{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 10+ years of industry work with hands-on security engineering experience\u003cbr/\u003e- 10+ years of risk assessment and enabling organizations making security decisions experience\u003cbr/\u003e- 10+ years of team management and building (including coaching and mentoring) experience\u003cbr/\u003e- 10+ years of communicating technical concepts to a non-technical audience experience\u003cbr/\u003e- Bachelor's degree in Computer Science or a related field\u003cbr/\u003e- Experience communicating technical concepts to a non-technical audience\u003cbr/\u003e- Experience with hands-on security engineering\u003cbr/\u003e- Experience in risk assessment and enabling organizations to make security decisions\u003cbr/\u003e- Experience in team management and building (including coaching and mentoring)","business_category":"amazon-security","city":"San Francisco","company_name":"Amazon.com Services LLC","country_code":"USA","description":"We are open to hiring candidates to work out of one of the following locations:\u003cbr/\u003e\u003cbr/\u003eSan Francisco, CA, USA\u003cbr/\u003e\u003cbr/\u003eThe Amazon Devices and Services team designs and engineers high-profile consumer\u003cbr/\u003eelectronics, including the best-selling Eero products. We have also produced\u003cbr/\u003edevices like Fire tablets, Fire TV, Amazon Dash, Ring, and Amazon Echo.\u003cbr/\u003eWith eero, our mission is to serve as the central nervous system of the home. While we began by revolutionizing home WiFi, we now create comprehensive and secure solutions that serve both wireless and wired connectivity needs for customers and businesses worldwide. Our team builds products that customers love - from mesh routers to high-performance wired networking devices - and we're looking for you to join us in shaping the future of the connected home.\u003cbr/\u003eWhat will you help us create?\u003cbr/\u003e\u003cbr/\u003eAre you interested in building and leading a focused top-notch security team responsible for securing\u003cbr/\u003econsumer devices and information? Do you want to solve new security challenges and build\u003cbr/\u003esolutions at scale? If so, we have the job for you! Amazon’s Devices and Services Security\u003cbr/\u003eteam is looking for a senior leader who will be responsible for leading, developing and taking\u003cbr/\u003ethe Eero Security team to the next level. You will be responsible for the security\u003cbr/\u003erisk posture for the full Eero product line, while enabling the organization to deliver great\u003cbr/\u003eand secure experiences for our customers. In this role, you will define security requirements,\u003cbr/\u003ebuild processes and mechanisms that continue to raise the security bar for Amazon’s\u003cbr/\u003econsumer products, and develop scalable solutions that meet the business and customer\u003cbr/\u003eneeds. This role will require innovation, as well as the ability to perform security at scale while leading and motivating a team of skilled security engineers.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs the leader of the Devices and Services Security Eero team, you will be tasked in setting and\u003cbr/\u003eexecuting the security strategic direction for various consumer services, and device security strategies. You will be responsible for leading a multi-functionally diverse team. You will partner with\u003cbr/\u003eengineering teams to integrate scalable security tools and controls into everyday work for\u003cbr/\u003ethe entire organization. You will help envision, drive, and scale the programs through\u003cbr/\u003einnovative process changes across multiple organizations and teams, engaging technical\u003cbr/\u003eand non-technical people throughout the organization. You will partner and work across\u003cbr/\u003edisciplines and executives including engineering, marketing, product management, legal,\u003cbr/\u003eand business. Above all, you feel strongly about protecting customers. Your focus will be to\u003cbr/\u003ehelp teams design their systems and customer experiences in a manner that upholds our\u003cbr/\u003ehigh bar for customer trust.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour work will be dynamic and impactful. Day-to-day, you might find yourself analyzing application code for security vulnerabilities, building tools and frameworks that help developers work more securely and efficiently, or partnering with engineering teams to integrate security into new service architectures. You'll conduct comprehensive security reviews, and collaborate with product managers to balance security requirements with exceptional user experiences. You will coach and develop the members of your team and guide them in their career\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon Security values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003eWhy Amazon Security?\u003cbr/\u003eAt Amazon, security is central to maintaining customer trust and delivering delightful customer experiences. Our organization is responsible for creating and maintaining a high bar for security across all of Amazon’s products and services. We offer talented security professionals the chance to accelerate their careers with opportunities to build experience in a wide variety of areas including cloud, devices, retail, entertainment, healthcare, operations, and physical stores\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eIn Amazon Security, it’s in our nature to learn and be curious. Ongoing DEI events and learning experiences inspire us to continue learning and to embrace our uniqueness. Addressing the toughest security challenges requires that we seek out and celebrate a diversity of ideas, perspectives, and voices.\u003cbr/\u003eTraining \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, training, and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.","department_cost_center":null,"description_short":"We are open to hiring candidates to work out of one of the following locations:San Francisco, CA, USAThe Amazon Devices and Services team designs and engineers high-profile consumerelectronics, including","display_distance":null,"id":"44f82d3a-6e19-47e6-b607-49bfae5bedf7","id_icims":"3138991","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"Systems Security Engineering","job_function_id":null,"job_path":"/en/jobs/3138991/senior-manager-devices-services-security-devices-services-security","job_schedule_type":"full-time","location":"US, CA, San Francisco","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Francisco\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Francisco\",\"coordinates\":\"37.77702,-122.41956\",\"normalizedCountyName\":\"San Francisco\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Francisco, California, USA\",\"location\":\"US, CA, San Francisco\",\"region\":\"CA\",\"buildingCodeList\":[\"SFO38\"],\"normalizedCityName\":\"San Francisco\"}"],"normalized_location":"San Francisco, California, USA","optional_search_labels":[],"posted_date":"December  8, 2025","preferred_qualifications":"- Knowledge of information security risk-based prioritization\u003cbr/\u003e- Knowledge of information security technologies such as security design review, threat modeling, risk analysis, and software testing techniques\u003cbr/\u003e- Experience applying threat modeling or other risk identification techniques or equivalent\u003cbr/\u003e- Experience architecting, securing, and operating Amazon Web Services\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $187,500/year in our lowest geographic market up to $324,100/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"amazon-security.team-devices-security","source_system":"JobCreator","state":"CA","title":"Senior Manager - Devices \u0026 Services Security, Devices \u0026 Services Security","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3138991/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-devices-security","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- 1+ years of Microsoft Office products and applications experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- certification from Amazon's Mechatronics and Robotics Apprenticeship Program, or 2+ years of automated conveyor systems and controls experience\u003cbr/\u003e- 2+ years of conducting predictive and preventative maintenance procedures experience\u003cbr/\u003e- 2+ years of reading blueprints and electrical schematics experience\u003cbr/\u003e- 2+ years of demonstrating safety standards experience\u003cbr/\u003e- 2+ years of troubleshooting and diagnostics of material handling equipment (MHE) experience","business_category":"operations","city":"Deltona","company_name":"Amazon.com Services LLC - A57","country_code":"USA","description":"About Maintenance at Amazon\u003cbr/\u003e\u003cbr/\u003eOperations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every day. Reliability Maintenance \u0026 Engineering (RME) are the business partners that work tirelessly behind the scenes to make it all happen. We drive continuous improvement and maintain all of the Robotics and Material Handling Equipment (MHE) to ensure our customers are met with the Amazon smile. Come join us on our journey!\u003cbr/\u003e\u003cbr/\u003eAbout the Role\u003cbr/\u003e\u003cbr/\u003eAs a Mechatronics \u0026 Robotics Technician, you will use your skills to support the Operations Maintenance team in repairing and maintaining material handling equipment and pneumatic systems throughout the building. You will have the opportunity to install, maintain, and repair automated packaging and distribution equipment. In addition to developing your skills, you will mentor junior technicians to grow in their roles.\u003cbr/\u003e\u003cbr/\u003eWhat Do We Offer?\u003cbr/\u003e\u003cbr/\u003eAmazon offers competitive compensation packages including comprehensive healthcare benefits starting on Day 1, matching 401(k) program, and up to 20 weeks of paid parental leave. But wait, there is more: We provide lightweight fire-resistant daily wear and composite toe safety shoes for your safety!\u003cbr/\u003e\u003cbr/\u003eHere is what you can expect with the Reliability \u0026 Maintenance Engineering (RME) selection process for Mechatronics \u0026 Robotics Technicians: (Timeframe: Approximately 30-days)\u003cbr/\u003e\u003cbr/\u003eStep 1: Congratulations! You successfully submitted your application! \u003cbr/\u003e\u003cbr/\u003eStep 2: Amazon Recruiting will review your application and invite the most qualified candidate to complete a pre-employment assessment. \u003cbr/\u003e\u003cbr/\u003eStep 3: If you meet the role qualifications, you will receive an invitation from Amazon Recruiting (do-not-reply@criteriacorp.com) to begin your Criteria assessment. You have 5 days to complete. \u003cbr/\u003e\u003cbr/\u003eStep 4: Once you successfully meet the pre-employment assessment requirements, you will be invited to complete a video interview. Your video interview invitation will be from HireVue (interviews@hirevue.com) and you will have 7 days to record your interview.\u003cbr/\u003e\u003cbr/\u003eStep 5: Your video interview will be reviewed by the Amazon Hiring Team and you will be notified of next steps via email within 5 business days. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities include, but are not limited to: \u003cbr/\u003e- You will promote a safe working environment by following all safety procedures \u003cbr/\u003e- You will complete preventative maintenance routines with proper documentation \u003cbr/\u003e- You will troubleshoot electrical and mechanical problems related to all Material Handling Equipment (MHE) which includes belts, motors, photo-eyes, relays, and more \u003cbr/\u003e- You will maintain a positive working relationship across all of the Amazon Operations facility \u003cbr/\u003e- You must be able to move up to 49lbs, stand and walk during shifts lasting up to 12 hours, climb ladders and gangways safely, and without limitation, as well as perform regular bending, lifting, stretching, and reaching both below the waist and above the head\u003cbr/\u003e\u003cbr/\u003ePlease note that while we strive to accommodate employees' preferences for shift assignments, due to operational requirements and scheduling constraints, we cannot guarantee a specific shift assignment.\u003cbr/\u003e","department_cost_center":null,"description_short":"About Maintenance at AmazonOperations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds","display_distance":null,"id":"09ac5362-05ae-4983-8485-510f69772161","id_icims":"3177705","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3177705/mechatronics-robotics-tech-qzz1-rme","job_schedule_type":"full-time","location":"US, FL, Deltona","locations":["{\"normalizedStateName\":\"Florida\",\"normalizedCountryCode\":\"USA\",\"city\":\"Deltona\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, FL, Deltona\",\"coordinates\":\"28.93262,-81.22336\",\"normalizedCountyName\":\"Volusia\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Deltona, Florida, USA\",\"location\":\"US, FL, Deltona\",\"region\":\"FL\",\"buildingCodeList\":[\"QZZ1\"],\"normalizedCityName\":\"Deltona\"}"],"normalized_location":"Deltona, Florida, USA","optional_search_labels":[],"posted_date":"February 10, 2026","preferred_qualifications":"- Experience with robotic operation and maintenance\u003cbr/\u003e- 2+ years of electrical and electronic principles experience\u003cbr/\u003e- Associate's degree in Mechnical or Electrical\u003cbr/\u003e- 2+ years of Mechanical or Electrical apprenticeship experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below including the base pay rate plus the highest available shift differential which applies depending on the shift you select. As a total compensation company, you are eligible for additional earnings including overtime pay and performance bonuses. Final pay will be based on factors including shift selection and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, FL, Deltona - 30.00 - 30.00 USD hourly","primary_search_label":"operations.team-reliability-maintenance-engineering","source_system":"JobCreator","state":"FL","title":"Mechatronics \u0026 Robotics Tech , QZZ1 - RME ","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3177705/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-reliability-maintenance-engineering","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 7+ years of new hardware products development experience\u003cbr/\u003e- 7+ years of engineering team management experience\u003cbr/\u003e- Bachelor's degree in Electrical Engineering, Computer Engineering, or a related technical field\u003cbr/\u003e- Experience in engineering team management\u003cbr/\u003e- Experience in new hardware product development\u003cbr/\u003e- Experience in DFx (cost, test, manufacturing)\u003cbr/\u003e- Experience with the project management of technical projects","business_category":"retail","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"How do you get items to customers quickly, cost-effectively, and—most importantly—safely, in less than an hour? And how do you do it in a way that can scale? Our teams of hundreds of scientists, engineers, aerospace professionals, and futurists have been working hard to do just that! We are delivering to customers, and are excited for what’s to come. Check out more information about Prime Air (PA) on the About Amazon blog (https://www.aboutamazon.com/news/transportation/amazon-prime-air-drone-delivery-mk30-photos).\u003cbr/\u003e\u003cbr/\u003eThe Prime Air team is looking for a strong technical and business leader to lead one of our Drone Engineering teams. This is a critical role leading design, qualification and support efforts.  Our drone is the central capability behind our goal of delivering millions of packages to customers within 30 minutes. To do this, you influence and partner with Engineering, Product, Finance, Regulatory and Operations leaders within Prime Air and across Amazon. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eIn this role, you will be responsible for engineering, integration and delivery of Prime Air drone vehicle system components. This includes design and development of hardware systems as well as platform level systems integration. The ideal candidate is passionate about and experienced in working back from the customer to develop new, breakthrough products. They are experienced in designing, building, integrating, testing and certifying aerospace artifacts.\u003cbr/\u003e\u003cbr/\u003eAs a technical leader, you will lead a team of top-notch mechanical, electrical, software and systems engineers to deliver high quality, aerospace grade products. As a leader responsible for developing components for a highly integrated product, you will have experience working within an integrated product development plan and leading a team of engineers to execute to it. \u003cbr/\u003e\u003cbr/\u003eExport Control License: This position may require a deemed export control license for compliance with applicable laws and regulations. Placement is contingent on Amazon’s ability to apply for and obtain an export control license on your behalf.","department_cost_center":null,"description_short":"How do you get items to customers quickly, cost-effectively, and—most importantly—safely, in less than an hour? And how do you do it in a way that can scale? Our teams of hundreds of scientists, engineers,","display_distance":null,"id":"ac96187b-aa07-43f3-ab64-1ab04e845b06","id_icims":"3178306","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/3178306/manager-drone-hw-engineering-prime-air","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA109\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February 10, 2026","preferred_qualifications":"- Master's degree in Electrical, Mechanical, Power Engineering, or a related field\u003cbr/\u003e- Knowledge of AWS or cloud technologies\u003cbr/\u003e- Experience developing products for large volume production\u003cbr/\u003e- Experience managing teams of 8+ engineers\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 151,000.00 - 204,300.00 USD annually","primary_search_label":"retail.team-global-prime-air","source_system":"JobCreator","state":"WA","title":"Manager, Drone HW Engineering, Prime Air","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3178306/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-prime-air","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Master's degree in engineering, statistics, computer science, mathematics, or a related quantitative field\u003cbr/\u003e- 2+ years of machine learning, statistical modeling, data mining, and analytics techniques experience\u003cbr/\u003e- 3+ years of programming in Java, C++, Python or related language experience\u003cbr/\u003e- 2+ years of building machine learning models or developing algorithms for business application experience","business_category":"amazon-artificial-general-intelligence","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"This is currently a 12 month temporary contract opportunity with the possibility to extend to 24 months based on business needs.\u003cbr/\u003e\u003cbr/\u003eThe Artificial General Intelligence (AGI) team is seeking a dedicated, skilled, and innovative Applied Scientist with a robust background in machine learning, statistics, quality assurance, auditing methodologies, and automated evaluation systems to ensure the highest standards of data quality, to build industry-leading technology with Large Language Models (LLMs) and multimodal systems.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs part of the AGI team, an Applied Scientist will collaborate closely with core scientist team developing Amazon Nova models. They will lead the development of comprehensive quality strategies and auditing frameworks that safeguard the integrity of data collection workflows. This includes designing auditing strategies with detailed SOPs, quality metrics, and sampling methodologies that help Nova improve performances on benchmarks. The Applied Scientist will perform expert-level manual audits, conduct meta-audits to evaluate auditor performance, and provide targeted coaching to uplift overall quality capabilities. A critical aspect of this role involves developing and maintaining LLM-as-a-Judge systems, including designing judge architectures, creating evaluation rubrics, and building machine learning models for automated quality assessment. The Applied Scientist will also set up the configuration of data collection workflows and communicate quality feedback to stakeholders. An Applied Scientist will also have a direct impact on enhancing customer experiences through high-quality training and evaluation data that powers state-of-the-art LLM products and services.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAn Applied Scientist with the AGI team will support quality solution design, conduct root cause analysis on data quality issues, research new auditing methodologies, and find innovative ways of optimizing data quality while setting examples for the team on quality assurance best practices and standards. Besides theoretical analysis and quality framework development, an Applied Scientist will also work closely with talented engineers, domain experts, and vendor teams to put quality strategies and automated judging systems into practice.","department_cost_center":null,"description_short":"This is currently a 12 month temporary contract opportunity with the possibility to extend to 24 months based on business needs.The Artificial General Intelligence (AGI) team is seeking a dedicated, skilled,","display_distance":null,"id":"24001fb7-3807-4017-94dd-13e6858d2181","id_icims":"3166634","is_intern":null,"is_manager":null,"job_category":"Data Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3166634/applied-scientist-contract-artificial-general-intelligence","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Boston\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Boston\",\"coordinates\":\"42.35866,-71.05674\",\"normalizedCountyName\":\"Suffolk\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Boston, Massachusetts, USA\",\"location\":\"US, MA, Boston\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS17\"],\"normalizedCityName\":\"Boston\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA106\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":["alexa-and-amazon-devices.team-hardware-development-job-family"],"posted_date":"January 26, 2026","preferred_qualifications":"- Ph.D. in engineering, technology, computer science, machine learning, robotics, operations research, statistics, mathematics or equivalent quantitative field\u003cbr/\u003e- Have publications at top-tier peer-reviewed conferences or journals\u003cbr/\u003e- 4+ years of solving business problems through machine learning, data mining and statistical algorithms experience\u003cbr/\u003e- Experience with Machine Learning and Large Language Model fundamentals, including architecture, training/inference lifecycles, and optimization of model execution, or experience debugging, profiling, and implementing best software engineering practices in large-scale systems\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MA, Boston - 136,000.00 - 184,000.00 USD annually\u003cbr/\u003eUSA, WA, BELLEVUE - 136,000.00 - 184,000.00 USD annually","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":"WA","title":"Applied Scientist (Contract), Artificial General Intelligence","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3166634/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Master's degree in engineering, statistics, computer science, mathematics, or a related quantitative field\u003cbr/\u003e- 2+ years of machine learning, statistical modeling, data mining, and analytics techniques experience\u003cbr/\u003e- 3+ years of programming in Java, C++, Python or related language experience\u003cbr/\u003e- 2+ years of building machine learning models or developing algorithms for business application experience","business_category":"amazon-artificial-general-intelligence","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"This is currently a 12 month temporary contract opportunity with the possibility to extend to 24 months based on business needs.\u003cbr/\u003e\u003cbr/\u003eThe Artificial General Intelligence (AGI) team is seeking a dedicated, skilled, and innovative Applied Scientist with a robust background in machine learning, statistics, quality assurance, auditing methodologies, and automated evaluation systems to ensure the highest standards of data quality, to build industry-leading technology with Large Language Models (LLMs) and multimodal systems.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs part of the AGI team, an Applied Scientist will collaborate closely with core scientist team developing Amazon Nova models. They will lead the development of comprehensive quality strategies and auditing frameworks that safeguard the integrity of data collection workflows. This includes designing auditing strategies with detailed SOPs, quality metrics, and sampling methodologies that help Nova improve performances on benchmarks. The Applied Scientist will perform expert-level manual audits, conduct meta-audits to evaluate auditor performance, and provide targeted coaching to uplift overall quality capabilities. A critical aspect of this role involves developing and maintaining LLM-as-a-Judge systems, including designing judge architectures, creating evaluation rubrics, and building machine learning models for automated quality assessment. The Applied Scientist will also set up the configuration of data collection workflows and communicate quality feedback to stakeholders. An Applied Scientist will also have a direct impact on enhancing customer experiences through high-quality training and evaluation data that powers state-of-the-art LLM products and services.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAn Applied Scientist with the AGI team will support quality solution design, conduct root cause analysis on data quality issues, research new auditing methodologies, and find innovative ways of optimizing data quality while setting examples for the team on quality assurance best practices and standards. Besides theoretical analysis and quality framework development, an Applied Scientist will also work closely with talented engineers, domain experts, and vendor teams to put quality strategies and automated judging systems into practice.","department_cost_center":null,"description_short":"This is currently a 12 month temporary contract opportunity with the possibility to extend to 24 months based on business needs.The Artificial General Intelligence (AGI) team is seeking a dedicated, skilled,","display_distance":null,"id":"f9fde228-fdf5-423a-8317-b418a4560478","id_icims":"3166405","is_intern":null,"is_manager":null,"job_category":"Data Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3166405/applied-scientist-contract-artificial-general-intelligence","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Boston\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Boston\",\"coordinates\":\"42.35866,-71.05674\",\"normalizedCountyName\":\"Suffolk\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Boston, Massachusetts, USA\",\"location\":\"US, MA, Boston\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS17\"],\"normalizedCityName\":\"Boston\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA106\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":["alexa-and-amazon-devices.team-hardware-development-job-family"],"posted_date":"January 26, 2026","preferred_qualifications":"- Ph.D. in engineering, technology, computer science, machine learning, robotics, operations research, statistics, mathematics or equivalent quantitative field\u003cbr/\u003e- Have publications at top-tier peer-reviewed conferences or journals\u003cbr/\u003e- 4+ years of solving business problems through machine learning, data mining and statistical algorithms experience\u003cbr/\u003e- Experience with Machine Learning and Large Language Model fundamentals, including architecture, training/inference lifecycles, and optimization of model execution, or experience debugging, profiling, and implementing best software engineering practices in large-scale systems\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MA, Boston - 136,000.00 - 184,000.00 USD annually\u003cbr/\u003eUSA, WA, BELLEVUE - 136,000.00 - 184,000.00 USD annually","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":"WA","title":"Applied Scientist (Contract), Artificial General Intelligence","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3166405/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Master's degree in engineering, statistics, computer science, mathematics, or a related quantitative field\u003cbr/\u003e- 2+ years of machine learning, statistical modeling, data mining, and analytics techniques experience\u003cbr/\u003e- 3+ years of programming in Java, C++, Python or related language experience\u003cbr/\u003e- 2+ years of building machine learning models or developing algorithms for business application experience","business_category":"amazon-artificial-general-intelligence","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"This is currently a 12 month temporary contract opportunity with the possibility to extend to 24 months based on business needs.\u003cbr/\u003e\u003cbr/\u003eThe Artificial General Intelligence (AGI) team is seeking a dedicated, skilled, and innovative Applied Scientist with a robust background in machine learning, statistics, quality assurance, auditing methodologies, and automated evaluation systems to ensure the highest standards of data quality, to build industry-leading technology with Large Language Models (LLMs) and multimodal systems.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs part of the AGI team, an Applied Scientist will collaborate closely with core scientist team developing Amazon Nova models. They will lead the development of comprehensive quality strategies and auditing frameworks that safeguard the integrity of data collection workflows. This includes designing auditing strategies with detailed SOPs, quality metrics, and sampling methodologies that help Nova improve performances on benchmarks. The Applied Scientist will perform expert-level manual audits, conduct meta-audits to evaluate auditor performance, and provide targeted coaching to uplift overall quality capabilities. A critical aspect of this role involves developing and maintaining LLM-as-a-Judge systems, including designing judge architectures, creating evaluation rubrics, and building machine learning models for automated quality assessment. The Applied Scientist will also set up the configuration of data collection workflows and communicate quality feedback to stakeholders. An Applied Scientist will also have a direct impact on enhancing customer experiences through high-quality training and evaluation data that powers state-of-the-art LLM products and services.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAn Applied Scientist with the AGI team will support quality solution design, conduct root cause analysis on data quality issues, research new auditing methodologies, and find innovative ways of optimizing data quality while setting examples for the team on quality assurance best practices and standards. Besides theoretical analysis and quality framework development, an Applied Scientist will also work closely with talented engineers, domain experts, and vendor teams to put quality strategies and automated judging systems into practice.","department_cost_center":null,"description_short":"This is currently a 12 month temporary contract opportunity with the possibility to extend to 24 months based on business needs.The Artificial General Intelligence (AGI) team is seeking a dedicated, skilled,","display_distance":null,"id":"31d5876a-9337-48ea-aa88-39d3d7b3d9c7","id_icims":"3165525","is_intern":null,"is_manager":null,"job_category":"Data Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3165525/applied-scientist-contract-artificial-general-intelligence","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Boston\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Boston\",\"coordinates\":\"42.35866,-71.05674\",\"normalizedCountyName\":\"Suffolk\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Boston, Massachusetts, USA\",\"location\":\"US, MA, Boston\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS17\"],\"normalizedCityName\":\"Boston\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA106\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":["alexa-and-amazon-devices.team-hardware-development-job-family"],"posted_date":"January 23, 2026","preferred_qualifications":"- Ph.D. in engineering, technology, computer science, machine learning, robotics, operations research, statistics, mathematics or equivalent quantitative field\u003cbr/\u003e- Have publications at top-tier peer-reviewed conferences or journals\u003cbr/\u003e- 4+ years of solving business problems through machine learning, data mining and statistical algorithms experience\u003cbr/\u003e- Experience with Machine Learning and Large Language Model fundamentals, including architecture, training/inference lifecycles, and optimization of model execution, or experience debugging, profiling, and implementing best software engineering practices in large-scale systems\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MA, Boston - 136,000.00 - 184,000.00 USD annually\u003cbr/\u003eUSA, WA, BELLEVUE - 136,000.00 - 184,000.00 USD annually","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":"WA","title":"Applied Scientist (Contract), Artificial General Intelligence","university_job":null,"updated_time":"19 minutes","url_next_step":"https://account.amazon.com/jobs/3165525/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Master's degree in engineering, statistics, computer science, mathematics, or a related quantitative field\u003cbr/\u003e- 2+ years of machine learning, statistical modeling, data mining, and analytics techniques experience\u003cbr/\u003e- 3+ years of programming in Java, C++, Python or related language experience\u003cbr/\u003e- 2+ years of building machine learning models or developing algorithms for business application experience","business_category":"amazon-artificial-general-intelligence","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"This is currently a 12 month temporary contract opportunity with the possibility to extend to 24 months based on business needs.\u003cbr/\u003e\u003cbr/\u003eThe Artificial General Intelligence (AGI) team is seeking a dedicated, skilled, and innovative Applied Scientist with a robust background in machine learning, statistics, quality assurance, auditing methodologies, and automated evaluation systems to ensure the highest standards of data quality, to build industry-leading technology with Large Language Models (LLMs) and multimodal systems.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs part of the AGI team, an Applied Scientist will collaborate closely with core scientist team developing Amazon Nova models. They will lead the development of comprehensive quality strategies and auditing frameworks that safeguard the integrity of data collection workflows. This includes designing auditing strategies with detailed SOPs, quality metrics, and sampling methodologies that help Nova improve performances on benchmarks. The Applied Scientist will perform expert-level manual audits, conduct meta-audits to evaluate auditor performance, and provide targeted coaching to uplift overall quality capabilities. A critical aspect of this role involves developing and maintaining LLM-as-a-Judge systems, including designing judge architectures, creating evaluation rubrics, and building machine learning models for automated quality assessment. The Applied Scientist will also set up the configuration of data collection workflows and communicate quality feedback to stakeholders. An Applied Scientist will also have a direct impact on enhancing customer experiences through high-quality training and evaluation data that powers state-of-the-art LLM products and services.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAn Applied Scientist with the AGI team will support quality solution design, conduct root cause analysis on data quality issues, research new auditing methodologies, and find innovative ways of optimizing data quality while setting examples for the team on quality assurance best practices and standards. Besides theoretical analysis and quality framework development, an Applied Scientist will also work closely with talented engineers, domain experts, and vendor teams to put quality strategies and automated judging systems into practice.","department_cost_center":null,"description_short":"This is currently a 12 month temporary contract opportunity with the possibility to extend to 24 months based on business needs.The Artificial General Intelligence (AGI) team is seeking a dedicated, skilled,","display_distance":null,"id":"64896201-1f32-48bc-9cfd-b47f99e949f7","id_icims":"3166403","is_intern":null,"is_manager":null,"job_category":"Data Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3166403/applied-scientist-contract-artificial-general-intelligence","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Boston\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Boston\",\"coordinates\":\"42.35866,-71.05674\",\"normalizedCountyName\":\"Suffolk\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Boston, Massachusetts, USA\",\"location\":\"US, MA, Boston\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS17\"],\"normalizedCityName\":\"Boston\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA106\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":["alexa-and-amazon-devices.team-hardware-development-job-family"],"posted_date":"January 26, 2026","preferred_qualifications":"- Ph.D. in engineering, technology, computer science, machine learning, robotics, operations research, statistics, mathematics or equivalent quantitative field\u003cbr/\u003e- Have publications at top-tier peer-reviewed conferences or journals\u003cbr/\u003e- 4+ years of solving business problems through machine learning, data mining and statistical algorithms experience\u003cbr/\u003e- Experience with Machine Learning and Large Language Model fundamentals, including architecture, training/inference lifecycles, and optimization of model execution, or experience debugging, profiling, and implementing best software engineering practices in large-scale systems\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MA, Boston - 136,000.00 - 184,000.00 USD annually\u003cbr/\u003eUSA, WA, BELLEVUE - 136,000.00 - 184,000.00 USD annually","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":"WA","title":"Applied Scientist (Contract), Artificial General Intelligence","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3166403/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of Microsoft Office products and applications experience\u003cbr/\u003e- 2+ years of electrical and mechanical experience\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Leesburg","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e- Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"39ed6529-7d64-43e1-ad2f-d991e136380f","id_icims":"3153156","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3153156/engineering-operations-technician","job_schedule_type":"full-time","location":"US, VA, Leesburg","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Leesburg\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Leesburg\",\"coordinates\":\"39.1158,-77.56578\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Leesburg, Virginia, USA\",\"location\":\"US, VA, Leesburg\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD668\"],\"normalizedCityName\":\"Leesburg\"}"],"normalized_location":"Leesburg, Virginia, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"January  6, 2026","preferred_qualifications":"- Experience working in a data center or mission critical facility (example: hospital, military facility, public safety facility, etc.)\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e- Experience with reading and writing procedures, technical documents, and engineering drawings\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Leesburg - 36.00 - 63.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"VA","title":"Engineering Operations Technician","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3153156/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- - NVQ Level 3 (o qualifica equivalente) in una disciplina ingegneristica o altra qualifica ingegneristica con una forte componente pratica.\u003cbr/\u003e- - Vasta esperienza come ingegnere abilitato.\u003cbr/\u003e- - Vasta esperienza nella manutenzione di impianti meccanici e/o elettrici.\u003cbr/\u003e- - Piena padronanza della lingua italiana, scritta e parlata.","business_category":"fulfillment-ops","city":"Rome","company_name":"Amazon Italia Transport Srl","country_code":"ITA","description":"Job summary\u003cbr/\u003eAmazon Operations sits at the heart of the Amazon customer experience. We look after everything from the moment a customer clicks buy, to the moment their item is delivered – from desktop to doorstep.\u003cbr/\u003e   \u003cbr/\u003e  Across Europe we have more than 50 Fulfillment Centers, hundreds of Delivery Stations, thousands of machines, and tens of thousands of employees, all working together in harmony to make sure the right item gets delivered to the right person, in the right place, at the right time.\u003cbr/\u003e   \u003cbr/\u003e  Working in Amazon Operations is for people who like to be active and give their all. We work in a busy, dynamic environment and are part of a bigger team delivering on the expectations of millions of customers every single day.\u003cbr/\u003e   \u003cbr/\u003e   \u003cbr/\u003e  We are open, inclusive and welcome individuality and diversity. The culture in our Operation is built on the way teams bond and the work ethic that enables our business run like clockwork. Our teams take pride in a job well done, looking out for one another, ensuring the highest safety standards and playing their part in delivering the quality service Amazon is known for around the world.\u003cbr/\u003e   \u003cbr/\u003e  Join us in the Amazon Reliability Maintenance Engineering team. We maintain and optimize technologies in the Global Amazon Warehouse \u0026 Delivery Network.\u003cbr/\u003e     \u003cbr/\u003e  PURPOSE OF THE JOB:\u003cbr/\u003e\u003cbr/\u003eWe are looking for motivated, customer-focused people who want to join our team as a Reliability Maintenance Engineering Technician. \u003cbr/\u003e   \u003cbr/\u003eThe focus of the Reliability Maintenance Engineering Technician role is to ensure safety regulations and policies are adhered to, to ensure preventative maintenance is conducted on time to a high standard and to provide high levels of equipment availability through continuous improvement. \u003cbr/\u003e   \u003cbr/\u003eShift Pattern: This role includes working in non-traditional shift pattern, which may include nights and weekends\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tPut health \u0026 safety best practices first in all work carried out ensuring compliance with all health \u0026 safety standards and regulations.\u003cbr/\u003e•\tCarry out planned preventative maintenance on the full range of equipment within the site.\u003cbr/\u003e•\tReact quickly to breakdowns, communicate clearly with affected parties and work efficiently to fix the issue.\u003cbr/\u003e•\tSupport continuous improvement by learning from breakdowns and sending feedback and suggestions for improvements through the line manager.\u003cbr/\u003e•\tProvide high levels of equipment availability to our internal customers.\u003cbr/\u003e•\tSupport and learn from Senior Reliability Engineering Technicians.\u003cbr/\u003e•\tManagement of contractors.\u003cbr/\u003e•\tCarry out compliance tasks in line with country legislation that do not require specialist intervention.\u003cbr/\u003e•\tOn-site support and responsibility for management and escalation of high severity tickets.\u003cbr/\u003e•\tManagement of escalations to specialist subcontractors where required.\u003cbr/\u003e•\tEngineering tasks qualified as basic, standard, advanced and expert (Levels 1-4) – Responsibility is for levels 1-3 for reactive and planned tasks and Level 4 is when specialist is required.\u003cbr/\u003e•\tControl and management of cleaning and waste companies.\u003cbr/\u003e•\tCarry out scheduled/ad hoc audits using online tools (iAuditor, EAM).\u003cbr/\u003e•\tManagement of critical spare parts inventory utilizing CMMS system (EAM).\u003cbr/\u003e•\tWork in a hands-on manner and demonstrate required knowledge on all Material Handling Equipment in the building.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003eInterventi di manutenzione preventiva e a guasto su un’ampia gamma di macchinari in sede.\u003cbr/\u003e\u003cbr/\u003eEseguire riparazioni di emergenza e diagnosi dei guasti nei magazzini di distribuzione.\u003cbr/\u003e\u003cbr/\u003eUtilizzo di strumenti all’avanguardia per massimizzare l’efficacia dei macchinari.\u003cbr/\u003e\u003cbr/\u003eConformità a tutte le normative e prassi in materia di salute e sicurezza. \u003cbr/\u003e\u003cbr/\u003eFavorire lo sviluppo e l’avanzamento di chi partecipa ai programmi di apprendistato nelle nostre sedi.\u003cbr/\u003e\u003cbr/\u003eSovraintendere a progetti di miglioramento continuo e implementare procedure chiave in una gamma di sedi europee.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eLa giornata tipo\u003cbr/\u003e\u003cbr/\u003eI nostri RME Technician operano sul campo, in modo da intervenire prontamente nell’eventualità di problemi ai macchinari. A intervalli prestabiliti, eseguirai una serie di interventi di manutenzione preventiva sui macchinari delle nostre sedi, per assicurarne il corretto funzionamento. In qualità di RME Technician, interverrai prontamente in caso di guasti, investigandone le cause e implementando soluzioni in maniera tempestiva.  Inoltre, indicherai possibili miglioramenti a lungo termine da apportare per scongiurare problematiche in futuro.\u003cbr/\u003eAffiancando i colleghi senior, ti occuperai della manutenzione ordinaria, come la tinteggiatura o l’idraulica, con il supporto di professionisti esterni se necessario. Il tuo lavoro sarà organizzato su diversi turni, per assicurare assistenza 24 ore su 24, in modo da consentire ad Amazon di effettuare le consegne con la velocità che ci contraddistingue. ","department_cost_center":null,"description_short":"Job summaryAmazon Operations sits at the heart of the Amazon customer experience. We look after everything from the moment a customer clicks buy, to the moment their item is delivered – from desktop to","display_distance":null,"id":"9f6fabd0-5b08-4e44-b057-4f10ce3960c7","id_icims":"3173815","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3173815/specialista-di-manutenzione-tecnico-di-manutenzione-manutentore-elettromeccanico-manutentore-industriale-manutentore-elettrico-manutentore-meccanico-fiumicino","job_schedule_type":"full-time","location":"IT, RM, Rome","locations":["{\"normalizedStateName\":\"Latium\",\"normalizedCountryCode\":\"ITA\",\"city\":\"Fiumicino\",\"countryIso3a\":\"ITA\",\"countryIso2a\":\"IT\",\"locationNonStemming\":\"Italy, RM, Fiumicino\",\"coordinates\":\"41.77008,12.22708\",\"normalizedCountyName\":\"Rome\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Italy\",\"normalizedLocation\":\"Fiumicino, Latium, ITA\",\"location\":\"IT, RM, Fiumicino\",\"region\":\"RM\",\"buildingCodeList\":[\"DLZ7\"],\"normalizedCityName\":\"Fiumicino\"}","{\"normalizedStateName\":\"Latium\",\"normalizedCountryCode\":\"ITA\",\"city\":\"Roma\",\"countryIso3a\":\"ITA\",\"countryIso2a\":\"IT\",\"locationNonStemming\":\"Italy, RM, Roma\",\"coordinates\":\"41.90325,12.49563\",\"normalizedCountyName\":\"Rome\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Italy\",\"normalizedLocation\":\"Rome, Latium, ITA\",\"location\":\"IT, RM, Roma\",\"region\":\"RM\",\"buildingCodeList\":[\"DLZ6\",\"DLZ5\",\"OLZ1\",\"HLZ1\"],\"normalizedCityName\":\"Rome\"}","{\"normalizedStateName\":\"Latium\",\"normalizedCountryCode\":\"ITA\",\"city\":\"Roma\",\"countryIso3a\":\"ITA\",\"countryIso2a\":\"IT\",\"locationNonStemming\":\"Italy, Roma\",\"coordinates\":\"41.90325,12.49563\",\"normalizedCountyName\":\"Rome\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Italy\",\"normalizedLocation\":\"Rome, Latium, ITA\",\"location\":\"IT, Roma\",\"region\":\"\",\"buildingCodeList\":[\"FCO254\",\"NLZ1\"],\"normalizedCityName\":\"Rome\"}","{\"normalizedStateName\":\"Latium\",\"normalizedCountryCode\":\"ITA\",\"city\":\"Rome\",\"countryIso3a\":\"ITA\",\"countryIso2a\":\"IT\",\"locationNonStemming\":\"Italy, RM, Rome\",\"coordinates\":\"41.90325,12.49563\",\"normalizedCountyName\":\"Rome\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Italy\",\"normalizedLocation\":\"Rome, Latium, ITA\",\"location\":\"IT, RM, Rome\",\"region\":\"RM\",\"buildingCodeList\":[\"DLZ3\",\"FCO11\",\"LIRF\",\"UIT4\",\"DLZ4\"],\"normalizedCityName\":\"Rome\"}"],"normalized_location":"Rome, Latium, ITA","optional_search_labels":[],"posted_date":"February  4, 2026","preferred_qualifications":"- - Le qualifiche preferenziali non sono requisiti obbligatori per candidarsi a una posizione in Amazon. Se possiedi tutte le qualifiche richieste di cui sopra, non esitare a inviarci la tua candidatura: saremo felici di esaminarla!\u003cbr/\u003e- - Esperienza nel monitoraggio \"Condition Based Monitoring\" (monitoraggio in base alle condizioni)\u003cbr/\u003e- - Esperienza professionale con i macchinari di stampa e applicazione etichette.\u003cbr/\u003e- - Esperienza nell’individuazione dei guasti e nella manutenzione di nastri trasportatori o sistemi di automazione.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":"RM","title":"Specialista di Manutenzione / Tecnico di Manutenzione / Manutentore Elettromeccanico / Manutentore Industriale / Manutentore elettrico / Manutentore meccanico, Fiumicino","university_job":null,"updated_time":"21 minutes","url_next_step":"https://account.amazon.com/jobs/3173815/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Leesburg","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"4d32f9db-b22e-4b5f-a486-941a36daa4e2","id_icims":"3153284","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3153284/engineering-operations-technician","job_schedule_type":"full-time","location":"US, VA, Leesburg","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Leesburg\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Leesburg\",\"coordinates\":\"39.1158,-77.56578\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Leesburg, Virginia, USA\",\"location\":\"US, VA, Leesburg\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD668\"],\"normalizedCityName\":\"Leesburg\"}"],"normalized_location":"Leesburg, Virginia, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"January  6, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Technical (Military/Trade School) training\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Leesburg - 31.00 - 55.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"VA","title":"Engineering Operations Technician","university_job":null,"updated_time":"21 minutes","url_next_step":"https://account.amazon.com/jobs/3153284/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}