{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 5+ years of technical product or program management experience\u003cbr/\u003e- 7+ years of working directly with engineering teams experience\u003cbr/\u003e- 3+ years of software development experience\u003cbr/\u003e- 5+ years of technical program management working directly with software engineering teams experience\u003cbr/\u003e- Experience managing programs across cross functional teams, building processes and coordinating release schedules","business_category":"customer-service","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon.com is broadly recognized as #1 in Customer Service in the US and abroad. At Amazon we drive innovation and customer obsession into everything we do, and this is especially true in the Customer Engagement Technologies (CET) department. CET owns the technology to support and enhance our Customer Service Operations network through our Self Service and Automation features, CRM, contact center infrastructure, and various client applications. We focus on robust architecture, world class UX, and leverage our Big Data to drive insights and solutions through a myriad of applications.\u003cbr/\u003e\u003cbr/\u003eCET is looking for an experienced Sr. Technical Program Manager (TPM) to lead a multi-year, large-scale, enterprise software program. You will be part of a Global Product and Technology team whose innovations and strategies will define the next generation of contact routing for Amazon Customer Service, providing a seamless customer support experience and ensuring issues are resolved during the first interaction.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs a Sr. TPM in CET, you will take part in the program management and delivery of contact center systems built on top of our next-generation routing system, leveraging the power of Generative AI (GenAI) and Machine Learning for improved intents and routing signals, and preserving customer contact journey data.  You will work cross functionally with partners to take the product from concept to customer release while ensuring the highest level of quality for your deliverables, managing one of the worlds largest and most complex customer service organizations.\u003cbr/\u003e\u003cbr/\u003e• Collaborate with experienced cross-disciplinary Amazonians to conceive, design, and bring innovative products and services to market.\u003cbr/\u003e• Manage technologies in a large distributed computing environment, and help lead fundamental changes in the industry.\u003cbr/\u003e• Identify and prioritize needs, able to effectively influence up and across the organization, and adept at synthesizing a variety of technologies and capabilities into high quality customer experiences\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include: 1. Medical, Dental, and Vision Coverage 2. Maternity and Parental Leave Options 3. Paid Time Off (PTO) 4. 401(k) Plan.\u003cbr/\u003e\u003cbr/\u003eIf you are not sure that every qualification on the list above describes you exactly, we'd still love to hear from you! At Amazon, we value people with unique backgrounds, experiences, and skillsets. If you’re passionate about this role and want to make an impact on a global scale, please apply!\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThis role sits on a team within CET focused on CS routing. We are responsible for every customer contact, ensuring customers get to a customer service associate able to solve their issue within the first contact. Ultimately, we reduce customer effort by improving the discoverability of customer ingresses, creating a contact experience that effectively identifies the customer issue and preserves it across the customer journey for a seamless transition between automated and human support, and ensures quick issue resolution on the first contact by investing in foundational technologies to capture and persist routing signals.","department_cost_center":null,"description_short":"Amazon.com is broadly recognized as #1 in Customer Service in the US and abroad. At Amazon we drive innovation and customer obsession into everything we do, and this is especially true in the Customer","display_distance":null,"id":"2e7690b2-d287-4b41-9d57-fb24e015b8e4","id_icims":"2784450","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Technical Program Management","job_function_id":null,"job_path":"/en/jobs/2784450/sr-technical-program-manager-amazon-customer-service","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SHK5\",\"IBF4\",\"SEA43\",\"SEA88\",\"SEA57\",\"SEA109\",\"ONM125\",\"SEA91\",\"ATBP18\",\"SEA910\",\"UWA2\",\"BFI83\",\"SEA33R\",\"SEA26\",\"LBV2\",\"METR7\",\"BFI33\",\"UWA4\",\"SEA141\",\"SEA28\",\"LBV4\",\"WFM761\",\"JSE5\",\"LUM9\",\"SEA55\",\"SEA41\",\"SEA1\",\"SEA69\",\"ONM127\",\"SEA60\",\"BFI81\",\"SEA74\",\"ISE1\",\"DSW9\",\"PSE\",\"ATBP23\",\"QDS1\",\"SEA38\",\"SEA76\",\"LJG6\",\"SHK3\",\"WFM216\",\"SEA98\",\"SEA45\",\"DCA53\",\"SEA116\",\"MAB6\",\"CPA2\",\"ASL1\",\"SEA86\",\"SEA70\",\"SEA19\",\"LUM5\",\"WFM103\",\"LUM2\",\"SOD5\",\"SEA134\",\"SEA49\",\"SOD4\",\"FSE1\",\"LWA2\",\"SEA48\",\"FSE2\",\"PSL1\",\"ONM234\",\"ISG2\",\"SEA801\",\"DWX3\",\"ISE3\",\"SEA33\",\"SEA4\",\"ONM135\",\"BFI99\",\"JSE4\",\"LUM1\",\"CPA3\",\"SEA62\",\"CPA4\",\"SEA68\",\"SEA3\",\"WFM524\",\"TFC2\",\"T001\",\"ONM126\",\"SEA53\",\"DSE9\",\"ATBP24\",\"SEA81\",\"SEA72\",\"SEA59\",\"COL1\",\"SEA78\",\"BLU1\",\"METR2\",\"WFM59\",\"SEA24\",\"HUS1\",\"SHK4\",\"CWA42\",\"BFI82\",\"ATBP20\",\"DWA8\",\"LWES\",\"LBV3\",\"R004\",\"PUP\",\"UWA3\",\"SEA73\",\"CPA1\",\"SHK6\",\"IBF5\",\"SEA190\",\"SEA42\",\"SEA25\",\"SSE1\",\"DEV2\",\"SEA39\",\"DSW8\",\"SEA9\",\"MAE1\",\"KRA1\",\"IBF3\",\"ATBP22\",\"CWA2\",\"ONM124\",\"SEA44\",\"ATBP17\",\"SEA90\",\"WFM630\",\"HDG13\",\"SEA71\",\"ISE9\",\"SEA58\",\"ISE7\",\"SEA32\",\"SHK2\",\"SEA77\",\"MAB7\",\"XBF2\",\"ONM122\",\"LRSQ\",\"SEA2\",\"SEA01\",\"SEA54\",\"WFM755\",\"SEA23\",\"SEA29\",\"ATBP5\",\"T002\",\"FSE3\",\"SEA61\",\"SEA83\",\"ATBP10\",\"ONM232\",\"DTS2\",\"DWX8\",\"ONM128\",\"SEA89\",\"SEA803\",\"JSE1\",\"WFM604\",\"LUM4\",\"HCS8\",\"SEA51\",\"MAC8\",\"SEA20\",\"SEA65\",\"ATBP12\",\"SEA18\",\"SEA95\",\"SEA804\",\"SEA22\",\"LUM3\",\"SEA36\",\"METR4\",\"ISE6\",\"SEA117\",\"SEA47\",\"ZSE1\",\"CRP1\",\"DWX7\",\"SEA40\",\"IBF1\",\"SOD1\",\"PSE3\",\"SEA46\",\"SEA37\",\"SEA401\",\"SEA84\",\"BWA1\",\"XXX0\",\"BFI80\",\"SEA102\",\"R097\",\"SEA75\",\"METR5\",\"WFM275\",\"SEA27\",\"DSW4\",\"SHK7\",\"SEA21\",\"SEA02\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"September 24, 2024","preferred_qualifications":"- 5+ years of project management disciplines including scope, schedule, budget, quality, along with risk and critical path management experience\u003cbr/\u003e- Experience managing projects across cross functional teams, building sustainable processes and coordinating release schedules\u003cbr/\u003e- Experience defining KPI's/SLA's used to drive multi-million dollar businesses and reporting to senior leadership\u003cbr/\u003e\u003cbr/\u003eAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, OR, Corvallis - 148,700.00 - 201,200.00 USD annually\u003cbr/\u003eUSA, WA, SEATTLE - 148,700.00 - 201,200.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 148,700.00 - 201,200.00 USD annually","primary_search_label":"customer-service.technology","source_system":"JobCreator","state":"WA","title":"Sr. Technical Program Manager, Amazon Customer Service ","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/2784450/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"technology","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- 3+ years of increasing responsibilities in WHS and/or environmental programs in manufacturing, production, or service operations\u003cbr/\u003e- 3+ years of increasing responsibilities in people and performance management, or 2+ years of Amazon Safety (blue badge/FTE) experience","business_category":"fulfillment-and-operations","city":"Richmond","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We're seeking a dedicated Workplace Health \u0026 Safety (WHS) Manager to join our mission of creating the world's safest work environment. This role offers an exciting opportunity to directly impact associate well being while driving operational excellence.\u003cbr/\u003e\u003cbr/\u003eAs a WHS Manager, you'll be the site's safety champion, leading our Global WHS Program implementation. You'll combine hands-on safety management with strategic thinking to protect our most valuable asset – our people. Your role bridges the gap between safety requirements and operational success, requiring both technical expertise and strong interpersonal skills. Working closely with Operations leadership, you'll drive safety initiatives that make a real difference. You'll conduct comprehensive risk assessments, analyze safety data, and implement practical solutions that protect associates while supporting productivity. Your ability to build relationships and influence positive change will be essential as you help shape our safety culture. You'll lead safety compliance efforts, conduct thorough site audits, and analyze incident trends to target improvements where they matter most. Managing our first aid program and emergency response capabilities, you'll ensure immediate care is always available. Your analytical skills will transform safety data into actionable insights, while your leadership abilities will help engage associates in our safety mission.\u003cbr/\u003e\u003cbr/\u003eCore Impact Areas:\u003cbr/\u003eSafety Leadership \u0026 Innovation - Transform safety culture through leadership and innovative solutions. Drive continuous improvement initiatives that set new benchmarks in workplace safety. Leverage technology and data analytics to drive preventive safety measures that protect our associates while enhancing operational excellence. Develop leadership plans, communicate expectations, and drive initiatives to create a safe work environment. Measure performance against WHS policies, analyze metrics, and conduct site audits to address non-compliance issues. \u003cbr/\u003e\u003cbr/\u003eStrategic Partnership \u0026 Influence - Build partnerships with Operations leadership to integrate safety into every aspect of our business. Use compelling data analysis and risk insights to influence positive change and drive strategic decision-making. Establish yourself as a trusted advisor who balances safety excellence with operational demands. Oversee recordkeeping, workplace organization, and WHS training programs. \u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements include: \u003cbr/\u003e- Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Stand/walk for up to 12 hours during shifts\u003cbr/\u003e- Work in an environment where the noise level varies \u003cbr/\u003e- Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e- Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e- Maintain effective care delivery in emergencies and assist emergency response at the site\u003cbr/\u003e\u003cbr/\u003eFor those that do not have an adult First Aid, CPR, AED certification from the American Heart Association or American Red Cross, must obtain within 3 weeks of start date.","department_cost_center":null,"description_short":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We're seeking","display_distance":null,"id":"4088ec1c-07f1-4aa9-a976-66c0a46c7e5f","id_icims":"3169193","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3169193/site-ehs-manager-ii","job_schedule_type":"full-time","location":"US, VA, Richmond","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Richmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Richmond\",\"coordinates\":\"37.54068,-77.43367\",\"normalizedCountyName\":\"Richmond (City)\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Richmond, Virginia, USA\",\"location\":\"US, VA, Richmond\",\"region\":\"VA\",\"buildingCodeList\":[\"XRI3\"],\"normalizedCityName\":\"Richmond\"}"],"normalized_location":"Richmond, Virginia, USA","optional_search_labels":[],"posted_date":"January 29, 2026","preferred_qualifications":"- Distribution Center or Manufacturing EHS experience with mix of exempt and non-exempt employees at a site of at least 250 people\u003cbr/\u003e- Master’s degree\u003cbr/\u003e- Experience implementing lean principles and process improvement in an operational environment.\u003cbr/\u003e- Experience in a fast paced, dynamic organization.\u003cbr/\u003e- Certified Safety Professional\u003cbr/\u003e- Excellent written and verbal communication skills, including comfort interfacing with site leader\u003cbr/\u003e- Ability to develop and implement department goals and strategies.\u003cbr/\u003e- Strong analytical skills with demonstrated problem solving ability.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Richmond - 70,100.00 - 105,200.00 USD annually","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"VA","title":"Site EHS Manager II","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3169193/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of construction management of large, complex projects involving large-scale mechanical, electrical and plumbing (MEP) plants experience\u003cbr/\u003e- Experience carrying new design concepts through exploration, development, and into deployment or mass production\u003cbr/\u003e- Experience in MS Excel, Word, and Windows Operating Systems\u003cbr/\u003e- Experience with power management and power monitoring systems","business_category":"aws","city":"Columbus","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Amazon’s Data Centers are industry leading examples of innovation in the areas of security, safety, space utilization, efficiency, and cost effectiveness. We are the global team responsible for the construction of the Amazon owned sites. Our Construction Managers are on the forefront of creating and delivering the most innovative products to our customers; and are known for changing the face of cloud computing. \u003cbr/\u003e\u003cbr/\u003eAs a Pre-Construction Manager you will support the development and implementation of a regional Pre-Construction program across a multitude of campuses.  This role will serve as the primary liaison between Real Estate, Design Engineering and other critical partner teams during initial planning, conceptual design, schematics progress, and design development; providing cost, schedule, and constructability guidance. Our goal is to find the candidate that has highly developed critical facility pre-construction knowledge coupled with extensive practical construction experience to drive standards in this essential part of our delivery process. If you have experience driving global pre-construction standards, bid documents including the plans, specifications and general requirements to describe all the elements of a construction project and working within a broad design and construction infrastructure environment, then you could be the right candidate. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•Working knowledge of critical data center / mission critical equipment.\u003cbr/\u003e• Excellent communication skills, attention to detail, maintain high quality standards. \u003cbr/\u003e• Drive practical constructability standards in design documentation.\u003cbr/\u003e• Perform constructability reviews of electrical and mechanical designs associated with the construction of new data centers or optimization of existing data centers.  \u003cbr/\u003e• Act as the point of escalation for complex constructability issues. \u003cbr/\u003e• Provide input into global standards and data center template designs. \u003cbr/\u003e• Perform civil, structural, electrical and build phasing evaluations for potential sites. \u003cbr/\u003e• Conduct negotiations with landlords, developers, general contractors and evaluate bids/proposals with detail and accuracy. \u003cbr/\u003e• Determine and communicate site requirements that could impact schedule, cost, delivery of the work and integration of site with surrounding properties.\u003cbr/\u003e• Create construction GC scope and request for proposals.\u003cbr/\u003e• Manage GC as they deliver preconstruction services during the design phase. \u003cbr/\u003e• Review bid summaries, schedules and milestones, labor pricing, and perform subcontractor evaluations.\u003cbr/\u003e• Financial analysis of construction cost at multiple milestones. \u003cbr/\u003e• Establish detailed information to supports bi-annual construction budget updates.\u003cbr/\u003e• Determine and communicate contract requirements for creation of Work Orders. \u003cbr/\u003e• Collect, organize and hand off critical budget, schedule, design and site related information to Construction Manager. \u003cbr/\u003e• Collect, organize, apply and hand off lessons learned to design, preconstruction and construction teams to achieve continuous improvement across the entire program.\u003cbr/\u003e\u003cbr/\u003e \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e**Why AWS**\u003cbr/\u003e Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of infrastructure professionals. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon’s Data Centers are industry leading examples of innovation in the areas of security, safety, space utilization, efficiency, and cost effectiveness. We are the global team responsible for the construction","display_distance":null,"id":"0e716bff-1655-49c6-a77a-a3546d401da2","id_icims":"3155501","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3155501/pre-construction-manager-amer-central-data-center-construction","job_schedule_type":"full-time","location":"US, OH, Columbus","locations":["{\"normalizedStateName\":\"Ohio\",\"normalizedCountryCode\":\"USA\",\"city\":\"Columbus\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OH, Columbus\",\"coordinates\":\"39.96199,-83.00275\",\"normalizedCountyName\":\"Franklin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Columbus, Ohio, USA\",\"location\":\"US, OH, Columbus\",\"region\":\"OH\",\"buildingCodeList\":[\"CMH11\"],\"normalizedCityName\":\"Columbus\"}"],"normalized_location":"Columbus, Ohio, USA","optional_search_labels":["aws.team-ais"],"posted_date":"January  8, 2026","preferred_qualifications":"- Knowledge of critical data center equipment\u003cbr/\u003e- Knowledge of building codes and regulations including Life Safety, BOCA, NFPA, NEC, or OSHA\u003cbr/\u003e- Experience in project management in data centers or comparable critical infrastructure\u003cbr/\u003e- Experience in Data Center Engineering Operations, with a deep understanding of electrical and mechanical data center infrastructure\u003cbr/\u003e- Experience reading and interpreting construction specifications and drawings for all domains\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, OH, Columbus - 109,700.00 - 183,300.00 USD annually","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"OH","title":"Pre-Construction Manager, AMER Central Data Center Construction","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3155501/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"• Bachelor’s Degree in Construction Management, Civil, Structural, Mechanical or Electrical Engineering or 6+ years of relevant experience. \u003cbr/\u003e• 5+ years of experience in data center delivery (design, commissioning and construction), mission critical facilities or equivalent. \u003cbr/\u003e• 5+ years of experience of end to end project delivery.\u003cbr/\u003e","business_category":"aws","city":"Columbus","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon’s Data Centers are industry leading examples of innovation in the areas of security, safety, space utilization, efficiency, and cost effectiveness. We are responsible for the construction of the Amazon owned sites. Our Construction Managers are on the forefront of creating and delivering the most innovative products to our customers; and are known for changing the face of cloud computing. \u003cbr/\u003e\u003cbr/\u003eAs a Pre-Construction Manager you will support the development and implementation of design standards across regional construction programs. This role will serve as the primary liaison between Real Estate, Design Engineering and other critical partner teams during initial planning, conceptual design, schematics progress, and design development; providing cost, schedule, and constructability guidance. \u003cbr/\u003e\u003cbr/\u003eOur goal is to find the candidate that has highly developed critical facility pre-construction knowledge coupled with extensive practical construction experience to drive standards in this essential part of our delivery process. If you have experience driving pre-construction standards, bid documents including the plans, specifications and general requirements to describe all the elements of a construction project and working within a broad design and construction infrastructure environment, then you could be the right candidate. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eDetailed knowledge of critical data center equipment (Generators, Uninterruptible Power Supplies, Switchgear, Transformers, Power Feeders, Chillers, Plumbing, Fire Detection/Suppression, Air Handling Units, Computer Room Air Handling/Conditioning Units, UPS, CRAH, CRAC). \u003cbr/\u003e• Excellent communication skills, attention to detail, maintain high quality standards. \u003cbr/\u003e• Drive practical constructability standards in design documentation.\u003cbr/\u003e• Perform constructability reviews of electrical and mechanical designs associated with the construction of new data centers or optimization of existing data centers.  \u003cbr/\u003e• Act as the point of escalation for complex constructability issues. \u003cbr/\u003e• Provide input into global standards and data center template designs. \u003cbr/\u003e• Perform civil, structural, electrical and build phasing evaluations for potential sites. \u003cbr/\u003e• Conduct negotiations with general contractors and evaluate bids/proposals with detail and accuracy. \u003cbr/\u003e• Determine and communicate site requirements that could impact schedule, cost, delivery of the work and integration of site with surrounding properties.\u003cbr/\u003e• Create construction GC scope and request for proposals.\u003cbr/\u003e• Manage GC as they deliver preconstruction services during the design phase. \u003cbr/\u003e• Review bid summaries, schedules and milestones, labor pricing, and perform subcontractor evaluations.\u003cbr/\u003e• Travel required: 25%-50%. Domestic and International. \u003cbr/\u003e• US Citizenship required.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e**Why AWS**\u003cbr/\u003e Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003e*Diverse Experiences*\u003cbr/\u003e Amazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003e*Work/Life Balance*\u003cbr/\u003e We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003e*Inclusive Team Culture*\u003cbr/\u003e Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003e*Mentorship and Career Growth*\u003cbr/\u003e We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003e#DCCD_AMER ","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"23a8f490-b40e-4154-9cc0-824c97710055","id_icims":"3049299","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3049299/pre-construction-manager-amer-southeast-ml-data-center-pre-construction","job_schedule_type":"full-time","location":"US, OH, Columbus","locations":["{\"normalizedStateName\":\"Ohio\",\"normalizedCountryCode\":\"USA\",\"city\":\"Columbus\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OH, Columbus\",\"coordinates\":\"39.96199,-83.00275\",\"normalizedCountyName\":\"Franklin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Columbus, Ohio, USA\",\"location\":\"US, OH, Columbus\",\"region\":\"OH\",\"buildingCodeList\":[\"CMH11\"],\"normalizedCityName\":\"Columbus\"}"],"normalized_location":"Columbus, Ohio, USA","optional_search_labels":["aws.team-ais"],"posted_date":"July 31, 2025","preferred_qualifications":"• Ability to develop new concepts through exploration, design, testing and into deployment/mass production. Experience directly related to the design or construction of data centers/critical infrastructure or large scale mechanical and electrical plants. \u003cbr/\u003e• Experience of working with large data center providers in multiple regions. \u003cbr/\u003e• Large infrastructure project experience, vendor management experience, and sustainable design experience. \u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $98,700/year in our lowest geographic market up to $210,800/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"OH","title":"Pre-Construction Manager, AMER Southeast ML Data Center Pre-Construction","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3049299/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of leading large-scale, technical or engineering programs with a proven record of thought leadership, business case development, realizing customer benefits, and successful program completion experience\u003cbr/\u003e- 2+ years of customer-facing work, engaging with customer executives, technologists or partners to solve business problems with advanced technologies experience\u003cbr/\u003e- Bachelor's degree in science, technology, engineering, math, business or equivalent\u003cbr/\u003e- Experience leading technical and non-technical transformation project teams with a proven ability to work across broad functional teams","business_category":"aws","city":"Austin","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"This position is part of the AWS Specialist and Partner Organization (ASP). Specialists own the end-to-end go-to-market strategy for their respective technology domains, providing the business and technical expertise to help our customers succeed. Partner teams own the strategy, recruiting, development, and growth of our key technology and consulting partners. Together they provide our customers with the expertise and scale needed to build innovative solutions for their most complex challenges.\u003cbr/\u003e\u003cbr/\u003eElevate Customer Success with innovative Cloud Technology. We're seeking an innovative Customer Success Specialist to transform enterprise contact center experiences through AWS Amazon Connect. You'll be a strategic partner who empowers businesses to revolutionize their customer engagement, driving meaningful technological adoption and creating tangible business value.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Develop customized success plans that align AWS Amazon Connect solutions with customers' strategic business objectives\u003cbr/\u003e- Design and deliver technical workshops that accelerate technology adoption and customer enablement\u003cbr/\u003e- Create comprehensive best practices documentation and implementation guides\u003cbr/\u003e- Proactively monitor customer health dashboards and address potential adoption barriers\u003cbr/\u003e- Gather and communicate critical customer insights to AWS product development teams\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour day will be a dynamic blend of strategic thinking and customer-centric problem-solving. You'll collaborate with enterprise customers, design tailored success strategies, and unlock the transformative potential of cloud communication technologies. Expect to craft compelling narratives that demonstrate how AWS Amazon Connect can fundamentally reshape customer interaction models.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe are a collaborative group of customer success professionals dedicated to driving technological innovation. Our team believes in empowering businesses through intelligent cloud solutions, working closely with customers to understand their unique challenges and co-create breakthrough strategies.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003e\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003e\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e","department_cost_center":null,"description_short":"This position is part of the AWS Specialist and Partner Organization (ASP). Specialists own the end-to-end go-to-market strategy for their respective technology domains, providing the business and technical","display_distance":null,"id":"7a7cb00a-cf1b-4f3c-9fa6-3ec4c9e2bdc4","id_icims":"3150339","is_intern":null,"is_manager":null,"job_category":"Business \u0026 Merchant Development","job_family":"Tech, Customer Solutions Mgr","job_function_id":null,"job_path":"/en/jobs/3150339/senior-customer-success-specialist-amazon-connect-aws-specialist-and-partner-organization","job_schedule_type":"full-time","location":"US, TX, Austin","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS11\"],\"normalizedCityName\":\"Austin\"}","{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Atlanta\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Atlanta\",\"coordinates\":\"33.74831,-84.39111\",\"normalizedCountyName\":\"Fulton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Atlanta, Georgia, USA\",\"location\":\"US, GA, Atlanta\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL11\"],\"normalizedCityName\":\"Atlanta\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Dallas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Dallas\",\"coordinates\":\"32.77822,-96.79512\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Dallas, Texas, USA\",\"location\":\"US, TX, Dallas\",\"region\":\"TX\",\"buildingCodeList\":[\"DFW15\"],\"normalizedCityName\":\"Dallas\"}"],"normalized_location":"Austin, Texas, USA","optional_search_labels":["aws.team-aspo"],"posted_date":"December 30, 2025","preferred_qualifications":"- PMP certification, or SCRUM/Agile, SAFe certification\u003cbr/\u003e- Experience implementing cloud services including migrations and modernization projects or similar\u003cbr/\u003e- Experience with Amazon Connect or call center technology\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Austin - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, TX, Dallas - 153,600.00 - 207,800.00 USD annually","primary_search_label":"aws.team-business-development-primary","source_system":"JobCreator","state":"TX","title":"Senior Customer Success Specialist - Amazon Connect, AWS Specialist and Partner Organization","university_job":null,"updated_time":"23 minutes","url_next_step":"https://account.amazon.com/jobs/3150339/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-business-development-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 10+ years of technology related sales, business development or equivalent experience\u003cbr/\u003e- 5+ years of sales team management experience\u003cbr/\u003e- Experience hiring and leading sales or account management teams focused on acquiring and managing enterprise customers","business_category":"aws","city":"Chicago","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"As AWS continues to rapidly grow, we seek a Sr. Sales Leader to own driving adoption of Amazon Web Services within our Enterprise segment. In this role, you will accelerate adoption, building strategy through execution and inspirational leadership. This individual will build a business focused on helping enterprise customers in the Central US innovate and exceed revenue goals. This leader must have the business savvy and sales leadership background necessary to bring together a cross functional team including sales, partner and product teams to deliver accelerated business growth for AWS and our customers. You will establish and maintain high-level relationships within key accounts, driving innovation and next-gen capabilities across infrastructure and business application landscapes.\u003cbr/\u003e \u003cbr/\u003eThis is an exciting opportunity to be part of a fast growing and entrepreneurial organization, bringing innovation and growing the adoption of cloud. This role will require you to scale a highly complex environment through strategic initiatives. As the Senior Leader focused on our most important Enterprise customers and partners in the Central US, you will have the exciting opportunity to help drive the growth and shape the future of cloud computing, by building and leading a sales team dedicated to helping our customers build and deliver innovative solutions leveraging the latest in AWS services. You will be responsible for developing opportunity pipelines, evangelizing cloud computing, and driving revenue and user adoption. You will also be responsible for building the AWS go-to-market through both your dedicated team and the cross-functional ecosystem.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Drive adoption of AWS full suite of services into a set of Enterprise customers\u003cbr/\u003e- Exceed annual revenue and design win targets\u003cbr/\u003e- Scale out an integrated go-to-market team in a highly complex environment\u003cbr/\u003e- Develop and execute against a set of goals including customer references, support, professional services, and training\u003cbr/\u003e- Develop relationships and engage with cross-functional and partner ecosystems to extend reach and drive adoption\u003cbr/\u003e- Build and leverage relationships with internal and      external stakeholders to further adoption of AWS services in the market\u003cbr/\u003e- Support all AWS operating cadences and represent a consolidated view of the districts to senior AWS leaders\u003cbr/\u003e- Lead a Customer Obsessed business that delights our customers\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS \u003cbr/\u003e\u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eAbout the Team: \u003cbr/\u003e\u003cbr/\u003eAbout the broader organization: Sales, Marketing and Global Services (SMGS) \u003cbr/\u003eAWS Sales, Marketing, and Global Services (SMGS) is responsible for driving revenue, adoption, and growth from the largest and fastest growing small- and mid-market accounts to enterprise-level customers including public sector. The AWS Global Support team interacts with leading companies and believes that world-class support is critical to customer success. AWS Support also partners with a global list of customers that are building mission-critical applications on top of AWS services.","department_cost_center":null,"description_short":"As AWS continues to rapidly grow, we seek a Sr. Sales Leader to own driving adoption of Amazon Web Services within our Enterprise segment. In this role, you will accelerate adoption, building strategy","display_distance":null,"id":"8cf0ecfc-efdd-4611-bb54-7be4ab0f303a","id_icims":"3175305","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Tech Sales","job_function_id":null,"job_path":"/en/jobs/3175305/aws-sr-sales-leader-auto-mfg-central-area","job_schedule_type":"full-time","location":"US, IL, Chicago","locations":["{\"normalizedStateName\":\"Illinois\",\"normalizedCountryCode\":\"USA\",\"city\":\"Chicago\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, IL, Chicago\",\"coordinates\":\"41.88425,-87.63245\",\"normalizedCountyName\":\"Cook\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Chicago, Illinois, USA\",\"location\":\"US, IL, Chicago\",\"region\":\"IL\",\"buildingCodeList\":[\"ORD11\"],\"normalizedCityName\":\"Chicago\"}"],"normalized_location":"Chicago, Illinois, USA","optional_search_labels":[],"posted_date":"February  5, 2026","preferred_qualifications":"- Master's degree\u003cbr/\u003e- Bachelor's degree or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments, restricted stock units (RSUs), and sales incentives. Final compensation will be determined based on factors including experience, qualifications, and location. \u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eAmazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, IL, Chicago - 187,000.00 - 252,900.00 USD annually","primary_search_label":"aws.team-sales-primary","source_system":"JobCreator","state":"IL","title":"AWS Sr. Sales Leader, Auto/MFG, Central Area","university_job":null,"updated_time":"26 minutes","url_next_step":"https://account.amazon.com/jobs/3175305/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sales-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent\u003cbr/\u003e- Knowledge of OSHA regulations, specifically 29 CFR 1910\u003cbr/\u003e- A minimum of 1 year in an Environmental Health \u0026 Safety (EHS) related field OR; A Bachelor’s degree in EHS-relevant background OR; 6 months experience performing in a safety-related role within Amazon\u003cbr/\u003e- Experience using Microsoft Word and Excel in a professional capacity\u003cbr/\u003e- Experience maintaining confidentiality in matter involving security and/or personnel issues in the workplace","business_category":"fulfillment-and-operations","city":"Calgary","company_name":"Amazon Canada Fulfillment Services, ULC - B85","country_code":"CAN","description":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. As a Workplace Health \u0026 Safety Specialist (WHSS), you'll be at the forefront of transforming workplace safety culture at one of the world's most innovative companies. Your expertise and dedication will directly protect employees, ensuring they return home safely to their families every day. You'll facilitate new approaches to safety, combining technology with human-centered solutions to create an environment where safety and productivity thrive together. This isn't just about maintaining safety standards – it's about revolutionizing how we think about and implement workplace safety, making a lasting impact on our people and operations. As your building's designated safety champion, you'll have the unique opportunity to build relationships, influence positive change, and help write the next chapter in Amazon's commitment to becoming Earth's Safest Place to Work.\u003cbr/\u003e\u003cbr/\u003eCore Impact Areas:\u003cbr/\u003eSafety Program Excellence \u0026 Implementation - Drive comprehensive safety programs through data-driven strategies. Lead daily safety audits, incident investigations, and risk assessments while implementing innovative solutions to prevent injuries. Deliver engaging safety training that resonates with associates and promotes a proactive safety culture. Champion continuous improvement initiatives that enhance workplace safety while maintaining operational efficiency.\u003cbr/\u003e\u003cbr/\u003eAssociate Advocacy \u0026 Cultural Leadership - Serve as a trusted safety advisor and advocate for associate wellbeing, building strong partnerships across all levels of the organization. Foster a culture where safety is everyone's priority through effective communication, coaching, and positive reinforcement. Develop strong relationships with frontline associates and leadership to drive behavioral changes and ensure safety best practices become natural habits. Transform safety data into compelling narratives that influence positive change and drive engagement in safety initiatives.\u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements include:\u003cbr/\u003e\u003cbr/\u003e- Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Stand/walk for up to 12 hours during shifts\u003cbr/\u003e- Work in an environment where the noise level varies\u003cbr/\u003e- Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e- Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e- Must be available to work flexible shifts including days, nights and/or weekends.\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. As a Workplace","display_distance":null,"id":"7be416a3-cdf1-4adc-b276-5c6f31d261f5","id_icims":"3165115","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3165115/whs-specialist","job_schedule_type":"full-time","location":"CA, AB, Calgary","locations":["{\"normalizedStateName\":\"Alberta\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Calgary\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, AB, Calgary\",\"coordinates\":\"51.04532,-114.06301\",\"normalizedCountyName\":\"Alberta\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Calgary, Alberta, CAN\",\"location\":\"CA, AB, Calgary\",\"region\":\"AB\",\"buildingCodeList\":[\"YYC1\"],\"normalizedCityName\":\"Calgary\"}"],"normalized_location":"Calgary, Alberta, CAN","optional_search_labels":[],"posted_date":"January 22, 2026","preferred_qualifications":"- Experience in worker's compensation case management\u003cbr/\u003e- Bachelor’s degree or higher, preferably in a safety related field\u003cbr/\u003e- Strong communication, teamwork, analysis, judgment, and customer focus skills\u003cbr/\u003e- Experience leading and managing a team, ability to analyze accident data, new processes, and machinery for potential safety concerns, and conduct job hazard and job safety analyses\u003cbr/\u003e- Experience in emergency response and currently holds First Aid and CPR certificates\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(34, 34, 34)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. As a total compensation company, Amazon's package may include other elements such as sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon offers comprehensive benefits including health insurance (medical, dental, vision, prescription, basic life \u0026amp; AD\u0026amp;D insurance), Registered Retirement Savings Plan (RRSP), Deferred Profit Sharing Plan (DPSP), paid time off, and other resources to improve health and well-being. We thank all applicants for their interest, however only those interviewed will be advised as to hiring status.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eCAN, AB, Calgary - 29.00 - 40.00 CAD hourly","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"AB","title":"WHS Specialist ","university_job":null,"updated_time":"28 minutes","url_next_step":"https://account.amazon.com/jobs/3165115/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in mechanical and electrical integration or assembly\u003cbr/\u003e- Experience with common business applications and tools (i.e. Microsoft Office, ie. Word, Excel, etc.)","business_category":"retail","city":"Richardson","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Here at Amazon, we embrace our differences. We are committed to furthering our culture of diversity and inclusion of our teams within the organization.\u003cbr/\u003e How do you get items to customers quickly, cost-effectively, and—most importantly—safely, in less than an hour? And how do you do it in a way that can scale? Our teams of hundreds of scientists, engineers, aerospace professionals, and futurists have been working hard to do just that! We are delivering to customers, and are excited for what’s to come. Check out more information about Prime Air on the About Amazon blog (https://www.aboutamazon.com/news/transportation/amazon-prime-air-delivery-drone-reveal-photos)\u003cbr/\u003e If you are seeking an iterative environment where you can drive innovation, apply state-of-the-art technologies to solve real world delivery challenges, and provide benefits to customers, Prime Air is the place for you. Come work on the Amazon Prime Air Team!\u003cbr/\u003e\u003cbr/\u003ePrime Air is seeking a Repair Technician who combines technical skills with a passion for maintaining machinery and aircraft. This person will be responsible for drone maintenance and routine service, ensuring the aircraft conforms to design, and that vehicles are in safe operating condition. This candidate is expected to work closely with engineering, flight operations, and other Prime Air teams to deliver on their assigned responsibilities. This individual should possess strong analytical skills, be a self-starter, and work well independently.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e • Drive time-based and condition-based maintenance activities\u003cbr/\u003e • Show understanding of fleet performance metrics\u003cbr/\u003e • Verify adherence to FAA regulations and Prime Air directives and processes\u003cbr/\u003e • Manage fleet spare parts and inventory\u003cbr/\u003e• Demonstrate proactive safety mindset in ambiguous situations\u003cbr/\u003e• Follow detailed instructions outlined in technical manuals \u003cbr/\u003e\u003cbr/\u003eThis role requires the ability to carry/lift up to 50 lbs, stand / walk during shifts lasting up to 12 hours, and be able to frequently push, pull, squat, bend and reach.\u003cbr/\u003e\u003cbr/\u003eThis role requires the  ability to work any shift, including nights, weekends, and holidays\u003cbr/\u003e\u003cbr/\u003eThis role requires travel, up to 25% of the time.\u003cbr/\u003e\u003cbr/\u003eExport Control License\u003cbr/\u003e This position may require a deemed export control license for compliance with applicable laws and regulations. Placement is contingent on Amazon’s ability to apply for and obtain an export control license on your behalf.\u003cbr/\u003e\u003cbr/\u003eThis position may be subject to Department of Transportation (DOT) drug and alcohol testing if conducting safety sensitive functions as defined by the FAA. Federal law also requires Amazon to determine an applicant's DOT drug and/or alcohol testing history prior to hiring him/her into a position that would require them to conduct safety sensitive functions as defined by the FAA.","department_cost_center":null,"description_short":"Here at Amazon, we embrace our differences. We are committed to furthering our culture of diversity and inclusion of our teams within the organization. How do you get items to customers quickly, cost-effectively,","display_distance":null,"id":"f37831e5-394e-491e-8573-426592ba32e9","id_icims":"3175312","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Aerospace Maint Technician","job_function_id":null,"job_path":"/en/jobs/3175312/prime-air-maintenance-technician-amazon-prime-air","job_schedule_type":"full-time","location":"US, TX, Richardson","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Richardson\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Richardson\",\"coordinates\":\"32.96074,-96.73297\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Richardson, Texas, USA\",\"location\":\"US, TX, Richardson\",\"region\":\"TX\",\"buildingCodeList\":[\"DFW63\",\"WFM613\",\"NUL2\",\"QTX1\",\"DFW53\",\"LDA4\",\"PTX8\",\"XDF6\",\"DFW55\",\"STX8\"],\"normalizedCityName\":\"Richardson\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Woodway\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Woodway\",\"coordinates\":\"31.49614,-97.21945\",\"normalizedCountyName\":\"McLennan\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Woodway, Texas, USA\",\"location\":\"US, TX, Woodway\",\"region\":\"TX\",\"buildingCodeList\":[\"QTX2\"],\"normalizedCityName\":\"Woodway\"}"],"normalized_location":"Richardson, Texas, USA","optional_search_labels":[],"posted_date":"February  5, 2026","preferred_qualifications":"- Experience in installing sub-assemblies and assemblies while working to drawings or CAD files\u003cbr/\u003e- Candidates with Robotics and Manufacturing Engineering experience are highly encouraged to apply\u003cbr/\u003e- Experience in the aviation industry\u003cbr/\u003e- Excellent business communication skills\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, RICHARDSON - 21.00 - 44.00 USD hourly\u003cbr/\u003eUSA, TX, Richardson - 21.00 - 44.00 USD hourly\u003cbr/\u003eUSA, TX, WOODWAY - 21.00 - 44.00 USD hourly","primary_search_label":"retail.team-global-prime-air","source_system":"JobCreator","state":"TX","title":"Prime Air Maintenance Technician, Amazon Prime Air","university_job":null,"updated_time":"29 minutes","url_next_step":"https://account.amazon.com/jobs/3175312/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-prime-air","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of client facing Advertising and/or Sales role with revenue ownership.\u003cbr/\u003e- Experience in Omni-channel marketing, display, over-the-top (OTT)/Video, or search marketing\u003cbr/\u003e- Effectively analyze data and insights to present strategic and tactical plans to advertisers\u003cbr/\u003e- Adept at solving problems that span business and technology\u003cbr/\u003e- Influence process improvement that scales broadly; inventing and simplifying within existing processes","business_category":"advertising","city":"New York","company_name":"Amazon Advertising LLC","country_code":"USA","description":"Amazon Advertising operates at the intersection of eCommerce and advertising, offering a rich array of advertising solutions. We partner with advertisers to reach Amazon customers on Amazon.com, across our other owned and operated sites, on other high quality sites across the web, and on millions of devices. If you’re interested in joining a rapidly growing organization working to build a unique, world-class advertising group with a relentless focus on the customer, you’ve come to the right place.\u003cbr/\u003e\u003cbr/\u003eWe’re looking for a results oriented Associate Account Manager who is passionate about partnering with our advertisers, educating them and helping to solve ambiguous business problems, mitigating risks before they become roadblocks. As an Associate Account Manager, you manage and deliver against complex advertiser goals and problems to drive revenue and achieve revenue targets. You nurture customer relationships and create revenue opportunities from the advertisers you own. You’ll not only dive deep into data to understand trends, but also communicate the “why” behind results and make actionable recommendations to internal and external stakeholders. You’ll leverage Amazon’s proprietary data to provide strategic and personalized recommendations, influencing both your internal team and your external customer to facilitate them reaching their business goals. This role is highly collaborative, working with Creative, Senior Sales, Product, and Retail partners and will drive process improvement to gain efficiency and foster collaboration. The Associate Account Manager’s strategic digital expertise and influence is considered critical to unlocking greater value and impact for our advertisers.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e-Become a knowledgeable partner and leader on Amazon Advertising solutions\u003cbr/\u003e-Deliver the highest level of sales and customer service to our clients.\u003cbr/\u003e-Retain and grow revenue from existing advertisers.\u003cbr/\u003e-Drive deals to closure in a new business environment.\u003cbr/\u003e-Develop annual media strategies for growth based on overall advertiser goals and objectives\u003cbr/\u003e-Develop campaign strategies and audience engagement recommendations\u003cbr/\u003e-Evaluate success metrics and drive campaign performance using data\u003cbr/\u003e-Perform in-depth data analysis to form and deliver actionable recommendations for both short- and long-term advertising strategy\u003cbr/\u003e-Educate advertisers on performance metrics, insights, and how to drive greater results\u003cbr/\u003eWork cross-functionally with Senior Sales and other -Amazon partners to drive incremental revenue and increase advertiser satisfaction","department_cost_center":null,"description_short":"Amazon Advertising operates at the intersection of eCommerce and advertising, offering a rich array of advertising solutions. We partner with advertisers to reach Amazon customers on Amazon.com, across","display_distance":null,"id":"28c40126-2f29-4323-bd9a-c168990cbb46","id_icims":"3175285","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Ad Sales","job_function_id":null,"job_path":"/en/jobs/3175285/associate-sales-account-manager-grocery","job_schedule_type":"full-time","location":"US, NY, New York","locations":["{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK19\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"New York, New York, USA","optional_search_labels":[],"posted_date":"February  5, 2026","preferred_qualifications":"- Experience in programmatic strategy and implementation\u003cbr/\u003e- 3-5 years work experience in Advertising with experience owning Media Buying/Planning across Digital Advertising, eCommerce, and/or Linear Broadcast/Streaming TV focused roles.\u003cbr/\u003e- Bachelors’ degree in Economics, Marketing, Advertising, Statistics, Engineering or Business; MBA is a plus\u003cbr/\u003e- Excellent organizational, relationship-building, and communication (written and verbal) skills\u003cbr/\u003e- Proven track record of delivering results (including revenue targets) and significantly contributing to advertiser revenue growth\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments, restricted stock units (RSUs), and sales incentives. Final compensation will be determined based on factors including experience, qualifications, and location. \u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eAmazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, New York - 66,300.00 - 108,800.00 USD annually","primary_search_label":"advertising.team-amazon-ads","source_system":"JobCreator","state":"NY","title":"Associate Sales Account Manager, Grocery","university_job":null,"updated_time":"29 minutes","url_next_step":"https://account.amazon.com/jobs/3175285/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-ads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- Work a flexible schedule including weekends, nights, and holidays\u003cbr/\u003e- 1+ years of computer/server hardware troubleshooting or related IT experience","business_category":"aws","city":"Berwick","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is seeking Data Center Technicians to support our customers in multiple locations. This position requires the successful candidate report to a site location.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is a fast-paced technology company and a leader in the world of data centers. The position will help ensure overall availability and reliability to meet or exceed defined service levels of data center operations. This position may involve participation in an primary responder rotation, which includes monitoring the data center infrastructure, coordinating response to operational incidents, and partnering with other teams to rapidly resolve issues that impact service availability. Primary responder responsibilities may require evening, weekend, holiday, and/or night work to ensure our global data centers are operating at the highest levels of reliability for our customers. All candidates should be willing to work both independently and with a team. Work prioritization, organizational skills, effective communication, and the ability to react quickly are critical to success. In addition to hardware and network repair candidates will install equipment, create documentation, innovate solutions, and fix problems within the data center space. This team works in an environment that operates 24/7. Traveling within and outside of regional work area is required.\u003cbr/\u003e\u003cbr/\u003eAll physical requirements are expected with reasonable accommodations:\u003cbr/\u003e• Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds\u003cbr/\u003e• Ability to work in an environment that operates 24/7 with an ability to participate in primary responder rotation and provide after-hours support as needed\u003cbr/\u003e• Working in cramped and/or elevated and/or noisy environments\u003cbr/\u003e• Bending, lifting, stretching, reaching, standing and walking for up to 8+ hours a day\u003cbr/\u003e• Ascending and descending ladders, stairs, and gangways safely and without limitation\u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon is not able to provide sponsorship now or in the future for these positions. Eligible candidates must have work authorization without employer intervention to be considered.\u003cbr/\u003e\u003cbr/\u003eNOTE: If applying for positions in Oregon (OR) and Ohio (OH), these sites are within AWS GovCloud region. Effective May 15, 2017, logical access to the AWS GovCloud region will be restricted to Amazon employees who are U.S. Citizens (GovCloud may NOT be accessed from outside of the United States).\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Performing server rack installations, hardware break-fix on various components, troubleshooting network issues, and responding to operational incidents that impact service availability, escalating to senior technicians and management as needed/required\u003cbr/\u003e• Serving as a primary contact point for both internal and external stakeholders, including engineers, software developers, vendors, and contractors\u003cbr/\u003e• Performing on-call duties and participating in scheduled maintenance and change management activities\u003cbr/\u003e• Contributing to documentation and process improvement initiatives based on your analysis of operational issues\u003cbr/\u003e• Helping to train and onboard new team members\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Data Center Technician professional, you have industry-leading technical abilities and demonstrate a breadth of knowledge while you:\u003cbr/\u003e• Take ownership of technical issues brought by their customer base, engaging other teams when needed to drive resolution\u003cbr/\u003e• Solve problems at their root and step back to understand the broader context\u003cbr/\u003e• Maintain service level agreements through the implementation of proactive issue detection and reporting\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"94e9aed2-5ce1-4b90-ab67-4637dbd2c387","id_icims":"3173778","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3173778/data-center-technician-dcc-communities","job_schedule_type":"full-time","location":"US, PA, Berwick","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Berwick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Berwick\",\"coordinates\":\"41.05089,-76.24352\",\"normalizedCountyName\":\"Columbia\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Berwick, Pennsylvania, USA\",\"location\":\"US, PA, Berwick\",\"region\":\"PA\",\"buildingCodeList\":[\"PHL100\"],\"normalizedCityName\":\"Berwick\"}"],"normalized_location":"Berwick, Pennsylvania, USA","optional_search_labels":["aws.team-ais","aws.team-dc","hourly","military"],"posted_date":"February  4, 2026","preferred_qualifications":"- Experience managing work and priorities through a ticketing system\u003cbr/\u003e- Experience working in a Data Center environment\u003cbr/\u003e- An Associate’s degree, technical certification, or equivalent professional or military experience in a relevant field (e.g., computer science, networking engineering, etc.)\u003cbr/\u003e- Understanding of network design, protocols and layer 1/2 troubleshooting\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, PA, Berwick - 27.00 - 47.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"PA","title":"Data Center Technician , DCC Communities ","university_job":null,"updated_time":"29 minutes","url_next_step":"https://account.amazon.com/jobs/3173778/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}