{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 3+ years of Apple platform development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Bachelor's degree or foreign equivalent in Computer Science, Engineering, Mathematics, or a related field\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"north-america-stores","city":"New York","company_name":"Zappos.com LLC","country_code":"USA","description":"At Zappos Tech, we're on a mission to deliver unparalleled shopping experiences to our customers. We're seeking a Software Development Engineer II (SDE2) to join our iOS Mobile team at Zappos. As an SDE2 on the iOS team, you will contribute significantly to software development of the Zappos iOS app. Your work will span the entire customer journey, from Homepage to checkout: Search, Search Results, Homepage, Ads, Widgets, Recommendations, and much more. If you're passionate about innovative products, thrive in dynamic environments, and are ready to grow your technical and leadership skills, we would love to hear from you!\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tDevelop and Maintain: Play a key role in the development and maintenance of native iOS apps using all the prominent iOS technologies and frameworks (XCode, Swift, SwiftUI, Objective-C, UIKit, CloudKit, Core Data,Core Animation)\u003cbr/\u003e•\tCollaborate for Success: Work closely with product managers, UX designers, and engineers. Your contributions will be crucial in creating optimal customer experiences and steering technology choices.\u003cbr/\u003e•\tCoach and Guide: Provide guidance and feedback to help maintain high coding standards and practices. Your efforts will contribute to the growth and development of our engineering team.\u003cbr/\u003e•\tSolve Problems: Address complex issues within a well-understood technology strategy. You'll balance business needs with technical solutions to ensure scalability and future growth.\u003cbr/\u003e•\tUphold Best Practices: Your contributions will not only address problems efficiently but also adhere to and promote best practices within the team.\u003cbr/\u003e•\tLearn and Grow: You'll have opportunities for continuous learning and contributing to the team's strategy and goals, fostering an inclusive and growth-oriented environment.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour day starts with standup where you sync with your team and product managers about tasks and priorities. \u003cbr/\u003e\u003cbr/\u003eYou'll spend most of your time writing code - building and testing new features, fixing issues, and improving app performance. Code reviews are part of your regular routine.  You regularly use AI tooling as part of your day to day development tasks.\u003cbr/\u003e\u003cbr/\u003eYou might research new iOS frameworks or tools, write technical documentation for complex features, or collaborate closely with teammates on challenging problems. Some days are deep focus on feature development, others involve mentoring or investigating production issues. The work varies but always centers on making our iOS app better for our customers.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eYou'll join a tight-knit mobile team of iOS and Android developers who take ownership of the entire customer experience in our app. Everyone here is passionate about creating seamless shopping experiences that make customers genuinely happy - whether that's perfecting the search flow, streamlining checkout, or building features that surprise and delight.\u003cbr/\u003e\u003cbr/\u003eWe work closely together, sharing knowledge across platforms and collaborating daily with product managers and backend engineers. The team values transparency, continuous learning, and taking initiative. You'll have the freedom to propose solutions, and experiment with new approaches to \u003cbr/\u003eimprove the Zappos customer experience.","department_cost_center":null,"description_short":"At Zappos Tech, we're on a mission to deliver unparalleled shopping experiences to our customers. We're seeking a Software Development Engineer II (SDE2) to join our iOS Mobile team at Zappos. As an SDE2","display_distance":null,"id":"337ba916-0c69-4c0c-b5f2-e9722296a9a9","id_icims":"3167762","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3167762/software-development-engineer-ii-ios-zappos-discovery-tech-mobile","job_schedule_type":"full-time","location":"US, NY, New York","locations":["{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK94\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"New York, New York, USA","optional_search_labels":[],"posted_date":"January 27, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- Usage of generative AI tools to enhance workflow efficiency, with a willingness to learn effective prompting and evaluation practices.\u003cbr/\u003e- Ability to recognize opportunities where generative AI could enhance products, workflows, or customer experiences.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, New York - 158,100.00 - 213,800.00 USD annually","primary_search_label":"north-america-stores.fashion","source_system":"JobCreator","state":"NY","title":"Software Development Engineer II, iOS, Zappos Discovery Tech - Mobile ","university_job":null,"updated_time":"1 minute","url_next_step":"https://account.amazon.com/jobs/3167762/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"fashion","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of professional non-internship marketing experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Experience with content production processes","business_category":"subsidiaries","city":"New York","company_name":"Zappos LLC - B46","country_code":"USA","description":"We're seeking a dynamic Social Content Producer to lead the production of compelling social media content for Zappos and Shopbop. This role will be responsible for planning and executing social media photo and video shoots, managing event coverage, and overseeing brand partnership content creation.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Plan and execute social media content shoots from pre-production to completion, including shot list development and on-set management \u003cbr/\u003e• Manage relationships with external photography/videography teams, creative agencies, and production vendors\u003cbr/\u003e• Develop and maintain content production schedules and budgets \u003cbr/\u003e• Ensure all deliverables meet platform-specific requirements and brand guidelines \u003cbr/\u003e• Direct on-site photography and videography teams during shoots and events \u003cbr/\u003e• Coordinate with internal teams (styling, creative, marketing) to align on content needs and execution \u003cbr/\u003e• Manage post-production process including photo/video selection, editing oversight, and asset organization\u003cbr/\u003e","department_cost_center":null,"description_short":"We're seeking a dynamic Social Content Producer to lead the production of compelling social media content for Zappos and Shopbop. This role will be responsible for planning and executing social media photo","display_distance":null,"id":"b46d5ab3-c498-431d-a9da-0d8246d9b252","id_icims":"3109414","is_intern":null,"is_manager":null,"job_category":"Marketing \u0026 PR","job_family":"Marketing","job_function_id":null,"job_path":"/en/jobs/3109414/social-media-producer-shopbop-zappos","job_schedule_type":"full-time","location":"US, NY, New York","locations":["{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK94\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"New York, New York, USA","optional_search_labels":[],"posted_date":"October 15, 2025","preferred_qualifications":"- Experience working with a major brand or entertainment company in project/production management\u003cbr/\u003e- Experience in e-commerce, start ups, advertising, commercial\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, New York - 66,300.00 - 113,700.00 USD annually","primary_search_label":"subsidiaries.team-zappos","source_system":"JobCreator","state":"NY","title":"Social Media Producer, Shopbop \u0026 Zappos ","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3109414/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-zappos","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of leading large-scale, technical or engineering programs with a proven record of thought leadership, business case development, realizing customer benefits, and successful program completion experience\u003cbr/\u003e- 2+ years of customer-facing work, engaging with customer executives, technologists or partners to solve business problems with advanced technologies experience\u003cbr/\u003e- Bachelor's degree in science, technology, engineering, math, business or equivalent\u003cbr/\u003e- Experience leading technical and non-technical transformation project teams with a proven ability to work across broad functional teams\u003cbr/\u003e- 3+ years with Amazon Connect or contact/call center technology expereince","business_category":"aws","city":"Atlanta","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Application deadline: Feb 4, 2026\u003cbr/\u003e\u003cbr/\u003eThis position is part of the AWS Specialist and Partner Organization (ASP). Specialists own the end-to-end go-to-market strategy for their respective technology domains, providing the business and technical expertise to help our customers succeed. Partner teams own the strategy, recruiting, development, and growth of our key technology and consulting partners. Together they provide our customers with the expertise and scale needed to build innovative solutions for their most complex challenges.\u003cbr/\u003e\u003cbr/\u003eAWS is one of Amazon’s fastest growing businesses, servicing millions of customers in more than 190 countries, reshaping the way global enterprises consume information technology and powering the developers who are building the next generation of global industry leaders. AWS customers include some of the most innovative startups like Netflix, Pinterest, Airbnb, and Instagram as well as some of the largest global enterprises like Shell International, Unilever, Hitachi, Sharp, Bristol-Myers Squibb, and Samsung. \u003cbr/\u003e\u003cbr/\u003eAWS is seeking an experienced Contact Center as a Service (CCaaS) Customer Success Specialist for Amazon Connect. Connect was born out of Amazon’s own need for the best CCaaS solution that works at scale, while improving customer experience. Today, Connect is one of AWS's fastest growing services, leveraging native generative AI capabilities to improve customer and employee experiences. As a Connect Customer Success Specialist, you will act as a strategic advisor to customers, helping them innovate and optimize their contact center and customer experience through adoption of the Connect capabilities. You will lead cross-functional field teams in sales, solutions architecture, partner sales, product, and will work at the CxO level with customers to maximize the value of their Connect investment. \u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will have enterprise sales and/or consulting experience in Contact Center as a Service or similar SaaS solutions in areas such as telecommunications, VoIP, and/or or CRM/ERP applications. You will be passionate about customer experience and advocacy and bring the voice of the customer into the product development process. You will enjoy solving complex problems; our customers will rely on your guidance to scale Connect across their complex global businesses, overcoming technical and organizational roadblocks on the way.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e-  Serve as the primary point of contact for a portfolio of strategic customer accounts, managing relationships and being a strategic advisor, driving enterprise-wide adoption of Connect. \u003cbr/\u003e- Deliver compelling presentations, product demos, sample solutions and programs, events, and discussions to enable customer success. \u003cbr/\u003e- Build customer skills and proficiency with Connect. \u003cbr/\u003e- Engage with C-level stakeholders to understand the value proposition of Connect and uncover new areas of business value. \u003cbr/\u003e- Develop account plans in conjunction with field teams. \u003cbr/\u003e- Meet annual revenue targets through increased adoption of Connect. \u003cbr/\u003e- Work with partners and ISVs to extend reach \u0026 drive adoption of AWS solutions.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThe Amazon Connect Customer Success Specialist (CSS) will create a matrix environment with resources from our partner community, Professional Services, AWS account teams, and Connect service team members to drive customer success. A CSS will run attach service plays, customer engagements to drive adoption of migrating services, work with our partner community to scale and align key members of the services team for optimization and retention efforts. Last, a CSS will uncover cases that align to Connect unique business value to be shared with AWS Marketing. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003e\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003e\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.","department_cost_center":null,"description_short":"This position is part of the AWS Specialist and Partner Organization (ASP). Specialists own the end-to-end go-to-market strategy for their respective technology domains, providing the business and technical","display_distance":null,"id":"be182a8a-b43f-46c4-ad95-008ff6f6711e","id_icims":"3165005","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Tech, Customer Solutions Mgr","job_function_id":null,"job_path":"/en/jobs/3165005/senior-customer-success-specialist-connect-specialty-sales","job_schedule_type":"full-time","location":"US, GA, Atlanta","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS22\"],\"normalizedCityName\":\"Austin\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA44\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Atlanta\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Atlanta\",\"coordinates\":\"33.74831,-84.39111\",\"normalizedCountyName\":\"Fulton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Atlanta, Georgia, USA\",\"location\":\"US, GA, Atlanta\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL11\"],\"normalizedCityName\":\"Atlanta\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}"],"normalized_location":"Atlanta, Georgia, USA","optional_search_labels":["aws.team-aspo"],"posted_date":"January 22, 2026","preferred_qualifications":"- PMP certification, or SCRUM/Agile, SAFe certification\u003cbr/\u003e- Experience implementing cloud services including migrations and modernization projects or similar\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, GA, Atlanta - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, TX, Austin - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 153,600.00 - 207,800.00 USD annually","primary_search_label":"aws.team-business-development-primary","source_system":"JobCreator","state":"GA","title":"Senior Customer Success Specialist, Connect Specialty Sales ","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3165005/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-business-development-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical, or 1+ years of data center or mission critical facilities (example: hospital, military facility, public safety facility, etc.) experience\u003cbr/\u003e- 1+ years experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Umatilla","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"85434cc2-d6fb-4455-9240-c58174f4e3e2","id_icims":"3161268","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3161268/engineering-operations-technician-dcc-communities","job_schedule_type":"full-time","location":"US, OR, Umatilla","locations":["{\"normalizedStateName\":\"Oregon\",\"normalizedCountryCode\":\"USA\",\"city\":\"Umatilla\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OR, Umatilla\",\"coordinates\":\"45.91768,-119.34203\",\"normalizedCountyName\":\"Umatilla\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Umatilla, Oregon, USA\",\"location\":\"US, OR, Umatilla\",\"region\":\"OR\",\"buildingCodeList\":[\"PDX127\",\"PDX124\",\"PDX121\",\"PDX194\",\"PDT122\",\"PDT130\",\"PDT197\",\"PDX132\",\"PDX2\",\"PDT194\",\"PDX201\",\"PDX130\",\"PDX135\",\"PDX199\",\"PDT51\",\"PDX96\",\"PDX51\",\"PDT65\",\"PDX123\",\"PDX195\",\"PDX54\",\"PDT54\",\"PDX134\",\"PDX126\",\"PDX131\",\"PDX57\",\"PDX200\",\"PDT69\",\"PDT196\",\"PDX60\",\"PDT2\",\"PDX100\",\"PDX137\",\"PDX198\",\"PDX122\",\"PDX136\",\"PDX196\",\"PDX133\",\"PDT195\",\"PDX125\",\"PDX78\",\"PDX128\",\"PDX197\",\"PDT60\",\"PDX071\"],\"normalizedCityName\":\"Umatilla\"}"],"normalized_location":"Umatilla, Oregon, USA","optional_search_labels":["aws.team-ais","aws.team-dc","hourly","military"],"posted_date":"January 16, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, OR, Umatilla - 31.00 - 55.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"OR","title":"Engineering Operations Technician, DCC Communities ","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3161268/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of product management experience\u003cbr/\u003e- Experience managing technical products or online services\u003cbr/\u003e- Experience in product, program, or project management in leading cross-functional teams in delivery of major new products or services\u003cbr/\u003e- Bachelor's degree","business_category":"subsidiaries","city":"New York","company_name":"Bop LLC","country_code":"USA","description":"Do you have a passion for products? Do you want to help us build a business from the ground up? Shopbop is hiring a Sourcing \u0026 Compliance Manager to support our private label program. \u003cbr/\u003eWe are looking for a customer obsessed, analytical and entrepreneurial Sourcing \u0026 Compliance Manager to manage and execute our global sourcing program. The Sourcing Manager will be responsible for creating global sourcing strategies and processes to develop and deliver best in class products. The ideal candidate will drive the global sourcing process from A to Z including strategic vendor management, sourcing workflow management, product development, production, social accountability, product compliance, and risk management. In this role, you will work collaboratively with the product design, in-stock managers, logistics, and social accountability teams to improve supply chain efficiencies and ensure our products and vendors meet our high standards.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities \u003cbr/\u003e• Collaborate with Design/Buying and supplier to design and develop product \u003cbr/\u003e• Manage the product life cycle from product development through production \u003cbr/\u003e• Owns vendor communication on design development \u003cbr/\u003e• Manage detailed garment components, BOM's, and garment costing \u003cbr/\u003e• Own raw material ownership strategy and planning \u003cbr/\u003e• Create and manage T\u0026A calendar for development and production. Responsible for driving and tracking adherence to maintaining SLA’s \u003cbr/\u003e• Minimize business risk by proactively seeking out vendor issues and finding solutions before issues arise \u003cbr/\u003e• On-board new suppliers and train existing suppliers on SOP’s \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou will have ownership over the production T\u0026A calendar, raw materials, and vendor relationships ensuring on time delivery of quality products. You will also own adherence to compliance standards. This role will interface with the Buying team, Planning, Logistics, Suppliers, Designers (internal and external) across the program and other organizations.","department_cost_center":null,"description_short":"Do you have a passion for products? Do you want to help us build a business from the ground up? Shopbop is hiring a Sourcing \u0026 Compliance Manager to support our private label program. We are looking for","display_distance":null,"id":"f9d6f4b3-c5c4-4fc2-ae2a-0b340fbc6197","id_icims":"3108607","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Product Management","job_function_id":null,"job_path":"/en/jobs/3108607/sourcing-compliance-manager-shopbop-buying-planning","job_schedule_type":"full-time","location":"US, NY, New York","locations":["{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK94\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"New York, New York, USA","optional_search_labels":[],"posted_date":"October 14, 2025","preferred_qualifications":"- Experience building and analyzing cost/benefit scenarios and business cases and communicating results throughout the organization\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, New York - 127,900.00 - 179,600.00 USD annually","primary_search_label":"subsidiaries.team-shopbop","source_system":"JobCreator","state":"NY","title":"Sourcing \u0026 Compliance Manager, Shopbop Buying \u0026 Planning ","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3108607/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-shopbop","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of Microsoft Office products and applications experience\u003cbr/\u003e- 2+ years of electrical and mechanical experience\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends","business_category":"aws","city":"Sparks","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e- Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"cfe4b50a-238e-48f0-8adf-c43307e3cdfc","id_icims":"3168267","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3168267/engineering-operations-technician-dcc-communities","job_schedule_type":"full-time","location":"US, NV, Sparks","locations":["{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sparks\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, Sparks\",\"coordinates\":\"39.54115,-119.74832\",\"normalizedCountyName\":\"Washoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sparks, Nevada, USA\",\"location\":\"US, NV, Sparks\",\"region\":\"NV\",\"buildingCodeList\":[\"RNO100\"],\"normalizedCityName\":\"Sparks\"}"],"normalized_location":"Sparks, Nevada, USA","optional_search_labels":["military","aws.team-dc","hourly","aws.team-ais"],"posted_date":"January 28, 2026","preferred_qualifications":"- Experience working in a data center or mission critical facility (example: hospital, military facility, public safety facility, etc.)\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e- Experience with reading and writing procedures, technical documents, and engineering drawings\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NV, Sparks - 36.00 - 63.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"NV","title":"Engineering Operations Technician, DCC Communities ","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3168267/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Sparks","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"01af499c-c2bf-4f8d-89d3-42f18ea31df1","id_icims":"3169290","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3169290/engineering-operations-technician-dcc-communities","job_schedule_type":"full-time","location":"US, NV, Sparks","locations":["{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sparks\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, Sparks\",\"coordinates\":\"39.54115,-119.74832\",\"normalizedCountyName\":\"Washoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sparks, Nevada, USA\",\"location\":\"US, NV, Sparks\",\"region\":\"NV\",\"buildingCodeList\":[\"RNO100\"],\"normalizedCityName\":\"Sparks\"}"],"normalized_location":"Sparks, Nevada, USA","optional_search_labels":["aws.team-ais","aws.team-dc","hourly","military"],"posted_date":"January 29, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Technical (Military/Trade School) training\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NV, Sparks - 31.00 - 55.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"NV","title":"Engineering Operations Technician, DCC Communities ","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3169290/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in BI, finance, engineering, statistics, computer science, mathematics, finance or equivalent quantitative field\u003cbr/\u003e- 2+ years of analyzing and interpreting data with Redshift, Oracle, NoSQL etc. experience\u003cbr/\u003e- Experience using SQL to pull data from a database or data warehouse and scripting experience (Python) to process data for modeling\u003cbr/\u003e- Experience with data visualization using Tableau, Quicksight, or similar tools\u003cbr/\u003e- Experience with data modeling, warehousing and building ETL pipelines\u003cbr/\u003e- Experience developing and presenting recommendations of new metrics allowing better understanding of the performance of the business","business_category":"north-america-stores","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Are you a passionate Business Intelligence Engineer (BIE) ready to shape the future of digital content creation? At Amazon, we're building Earth's most desired destination for creators to monetize their unique skills, inspire the next generation of customers, and help brands expand their reach. We build innovative products and experiences that drive growth for creators across Amazon's ecosystem. Our team owns the entire Creator product suite, ensuring a cohesive experience, optimizing compensation structures, and launching features that help creators achieve both monetary and non-monetary goals.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs a BIE on our team, you will:\u003cbr/\u003e- Develop innovative solutions to address creator needs and boost their success on Amazon\u003cbr/\u003e- Partner with Business, Marketing, Product, and Technical teams to design and maintain scalable, user-friendly analytics tools\u003cbr/\u003e- Provide actionable insights to senior leaders, informing strategies in critical areas such as creator compensation and monetization; creator satisfaction; marketing segmentation; content quality\u003cbr/\u003e- Help define our data acquisition and intelligence strategy for creator-related data\u003cbr/\u003e- Tackle challenging problems that directly impact millions of creators and customers\u003cbr/\u003e\u003cbr/\u003eThe successful candidate is a self-starter, comfortable with a dynamic, fast-paced environment, and able to think big while paying careful attention to detail. You have a combination of strong analytical skills, business acumen, and a demonstrable ability to operate at scale. You excel in a culture of invention and collaboration.","department_cost_center":null,"description_short":"Are you a passionate Business Intelligence Engineer (BIE) ready to shape the future of digital content creation? At Amazon, we're building Earth's most desired destination for creators to monetize their","display_distance":null,"id":"302a7e85-0d1a-4d8b-a5e6-fbc606cf4bb2","id_icims":"3170786","is_intern":null,"is_manager":null,"job_category":"Business Intelligence","job_family":"Business Intel Engineer","job_function_id":null,"job_path":"/en/jobs/3170786/business-intelligence-engineer-creators-and-social-analytics-team","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA70\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"January 30, 2026","preferred_qualifications":"- Master's degree in BI, finance, engineering, statistics, computer science, mathematics, finance or equivalent quantitative field\u003cbr/\u003e- Experience with AWS solutions such as EC2, DynamoDB, S3, and Redshift\u003cbr/\u003e- Experience in data mining, ETL, etc. and using databases in a business environment with large-scale, complex datasets\u003cbr/\u003e- Experience in analysis of large volume of data to drive analysis and to make decisions\u003cbr/\u003e- Experience in written and verbal communication skills to communicate with technical and non-technical audiences, including senior leadership\u003cbr/\u003e- Experience in translating business needs into detailed feature requirements\u003cbr/\u003e- Knowledge of key technology and market trends\u003cbr/\u003e- Digital commerce experience and a passion for social commerce\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 99,500.00 - 160,000.00 USD annually","primary_search_label":"north-america-stores.automated-marketing-and-events","source_system":"JobCreator","state":"WA","title":"Business Intelligence Engineer, Creators and Social Analytics Team","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3170786/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"automated-marketing-and-events","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- BS degree in EE, CE, or CS\u003cbr/\u003e- 5+ years of practical DFT experience with large processor and/or SoC designs\u003cbr/\u003e- Knowledge about industry standard tools and practices in DFT, including ATPG, JTAG, MBIST and trade-offs between test quality and test time\u003cbr/\u003e- Experience with automation script development","business_category":"aws","city":"Austin","company_name":"Annapurna Labs (U.S.) Inc.","country_code":"USA","description":"Custom SoCs (System on Chip) are at the heart of AWS Machine Learning servers. As a member of the Cloud-Scale Machine Learning Acceleration team, you'll be responsible for designing and optimizing hardware in our data centers, including AWS Inferentia and Trainium systems—our custom-designed machine learning inference and training servers.  Our success depends on world-class server infrastructure as we handle massive scale and rapidly integrate emerging technologies. We're looking for a Sr. DFT Design Engineer to help us trailblaze new technologies and architectures while ensuring high design quality and making the right trade-offs.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tDefine and develop state-of-the-art Design for Test (DFT) architectures for advanced technology nodes\u003cbr/\u003e•\tWork closely with block designers and physical design (PD) team to implement highly efficient DFT solutions\u003cbr/\u003e•\tAct as the primary point of contact for cross-functional stakeholders (PD, Architecture, and Product Engineering) to align schedules and goals\u003cbr/\u003e•\tMentor and develop junior engineers through code reviews, methodology training, and technical guidance\u003cbr/\u003e•\tManage project timelines and deliverables, ensuring high-quality DFT implementation from RTL through Silicon bring-up\u003cbr/\u003e","department_cost_center":null,"description_short":"Custom SoCs (System on Chip) are at the heart of AWS Machine Learning servers. As a member of the Cloud-Scale Machine Learning Acceleration team, you'll be responsible for designing and optimizing hardware","display_distance":null,"id":"c674336a-0754-4990-b177-7e984e5fa4aa","id_icims":"3091748","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"ASIC","job_function_id":null,"job_path":"/en/jobs/3091748/sr-dft-design-engineer-aws-machine-learning-acceleration","job_schedule_type":"full-time","location":"US, TX, Austin","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS16\"],\"normalizedCityName\":\"Austin\"}"],"normalized_location":"Austin, Texas, USA","optional_search_labels":["aws.team-utility-computing","aws.team-annapurna-labs"],"posted_date":"September 23, 2025","preferred_qualifications":"- MS degree in EE, CE or CS\u003cbr/\u003e- Good breadth of knowledge in chip design from micro-architecture through physical design\u003cbr/\u003e- Good knowledge of design verification (DV) simulation methodologies\u003cbr/\u003e- Experience with large gate-level simulation setup and debug with SDF\u003cbr/\u003e- Strong programming and scripting skills in Perl, Python or Tcl\u003cbr/\u003e- Experience with industry standard DFT/SCAN/ATPG tools\u003cbr/\u003e- Experience with STA constraints development and analysis for DFT modes\u003cbr/\u003e- Practical experience with silicon debug\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Austin - 159,200.00 - 215,300.00 USD annually","primary_search_label":"aws.team-machine-learning-primary","source_system":"JobCreator","state":"TX","title":"Sr. DFT Design Engineer, AWS Machine Learning Acceleration","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3091748/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-machine-learning-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of merchandising or planogram, or 3+ years of customer-facing environment experience\u003cbr/\u003e- Bachelor's degree or above\u003cbr/\u003e- Experience exceeding sales targets using a consultative, solutions-focused approach or equivalent\u003cbr/\u003e- Experience building and growing relationships with internal and external partners\u003cbr/\u003e- Experience analyzing data to make business decisions\u003cbr/\u003e- Experience prioritizing and handling multiple assignments at any given time while maintaining commitment to deadlines, or experience in a fast-paced, high-tech company\u003cbr/\u003e- Experience communicating and delivering presentations to customers, stakeholders, and/or teammates\u003cbr/\u003e- Experience working in a fast-paced environment similar to a high-tech start-up","business_category":"subsidiaries","city":"New York","company_name":"Zappos.com LLC","country_code":"USA","description":"As a Customer Success Manager, you’ll help grow footwear brands for Zappos on Amazon. You’ll manage brand relationships, develop business plans, and drive data-backed decisions that improves the customer experience. This role blends day-to-day seller management with program-building, giving you the chance to shape how Zappos partners with footwear brands at scale on Amazon. \u003cbr/\u003e\u003cbr/\u003eYou’ll work across onboarding, ongoing brand support, and program process development from reporting and advertising planning to catalog optimization and operational improvements. You’ll also manage vendor brand stores and A+ content, ensuring design and seasonal updates are optimized to convert customers and deliver a premium brand experience. The role is hands-on, cross-functional, and highly visible, with direct impact on how Zappos delivers for both customers and brand partners.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Own brand relationships within the Zappos Preferred Partnership Program (PPP), ensuring a consistent and high-quality experience.\u003cbr/\u003e* Develop and execute business plans that drive selection growth, operational excellence, and improved customer outcomes.\u003cbr/\u003e* Analyze performance data (sales, FO%, ROAS, in-stock rates) to identify risks, uncover opportunities, and recommend actions.\u003cbr/\u003e* Support promotional and advertising initiatives in partnership with internal HVE lead and Zappos’ multimillion-dollar Sponsored Ads investment. \u003cbr/\u003e* Manage assigned vendor brand stores on Amazon, including design and A+ Content optimization based on seasonality and conversion performance. \u003cbr/\u003e* Collaborate with internal teams (buying, planning, ads, operations) to resolve issues and scale mechanisms.\u003cbr/\u003e* Lead onboarding activities for new brand partners and support continuity for existing partners through reporting, communication, and process improvements.\u003cbr/\u003e* Deliver weekly and monthly reporting packages that track performance, inform business reviews, and highlight growth opportunities.\u003cbr/\u003e* Contribute to continuous improvement initiatives that make PPP scalable and repeatable.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e* Review brand performance metrics and prepare insights for brand meetings.\u003cbr/\u003e* Partner with cross-functional teams to resolve catalog, inventory, or promotional challenges.\u003cbr/\u003e* Work directly with brands to improve catalog setup, advertising efficiency, brand store design, and A+ Content \u003cbr/\u003e* Optimize seasonal brand store updates to improve discoverability and conversion.\u003cbr/\u003e* Participate in program development initiatives, including reporting automation and onboarding playbooks.\u003cbr/\u003e* Support program leadership in preparing content for business reviews and growth planning.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Zappos Preferred Partnership Program (PPP) is a new initiative designed to build deeper, more consistent relationships with footwear brands on Amazon. Our mission is to create a bar-raising partner experience that drives growth for brands while delivering a best-in-class shopping experience for customers.\u003cbr/\u003e\u003cbr/\u003eWe are a small, entrepreneurial team working on a high-visibility program with high impact. The work is dynamic, balancing operational excellence with strategic brand development. Team members lean into cross-functional collaboration, problem solving, and innovation to scale mechanisms that will shape the future of Zappos on Amazon.","department_cost_center":null,"description_short":"As a Customer Success Manager, you’ll help grow footwear brands for Zappos on Amazon. You’ll manage brand relationships, develop business plans, and drive data-backed decisions that improves the customer","display_distance":null,"id":"a2077aa4-9301-4aec-8be2-7936b8d2bf9a","id_icims":"3127778","is_intern":null,"is_manager":null,"job_category":"Marketing \u0026 PR","job_family":"Customer Success","job_function_id":null,"job_path":"/en/jobs/3127778/customer-success-manager-zappos-fba","job_schedule_type":"full-time","location":"US, NY, New York","locations":["{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK94\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"New York, New York, USA","optional_search_labels":[],"posted_date":"November 17, 2025","preferred_qualifications":"- Experience using analytical, marketing, and productivity tools including Oracle Business Intelligence, Salesforce or other CRM tools, Microsoft OneNote and Microsoft SharePoint\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $52,400/year in our lowest geographic market up to $112,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"subsidiaries.team-zappos","source_system":"JobCreator","state":"NY","title":"Customer Success Manager, Zappos FBA","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3127778/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-zappos","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}