{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 3+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience with full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations\u003cbr/\u003e- Experience designing and implementing data storage systems, ETL pipelines, or machine learning infrastructure for model training and evaluation workflows\u003cbr/\u003e- Proven track record building distributed systems with event-driven architectures and APIs that operate reliably at enterprise scale\u003cbr/\u003e- Experience with data security, privacy compliance, and implementing data retention/deletion mechanisms\u003cbr/\u003e- Working knowledge of AWS services for data processing and machine learning such as S3, SageMaker, and related data infrastructure","business_category":"aws","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"As part of the AWS Applied AI Solutions organization, we have a vision to provide business applications, leveraging Amazon’s unique experience and expertise, that are used by millions of companies worldwide to manage day-to-day operations. We will accomplish this by accelerating our customers’ businesses through delivery of intuitive and differentiated technology solutions that solve enduring business challenges. We blend vision with curiosity and Amazon’s real-world experience to build opinionated, turnkey solutions. Where customers prefer to buy over build, we become their trusted partner with solutions that are no-brainers to buy and easy to use.\u003cbr/\u003e\u003cbr/\u003eJoin our Applied AI Solutions team and help build the secure data foundation that powers AWS's AI-driven business applications. We own critical infrastructure including event-based data stores, machine learning training platforms, and data access interfaces that enable responsible AI development while maintaining the highest standards of privacy, security, and compliance. Our platform serves as the backbone for storing, processing, and managing data that fuels AI-powered capabilities across AWS, ensuring customers retain full control over their information.\u003cbr/\u003e\u003cbr/\u003eAs a Software Development Engineer II, you'll take ownership of production systems that handle the complete data lifecycle—from ingestion through model training to customer opt-out controls. You'll maintain and refactor existing services for enhanced performance and scalability, while designing new solutions to meet emerging requirements from business application teams. Working alongside scientists and engineers, you'll enable them to build and improve AI models, balancing innovation with compliance requirements.\u003cbr/\u003e\u003cbr/\u003eThis role offers exciting opportunities to solve complex challenges around secure data storage, efficient querying at scale, and building self-service platforms that empower development teams. You'll drive the evolution of established platforms to meet future needs, directly impacting how AWS delivers increasingly sophisticated AI-powered capabilities while ensuring customers maintain complete control over their data throughout every stage of processing.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Own and deliver complete software features for event-based data storage systems, from design through deployment and operations, ensuring they provide flexible, secure, and compliant platforms for AI-powered business applications\u003cbr/\u003e- Maintain, refactor, and enhance existing storage and analytics platform, identifying opportunities to improve performance, scalability, and operational excellence while eliminating technical debt\u003cbr/\u003e- Design and implement software solutions for data access interfaces and authorization systems within established architectural strategies, seeking guidance from senior engineers when facing complex technical tradeoffs\u003cbr/\u003e- Mentor team members through code reviews, documentation, and knowledge sharing—providing meaningful feedback, training newcomers on system architecture, and facilitating technical discussions that promote operational excellence\u003cbr/\u003e- Resolve operational issues by identifying root causes and implementing permanent fixes for compliance features, data deletion APIs, and customer opt-out mechanisms, going beyond quick workarounds\u003cbr/\u003e- Work directly with business application teams and stakeholders to understand requirements, translating them into technical solutions that balance customer needs with platform sustainability\u003cbr/\u003e- Take ownership of security implementations including encryption, access controls, audit trails, and PII handling, ensuring software can be maintained and extended by other engineers\u003cbr/\u003e- Drive improvements to self-service platforms and control planes, making priority tradeoffs between new feature development and operational work while maintaining governance standards\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou'll participate in engineering standups, providing updates on data storage features and resolving platform blockers. Your hands-on work includes refactoring services for performance, implementing secure data interfaces, and ensuring compliance through quality code and testing. You'll collaborate with scientists and engineers, helping them navigate data access patterns and authorization requirements while mentoring teammates through code reviews. When production issues arise, you investigate root causes to maintain reliable data deletion and opt-out mechanisms. Regular syncs with business application teams help you translate evolving requirements into technical solutions that balance innovation with security and compliance, while also documenting features and training teammates on system lifecycles.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eABOUT AWS:\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. ","department_cost_center":null,"description_short":"As part of the AWS Applied AI Solutions organization, we have a vision to provide business applications, leveraging Amazon’s unique experience and expertise, that are used by millions of companies worldwide","display_distance":null,"id":"c0bbf34b-0ef0-43be-b2b0-b6913923da67","id_icims":"3123954","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3123954/software-dev-engineer-ii-secure-customer-content-storage-and-analytics-aws-applied-ai-solution-core-services","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA68\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"November 10, 2025","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- Successful history of cross-team collaboration, driving technical convergence while maintaining delivery velocity\u003cbr/\u003e- Experience with distributed machine learning training platforms and workflow orchestration systems\u003cbr/\u003e- * Production experience implementing data access controls, authorization systems, and multi-tenant data isolation\u003cbr/\u003e- Knowledge of PII handling, data pseudonymization, and privacy-preserving techniques\u003cbr/\u003e- Experience building self-service platforms and control planes for data platform management\u003cbr/\u003e- Familiarity with streaming data ingestion, real-time processing, and efficient querying at scale\u003cbr/\u003e- Experience with data lineage tracking, audit trails, and compliance reporting systems\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 143,700.00 - 194,400.00 USD annually","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"WA","title":"Software Dev Engineer II, Secure Customer Content Storage and Analytics, AWS Applied AI Solution – Core Services","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3123954/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- * This role requires you to be a national of an EU member state\u003cbr/\u003e- * Proven experience in software development or related field with proficiency in at least one modern programming language such as Java, Typescript, Python, or Ruby\u003cbr/\u003e- * Demonstrated experience in engineering, working with hardware, software, networking, operating systems\u003cbr/\u003e- * Solid understanding of Linux and networking, and able to troubleshoot and anticipate problems that affect the performance, reliability, or availability of software systems.\u003cbr/\u003e- * Experience designing systems for performance, simplicity, and scalability, durability, cost, and security.","business_category":"aws","city":"Madrid","company_name":"Amazon Spain Services, S.L.U.","country_code":"ESP","description":"AWS is set to introduce the inaugural European Sovereign Cloud (ESC), marking a significant development in utility computing (UC). To spearhead this initiative, we are actively seeking experienced systems development  engineers with a strong background in automation and operations. As part of the AWS Managed Operations team, you will play a pivotal role in building and leading operations and development teams dedicated to delivering high-availability AWS services, including EC2, S3, Dynamo, Lambda, and Bedrock, exclusively for EU customers. For more information on ESC please check out our blog: https://aws.amazon.com/blogs/aws/in-the-works-aws-european-sovereign-cloud/\u003cbr/\u003e \u003cbr/\u003eYour responsibilities will encompass overseeing the launch of the ESC in 2025, working closely with global AWS teams, and influencing the evolution of AWS services and technology. A typical day in this role involves collaborating with technology leaders, contributing to the enhancement of day-to-day operations, and ensuring improvements in availability, reliability, latency, performance, and efficiency of the ESC. You will be required to occasionally participate in “on-call” rotations to resolve incidents occurring out-of-hours.\u003cbr/\u003e\u003cbr/\u003eThe overarching goal is to deliver scalable services and ensure a high-availability experience for EU customers. If you are an experienced professional ready for a challenging and impactful opportunity, we invite you to join our efforts in building a best-in-class development engineering and operations team that aligns with AWS' commitment to customer satisfaction and continual innovation.\u003cbr/\u003e\u003cbr/\u003eUtility Computing (UC) \u003cbr/\u003eEuropean Sovereign Cloud (ESC) is a part of AWS Utility Computing (UC).\u003cbr/\u003eAWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS. Within AWS UC, Managed Operations engineers engage with AWS customers who require specialized security solutions for their cloud services.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eA typical day in this role involves collaborating with technology leaders, contributing to the enhancement of day-to-day operations, and ensuring improvements in availability, reliability, latency, performance, and efficiency of the ESC. You’ll spend roughly 50% of your time operating production systems and 50% working with your team to make long-term improvements to the reliability, availability, and performance of those software systems. Over the course of a week, you will root cause why some deployments recently failed, and fix those bugs. Later in the week you may execute a highly sensitive time-critical change to production. You can round off the week by participating in design discussions by another team, writing code, and providing actionable feedback to your team’s code. You will be required to occasionally participate in “on-call” rotations to resolve incidents occurring out-of-hours. \u003cbr/\u003e\u003cbr/\u003eEligibility requirement \u003cbr/\u003e* Fluency in written and spoken English is required. \u003cbr/\u003e* Candidate must be a national of an EU member state and residing in the EU to operate the AWS European Sovereign Cloud.\u003cbr/\u003e* Amazon will provide relocation support for successful applicants relocating within the European Union.\u003cbr/\u003e* Employees will participate in an On-Call rota.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences \u003cbr/\u003e AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.  \u003cbr/\u003e\u003cbr/\u003eWhy AWS \u003cbr/\u003e Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003e We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003e AWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. ","department_cost_center":null,"description_short":"AWS is set to introduce the inaugural European Sovereign Cloud (ESC), marking a significant development in utility computing (UC). To spearhead this initiative, we are actively seeking experienced systems","display_distance":null,"id":"8b8d6ad2-1f04-449f-b559-3f7c3cf093cd","id_icims":"3143823","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"System Development Engineering","job_function_id":null,"job_path":"/en/jobs/3143823/systems-development-engineer-managed-operations","job_schedule_type":"full-time","location":"ES, M, Madrid","locations":["{\"normalizedStateName\":\"Community of Madrid\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Madrid\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, M, Madrid\",\"coordinates\":\"40.42024,-3.68755\",\"normalizedCountyName\":\"Madrid\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Madrid, Community of Madrid, ESP\",\"location\":\"ES, M, Madrid\",\"region\":\"M\",\"buildingCodeList\":[\"MAD15\"],\"normalizedCityName\":\"Madrid\"}"],"normalized_location":"Madrid, Community of Madrid, ESP","optional_search_labels":["aws.team-eu-sovereign-cloud"],"posted_date":"December 16, 2025","preferred_qualifications":"- * Able to lead the creation, revision, and/or improvement of standard operational procedures (SOPs) and driving operational best practices.\u003cbr/\u003e- * Experience with monitoring frameworks (such as CloudWatch, Datadog, Grafana, Elastic or similar).\u003cbr/\u003e- * Experience actively mentoring junior engineers and working cross-organizationally and leading strategic team efforts requiring work from multiple team members\u003cbr/\u003e- * Experience supporting service in AWS or other cloud systems or services\u003cbr/\u003e- * Experience operating 24x7 high-availability, distributed software applications and performance tuning software applications and optimizing fleet utilization\u003cbr/\u003e- * Experience with Infrastructure as Code, (such as CDK, CloudFormation, Puppet, Chef, Ansible, or similar)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-system-development-engineer-primary","source_system":"JobCreator","state":"M","title":"Systems Development Engineer, Managed Operations","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3143823/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-system-development-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- * This role requires you to be a national of an EU member state\u003cbr/\u003e- * Bachelor's degree in computer science (or related IT discipline) or equivalent industry experience\u003cbr/\u003e- * Knowledge or experience in scripting (Bash, Python, or Ruby) or software development (Java, TypeScript, or similar), coupled with Linux and networking fundamentals to effectively troubleshoot and optimize system performance and reliability.","business_category":"aws","city":"Madrid","company_name":"Amazon Spain Services, S.L.U.","country_code":"ESP","description":"AWS is set to introduce the inaugural European Sovereign Cloud (ESC), marking a significant development in Utility Computing (UC). To spearhead this initiative, we are actively seeking experienced systems engineers with a strong background in cloud operations. As part of the AWS Managed Operations team, you will play a pivotal role in building and leading operations and development teams dedicated to delivering high-availability AWS services, including EC2, S3, Dynamo, Lambda, and Bedrock, exclusively for EU customers. For more information on ESC please check out our blog: https://aws.amazon.com/blogs/aws/in-the-works-aws-european-sovereign-cloud/\u003cbr/\u003e\u003cbr/\u003eYour responsibilities will encompass overseeing the launch of the ESC in 2025, working closely with global AWS teams, and influencing the evolution of AWS services and technology. A typical day in this role involves collaborating with technology leaders, contributing to the enhancement of day-to-day operations, and ensuring improvements in availability, reliability, latency, performance, and efficiency of the ESC. \u003cbr/\u003e\u003cbr/\u003eThe overarching goal is to deliver scalable services and ensure a high-availability experience for EU customers. If you are an experienced professional ready for a challenging and impactful opportunity, we invite you to join our efforts in building a best-in-class development engineering and operations team that aligns with AWS' commitment to customer satisfaction and continual innovation.\u003cbr/\u003e\u003cbr/\u003eUtility Computing (UC) \u003cbr/\u003eEuropean Sovereign Cloud (ESC) is a part of AWS Utility Computing (UC).\u003cbr/\u003eAWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS. Within AWS UC, Managed Operations engineers engage with AWS customers who require specialized security solutions for their cloud services.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou’ll spend a majority of your time operating and improving one of the largest software systems. Over the course of a week, you will review the operational health of the services in your team’s care, and as soon as you figure out why there was an anomaly, you write up an actionable bug report. As a responsible engineer, you’ve learned never to make changes to production systems without a plan, so you reviewed then executed changes following a change management process to one of the production systems in your care. Later in the week, you help to resolve your team’s backlog of operational issues. You round off the week by writing a cool script that you shared with your team which helps get to root cause faster of a hard problem that you diagnosed earlier.\u003cbr/\u003e\u003cbr/\u003eYou will be required to occasionally participate in an “on-call” rotations to resolve incidents occurring out-of-hours.\u003cbr/\u003e\u003cbr/\u003eEligibility requirement \u003cbr/\u003e* Fluency in written and spoken English is required. \u003cbr/\u003e* Candidate must be a national of an EU member state and residing in the EU to operate the AWS European Sovereign Cloud.\u003cbr/\u003e* Amazon will provide relocation support for successful applicants relocating within the European Union.\u003cbr/\u003e* Employees will participate in an On-Call rota.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences \u003cbr/\u003e AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.  \u003cbr/\u003e\u003cbr/\u003eWhy AWS \u003cbr/\u003e Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003e We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003e AWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.  ","department_cost_center":null,"description_short":"AWS is set to introduce the inaugural European Sovereign Cloud (ESC), marking a significant development in Utility Computing (UC). To spearhead this initiative, we are actively seeking experienced systems","display_distance":null,"id":"139652ff-3a91-4f0c-8c30-d9c52329c6ee","id_icims":"3143755","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"System Planning/Administration","job_function_id":null,"job_path":"/en/jobs/3143755/systems-engineer-managed-operations","job_schedule_type":"full-time","location":"ES, M, Madrid","locations":["{\"normalizedStateName\":\"Community of Madrid\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Madrid\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, M, Madrid\",\"coordinates\":\"40.42024,-3.68755\",\"normalizedCountyName\":\"Madrid\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Madrid, Community of Madrid, ESP\",\"location\":\"ES, M, Madrid\",\"region\":\"M\",\"buildingCodeList\":[\"MAD15\"],\"normalizedCityName\":\"Madrid\"}"],"normalized_location":"Madrid, Community of Madrid, ESP","optional_search_labels":["military-emea","aws.team-eu-sovereign-cloud","aws.team-utility-computing"],"posted_date":"December 16, 2025","preferred_qualifications":"- * Able to execute standard operating procedures and following operational best practices\u003cbr/\u003e- * Knowledge or experience operating service in AWS or other cloud systems or services\u003cbr/\u003e- * Knowledge or experience operating 24x7 high-availability, distributed software applications, performance tuning software applications and optimizing fleet utilization and monitoring frameworks (such as CloudWatch, Datadog, Grafana, Elastic or similar)\u003cbr/\u003e- * Knowledge or experience with Infrastructure as Code, (such as CDK, CloudFormation, Puppet, Chef, Ansible, or similar)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-system-development-engineer-primary","source_system":"JobCreator","state":"M","title":"Systems Engineer, Managed Operations","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3143755/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-system-development-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- This role requires you to be a national of an EU member state\u003cbr/\u003e- Demonstrated expertise in systems engineering working with hardware, software, networking, operating systems\u003cbr/\u003e- Experience scripting processes in a language such as Bash, Python, or Ruby\u003cbr/\u003e- Solid understanding of Linux and networking, and able to troubleshoot and anticipate problems that affect the performance, reliability, or availability of software systems.\u003cbr/\u003e- Able to lead the creation, revision, and/or improvement of standard operational procedures (SOPs) and driving operational best practices.","business_category":"aws","city":"Madrid","company_name":"Amazon Spain Services, S.L.U.","country_code":"ESP","description":"AWS is set to introduce the inaugural European Sovereign Cloud (ESC), marking a significant development in utility computing (UC). To spearhead this initiative, we are actively seeking experienced systems engineers with a strong background in automation and operations. As part of the AWS Managed Operations team, you will play a pivotal role in building and leading operations and development teams dedicated to delivering high-availability AWS services, including EC2, S3, Dynamo, Lambda, and Bedrock, exclusively for EU customers. For more information on ESC please check out our blog: https://aws.amazon.com/blogs/aws/in-the-works-aws-european-sovereign-cloud/\u003cbr/\u003e\u003cbr/\u003eYour responsibilities will encompass overseeing the launch of the ESC in 2025, working closely with global AWS teams, and influencing the evolution of AWS services and technology. A typical day in this role involves collaborating with technology leaders, contributing to the enhancement of day-to-day operations, and ensuring improvements in availability, reliability, latency, performance, and efficiency of the ESC. You will be required to occasionally participate in “on-call” rotations to resolve incidents occurring out-of-hours.\u003cbr/\u003e\u003cbr/\u003eThe overarching goal is to deliver scalable services and ensure a high-availability experience for EU customers. If you are an experienced professional ready for a challenging and impactful opportunity, we invite you to join our efforts in building a best-in-class development engineering and operations team that aligns with AWS' commitment to customer satisfaction and continual innovation.\u003cbr/\u003e\u003cbr/\u003eUtility Computing (UC) \u003cbr/\u003eEuropean Sovereign Cloud (ESC) is a part of AWS Utility Computing (UC).\u003cbr/\u003eAWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS. Within AWS UC, Managed Operations engineers engage with AWS customers who require specialized security solutions for their cloud services.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eEmbark on a week filled with meaningful contributions to the operation and improvement of significant software systems. You dedicate a substantial portion of your time to carefully review the operational health of services within your team's responsibility. In the process, you diligently identify anomalies and craft actionable bug reports, aspiring to enhance the overall efficiency and performance of your systems.\u003cbr/\u003e\u003cbr/\u003eIn addition to these responsibilities, you offer constructive feedback on change management documents and work earnestly to address your team's operational backlog. Through a collaborative effort, you strive to navigate challenges and ensure the seamless functionality of your systems. Additionally, you engage in the development and testing of scripts, hoping to provide practical solutions to enhance your workflows.\u003cbr/\u003e\u003cbr/\u003eBeyond the technical aspects, you assume a role as an educator, sharing insights on the complexities of the European Sovereign Cloud with service teams. It's a humbling experience for you to contribute to the collective knowledge of the team, fostering a culture of mutual understanding.\u003cbr/\u003e\u003cbr/\u003eThis week encapsulates your commitment to continuous learning and improvement, acknowledging that every effort, no matter how small, contributes to the collective success of your team and the reliability of your software systems.\u003cbr/\u003e\u003cbr/\u003eIn addition to these responsibilities, your position involves 24x7 on-call responsibility. You work as a team to root-cause issues and ensure your systems remain resilient and fault-tolerant, underscoring your commitment to maintaining operational excellence.\u003cbr/\u003e\u003cbr/\u003eEligibility requirement \u003cbr/\u003e* Fluency in written and spoken English is required. \u003cbr/\u003e* Candidate must be a national of an EU member state and residing in the EU to operate the AWS European Sovereign Cloud.\u003cbr/\u003e* Amazon will provide relocation support for successful applicants relocating within the European Union.\u003cbr/\u003e* Employees will participate in an On-Call rota.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences \u003cbr/\u003e AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.  \u003cbr/\u003e\u003cbr/\u003eWhy AWS \u003cbr/\u003e Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003e We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003e AWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.  ","department_cost_center":null,"description_short":"AWS is set to introduce the inaugural European Sovereign Cloud (ESC), marking a significant development in utility computing (UC). To spearhead this initiative, we are actively seeking experienced systems","display_distance":null,"id":"f16990d4-e7ef-4c8d-aa96-656a0f1138d0","id_icims":"3142768","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"System Planning/Administration","job_function_id":null,"job_path":"/en/jobs/3142768/systems-engineer-esc-managed-operations","job_schedule_type":"full-time","location":"ES, M, Madrid","locations":["{\"normalizedStateName\":\"Community of Madrid\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Madrid\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, M, Madrid\",\"coordinates\":\"40.42024,-3.68755\",\"normalizedCountyName\":\"Madrid\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Madrid, Community of Madrid, ESP\",\"location\":\"ES, M, Madrid\",\"region\":\"M\",\"buildingCodeList\":[\"MAD15\"],\"normalizedCityName\":\"Madrid\"}"],"normalized_location":"Madrid, Community of Madrid, ESP","optional_search_labels":["aws.team-eu-sovereign-cloud","aws.team-utility-computing"],"posted_date":"December 15, 2025","preferred_qualifications":"- Experience with monitoring frameworks (such as CloudWatch, Datadog, Grafana, Elastic or similar).\u003cbr/\u003e- Experience actively mentoring junior engineers and working cross-organizationally and leading strategic team efforts requiring work from multiple team members\u003cbr/\u003e- Experience supporting service in AWS or other cloud systems or service\u003cbr/\u003e- Experience operating 24x7 high-availability, distributed software applications and performance tuning software applications and optimizing fleet utilization\u003cbr/\u003e- Experience with Infrastructure as Code, (such as CDK, CloudFormation, Puppet, Chef, Ansible, or similar)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-system-development-engineer-primary","source_system":"JobCreator","state":"M","title":"Systems Engineer, ESC Managed Operations","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3142768/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-system-development-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team\u003cbr/\u003e- Strong software engineering experience in 3D domains (games, simulation, robotics, etc)\u003cbr/\u003e- Extensive experience in physics simulation, with a preference for expertise in rigid body simulation\u003cbr/\u003e- Experience with Isaac Sim, Unity, Unreal or proprietary 3D game engine, or industry-equivalent technology (3D animation, simulation, etc)\u003cbr/\u003e- Understanding of 3D graphics and real-time rendering applications\u003cbr/\u003e- Passion for your craft and demonstrated excellence in physics simulation engineering\u003cbr/\u003e- Proficiency in Python and C++","business_category":"subsidiaries","city":"San Francisco","company_name":"Amazon.com Services LLC","country_code":"USA","description":"We are seeking a Simulation Engineer to join our AI robotics research team developing foundation models for robotics. You will rapidly develop 3D physics-based simulation frameworks and tools alongside scientists to enable training large-scale machine learning models. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Develop simulations for reinforcement learning, closed-loop simulations and synthetic data generation\u003cbr/\u003e* Implement essential robotics features, including accurate modeling of sensors, actuators, and controllers\u003cbr/\u003e* Build real-to-sim workflows for dynamic environments and robotics tasks\u003cbr/\u003e* Implement simulation features to minimize sim-to-real gaps through domain randomization and system identification\u003cbr/\u003e* Create asset toolchains supporting industry-standard formats (URDF, MJCF, USD)\u003cbr/\u003e* Collaborate closely with a team of ML researchers to enable large-scale robotics training pipelines \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAt Frontier AI \u0026 Robotics (FAR), we're not just advancing robotics – we're reimagining it from the ground up. Our team is building the future of intelligent robotics through frontier foundation models and end-to-end learned systems. We tackle some of the most challenging problems in AI and robotics, from developing sophisticated perception systems to creating adaptive manipulation strategies that work in complex, real-world scenarios.\u003cbr/\u003e\u003cbr/\u003eWhat sets us apart is our unique combination of ambitious research vision and practical impact. We leverage Amazon's massive computational infrastructure and rich real-world datasets to train and deploy state-of-the-art foundation models. Our work spans the full spectrum of robotics intelligence – from multimodal perception using images, videos, and sensor data, to sophisticated manipulation strategies that can handle diverse real-world scenarios. We're building systems that don't just work in the lab, but scale to meet the demands of Amazon's global operations.\u003cbr/\u003e\u003cbr/\u003eJoin us if you're excited about pushing the boundaries of what's possible in robotics, working with world-class researchers, and seeing your innovations deployed at unprecedented scale. ","department_cost_center":null,"description_short":"We are seeking a Simulation Engineer to join our AI robotics research team developing foundation models for robotics. You will rapidly develop 3D physics-based simulation frameworks and tools alongside","display_distance":null,"id":"e9b1beca-3ffb-43cd-ac5e-a9a02f74e699","id_icims":"3043054","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3043054/sr-sde-simulation-frontier-ai-robotics","job_schedule_type":"full-time","location":"US, CA, San Francisco","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Francisco\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Francisco\",\"coordinates\":\"37.77702,-122.41956\",\"normalizedCountyName\":\"San Francisco\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Francisco, California, USA\",\"location\":\"US, CA, San Francisco\",\"region\":\"CA\",\"buildingCodeList\":[\"UCA1\"],\"normalizedCityName\":\"San Francisco\"}"],"normalized_location":"San Francisco, California, USA","optional_search_labels":[],"posted_date":"July 24, 2025","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- Experience with physical robots, reinforcement learning, synthetic data generation\u003cbr/\u003e- Experience optimizing physics simulation for articulated robots and rigid body interactions\u003cbr/\u003e- Familiarity with modern ML frameworks like PyTorch\u003cbr/\u003e- Familiarity with 3D formats (URDF, MJCF, USD)\u003cbr/\u003e- Familiarity with 3D content creation tools (e.g, Blender, Houdini)\u003cbr/\u003e- Experience implementing techniques from research papers\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, San Francisco - 193,300.00 - 261,500.00 USD annually","primary_search_label":"subsidiaries.team-amazon-robotics","source_system":"JobCreator","state":"CA","title":"Sr. SDE, Simulation, Frontier AI Robotics","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3043054/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-robotics","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- 3+ years of increasing responsibilities in WHS and/or environmental programs in manufacturing, production, or service operations\u003cbr/\u003e- 3+ years of increasing responsibilities in people and performance management, or 2+ years of Amazon Safety (blue badge/FTE) experience","business_category":"fulfillment-and-operations","city":"Melville","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We're seeking a dedicated Workplace Health \u0026 Safety (WHS) Manager to join our mission of creating the world's safest work environment. This role offers an exciting opportunity to directly impact associate well being while driving operational excellence.\u003cbr/\u003e\u003cbr/\u003eAs a WHS Manager, you'll be the site's safety champion, leading our Global WHS Program implementation. You'll combine hands-on safety management with strategic thinking to protect our most valuable asset – our people. Your role bridges the gap between safety requirements and operational success, requiring both technical expertise and strong interpersonal skills. Working closely with Operations leadership, you'll drive safety initiatives that make a real difference. You'll conduct comprehensive risk assessments, analyze safety data, and implement practical solutions that protect associates while supporting productivity. Your ability to build relationships and influence positive change will be essential as you help shape our safety culture. You'll lead safety compliance efforts, conduct thorough site audits, and analyze incident trends to target improvements where they matter most. Managing our first aid program and emergency response capabilities, you'll ensure immediate care is always available. Your analytical skills will transform safety data into actionable insights, while your leadership abilities will help engage associates in our safety mission.\u003cbr/\u003e\u003cbr/\u003eCore Impact Areas:\u003cbr/\u003eSafety Leadership \u0026 Innovation - Transform safety culture through leadership and innovative solutions. Drive continuous improvement initiatives that set new benchmarks in workplace safety. Leverage technology and data analytics to drive preventive safety measures that protect our associates while enhancing operational excellence. Develop leadership plans, communicate expectations, and drive initiatives to create a safe work environment. Measure performance against WHS policies, analyze metrics, and conduct site audits to address non-compliance issues. \u003cbr/\u003e\u003cbr/\u003eStrategic Partnership \u0026 Influence - Build partnerships with Operations leadership to integrate safety into every aspect of our business. Use compelling data analysis and risk insights to influence positive change and drive strategic decision-making. Establish yourself as a trusted advisor who balances safety excellence with operational demands. Oversee recordkeeping, workplace organization, and WHS training programs. \u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements include: \u003cbr/\u003e- Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Stand/walk for up to 12 hours during shifts\u003cbr/\u003e- Work in an environment where the noise level varies \u003cbr/\u003e- Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e- Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e- Maintain effective care delivery in emergencies and assist emergency response at the site\u003cbr/\u003e\u003cbr/\u003eFor those that do not have an adult First Aid, CPR, AED certification from the American Heart Association or American Red Cross, must obtain within 3 weeks of start date.\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We're seeking","display_distance":null,"id":"abee03b2-4bfb-49f8-b5a6-96211f7b59b3","id_icims":"3163458","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3163458/site-ehs-manager-ii","job_schedule_type":"full-time","location":"US, NY, Melville","locations":["{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"Melville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, Melville\",\"coordinates\":\"40.7932,-73.41614\",\"normalizedCountyName\":\"Suffolk\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Melville, New York, USA\",\"location\":\"US, NY, Melville\",\"region\":\"NY\",\"buildingCodeList\":[\"SNY5\"],\"normalizedCityName\":\"Melville\"}"],"normalized_location":"Melville, New York, USA","optional_search_labels":[],"posted_date":"January 21, 2026","preferred_qualifications":"- Distribution Center or Manufacturing EHS experience with mix of exempt and non-exempt employees at a site of at least 250 people\u003cbr/\u003e- Master’s degree\u003cbr/\u003e- Experience implementing lean principles and process improvement in an operational environment.\u003cbr/\u003e- Experience in a fast paced, dynamic organization\u003cbr/\u003e- Certified Safety Professional\u003cbr/\u003e- Excellent written and verbal communication skills, including comfort interfacing with site leader\u003cbr/\u003e- Ability to develop and implement department goals and strategies\u003cbr/\u003e- Strong analytical skills with demonstrated problem solving ability\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, Melville - 77,100.00 - 115,700.00 USD annually","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"NY","title":"Site EHS Manager II","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3163458/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- 5+ years of increasing responsibilities in EHS and/or environmental programs in manufacturing, production, or service operations\u003cbr/\u003e- 5+ years of increasing responsibilities in people and performance management\u003cbr/\u003e- Experience implementing lean principles and process improvement in an operational environment","business_category":"fulfillment-and-operations","city":"Prince George","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We’re seeking a dedicated Workplace Health \u0026 Safety (WHS) Manager to help drive this mission forward. As our next WHS Manager, you'll be more than a safety professional – you'll be a catalyst for change, leading a comprehensive safety program that touches thousands of lives. Working at the intersection of operations and safety, you'll shape the future of workplace health while delivering real-time solutions that protect our most valuable asset: our people.  \u003cbr/\u003e\u003cbr/\u003eIn this role, you'll serve as the site's safety facilitator, orchestrating our Global WHS Program with precision and passion. You'll partner with Operations leadership to weave safety into the fabric of our daily operations, using data-driven insights to create innovative solutions that reduce risk and enhance productivity. Your ability to build trust, influence change, and drive results will be crucial as you lead comprehensive risk assessments and transform safety data into actionable strategies.\u003cbr/\u003eLeadership is at the heart of this role. You'll build and develop a high-performing team of WHS professionals, fostering a culture of continuous improvement and excellence. \u003cbr/\u003e\u003cbr/\u003eCore Impact Areas:\u003cbr/\u003eSafety Leadership \u0026 Innovation - Transform safety culture through leadership and innovative solutions. Drive continuous improvement initiatives that set new benchmarks in workplace safety. Leverage technology and data analytics to drive preventive safety measures that protect our associates while enhancing operational excellence. Develop leadership plans, communicate expectations, and drive initiatives to create a safe work environment. Measure performance against WHS policies, analyze metrics, and conduct site audits to address non-compliance issues. \u003cbr/\u003e\u003cbr/\u003eStrategic Partnership \u0026 Influence - Build partnerships with Operations leadership to integrate safety into every aspect of our business. Use compelling data analysis and risk insights to influence positive change and drive strategic decision-making. Establish yourself as a trusted advisor who balances safety excellence with operational demands. Oversee recordkeeping, workplace organization, and WHS training programs. \u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements include: \u003cbr/\u003e- Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Stand/walk for up to 12 hours during shifts\u003cbr/\u003e- Work in an environment where the noise level varies \u003cbr/\u003e- Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e- Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e- Maintain effective care delivery in emergencies and assist emergency response at the site\u003cbr/\u003e\u003cbr/\u003eThose that do not have an adult First Aid, CPR, AED certification from the American Heart Association or American Red Cross must obtain within 3 weeks of start date.","department_cost_center":null,"description_short":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We’re seeking","display_distance":null,"id":"1636e278-1530-4d93-b263-63c92f2dc025","id_icims":"3112332","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3112332/site-ehs-manager-iii","job_schedule_type":"full-time","location":"US, VA, Prince George","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Prince George\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Prince George\",\"coordinates\":\"37.22086,-77.28673\",\"normalizedCountyName\":\"Prince George\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Prince George, Virginia, USA\",\"location\":\"US, VA, Prince George\",\"region\":\"VA\",\"buildingCodeList\":[\"KRB2\"],\"normalizedCityName\":\"Prince George\"}"],"normalized_location":"Prince George, Virginia, USA","optional_search_labels":[],"posted_date":"October 20, 2025","preferred_qualifications":"- Master's degree\u003cbr/\u003e- Distribution Center or Manufacturing EHS experience with mix of exempt and non-exempt employees at a site of at least 250 people\u003cbr/\u003e- Experience implementing lean principles and process improvement in an operational environment.\u003cbr/\u003e- Experience in a fast paced, dynamic organization\u003cbr/\u003e- Certified Safety Professional\u003cbr/\u003e- Excellent written and verbal communication skills, including comfort interfacing with site leaders.\u003cbr/\u003e- Ability to develop and implement department goals and strategies\u003cbr/\u003e- Strong analytical skills with demonstrated problem solving ability\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Prince George - 94,200.00 - 141,400.00 USD annually","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"VA","title":"Site EHS Manager III","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3112332/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- 5+ years of increasing responsibilities in EHS and/or environmental programs in manufacturing, production, or service operations\u003cbr/\u003e- 5+ years of increasing responsibilities in people and performance management\u003cbr/\u003e- Experience implementing lean principles and process improvement in an operational environment","business_category":"fulfillment-and-operations","city":"New Castle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We’re seeking a dedicated Workplace Health \u0026 Safety (WHS) Manager to help drive this mission forward. As our next WHS Manager, you'll be more than a safety professional – you'll be a catalyst for change, leading a comprehensive safety program that touches thousands of lives. Working at the intersection of operations and safety, you'll shape the future of workplace health while delivering real-time solutions that protect our most valuable asset: our people.\u003cbr/\u003e\u003cbr/\u003eIn this role, you'll serve as the site's safety facilitator, orchestrating our Global WHS Program with precision and passion. You'll partner with Operations leadership to weave safety into the fabric of our daily operations, using data-driven insights to create innovative solutions that reduce risk and enhance productivity. Your ability to build trust, influence change, and drive results will be crucial as you lead comprehensive risk assessments and transform safety data into actionable strategies.\u003cbr/\u003eLeadership is at the heart of this role. You'll build and develop a high-performing team of WHS professionals, fostering a culture of continuous improvement and excellence.\u003cbr/\u003e\u003cbr/\u003eCore Impact Areas:\u003cbr/\u003eSafety Leadership \u0026 Innovation - Transform safety culture through leadership and innovative solutions. Drive continuous improvement initiatives that set new benchmarks in workplace safety. Leverage technology and data analytics to drive preventive safety measures that protect our associates while enhancing operational excellence. Develop leadership plans, communicate expectations, and drive initiatives to create a safe work environment. Measure performance against WHS policies, analyze metrics, and conduct site audits to address non-compliance issues.\u003cbr/\u003e\u003cbr/\u003eStrategic Partnership \u0026 Influence - Build partnerships with Operations leadership to integrate safety into every aspect of our business. Use compelling data analysis and risk insights to influence positive change and drive strategic decision-making. Establish yourself as a trusted advisor who balances safety excellence with operational demands. Oversee recordkeeping, workplace organization, and WHS training programs.\u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements include:\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eLift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e\u003cbr/\u003eStand/walk for up to 12 hours during shifts\u003cbr/\u003e\u003cbr/\u003eWork in an environment where the noise level varies\u003cbr/\u003e\u003cbr/\u003eWork in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e\u003cbr/\u003eContinuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e\u003cbr/\u003eMaintain effective care delivery in emergencies and assist emergency response at the site\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eThose that do not have an adult First Aid, CPR, AED certification from the American Heart Association or American Red Cross must obtain within 3 weeks of start date.","department_cost_center":null,"description_short":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We’re seeking","display_distance":null,"id":"9d62901f-06c5-4ca8-90b5-79b038fa11cf","id_icims":"3121025","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3121025/site-ehs-manager-iii","job_schedule_type":"full-time","location":"US, DE, New Castle","locations":["{\"normalizedStateName\":\"Delaware\",\"normalizedCountryCode\":\"USA\",\"city\":\"New Castle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, DE, New Castle\",\"coordinates\":\"39.65978,-75.56394\",\"normalizedCountyName\":\"New Castle\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New Castle, Delaware, USA\",\"location\":\"US, DE, New Castle\",\"region\":\"DE\",\"buildingCodeList\":[\"ILG1\"],\"normalizedCityName\":\"New Castle\"}"],"normalized_location":"New Castle, Delaware, USA","optional_search_labels":[],"posted_date":"November  4, 2025","preferred_qualifications":"- Distribution Center or Manufacturing EHS experience with mix of exempt and non-exempt employees at a site of at least 250 people\u003cbr/\u003e- Master’s degree\u003cbr/\u003e- Experience implementing lean principles and process improvement in an operational environment.\u003cbr/\u003e- Experience in a fast paced, dynamic organization\u003cbr/\u003e- Certified Safety Professional\u003cbr/\u003e- Excellent written and verbal communication skills, including comfort interfacing with site leaders.\u003cbr/\u003e- Ability to develop and implement department goals and strategies\u003cbr/\u003e- Strong analytical skills with demonstrated problem solving ability\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, DE, New Castle - 94,200.00 - 141,400.00 USD annually","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"DE","title":"Site EHS Manager III","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3121025/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- 5+ years of increasing responsibilities in EHS and/or environmental programs in manufacturing, production, or service operations\u003cbr/\u003e- 5+ years of increasing responsibilities in people and performance management","business_category":"fulfillment-and-operations","city":"Crest Hill","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We’re seeking a dedicated Workplace Health \u0026 Safety (WHS) Manager to help drive this mission forward. As our next WHS Manager, you'll be more than a safety professional – you'll be a catalyst for change, leading a comprehensive safety program that touches thousands of lives. Working at the intersection of operations and safety, you'll shape the future of workplace health while delivering real-time solutions that protect our most valuable asset: our people.  \u003cbr/\u003e\u003cbr/\u003eIn this role, you'll serve as the site's safety facilitator, orchestrating our Global WHS Program with precision and passion. You'll partner with Operations leadership to weave safety into the fabric of our daily operations, using data-driven insights to create innovative solutions that reduce risk and enhance productivity. Your ability to build trust, influence change, and drive results will be crucial as you lead comprehensive risk assessments and transform safety data into actionable strategies.\u003cbr/\u003eLeadership is at the heart of this role. You'll build and develop a high-performing team of WHS professionals, fostering a culture of continuous improvement and excellence. \u003cbr/\u003e\u003cbr/\u003eCore Impact Areas:\u003cbr/\u003eSafety Leadership \u0026 Innovation - Transform safety culture through leadership and innovative solutions. Drive continuous improvement initiatives that set new benchmarks in workplace safety. Leverage technology and data analytics to drive preventive safety measures that protect our associates while enhancing operational excellence. Develop leadership plans, communicate expectations, and drive initiatives to create a safe work environment. Measure performance against WHS policies, analyze metrics, and conduct site audits to address non-compliance issues. \u003cbr/\u003e\u003cbr/\u003eStrategic Partnership \u0026 Influence - Build partnerships with Operations leadership to integrate safety into every aspect of our business. Use compelling data analysis and risk insights to influence positive change and drive strategic decision-making. Establish yourself as a trusted advisor who balances safety excellence with operational demands. Oversee recordkeeping, workplace organization, and WHS training programs. \u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements include: \u003cbr/\u003e- Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Stand/walk for up to 12 hours during shifts\u003cbr/\u003e- Work in an environment where the noise level varies \u003cbr/\u003e- Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e- Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e- Maintain effective care delivery in emergencies and assist emergency response at the site\u003cbr/\u003e\u003cbr/\u003eThose that do not have an adult First Aid, CPR, AED certification from the American Heart Association or American Red Cross must obtain within 3 weeks of start date.","department_cost_center":null,"description_short":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We’re seeking","display_distance":null,"id":"62ca2787-5365-4d55-8e69-9cf68e44a0b2","id_icims":"3180491","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3180491/site-ehs-manager-iii","job_schedule_type":"full-time","location":"US, IL, Crest Hill","locations":["{\"normalizedStateName\":\"Illinois\",\"normalizedCountryCode\":\"USA\",\"city\":\"Crest Hill\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, IL, Crest Hill\",\"coordinates\":\"41.55471,-88.12553\",\"normalizedCountyName\":\"Will\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Crest Hill, Illinois, USA\",\"location\":\"US, IL, Crest Hill\",\"region\":\"IL\",\"buildingCodeList\":[\"MDW5\"],\"normalizedCityName\":\"Crest Hill\"}"],"normalized_location":"Crest Hill, Illinois, USA","optional_search_labels":[],"posted_date":"February 13, 2026","preferred_qualifications":"- Distribution Center or Manufacturing EHS experience with mix of exempt and non-exempt employees at a site of at least 250 people\u003cbr/\u003e- Master’s degree\u003cbr/\u003e- Experience implementing lean principles and process improvement in an operational environment.\u003cbr/\u003e- Experience in a fast paced, dynamic organization\u003cbr/\u003e- Certified Safety Professional\u003cbr/\u003e- Excellent written and verbal communication skills, including comfort interfacing with site leaders.\u003cbr/\u003e- Ability to develop and implement department goals and strategies\u003cbr/\u003e- Strong analytical skills with demonstrated problem solving ability\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, IL, Crest Hill - 94,200.00 - 141,400.00 USD annually","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"IL","title":"Site EHS Manager III","university_job":null,"updated_time":"19 minutes","url_next_step":"https://account.amazon.com/jobs/3180491/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- 1+ years of data center experience\u003cbr/\u003e- Experience with network hardware: copper and optical fiber cabling, switches, routers","business_category":"aws","city":"Manassas","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Amazon Web Services (AWS) is looking for an Infrastructure Delivery Network Technician to join our growing team within infrastructure operations. By applying to this position your application will be considered for all locations we hire for in the United States. This includes, but is not limited to: VA (Manassas, Herndon, Chantilly, Auburn), OR (Boardman, Umatilla, Hermiston), OH (Columbus), CA (Santa Clara), given availability. This position requires the successful candidate report to a site location.\u003cbr/\u003e\u003cbr/\u003eAs a Data Center Network Technician, you will work in a dynamic environment to drive the stability and sustainability of our next-generation networks and assist in the development of innovative ways to automate and scale our network. The position's responsibilities include scaling support of several data center locations and day to day assistance with capacity management. Our ideal candidate is sufficiently autonomous, detail oriented, possesses strong written and verbal communication skills and has some experience in supporting large scale, enterprise class networks. Network implementation and troubleshooting skills combined with a proven documentation methodology is also a requirement.\u003cbr/\u003e\u003cbr/\u003eYou will leverage your experience supporting large scale, enterprise class networks as well as network implementation and troubleshooting. As a Network Technician you will work in a fast paced, collaborative environment with regular peer and customer interaction. In addition to providing management and support of Amazon Web Services vast network infrastructure, Network Technicians establish and follow best practices and refine operational procedures.\u003cbr/\u003e\u003cbr/\u003e#DCPD_GND\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eDaily responsibilities include:\u003cbr/\u003e• Participate in the migration, basic configuration and rollout of new or upgraded hardware\u003cbr/\u003e• Manage work and priorities through ticketing system and workflows to complete customer requests and projects\u003cbr/\u003e• Work closely with our Network Engineering \u0026 Network Technical Project Manager teams to ensure fast, smooth rollout of established designs and products\u003cbr/\u003e• Troubleshoot networking, routing and inter connectivity issues, including troubleshooting of network device configuration and low level application interaction\u003cbr/\u003e• Up to 20% travel within geographical work area may be required; some travel outside traditional work area may be requested\u003cbr/\u003e• Troubleshooting cabling infrastructure connectivity issues, including patch panels and patch cords\u003cbr/\u003e\u003cbr/\u003eAll physical requirements are expected with reasonable accommodations:\u003cbr/\u003e• Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41 pounds or more\u003cbr/\u003e• Ability to work in an environment that operates 24/7 with an ability to participate in on-call rotation and provide after-hours support as needed\u003cbr/\u003e• Some regional travel may be required\u003cbr/\u003e• Walk job sites in uneven terrain\u003cbr/\u003e• Work safely at heights and from ladders","department_cost_center":null,"description_short":"Amazon Web Services (AWS) is looking for an Infrastructure Delivery Network Technician to join our growing team within infrastructure operations. By applying to this position your application will be considered","display_distance":null,"id":"90ccec0c-3fdc-4810-8c94-4ef6eabc725b","id_icims":"3158300","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3158300/network-deploy-technician-id-deploy-optical-team","job_schedule_type":"full-time","location":"US, VA, Manassas","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Haymarket\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Haymarket\",\"coordinates\":\"38.81259,-77.63731\",\"normalizedCountyName\":\"Prince William\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Haymarket, Virginia, USA\",\"location\":\"US, VA, Haymarket\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD55\"],\"normalizedCityName\":\"Haymarket\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD736\",\"IAD650\",\"IAD653\",\"IAD905\",\"IAD28\",\"IAD500\",\"IAD165\",\"IAD547\",\"IAD168\",\"IAD21R\",\"IAD992\",\"IAD739\",\"IAD655\",\"IAD869\",\"IAD769\",\"IAD658\",\"DCA52\",\"IAD654\",\"IAD651\",\"IAD21\",\"IAD993\",\"IAD549\",\"IAD166\",\"IAD546\",\"IAD940\",\"IAD657\",\"IAD990\",\"IAD660\",\"IAD8\",\"IAD652\",\"IAD960\",\"IAD848\",\"IAD545\",\"IAD737\",\"IAD31\",\"IAD980\",\"IAD659\",\"IAD548\",\"IAD656\",\"IAD167\",\"IAD991\"],\"normalizedCityName\":\"Herndon\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Manassas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Manassas\",\"coordinates\":\"38.75125,-77.47086\",\"normalizedCountyName\":\"Manassas (City)\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Manassas, Virginia, USA\",\"location\":\"US, VA, Manassas\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD59\"],\"normalizedCityName\":\"Manassas\"}"],"normalized_location":"Manassas, Virginia, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"January 13, 2026","preferred_qualifications":"- Associate's degree in information technology or computer science\u003cbr/\u003e- 2+ years of Linux operating systems experience\u003cbr/\u003e- CompTIA A+, CompTIA Network+, Cisco/CCNA, Linux (Redhat), Microsoft hardware (installation), AWS, or other industry relevant certifications\u003cbr/\u003e- Experience with common tools related to network troubleshooting, including VFLs, OTDR and power meters\u003cbr/\u003e- Knowledge of major Command Line Protocols (Cisco IOS, JunOS, GNU/Linux) and common Networking Protocols (BGP, OSPF)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Haymarket - 27.00 - 48.00 USD hourly\u003cbr/\u003eUSA, VA, Herndon - 27.00 - 48.00 USD hourly\u003cbr/\u003eUSA, VA, Manassas - 27.00 - 48.00 USD hourly","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"VA","title":"Network Deploy Technician, ID Deploy Optical Team","university_job":null,"updated_time":"22 minutes","url_next_step":"https://account.amazon.com/jobs/3158300/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}