{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Work flexible schedule including weekends, nights, and holidays\u003cbr/\u003e- Bachelor's degree in computer science, electrical engineering, automation engineering, or equivalent, or 2+ years of process or production environment related PLC-controlled automation and issue diagnosis experience\u003cbr/\u003e- Bachelor's degree in computer science, electrical engineering, automation engineering, or equivalent, or 2+ years of PLC programming or automation engineering experience\u003cbr/\u003e- Bachelor's degree in computer science, electrical engineering, automation engineering, or equivalent, or 2+ years of robotics work cells and control systems experience\u003cbr/\u003e- Bachelor's degree in computer science, electrical engineering, automation engineering, or equivalent, or 2+ years of electrical theory, robotics, controls components, and automated equipment experience\u003cbr/\u003e- Bachelor's degree in computer science, electrical engineering, automation engineering, or equivalent, or 2+ years of experience with Ladder Logic and structure programming from Siemens, Allen-Bradley, or Codesys PLCs","business_category":"operations","city":"Loveland","company_name":"Amazon.com Services LLC - A57","country_code":"USA","description":"Application deadline: Applications will be accepted on an ongoing basis\u003cbr/\u003e\u003cbr/\u003eOperations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every day. The Reliability \u0026 Maintenance Engineering (RME) team are the business partners that work tirelessly behind the scenes to make it happen. We drive continuous improvement, and maintain all of the robotics and material handling equipment (MHE) to ensure our customers are met with the Amazon smile. Come join us on our journey!\u003cbr/\u003e\u003cbr/\u003eAbout the Role:\u003cbr/\u003eAs an Automation Engineer, you will play a crucial role in maximizing equipment reliability and operational performance in our fulfillment centers by providing proactive controls automation and technical support. Your expertise will be essential in troubleshooting complex control systems, analyzing performance metrics, and driving continuous improvement initiatives. You'll collaborate with cross-functional teams to optimize material handling equipment (MHE) systems and implement innovative projects. You'll work with state-of-the-art technology, including conveyors, sortation systems, scanners, cameras, print and apply systems, and SCADA devices and programs. Through your efforts, you'll directly contribute to ensuring our customers receive their orders with Amazon's signature speed and accuracy.\u003cbr/\u003e\u003cbr/\u003eWhat Do We Offer?\u003cbr/\u003eAmazon offers competitive compensation packages including comprehensive healthcare benefits starting on Day 1, matching 401(k) program, and up to 20 weeks of paid parental leave. But wait, there’s more: We provide lightweight fire-resistant daily wear and composite toe safety shoes for your safety!\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities include, but are not limited to:\u003cbr/\u003e- You will serve as the site expert for maintaining the automation systems that are critical for operations\u003cbr/\u003e- You will understand, maintain and troubleshoot material handling control systems, including PLC/PC controllers and industrial networks such as Ethernet, ControlNet, DeviceNet, Profibus, motor control systems, servo drives, frequency drives, and electrical distribution systems\u003cbr/\u003e- You will monitor MHE metrics and partner with maintenance/operations to address system performance issues and provide analysis across all operations\u003cbr/\u003e- You will provide first-level escalation support for site technicians, both locally and remotely \u003cbr/\u003e- You will perform and analyze building System Assessments to enhance material handling system performance \u003cbr/\u003e","department_cost_center":null,"description_short":"Operations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every","display_distance":null,"id":"fd9e2d64-076a-4efc-ad8d-97af99eb7bce","id_icims":"3152829","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3152829/automation-engineer","job_schedule_type":"full-time","location":"US, CO, Loveland","locations":["{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Loveland\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Loveland\",\"coordinates\":\"40.39277,-105.07358\",\"normalizedCountyName\":\"Larimer\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Loveland, Colorado, USA\",\"location\":\"US, CO, Loveland\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN9\"],\"normalizedCityName\":\"Loveland\"}"],"normalized_location":"Loveland, Colorado, USA","optional_search_labels":["operations.team-reliability-maintenance-engineering-na"],"posted_date":"January  5, 2026","preferred_qualifications":"- Experience with HMI and control network components, including maintenance, troubleshooting, programming and design\u003cbr/\u003e- Experience identifying, maintaining, troubleshooting, and modifying Motor Controls including motor starters, Variable Frequency Drives, DC drives, and standard electrical components\u003cbr/\u003e- Experience with preventive maintenance procedures, industrial electrical, industrial controls, and industrial electronics \u0026 robotics\u003cbr/\u003e- Experience interpreting and modifying mechanical and electrical drawings\u003cbr/\u003e- Experience programming with RSLogix5000, Studio 5000, FT View, and other controls software platforms\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Loveland - 90,000.00 - 112,500.00 USD annually","primary_search_label":"operations.team-reliability-maintenance-engineering","source_system":"JobCreator","state":"CO","title":"Automation Engineer ","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3152829/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-reliability-maintenance-engineering","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Electrical or Mechanical Engineering, Engineering Technology, Reliability Engineering, or 8+ years of managing, analyzing and communicating results to senior leadership experience\u003cbr/\u003e- 5+ years of root cause analysis and troubleshooting or problem solving experience\u003cbr/\u003e- 5+ years of product validation (Shock/Drop, cycle testing, environmental testing) experience","business_category":"aws","city":"Singapore","company_name":"Amazon Asia-Pacific Resources Private Limited (Singapore)","country_code":"SGP","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAs a Senior Infrastructure Reliability Engineer you will be proactively driving the reliability risk identification, assessment and mitigation for datacenter infrastructure equipment (Example: Air Handling Units, LV Generator, MV Transformers, LV SWGR, Breakers, UPS, Chillers etc.). You will also be responsible for root cause analysis of critical equipment failures and drive the continuous improvements to improve datacenter availability for AWS customers. You will work closely with both internal and outside partners including suppliers to drive key aspects of product specification, risk identification plan and execution. You must be ownership minded, independent, action and results oriented to succeed in an open collaborative environment.\u003cbr/\u003e\u003cbr/\u003eOur Senior Reliability Engineers have experience in using Physics-of-Failure based approach to develop and implement both analytical and empirical approaches for product quality/reliability risk identification and assessment during product design, manufacture as well as deployment stages. They drive AWS application-specific requirements in carrying out both lifecycle environmental and operational stress driven risk analysis, including thermal, electrical, chemical and mechanical stresses so to identify overstress and fatigue-related product weaknesses. Evaluate product design quality/reliability risks and assess electronics manufacture process related quality/reliability issues. \u003cbr/\u003e\u003cbr/\u003eThey drive critical component identification and the associated vendor selection and qualification requirements. Using their knowledge of process capability for electronic component production as well as system-level performance requirements to establish critical to quality and reliability metrics, they develop datacenter system level reliability model and related reliability quantification and risk analysis for datacenter configuration optimization. \u003cbr/\u003e\u003cbr/\u003eDuring sustaining stage, you will be responsible for monitoring product performance in the field and will be responsible to drive root cause analysis of any critical failures and the associated corrective and preventive actions. You will drive effective vendor auditing and quarterly review process to drive the continuous improvements of datacenter availability.\u003cbr/\u003e\u003cbr/\u003eAs an SME in the reliability engineering field and product reliability leadership, as well as business negotiations and program management, you will conduct problem analysis and solve as well as communicate with vendors.  \u003cbr/\u003e\u003cbr/\u003eIn this role, you will be required to travel within APAC and internationally. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. ","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"815fffd1-7a8e-45b9-bb37-6cc7b197cec2","id_icims":"3181276","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"Data Center Infrastructure Eng","job_function_id":null,"job_path":"/en/jobs/3181276/sr-infrastructure-reliability-engineer-infrastructure-reliability-quality","job_schedule_type":"full-time","location":"SG, Singapore","locations":["{\"normalizedCountryCode\":\"SGP\",\"city\":\"Singapore\",\"countryIso3a\":\"SGP\",\"countryIso2a\":\"SG\",\"locationNonStemming\":\"Singapore, Singapore\",\"coordinates\":\"1.29087,103.85238\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Singapore\",\"normalizedLocation\":\"SGP\",\"location\":\"SG, Singapore\",\"region\":\"\",\"buildingCodeList\":[\"SIN18\"]}"],"normalized_location":"SGP","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"February 13, 2026","preferred_qualifications":"- Bachelor's degree in Electrical or Mechanical Engineering, Engineering Technology, Reliability Engineering, or 10+ years of managing, analyzing and communicating results to senior leadership experience\u003cbr/\u003e- Experience in supply chain, commodity, and supplier management in a high volume, global sourcing and operations manufacturing environment with a global supply base of contract manufacturers\u003cbr/\u003e- Knowledge of critical data center mechanical and electrical equipment\u003cbr/\u003e- Experience managing multiple projects, prioritizing, planning, and managing time\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":null,"title":"Sr. Infrastructure Reliability Engineer, Infrastructure Reliability \u0026 Quality","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3181276/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"advertising","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"Amazon Advertising operates at the intersection of e-Commerce and Advertising, offering a range of digital advertising solutions with the goal of helping our customers discover and shop for anything they want to buy. Advertising is an extension of the shopping experience and as consumers watch more video than ever, a viewing revolution is underway in how people consume video and connect with brands.\u003cbr/\u003e\u003cbr/\u003eThe Amazon Advertising business is growing at a fast pace and this team’s mission is to apply technology to accelerate that growth through best-in-class software engineering, data engineering, and business intelligence. We are Sales Technology division within Global Sales organization and our mission is to deliver best-in-class software products and solutions to improve Amazon Advertising Sales' effectiveness worldwide. We are building sales enablement products for Amazon Advertising front line sales team. We want to ensure that the sales team has all the information about the customer and their potential to up-sell at their fingertips and they are not wasting time in inefficiencies. The team is looking for motivated, thoughtful self-starters who can contribute right away to the design and development of these new products and who can partner closely with Sales teams to deliver products that truly move the needle for innovation.\u003cbr/\u003e\u003cbr/\u003eA qualified candidate for this role enjoys working with end users, developing customer-focused UX, workflows and services, and solving business problems with leveraging AI and extensible software solutions. Engineers on this team can turn large data sets and disparate systems into actionable, insight-driven products that can help Sales teams serve some of the world’s best known brands as well as small businesses selling products on Amazon. If you are interested in being part of Amazon Advertising and building services that allow Advertising to reach its innovative and aggressive goals, then we look forward to connecting with you.\u003cbr/\u003e\u003cbr/\u003eYou'll be part of a world-class team in a fast-paced environment that has the entrepreneurial feel of a start-up. This is an opportunity to operate and engineer systems on a massive scale, and to gain top-notch experience in cloud computing.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eBe heavily involved with design and product teams to understand needs, propose features, create early prototypes and transform them into exciting experiences.\u003cbr/\u003e\u003cbr/\u003ePropose innovative tools, frameworks, automations and processes that are used by the entire services team for development.\u003cbr/\u003e\u003cbr/\u003eWrite clean, maintainable code and perform peer code-reviews.\u003cbr/\u003e\u003cbr/\u003eDeep-dive into client or server systems to optimize for performance, maintainability, scalability, extensibility as needed.\u003cbr/\u003e\u003cbr/\u003eMentor your team members to promote engineering excellence\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Software Development Engineer, you will be designing and developing automated solutions that help guarantee the software quality across a wide range of devices and web. You will be working on tools and infrastructure challenges involving big data and large scale back-end web services, all with the goal of delivering seamless experience to the customer.","department_cost_center":null,"description_short":"Amazon Advertising operates at the intersection of e-Commerce and Advertising, offering a range of digital advertising solutions with the goal of helping our customers discover and shop for anything they","display_distance":null,"id":"9b5e2f93-61f6-47ac-9896-3dc9c219f78b","id_icims":"3142197","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3142197/software-development-engineer-ii-sales-technology-amazon-advertising","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR18\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"December 12, 2025","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- Knowledge of professional software engineering \u0026 best practices for full software development life cycle, including coding standards, software architectures, code reviews, source control management, continuous deployments, testing, and operational excellence\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"advertising.team-amazon-ads","source_system":"JobCreator","state":"KA","title":"Software Development Engineer - II, Sales Technology, Amazon Advertising","university_job":null,"updated_time":"31 minutes","url_next_step":"https://account.amazon.com/jobs/3142197/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-ads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"advertising","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"Amazon Advertising operates at the intersection of e-Commerce and Advertising, offering a range of digital advertising solutions with the goal of helping our customers discover and shop for anything they want to buy. Advertising is an extension of the shopping experience and as consumers watch more video than ever, a viewing revolution is underway in how people consume video and connect with brands.\u003cbr/\u003e\u003cbr/\u003eThe Amazon Advertising business is growing at a fast pace and this team’s mission is to apply technology to accelerate that growth through best-in-class software engineering, data engineering, and business intelligence. We are Sales Technology division within Global Sales organization and our mission is to deliver best-in-class software products and solutions to improve Amazon Advertising Sales' effectiveness worldwide. We are building sales enablement products for Amazon Advertising front line sales team. We want to ensure that the sales team has all the information about the customer and their potential to up-sell at their fingertips and they are not wasting time in inefficiencies. The team is looking for motivated, thoughtful self-starters who can contribute right away to the design and development of these new products and who can partner closely with Sales teams to deliver products that truly move the needle for innovation.\u003cbr/\u003e\u003cbr/\u003eA qualified candidate for this role enjoys working with end users, developing customer-focused UX, workflows and services, and solving business problems with leveraging AI and extensible software solutions. Engineers on this team can turn large data sets and disparate systems into actionable, insight-driven products that can help Sales teams serve some of the world’s best known brands as well as small businesses selling products on Amazon. If you are interested in being part of Amazon Advertising and building services that allow Advertising to reach its innovative and aggressive goals, then we look forward to connecting with you.\u003cbr/\u003e\u003cbr/\u003eYou'll be part of a world-class team in a fast-paced environment that has the entrepreneurial feel of a start-up. This is an opportunity to operate and engineer systems on a massive scale, and to gain top-notch experience in cloud computing.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eBe heavily involved with design and product teams to understand needs, propose features, create early prototypes and transform them into exciting experiences.\u003cbr/\u003e\u003cbr/\u003ePropose innovative tools, frameworks, automations and processes that are used by the entire services team for development.\u003cbr/\u003e\u003cbr/\u003eWrite clean, maintainable code and perform peer code-reviews.\u003cbr/\u003e\u003cbr/\u003eDeep-dive into client or server systems to optimize for performance, maintainability, scalability, extensibility as needed.\u003cbr/\u003e\u003cbr/\u003eMentor your team members to promote engineering excellence\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Software Development Engineer, you will be designing and developing automated solutions that help guarantee the software quality across a wide range of devices and web. You will be working on tools and infrastructure challenges involving big data and large scale back-end web services, all with the goal of delivering seamless experience to the customer.","department_cost_center":null,"description_short":"Amazon Advertising operates at the intersection of e-Commerce and Advertising, offering a range of digital advertising solutions with the goal of helping our customers discover and shop for anything they","display_distance":null,"id":"8d031aa9-0761-422f-a352-0d377e228632","id_icims":"3142196","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3142196/software-development-engineer-ii-sales-technology-amazon-advertising","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR18\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"December 12, 2025","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- Knowledge of professional software engineering \u0026 best practices for full software development life cycle, including coding standards, software architectures, code reviews, source control management, continuous deployments, testing, and operational excellence\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"advertising.team-amazon-ads","source_system":"JobCreator","state":"KA","title":"Software Development Engineer - II, Sales Technology, Amazon Advertising","university_job":null,"updated_time":"34 minutes","url_next_step":"https://account.amazon.com/jobs/3142196/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-ads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree","business_category":"fulfillment-and-operations","city":"New Delhi","company_name":"ASSPL - Delhi - C76","country_code":"IND","description":"At Amazon, we strive to be Earth’s most customer centered company where people can find and discover anything they want to buy online. We hire the world’s brightest minds, offering them an environment in which they can relentlessly improve the experience for customers. Innovation and creativity are built into the DNA of the company and are encouraged at all levels of employment. Every day we solve complex technical and business problems with ingenuity and simplicity. We’re making history and the good news is we’ve only just begun\u003cbr/\u003eAmazon is a highly data driven company highly passionate about its customers. In this context it is vital to ensure the customers always get their orders on time and with quality. The processes at the FCs are largely manual involving large numbers of associates. One of the most critical roles is that of a process associates who mentor/guide the associates towards ensuring meeting the customer expectation by following our standard work practice keeping safety \u0026 quality in mind. \u003cbr/\u003e\u003cbr/\u003ePlease note: This role will be based in Sonipat only.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e-Job Description · A graduate with 1-3 yrs of experience in a customer facing environment, warehousing, logistics or manufacturing. - Strong execution skills, action oriented, go getter. Good people management skills. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eWe're seeking a Team lead for our Pantry FC operations. In this role, you will be responsible for:\u003cbr/\u003eInitially to be part of planning and executing the launch of the FC and then ramp up the site to necessary processing capacity. And then single handedly managing, on a daily basis, end to end operations for a 3P operated pantry FC overseeing inbound, outbound and ICQA operations.\u003cbr/\u003eMeeting customer facing metrics, while maintaining cost targets for the site and upholding safety and morale of the 3P team reporting to you.\u003cbr/\u003eWork with all stakeholders to ensure smooth operations and partner experience and keeping a close monitoring of site health by conducting 4M, 5S and inventory audits for the FC on a daily basis.","department_cost_center":null,"description_short":"At Amazon, we strive to be Earth’s most customer centered company where people can find and discover anything they want to buy online. We hire the world’s brightest minds, offering them an environment","display_distance":null,"id":"b8207a59-2ffb-4b81-9865-0801e09b5863","id_icims":"3176674","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3176674/team-lead-quick-commerce-f-f-center-var","job_schedule_type":"full-time","location":"IN, DL, New Delhi","locations":["{\"normalizedStateName\":\"Delhi\",\"normalizedCountryCode\":\"IND\",\"city\":\"New Delhi\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, DL, New Delhi\",\"coordinates\":\"28.63141,77.21676\",\"normalizedCountyName\":\"New Delhi\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"New Delhi, Delhi, IND\",\"location\":\"IN, DL, New Delhi\",\"region\":\"DL\",\"buildingCodeList\":[\"PDL2\"],\"normalizedCityName\":\"New Delhi\"}"],"normalized_location":"New Delhi, Delhi, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"February  9, 2026","preferred_qualifications":"- 2+ years of customer-facing environment, warehousing, logistics or manufacturing experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.no-team-listed","source_system":"JobCreator","state":"DL","title":"Team Lead ,  Quick Commerce F F Center-VAR","university_job":null,"updated_time":"38 minutes","url_next_step":"https://account.amazon.com/jobs/3176674/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 4+ years of non-internship background in troubleshooting systems issues, analyzing logs, or automating complex tasks using command line tools experience\u003cbr/\u003e- 5+ years of work in identifying security issues and risks, and developing mitigation plans experience\u003cbr/\u003e- 4+ years of (non-internship) scripting, programming, and security code review in common programming languages experience\u003cbr/\u003e- Knowledge of at least two of the following programming languages: Scala, Java, Python, C/C++, or Go\u003cbr/\u003e- Experience (non-internship) in scripting, programming, and security code reviewing in a common programming language\u003cbr/\u003e- Experience (non-internship) in troubleshooting systems issues, analyzing logs, or automating complex tasks using command line tools\u003cbr/\u003e- Experience working in identifying security issues and risks, and developing mitigation plans\u003cbr/\u003e- Experience (non-internship) in industry-based security vulnerabilities identification, attack patterns, and remediation techniques\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team","business_category":"alexa-and-amazon-devices","city":"Hawthorne","company_name":"Amazon.com Services LLC","country_code":"USA","description":"We are seeking an experienced Security Engineer III (L6) individual contributor to expand critical security infrastructure around data protection and accountability. Ring and Blink Customer Support employees use 1P and 3P tools to handle customer data and perform actions that can impact customers’ devices, security, and privacy.  In this role, you will own the continued development of mechanisms designed to monitor, detect, and escalate security events to incident response teams. You will also work cross-functionally with application security (AppSec), software development engineers, and solution architects to design workflows that inject security concepts early in CS technology build cycles.  You will tackle ambiguous, large-scale security challenges where customer, employee, or legal/regulatory needs are defined, but security strategies must be established from the ground up. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Design and implement security frameworks that scale across Ring and Blink Customer Support operations, including Splunk-based detection systems, monitoring dashboards, and unified security intelligence platforms consolidating insights from Incident Response, Adversarial Threat, Insider Threat, Fraud, and Loss Prevention \u003cbr/\u003e\u003cbr/\u003e- Develop AI-powered security solutions including risk scoring systems, automated threat detection, and intelligent security response mechanisms \u003cbr/\u003e\u003cbr/\u003e- Establish streamlined security pathways that balance rigorous security standards with efficient application security assessments, partnering with AppSec, Product Security, and Engineering teams to certify technology projects \u003cbr/\u003e\u003cbr/\u003e- Drive cross-organizational consensus across multiple stakeholder groups with differing priorities, mentoring security engineers and setting standards for security engineering excellence \u003cbr/\u003e\u003cbr/\u003e- Design and implement security compliance frameworks that meet Amazon standards and regulatory requirements (CCPA, GDPR, FTC), including automated compliance tracking, identity and access management, and audit-ready controls \u003cbr/\u003e\u003cbr/\u003e- Proactively engage with product and system owners to design security controls for emerging technologies, translating complex security risks into actionable recommendations while balancing business needs, customer experience, and measurable risk reduction \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eA big part of your day is meeting with solution architects and engineering teams, reviewing technical designs and providing security guidance. Where time allows, you'll volunteer for and conduct ASR reviews, evaluating new systems against security standards. Throughout all of this, you will mentor, and delegate some of the work listed above to junior security engineers. You will also work on projects like engineering employee-facing security solutions (including AI)—tools that make it easier for support teams to work securely without friction.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eRing Blink Customer Support Security (RBCS CSSec) protects customer trust by strengthening Security, Privacy, Compliance, and Fraud posture across Ring and Blink Customer Support. We investigate sensitive escalations, analyze telemetry, determine root causes, and drive fast resolution for unauthorized access or anomalous device behavior. Partnering with engineering, security, fraud, legal, and product teams, we ensure rigorous case handling and risk reduction. We provide governance, audit readiness, fraud prevention, secure workstation compliance, and cross-functional program delivery through scalable mechanisms, SOPs, automation, and roadmaps to keep our organization compliant, efficient, and growth-ready.","department_cost_center":null,"description_short":"We are seeking an experienced Security Engineer III (L6) individual contributor to expand critical security infrastructure around data protection and accountability. Ring and Blink Customer Support employees","display_distance":null,"id":"5676ee2f-fb14-490d-99fb-f8658e1a3d0c","id_icims":"3176078","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"Systems Security Engineering","job_function_id":null,"job_path":"/en/jobs/3176078/sr-security-engineer-customer-service-support-ring-and-blink-cs-security-program","job_schedule_type":"full-time","location":"US, CA, Hawthorne","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Hawthorne\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Hawthorne\",\"coordinates\":\"33.91822,-118.35273\",\"normalizedCountyName\":\"Los Angeles\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Hawthorne, California, USA\",\"location\":\"US, CA, Hawthorne\",\"region\":\"CA\",\"buildingCodeList\":[\"LAX32\"],\"normalizedCityName\":\"Hawthorne\"}"],"normalized_location":"Hawthorne, California, USA","optional_search_labels":[],"posted_date":"February  6, 2026","preferred_qualifications":"- Experience applying threat modeling or other risk identification techniques or equivalent\u003cbr/\u003e- Experience with security in service-oriented architectures/microservices and web services\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Hawthorne - 178,400.00 - 226,700.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-ring-key-blink","source_system":"JobCreator","state":"CA","title":"Sr. Security Engineer - Customer Service Support, Ring and Blink CS Security Program ","university_job":null,"updated_time":"40 minutes","url_next_step":"https://account.amazon.com/jobs/3176078/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-ring-key-blink","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of corporate setting Windows, Mac or Linux Operating systems support experience\u003cbr/\u003e- 3+ years of troubleshooting in a multi-user high availability environment experience\u003cbr/\u003e- 2+ years of PC repair, troubleshooting, deployment and liquidation experience\u003cbr/\u003e- 2+ years of IT client, server, and network service delivery experience\u003cbr/\u003e- 2+ years of networking (such as DNS, DHCP, SSL, OSI Model, and TCP/IP) experience\u003cbr/\u003e- 2+ years of supporting and maintaining a corporate network environment experience\u003cbr/\u003e- Bachelor's degree","business_category":"international-stores","city":"Hong Kong","company_name":"Amazon Web Services Hong Kong Limited","country_code":"HKG","description":"Are you passionate about helping people solve IT problems? Love being a part of an exciting and innovative environment? Join Amazon Global IT Support! We’re looking for people who strive to “Work Hard. Have Fun. Make History.”\u003cbr/\u003eAmazon, is seeking bright, adaptable, and hardworking applicants to work at our Corporate Office. IT Support Engineers work with Amazon teams to provide and support the IT equipment and services they need. We treat Amazon employees as our customers and provide timely, accurate, and professional support. A successful IT Support Engineer I excel in a fast-paced, team environment and possesses excellent communication skills. They have a high degree of technical aptitude over a large scope of IT software, hardware, and networking disciplines.\u003cbr/\u003eRegular activities include:\u003cbr/\u003eWindows/Mac/Linux OS deployment\u003cbr/\u003eProviding on-site tech support\u003cbr/\u003eLAN troubleshooting and support\u003cbr/\u003eTroubleshooting AV systems, particularly large or complex integrated systems\u003cbr/\u003eCollaborating IT Program to improve customer satisfaction\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKEY RESPONSIBILITIES\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eProvide contact-based in-person desktop support for Amazon employees in the Hong Kong office. \u003cbr/\u003e\u003cbr/\u003eManage various routine processes such as new hire onboards, computer life cycle management, asset management, computer imaging, hardware warranty support and hardware recycling.\u003cbr/\u003e\u003cbr/\u003eWork with other internal IT technical service owners to uphold system SLAs with a rotating On-call schedule for production support issues.\u003cbr/\u003e\u003cbr/\u003eParticipate in the development, implementation and administration of processes and procedures to ensure the reliability, recoverability, and optimum performance of user hardware and local services.\u003cbr/\u003e\u003cbr/\u003eResearch, procure, vet and deploy new hardware and software solutions.\u003cbr/\u003e\u003cbr/\u003eDirect internal and external service provider engagements, as needed, in the processing of support requests for effective and timely resolution of issues.","department_cost_center":null,"description_short":"Are you passionate about helping people solve IT problems? Love being a part of an exciting and innovative environment? Join Amazon Global IT Support! We’re looking for people who strive to “Work Hard.","display_distance":null,"id":"687ffa66-a0cd-46b3-9a34-be49708b919e","id_icims":"3171147","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Technical Services","job_function_id":null,"job_path":"/en/jobs/3171147/it-support-engineer-global-on-premise-it","job_schedule_type":"full-time","location":"HK, Hong Kong","locations":["{\"normalizedStateName\":\"Hong Kong SAR\",\"normalizedCountryCode\":\"HKG\",\"city\":\"Hong Kong\",\"countryIso3a\":\"HKG\",\"countryIso2a\":\"HK\",\"locationNonStemming\":\"Hong Kong SAR China, Hong Kong\",\"coordinates\":\"22.27683,114.17612\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Hong Kong SAR\",\"normalizedLocation\":\"Hong Kong, Hong Kong SAR, HKG\",\"location\":\"HK, Hong Kong\",\"region\":\"\",\"buildingCodeList\":[\"HKG12\"],\"normalizedCityName\":\"Hong Kong\"}"],"normalized_location":"Hong Kong, Hong Kong SAR, HKG","optional_search_labels":["amazon-stores-tech-cn"],"posted_date":"January 31, 2026","preferred_qualifications":"- CompTIA A+, CompTIA Network+, Cisco/CCNA, Linux (Redhat), Microsoft hardware (installation), AWS, or other industry relevant certifications\u003cbr/\u003e- Experience supporting video conference and teleconference equipment\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"international-stores.team-international-sellers-group","source_system":"JobCreator","state":null,"title":"IT Support Engineer, Global On-Premise IT","university_job":null,"updated_time":"43 minutes","url_next_step":"https://account.amazon.com/jobs/3171147/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-international-sellers-group","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of customer-facing environment, warehousing, logistics or manufacturing experience\u003cbr/\u003e- Speak, write, and read fluently in English\u003cbr/\u003e- Experience with Microsoft Office products and applications\u003cbr/\u003e- Experience with Excel","business_category":"fulfillment-and-operations","city":"Jaipur","company_name":"ASSPL - Delhi - C76","country_code":"IND","description":"At Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Team leads for our transportation team. Amazon is one of the most recognizable brand names in the world and we distribute millions of products each year to our loyal customers\u003cbr/\u003e\u003cbr/\u003eWe're seeking a Team lead for our Delivery center. In this role you will be responsible for shift operations at our DCs and support the DC manager in performance management and driving the operational plan.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eEssential Functions\u003cbr/\u003e    Defining , building and executing the delivery process from delivery station to customer address\u003cbr/\u003e\u003cbr/\u003e    Ensure enough bandwidth in territorial delivery team to ensure peak time delivery management\u003cbr/\u003e\u003cbr/\u003e    Engage closely with the delivery team including associates, developing and maintaining a highly motivated and performance driven team.\u003cbr/\u003e\u003cbr/\u003e    Continuously improve the delivery process and attain a sustained level of delivery performance, through process and training improvements. Initiates improvements to enhance quality standards, reduce waste, and eliminate unnecessary work.\u003cbr/\u003e    Analysis of the data reports to identify performance bottlenecks and improve performance\u003cbr/\u003e    Implement the formal process control and process improvement mechanisms such as Kaizen\u003cbr/\u003eEssential Skills\u003cbr/\u003eStrong leadership capabilities and people management skills - Ability to work under pressure situations\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e    Ability to work in ambiguous situations\u003cbr/\u003e\u003cbr/\u003e    Good communication skills. Ability to communicate and explain to individuals \u0026 the team, what needs to be achieved for the Delivery Center /Amazon to achieve its objectives. Listening skills: Gains input and commitment from all involved in delivering their specific part.\u003cbr/\u003e\u003cbr/\u003e    Strong Bias for great customer service: Engage the Team in developing their understanding of Customer Experience and knowledge of what Customers actually needs/expects.\u003cbr/\u003e\u003cbr/\u003e    High Ownership: Follows through to ensure the delivery of changes/solutions/services that fulfill the Customer’s needs.\u003cbr/\u003e\u003cbr/\u003eAnalytical Skills: Effectively analyse and interpret information, identifying \u0026 validating the key facts, including reviewing alternatives to determine advantages and associated risks.\u003cbr/\u003e","department_cost_center":null,"description_short":"At Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Team leads for our transportation team.","display_distance":null,"id":"bd14fc37-ab94-4891-8b00-6591d5bc2dc0","id_icims":"3185812","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3185812/team-lead-team-lead","job_schedule_type":"full-time","location":"IN, RJ, Jaipur","locations":["{\"normalizedStateName\":\"Rajasthan\",\"normalizedCountryCode\":\"IND\",\"city\":\"Jaipur\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, RJ, Jaipur\",\"coordinates\":\"26.92589,75.80674\",\"normalizedCountyName\":\"Jaipur\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Jaipur, Rajasthan, IND\",\"location\":\"IN, RJ, Jaipur\",\"region\":\"RJ\",\"buildingCodeList\":[\"UJA1\"],\"normalizedCityName\":\"Jaipur\"}"],"normalized_location":"Jaipur, Rajasthan, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"February 20, 2026","preferred_qualifications":"- Bachelor's degree\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-last-mile-delivery","source_system":"JobCreator","state":"RJ","title":"Team Lead, Team lead ","university_job":null,"updated_time":"44 minutes","url_next_step":"https://account.amazon.com/jobs/3185812/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-delivery","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of customer-facing environment, warehousing, logistics or manufacturing experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Speak, write, and read fluently in English\u003cbr/\u003e- Experience with Microsoft Office products and applications\u003cbr/\u003e- Experience with Excel","business_category":"fulfillment-and-operations","city":"Chennai","company_name":"ASSPL - Tamil Nadu - D31","country_code":"IND","description":"Amazon is a highly data driven company highly passionate about its customers. In this context it is vital to ensure the customers always get their orders on time and with quality. The processes at the GSF LM are largely manual involving large numbers of associates and 3P Vendors. One of the most critical roles is that of a process associates who mentor/guide the associates towards ensuring meeting the customer expectation by following our standard work practice keeping safety \u0026 quality in mind.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eWe're seeking a Team lead for our GSF LM operations. In this role, you will be responsible for: Managing, on a daily basis, end to end operations for either one large site or a combination of small sites having below Job responsibilities.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eJob Deliverables:\u003cbr/\u003eo Daily Management of shift\u003cbr/\u003eo Administrative management of associates\u003cbr/\u003eo Job allocation to associates\u003cbr/\u003eo Monitoring and mentoring of associates on productivity, cost,quality and safety.\u003cbr/\u003eo Monitor status of counts and problem solve queues\u003cbr/\u003eo Responsible for shift quality and associated action plans\u003cbr/\u003eo Preparing and implementing training and development plans for associates\u003cbr/\u003eo Conduct a 4M and 5S audit for the respective work stations on a daily basis\u003cbr/\u003eo Stand-in for Area Manager\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eJob Deliverables:\u003cbr/\u003eo Daily Management of shift\u003cbr/\u003eo Administrative management of associates\u003cbr/\u003eo Job allocation to associates\u003cbr/\u003eo Monitoring and mentoring of associates on productivity, cost,quality and safety.\u003cbr/\u003eo Monitor status of counts and problem solve queues\u003cbr/\u003eo Responsible for shift quality and associated action plans\u003cbr/\u003eo Preparing and implementing training and development plans for associates\u003cbr/\u003eo Conduct a 4M and 5S audit for the respective work stations on a daily basis\u003cbr/\u003eo Stand-in for Area Manager\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Team  will address discipline and/or performance issues for LM Associates. In addition, you will work in partnership with third party delivery providers to ensure Amazon standards are being met in accordance to service contracts. Team will ensure Amazon policies – including attendance tracking – are implemented and administered fairly and consistently. This includes motivating, coaching, reporting, for achieving or exceeding Amazon expectations. ","department_cost_center":null,"description_short":"Amazon is a highly data driven company highly passionate about its customers. In this context it is vital to ensure the customers always get their orders on time and with quality. The processes at the","display_distance":null,"id":"7cc05c19-bff7-46ca-a5a3-32d294bb02dc","id_icims":"3181795","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3181795/lm-team-lead-gsf-lm","job_schedule_type":"full-time","location":"IN, TN, Chennai","locations":["{\"normalizedStateName\":\"Tamil Nadu\",\"normalizedCountryCode\":\"IND\",\"city\":\"Chennai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TN, Chennai\",\"coordinates\":\"13.08404,80.28274\",\"normalizedCountyName\":\"Chennai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Chennai, Tamil Nadu, IND\",\"location\":\"IN, TN, Chennai\",\"region\":\"TN\",\"buildingCodeList\":[\"UMA7\"],\"normalizedCityName\":\"Chennai\"}"],"normalized_location":"Chennai, Tamil Nadu, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"February 16, 2026","preferred_qualifications":"- 2+ years of customer-facing environment, warehousing, logistics or manufacturing experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-last-mile-delivery","source_system":"JobCreator","state":"TN","title":"LM Team Lead, GSF LM","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3181795/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-delivery","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- Speak, write, and read fluently in English\u003cbr/\u003e- Experience with Microsoft Office products and applications","business_category":"operations","city":"Surat","company_name":"ASSPL - Gujarat","country_code":"IND","description":"\r\u003cbr/\u003eAmazon.com strives to be Earth's most customer-centric company  where  people can find and discover virtually anything they want to buy   online. By giving customers more of what they want - low prices, vast   selection, and convenience - Amazon.com continues to grow and evolve as a   world-class e-commerce platform. Amazon's evolution from Web site to   e-commerce partner to development platform is driven by the spirit of   innovation that is part of the company's DNA. The world's brightest   technology minds come to Amazon.com to research and develop technology   that improves the lives of shoppers and sellers around the world.\r\u003cbr/\u003e\r\u003cbr/\u003e      Amazon Operations \r\u003cbr/\u003e\r\u003cbr/\u003e   Amazon Worldwide Operations is the underlying fulfillment and   customer service engine that ensures Amazon creates the same consistent,   world-class customer experience every time. We are looking for   high-potential, flexible, innovative, and forward-thinking professionals   to join our India Operations team. Are you ready to drive   high-visibility, strategic, revenue-generating projects as well as   leverage Lean methodologies to lead Operational process improvement   initiatives? Are you equally comfortable digging into business   requirements as you are drilling into architecture and design with   development teams?\r\u003cbr/\u003e\r\u003cbr/\u003e      Join the Operations team as SellerFlex Operations Executive  (SFOE).  As SFOE you will be responsible for monitoring multiple seller  flex  sites from operations and compliance point of view. You will be  working  with multiple internal and external stakeholders to achieve  timely  launches and operations metrics. With customer obsession and a  high  sense of ownership, you will utilize your skills to identify  patterns  and any disruptions in it. You should be able to dive deep,  scrutinize  details and foresee data implications. You must be flexible  to work  weekends and/or overnight shifts regularly and to travel to  seller nodes  to launch, set up \u0026 monitor Flex operations. \r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003e","department_cost_center":null,"description_short":"\rAmazon.com strives to be Earth's most customer-centric company  where  people can find and discover virtually anything they want to buy   online. By giving customers more of what they want - low prices,","display_distance":null,"id":"b83288e6-dfc7-4671-adc8-c4f4bddd471f","id_icims":"3180549","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Administrative Support","job_function_id":null,"job_path":"/en/jobs/3180549/sellerflex-operation-executive-external-fulfillment","job_schedule_type":"full-time","location":"IN, GJ, Surat","locations":["{\"normalizedStateName\":\"Gujarat\",\"normalizedCountryCode\":\"IND\",\"city\":\"Surat\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, GJ, Surat\",\"coordinates\":\"21.1859,72.83661\",\"normalizedCountyName\":\"Surat\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Surat, Gujarat, IND\",\"location\":\"IN, GJ, Surat\",\"region\":\"GJ\",\"buildingCodeList\":[\"FSTA\"],\"normalizedCityName\":\"Surat\"}"],"normalized_location":"Surat, Gujarat, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"February 13, 2026","preferred_qualifications":"- 2+ years of manufacturing or customer-facing environment experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"operations.team-no-team-listed","source_system":"JobCreator","state":"GJ","title":"SellerFlex Operation Executive, External Fulfillment","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3180549/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}