{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Experience in Network protocols like DNS/DHCP/TCP\u003cbr/\u003e- 3+ years of computer hardware experience, including troubleshooting and repairing experience\u003cbr/\u003e- Knowledge of Linux/Unix Administration\u003cbr/\u003e- Ability to cover 24x7 shift rotation","business_category":"aws","city":"Melbourne","company_name":"Amazon Corporate Services Pty Ltd","country_code":"AUS","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. \u003cbr/\u003e\u003cbr/\u003eThe Infrastructure Operations team is seeking Data Centre Technicians to join our expanding team. As a Data Centre Technician, you'll troubleshoot and resolve a range of infrastructure issues including server hardware, fiber, networking, and related problems.\u003cbr/\u003e\u003cbr/\u003eTo be eligible for this role you will need to hold or be able to obtain an Australian Government Security Vetting Agency clearance. See link for specific details of suitability (https://www.agsva.gov.au/applicants/eligibility-and-suitability).\u003cbr/\u003e\u003cbr/\u003eIf you enjoy applying IT principles like computer architecture and the OSI (Open Systems Interconnection) model to solve complex problems, we'd like to meet you. Your work will help maintain one of the world's largest information system infrastructures.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThis role involves physical data centre activities including capacity planning and tracking, rack deployment, cabling, hardware and software troubleshooting, and decommissioning.\u003cbr/\u003e\u003cbr/\u003eYou'll maintain system reliability by prioritising and resolving trouble tickets efficiently, serve as the escalation point and technical troubleshooter for all systems issues, and deep dive into Linux server problems.\u003cbr/\u003e\u003cbr/\u003eYou'll meet 24x7 on-call requirements during shift rotations, install and configure racks per internal SLAs, triage and resolve trouble tickets for all regional devices, and serve as a technical point of contact for high severity issues. \u003cbr/\u003e\u003cbr/\u003eThis position requires the ability to lift and rack equipment up to 20 kg, work in cramped spaces or elevated locations following health and safety guidelines.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"7780b583-1ab3-4049-b9f5-d58e9f96b45e","id_icims":"3154013","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3154013/data-center-operation-technician","job_schedule_type":"full-time","location":"AU, VIC, Melbourne","locations":["{\"normalizedStateName\":\"Victoria\",\"normalizedCountryCode\":\"AUS\",\"city\":\"Melbourne\",\"countryIso3a\":\"AUS\",\"countryIso2a\":\"AU\",\"locationNonStemming\":\"Australia, VIC, Melbourne\",\"coordinates\":\"-37.81736,144.96755\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Australia\",\"normalizedLocation\":\"Melbourne, Victoria, AUS\",\"location\":\"AU, VIC, Melbourne\",\"region\":\"VIC\",\"buildingCodeList\":[\"MEL12\"],\"normalizedCityName\":\"Melbourne\"}"],"normalized_location":"Melbourne, Victoria, AUS","optional_search_labels":["aws.adc-australia"],"posted_date":"January  7, 2026","preferred_qualifications":"- Experience working in a data center environment (racking and stacking gear, cable management, hot/cold aisle containment)\u003cbr/\u003e- Experience with Network Protocols: TCP/IP, Ethernet, L2/L3 technologies\u003cbr/\u003e- Experience using scripting languages, such as Python, Perl, Linux bash\u003cbr/\u003e\u003cbr/\u003eAcknowledgement of country:\u003cbr/\u003eIn the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.\u003cbr/\u003e\u003cbr/\u003eIDE statement:\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"VIC","title":"Data Center Operation Technician ","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3154013/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical, or 1+ years of data center or mission critical facilities (example: hospital, military facility, public safety facility, etc.) experience\u003cbr/\u003e- Degree or technical certification (Military or Trade school)\u003cbr/\u003e- Mechanical/HVAC/Electrical engineering or experience at technician level in a critical environment\u003cbr/\u003e- Valid and active Driver's Licence\u003cbr/\u003e- Ability to cover 24/7 shift rotations","business_category":"aws","city":"Melbourne","company_name":"Amazon Corporate Services Pty Ltd","country_code":"AUS","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eWe are looking for a Data Centre Engineering Operations Technician (EOT). Our EOT's are Amazon’s front line responders for hands-on electrical and mechanical equipment troubleshooting and operation. This equipment includes, but is not limited to, stand-by diesel generators, switchboards/switchgears, UPSs, PDUs, AHUs, pumps, motors, VFDs, and building automation systems. They provide 24/7 shift coverage which could include 12 hour shifts, rotating shifts, 3, 4, or 5 day work weeks.\u003cbr/\u003e\u003cbr/\u003eTo be eligible for this role you will need to hold or be able to attain an Australian Government Security Vetting Agency clearance (see https://www.agsva.gov.au/applicants/eligibility-and-suitability)\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Review  the management of both routine and corrective maintenance on a variety of  critical systems such as: switch gear, generators, UPS systems, power  distribution equipment, chillers, cooling towers, computer room air  handlers, building monitoring systems, etc.\u003cbr/\u003e- Establish  performance benchmarks, conduct analyses \u0026 prepare reports on all  aspects of the critical facility infrastructure operations \u0026  maintenance.\u003cbr/\u003e- Help  with the design, implementation, commissioning and build out of new  facilities.\u003cbr/\u003e- Create  and implement projects to increase current facility capacity, efficiency,  sustainability \u0026 reliability. \u003cbr/\u003e- Manage  the facility assets and the provision of infrastructure \u0026 inventory  asset management.\u003cbr/\u003e- Manage the on-site management of contractors, sub-contractors and vendors,  ensuring that all work performed, is observing established practices,  procedures \u0026 local legislation.\u003cbr/\u003e- Work  with other business leaders to coordinate projects, manage capacity, and optimise plant safety, performance, reliability, sustainability and  efficiency.· \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe are experiencing rapid growth, therefore your onboarding will be dynamic in nature, where you will gain diverse experience working in new and established AWS data centre's. These future Amazonians will rotate through various AWS locations to complete training as part of their onboarding to prepare for deployment in a data centre region. This training will be completed over a duration of 6-12 months. Once training is completed, individuals will be relocated to the permanent location.\u003cbr/\u003e\u003cbr/\u003eEngineering Operations Technicians support the data centre building and the critical equipment that keeps it running. This includes diesel power generators, HVAC and fire suppression systems. They’re responsible for the day-to-day operations and maintenance of the critical infrastructure, supervising specialist vendors, acting as first responders to incidents, and becoming subject matter experts for the facility.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"6014c913-da35-4d17-86a8-59e61652393d","id_icims":"3178448","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3178448/engineering-operations-technician","job_schedule_type":"full-time","location":"AU, VIC, Melbourne","locations":["{\"normalizedStateName\":\"Victoria\",\"normalizedCountryCode\":\"AUS\",\"city\":\"Melbourne\",\"countryIso3a\":\"AUS\",\"countryIso2a\":\"AU\",\"locationNonStemming\":\"Australia, VIC, Melbourne\",\"coordinates\":\"-37.81736,144.96755\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Australia\",\"normalizedLocation\":\"Melbourne, Victoria, AUS\",\"location\":\"AU, VIC, Melbourne\",\"region\":\"VIC\",\"buildingCodeList\":[\"MEL12\"],\"normalizedCityName\":\"Melbourne\"}"],"normalized_location":"Melbourne, Victoria, AUS","optional_search_labels":["aws.adc-australia"],"posted_date":"February 11, 2026","preferred_qualifications":"- Experience prioritizing and handling multiple assignments at any given time while maintaining commitment to deadlines\u003cbr/\u003e- Experience that includes strong analytical skills, attention to detail, and effective communication abilities\u003cbr/\u003e- Experience developing MOPs and SWMS for planned works\u003cbr/\u003e- Knowledge of concepts and interaction of service management systems (problem and change)\u003cbr/\u003e\u003cbr/\u003eAcknowledgement of country:\u003cbr/\u003eIn the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.\u003cbr/\u003e\u003cbr/\u003eIDE statement:\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"VIC","title":"Engineering Operations Technician","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3178448/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of program or project management experience\u003cbr/\u003e- Bachelor's degree in supply chain, business, engineering, finance or related technical or quantitative field\u003cbr/\u003e- Experience defining program requirements and using data and metrics to determine improvements\u003cbr/\u003e- Experience in English-language communication skills, both written and verbal","business_category":"fulfillment-and-operations","city":"Tokyo","company_name":"Amazon Japan G.K.","country_code":"JPN","description":"Central Operations (CO) is a team that explores new approaches and ways of working at Amazon Logistics, delivering scalable solutions for running increasingly complex and growing last-mile delivery networks. The CO is responsible for the critical processes of last mile delivery, such as Route planning, Scheduling and Forecasting, On Road Management, and has a vision to continually transform the way we do this in a scalable manner.\u003cbr/\u003e\u003cbr/\u003eWe are looking for Program Manager to join our team and drive improvements to the processes and technology used within Central Operations (CO). Program Manager must be able to excel and grow in a new team with high ambiguity. In this role, you will think big, develop original ideas, and directly influence and collaborate with the Transportation team, Last Mile Tech team, Operations, and business development teams to further expand Central Operations also responsible for developing strategic approaches.\u003cbr/\u003e\u003cbr/\u003eMore Information (Japanese Only)\u003cbr/\u003e・Department: Last Mile(AMZL)\u003cbr/\u003e・Job:Project Management\u003cbr/\u003e・Location:Tokyo Office\u003cbr/\u003e\u003cbr/\u003eAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected status. For individuals with disabilities who would like to request for support, please visit https://www.amazon.jobs/en/disability/jp.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Define the program (mission, vision, tenets), set objectives, analyze data, and drive improvements that are quantified with metrics\u003cbr/\u003e• Seek to understand business problems, automation limitations, scaling factors, boundary conditions and reasons behind leadership decisions\u003cbr/\u003e• Oversee gaps between teams, processes and systems\u003cbr/\u003e• Identify and mitigate risks (before they become roadblocks)\u003cbr/\u003e• Ensure critical path timelines are met, resource needs are understood and project prioritization is visible to senior leadership\u003cbr/\u003e• Work closely with operations, product teams and engineering teams to root cause and solve complex problems related to increasing capability and reliability of our systems\u003cbr/\u003e• Partnering with other analysts and BI engineers in planning and analytics to build analytical solutions to deliver on business goals\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Last Mile Execution team, to which the Central Operations (CO) belongs, is a very unique team consisting of three teams: Planning, Analytics, and Central Operations. This is a exciting team as we have a lot of cross-functional responsibility from planning to execution, but at the same time, each team's process design and changes require careful assessment. In this role, Program Manager will have the opportunity to experience the joy of working in a team, communicating and persevering to achieve results.","department_cost_center":null,"description_short":"Central Operations (CO) is a team that explores new approaches and ways of working at Amazon Logistics, delivering scalable solutions for running increasingly complex and growing last-mile delivery networks.","display_distance":null,"id":"f9e74a97-a0a0-4583-978e-08cab033bf04","id_icims":"3177470","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Program Management","job_function_id":null,"job_path":"/en/jobs/3177470/program-manager-central-operation","job_schedule_type":"full-time","location":"JP, 13, Tokyo","locations":["{\"normalizedStateName\":\"Tokyo\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Tokyo\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, 13, Tokyo\",\"coordinates\":\"35.68946,139.69172\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Tokyo, JPN\",\"location\":\"JP, 13, Tokyo\",\"region\":\"13\",\"buildingCodeList\":[\"HND21\"]}"],"normalized_location":"Tokyo, JPN","optional_search_labels":[],"posted_date":"February 10, 2026","preferred_qualifications":"- Experience implementing repeatable processes and driving automation or standardization\u003cbr/\u003e- Experience in data mining, data management, reporting, and SQL queries\u003cbr/\u003e- Speak, write, and read fluently in Japanese at a business level or above (N1+)\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-last-mile-delivery","source_system":"JobCreator","state":"13","title":"Program Manager,  Central Operation","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3177470/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-delivery","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team","business_category":"entertainment","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"Are you interested in shaping the future of movies and television? Do you want to define the next generation of how and what Amazon customers are watching? Prime Video is one of the leading digital video services on the Internet today, and we're at the forefront of delivering premium live content to millions of customers worldwide.\u003cbr/\u003eWe are seeking a talented Senior Software Development Engineer for our Live Streaming Playback team, which powers the critical encoding and packaging pipelines behind thousands of live TV channels and premium sports events globally. Our team is responsible for transforming raw video feeds into high-quality, adaptive streaming formats that deliver flawless viewing experiences across devices. From major sporting events like NFL Thursday Night Football and Premier League matches to 24/7 broadcast channels, our systems ensure millions of customers receive pristine video quality with minimal latency.\u003cbr/\u003eAs an Sr.SDE, you'll architect and implement large-scale automation workflows that manage the setup, orchestration, and lifecycle management of live infrastructure. You'll work with both established and greenfield AWS technologies, designing backend systems that handle real-time video processing at massive scale. Your work will directly impact the quality and reliability of live streams for premier content including 4K/HDR/Dolby Atmos broadcasts, while gaining deep expertise in Prime Video's sophisticated Live platform architecture.\u003cbr/\u003eThe ideal candidate is passionate about elegant software solutions and customer-centric products, with expertise in agile development methodologies. You'll approach challenges holistically, looking beyond team boundaries to create solutions that address strategic, business, and technical requirements. As a natural leader, you'll confidently coordinate cross-organizational initiatives, address complex technical questions, and foster collaborative outcomes. Your ability to analyze code critically and communicate effectively with executive stakeholders ensures our solutions remain reliable, scalable, and secure.\u003cbr/\u003eYou'll have an unprecedented opportunity to shape both customer and partner experiences through the design, architecture, and implementation of cutting-edge video processing pipelines used daily by millions. Your work will influence industry standards and push the boundaries of live video delivery. We're seeking individuals who combine technical excellence with a passion for innovation, demonstrate strong ownership, and want to make history while enjoying the journey.\u003cbr/\u003eWhat you'll do:\u003cbr/\u003eLead the design and implementation of robust encoding and packaging pipelines for live video delivery \u003cbr/\u003e•\tDrive technical excellence in video processing and streaming technologies Architect automation systems that scale to support major global sporting events and broadcast channels \u003cbr/\u003e•\tMentor and develop software engineers while fostering a culture of innovation Communicate complex technical solutions to diverse stakeholders effectively \u003cbr/\u003e•\tCollaborate with peer engineers to scope and estimate development efforts \u003cbr/\u003e•\tDesign solutions that ensure consistent high-quality video delivery across diverse network conditions Influence technical direction and adoption of industry standards in live video streaming \u003cbr/\u003e•\tDrive data-driven decisions with conviction and diplomatic finesse \u003cbr/\u003e•\tContribute to the evolution of Prime Video's global streaming infrastructure\u003cbr/\u003e\u003cbr/\u003eJoin us in revolutionizing how the world experiences live entertainment at unprecedented scale.\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Are you interested in shaping the future of movies and television? Do you want to define the next generation of how and what Amazon customers are watching? Prime Video is one of the leading digital video","display_distance":null,"id":"929c8b01-8567-43e5-9f36-2bbc1eec1506","id_icims":"3116658","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3116658/software-development-engineer-iii-prime-video-live-playback","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR18\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"October 28, 2025","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"entertainment.team-primevideo","source_system":"JobCreator","state":"KA","title":"Software Development Engineer III, Prime Video Live Playback","university_job":null,"updated_time":"23 minutes","url_next_step":"https://account.amazon.com/jobs/3116658/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-primevideo","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Currently enrolled in Bachelor's or Master's degree in Computer Science, Software Development, Machine Learning, Mathematics, or related majors\u003cbr/\u003e- Graduation date: November 2026 - July 2027\u003cbr/\u003e- Available for minimum 6-month internship\u003cbr/\u003e- Proficient in Java/Python/C++/JavaScript/TypeScript\u003cbr/\u003e- Solid foundation in algorithms and data structures\u003cbr/\u003e- Strong English reading and writing skills","business_category":"university","city":"Shanghai","company_name":"Amazon (China) Holding Company Limited","country_code":"CHN","description":"职位：SDE上海\u003cbr/\u003e· 毕业时间：2026年10月 - 2027年7月之间毕业的应届毕业生\u003cbr/\u003e· 入职日期：2026年5月及之前\u003cbr/\u003e· 实习时间：保证一周实习4-5天全职实习，至少持续6个月\u003cbr/\u003e· 工作地点：上海\u003cbr/\u003e\u003cbr/\u003e· 投递须知：\u003cbr/\u003e1 填写简历申请时，请把必填和非必填项都填写完整。提交简历之后就无法修改了哦！\u003cbr/\u003e2 学校的英文全称请准确填写。中英文对应表请查这里（无法浏览请登录后浏览）https://docs.qq.com/sheet/DVmdaa1BCV0RBbnlR?tab=BB08J2\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) OpenSearch team is recruiting engineering interns for multiple specializations. OpenSearch is an open-source search and data analysis suite designed to build solutions for data-intensive applications, featuring high-performance, developer-friendly tools with powerful machine learning and data processing capabilities. It provides flexible data exploration, enrichment, and visualization features to help customers discover valuable information from complex data\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eDuring this internship, you will have the opportunity to:\u003cbr/\u003e\u003cbr/\u003eSoftware Development\u003cbr/\u003e* Develop high-quality, secure, maintainable code using Java/Kotlin and React/TypeScript/JavaScript\u003cbr/\u003e* Design scalable, fault-tolerant distributed storage, indexing, and query systems\u003cbr/\u003e* Build distributed systems for high-speed, large-scale predictions\u003cbr/\u003e* Understand Lucene search engine principles and applications\u003cbr/\u003e\u003cbr/\u003eAI Integration\u003cbr/\u003e* Apply artificial intelligence and machine learning techniques to boost search relevancy and performance\u003cbr/\u003e* Contribute to our agent framework by advancing context management and skill service capabilities that enable automatic intelligent data analysis and optimize user interactions.\u003cbr/\u003e\u003cbr/\u003eDevelopment Lifecycle\u003cbr/\u003e* Practice product development, deployment, security review, and release processes\u003cbr/\u003e* Participate in requirement discussions and propose technical solutions\u003cbr/\u003e* Learn AWS cloud services\u003cbr/\u003e\u003cbr/\u003eCollaboration\u003cbr/\u003e* Work with global development teams on code development and review\u003cbr/\u003e* Collaborate with cross-disciplinary teams to design and launch innovative products\u003cbr/\u003e","department_cost_center":null,"description_short":"职位：SDE上海· 毕业时间：2026年10月 - 2027年7月之间毕业的应届毕业生· 入职日期：2026年5月及之前· 实习时间：保证一周实习4-5天全职实习，至少持续6个月· 工作地点：上海· 投递须知：1 填写简历申请时，请把必填和非必填项都填写完整。提交简历之后就无法修改了哦！2 学校的英文全称请准确填写。中英文对应表请查这里（无法浏览请登录后浏览）https://docs.qq.com/sheet/DVmdaa1BCV0RBbnlR?tab=BB08J2Amazon","display_distance":null,"id":"e093ae0a-a5e2-4b1b-abc6-2a4bc8c66bb1","id_icims":"3179483","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3179483/software-dev-engineer-intern-opensearch-2026-shanghai","job_schedule_type":"full-time","location":"CN, 31, Shanghai","locations":["{\"normalizedCountryCode\":\"CHN\",\"city\":\"Shanghai\",\"countryIso3a\":\"CHN\",\"countryIso2a\":\"CN\",\"locationNonStemming\":\"China, 31, Shanghai\",\"coordinates\":\"31.25516,121.4747\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"People's Republic of China\",\"normalizedLocation\":\"Shanghai, CHN\",\"location\":\"CN, 31, Shanghai\",\"region\":\"31\",\"buildingCodeList\":[\"SHA20\"],\"normalizedCityName\":\"Shanghai\"}"],"normalized_location":"Shanghai, CHN","optional_search_labels":[],"posted_date":"February 12, 2026","preferred_qualifications":"- Previous technical internship or project experience\u003cbr/\u003e- Experience with agent frameworks\u003cbr/\u003e- Experience with distributed systems, algorithms, and relational databases\u003cbr/\u003e- Experience in optimization mathematics (linear programming, nonlinear optimization)\u003cbr/\u003e- Verbal proficiency in English\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"university.team-intern-tech","source_system":"JobCreator","state":"31","title":"Software Dev Engineer Intern, OpenSearch, 2026 Shanghai","university_job":null,"updated_time":"28 minutes","url_next_step":"https://account.amazon.com/jobs/3179483/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-intern-tech","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of experience with Linux, using the command line and basic administration, and computer networking fundamentals\u003cbr/\u003e- 3+ Years of Operations experience working with CI/CD Pipelines and deployment systems like; Terraform, Github Actions, Jenkins, or others\u003cbr/\u003e- Able to troubleshoot at all levels, from network to operating systems to software applications\u003cbr/\u003e- 3+ Years working in Linux or other UNIX based Operating Systems\u003cbr/\u003e- Experience supporting cloud systems or other services. Proficient troubleshooting and anticipating problems that affect the performance, reliability, or availability of software systems","business_category":"aws","city":"Sydney","company_name":"Amazon Support Services Pty Ltd","country_code":"AUS","description":"Our Region Services team redefines the way AWS designs, builds, and operates AWS regions to enable new AWS Cloud Infrastructure and Services offerings to customers across every industry and of every size, including start-ups, enterprises, and public sector organizations. We are actively seeking experienced systems engineers with a strong background in cloud operations based in Melbourne or Sydney. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Define and/or refine hardware requirements, participate in the development and delivery of operability-related features such as system health monitoring, diagnostics, repair, and other self-healing automation\u003cbr/\u003e- Develop or further existing application and system management tools and processes that reduce manual efforts and increase overall efficiency\u003cbr/\u003e- Adapt and improve operations management systems and processes to accommodate rapid and increasing growth in systems and traffic\u003cbr/\u003e- Participate in the design and execution of production acceptance tests and new hardware evaluations\u003cbr/\u003e- Monitor the health of the fleet, automating system health, maintenance tasks, and reporting systems as needed\u003cbr/\u003e- Participate in “on-call” rotations to resolve incidents occurring out-of-hours.\u003cbr/\u003e\u003cbr/\u003eMust be an Australian Citizen and hold or be able to attain an Australian Government Security Vetting Agency clearance (see https://www1.defence.gov.au/security/clearances).\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eRegion Services provides the highest caliber Operational Solutions and Cleared Support for services within our Regions. We provide 'hands on keyboard' support to our service teams by deploying changes into these isolated regions, monitoring the results, and reporting any issues that are observed.\u003cbr/\u003e\u003cbr/\u003eAWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS, including support for customers who require specialised security solutions for their cloud services.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"Our Region Services team redefines the way AWS designs, builds, and operates AWS regions to enable new AWS Cloud Infrastructure and Services offerings to customers across every industry and of every size,","display_distance":null,"id":"39d3407c-ab43-41a3-88c9-070f44b1b468","id_icims":"3179480","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"System Planning/Administration","job_function_id":null,"job_path":"/en/jobs/3179480/systems-engineer-region-services","job_schedule_type":"full-time","location":"AU, NSW, Sydney","locations":["{\"normalizedStateName\":\"New South Wales\",\"normalizedCountryCode\":\"AUS\",\"city\":\"Sydney\",\"countryIso3a\":\"AUS\",\"countryIso2a\":\"AU\",\"locationNonStemming\":\"Australia, NSW, Sydney\",\"coordinates\":\"-33.87073,151.20788\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Australia\",\"normalizedLocation\":\"Sydney, New South Wales, AUS\",\"location\":\"AU, NSW, Sydney\",\"region\":\"NSW\",\"buildingCodeList\":[\"SYD12\"],\"normalizedCityName\":\"Sydney\"}"],"normalized_location":"Sydney, New South Wales, AUS","optional_search_labels":["aws.adc-australia","aws.team-utility-computing","aws.team-ais"],"posted_date":"February 12, 2026","preferred_qualifications":"- Experience operating 24x7 high-availability, distributed software applications and performance tuning software applications and optimizing fleet utilization\u003cbr/\u003e- Understanding of network fundamentals (DNS, DHCP, TCP/IP, routing, load balancing, load shedding) and experience with monitoring frameworks (such as CloudWatch, Datadog, Grafana, Elastic or similar)\u003cbr/\u003e- Experience scripting operating system tasks in Bash, Python, etc. and with Infrastructure as Code, (such as CDK, CloudFormation, Puppet, Chef, Ansible, or similar)\u003cbr/\u003e\u003cbr/\u003eAcknowledgement of country:\u003cbr/\u003eIn the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.\u003cbr/\u003e\u003cbr/\u003eIDE statement:\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-system-development-engineer-primary","source_system":"JobCreator","state":"NSW","title":"Systems Engineer, Region Services","university_job":null,"updated_time":"29 minutes","url_next_step":"https://account.amazon.com/jobs/3179480/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-system-development-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 7+ years of team management experience\u003cbr/\u003e- Bachelor's degree or equivalent\u003cbr/\u003e- •\t10+ years of program management experience in operations, business excellence, or related fields\u003cbr/\u003e- •\tProven track record of delivering large-scale, high-impact programs with measurable ROI\u003cbr/\u003e- •\tDeep knowledge of Lean Manufacturing concepts, value streams, and continuous improvement methodologies\u003cbr/\u003e- •\tExperience with data analysis, metrics-driven decision making, and impact measurement\u003cbr/\u003e- •\tStrong project management skills with ability to manage multiple complex initiatives simultaneously\u003cbr/\u003e- •\tExperience dealing with ambiguity, prioritizing needs, and delivering measurable results in agile environments\u003cbr/\u003e- •\tKnowledge of GenAI and commitment to continuous learning as GenAI evolves\u003cbr/\u003e- •\tDemonstrated ability to influence senior leaders and drive organizational change","business_category":"retail","city":"Bangalore","company_name":"ADCI - BLR 14 SEZ - F07","country_code":"IND","description":"Amazon's Retail Business Services (RBS) Business Excellence team is seeking an exceptional Senior Program Manager to lead the Value Excellence workstream. This role is critical in identifying high-impact underserved areas, creating proof of concepts, and driving programs that deliver extraordinary returns on investment for Amazon and our Selling Partners.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tLead the Value Excellence workstream to increase Orgs impact and ROI. Aggregate and analyze business metrics to identify opportunities for value creation and ROI improvement\u003cbr/\u003e•\tIdentify and prioritize high-impact, underserved defect areas across Amazon's ecosystem, and develop proof of concepts for upstream defect elimination.\u003cbr/\u003e•\tPartner with senior leaders across Business Units and external organizations to understand performance gaps and identify value creation opportunities\u003cbr/\u003e•\tBuild strong relationships with VP and Director-level stakeholders to secure buy-in for high-impact initiatives\u003cbr/\u003e•\tTranslate complex business problems into data-driven solutions with measurable outcomes\u003cbr/\u003e•\tFoster innovation by identifying and implementing systematic mechanisms that amplify value and ROI\u003cbr/\u003e•\tLead and develop a team of Program Managers , Subject Matter Experts, Business Analysts\u003cbr/\u003e•\tFoster a culture of excellence, continuous improvement, and innovation within the team\u003cbr/\u003e•\tMentor and develop team members to build organizational capability\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou'll start your day reviewing program metrics and identifying emerging opportunities for value creation. You'll partner with Amazon leaders to understand their most pressing challenges and translate them into actionable programs. You'll lead cross-functional meetings to drive alignment on high-impact initiatives, work with your team to develop proof of concepts, and present ROI analyses to senior leadership. You'll balance multiple programs simultaneously to reduce cost to serve, improve growth and Selling Partner experience. Throughout the day, you'll remove blockers, influence stakeholders, and ensure your programs are on track to deliver extraordinary returns.","department_cost_center":null,"description_short":"Amazon's Retail Business Services (RBS) Business Excellence team is seeking an exceptional Senior Program Manager to lead the Value Excellence workstream. This role is critical in identifying high-impact","display_distance":null,"id":"332c3ac8-7eed-4357-a89a-85037c902705","id_icims":"3153032","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Program Management","job_function_id":null,"job_path":"/en/jobs/3153032/senior-manager-value-excellence-retail-business-services","job_schedule_type":"full-time","location":"IN, KA, Bangalore","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bangalore\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bangalore\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bangalore\",\"region\":\"KA\",\"buildingCodeList\":[\"YSUI\",\"YESN\",\"WBL7\",\"YSUT\",\"TBR5\",\"FBLG\",\"QSAS\",\"QSAH\",\"ZSDS\",\"PBL4\",\"TBP8\",\"TBX7\",\"HBL6\",\"WBLB\",\"YSE5\",\"TBY2\",\"RSBM\",\"QSAL\",\"TBAA1\",\"QRRR\",\"YSUX\",\"TBS7\",\"YSF7\",\"WBLQ\",\"QSCT\",\"ZSEF\",\"RSBB\",\"RSO2\",\"QSBU\",\"BLR73\",\"TBW5\",\"BLU46\",\"WBLM\",\"YSE1\",\"BLU43\",\"HBL2\",\"WSAA\",\"YEYT\",\"FKPB\",\"YSFF\",\"RSAK\",\"TBS4\",\"BLR47\",\"YSIT\",\"YSUB\",\"TBY6\",\"ZSE8\",\"WBLI\",\"HBB42\",\"RSA4\",\"DPYN\",\"WBLT\",\"FBLO\",\"QSAD\",\"FBLN\",\"BLT01\",\"ZSEC\",\"TBS3\",\"UBL9\",\"TBR2\",\"IRYI\",\"QSAE\",\"YSYR\",\"TBY5\",\"BLR32\",\"TBP5\",\"YSYJ\",\"QSAP\",\"HBL3\",\"BLU47\",\"YESJ\",\"UBLE\",\"YSFM\",\"YSUL\",\"BLR81\",\"YSL2\",\"WBAA\",\"BLR48\",\"PNR3\",\"YSYK\",\"BLU42\",\"QSBV\",\"WBA6\",\"YEYS\",\"WBA5\",\"MYQ2\",\"QSHS\",\"HBB91\",\"BLR52\",\"RSBL\",\"BLU80\",\"TBT2\",\"UBL2\",\"YESC\",\"WBLU\",\"TBP4\",\"TBR6\",\"TBN1\",\"TBW4\",\"BLR53\",\"KSZB\",\"YSE6\",\"YSUJ\",\"PBL5\",\"QSBB\",\"WBL6\",\"SBLD\",\"FBLH\",\"WBLC\",\"BLU49\",\"UBL3\",\"FBLJ\",\"YSIS\",\"YESD\",\"XSAA\",\"TBR4\",\"YSNZ\",\"YESM\",\"WBLE\",\"HSS40\",\"WBLN\",\"TBW6\",\"KEZM\",\"YESK\",\"QSAX\",\"YSUQ\",\"BLR57\",\"RSBN\",\"BLR88\",\"TBT1\",\"TBR8\",\"HBE5\",\"TBN3\",\"WBA1\",\"YSDY\",\"YZZ3\",\"YSUH\",\"SBLZ\",\"YZZ6\",\"WBL2\",\"FBLL\",\"BRU92\",\"YSUO\",\"TBQ8\",\"TBW9\",\"TBX2\",\"YZZK\",\"WBA3\",\"QSAZ\",\"BLR93\",\"TBR1\",\"KERX\",\"YSL6\",\"WBLS\",\"QSAN\",\"TBX4\",\"BLT4\",\"TBT6\",\"QSAB\",\"ZSEA\",\"TBY9\",\"YEWD\",\"ZSDT\",\"WBL4\",\"WBLL\",\"HBB40\",\"YSE3\",\"YSIU\",\"TBS6\",\"YSF8\",\"KELI\",\"YSUV\",\"UBL41\",\"BLR4\",\"RSBI\",\"FBL2\",\"XBLB\",\"BRU46\",\"YESF\",\"YEW8\",\"YSYT\",\"UBL5\",\"TBC7\",\"YEXP\",\"TBN8\",\"BRU91\",\"QSAU\",\"QSBA\",\"BLR54\",\"RSBK\",\"XSBZ\",\"PKHS\",\"TBX9\",\"YEW0\",\"YSIR\",\"YSFD\",\"BLX2\",\"QSCG\",\"BLU41\",\"YESP\",\"TBR7\",\"KELQ\",\"FBL3\",\"BLR83\",\"TBW3\",\"ZSEH\",\"YESE\",\"QSMU\",\"MYQ1\",\"BLR50\",\"RSBG\",\"TBX5\",\"ZSDU\",\"TBP6\",\"YSYL\",\"TBY4\",\"QSBE\",\"SBLA\",\"RSA6\",\"RSA3\",\"WBLD\",\"YZZB\",\"BLR262\",\"WBL5\",\"FBLI\",\"YSL4\",\"BLU91\",\"WBA7\",\"BLR8\",\"BLR257\",\"YSDZ\",\"WBL1\",\"UBLC\",\"ZSED\",\"TBP3\",\"YSUN\",\"ZSE9\",\"UBL7\",\"TBY7\",\"SMA3\",\"YESH\",\"HBB43\",\"YSE0\",\"WBLV\",\"FBLM\",\"KEZ4\",\"TBQ9\",\"YEW4\",\"WBLH\",\"BRD40\",\"BLR80\",\"ZSEE\",\"BLR91\",\"YSF6\",\"TBX1\",\"BLR87\",\"QSBP\",\"BLU48\",\"TBS2\",\"TBW7\",\"YEYR\",\"YSYE\",\"YSL3\",\"BLROTH\",\"QSAQ\",\"WBAB\",\"HBL4\",\"BLR49\",\"YSUG\",\"BLNX\",\"XSAB\",\"TBX6\",\"FKPC\",\"YSUS\",\"YESO\",\"YSF5\",\"TBS9\",\"YEXA\",\"BLR58\",\"YESI\",\"BLR7\",\"KSLD\",\"BLR33\",\"QSBD\",\"PBL3\",\"UBL8\",\"TBR3\",\"YEXS\",\"BLR84\",\"BNG93\",\"TBT3\",\"FKPA\",\"YSFE\",\"YSO0\",\"RSBJ\",\"YESB\",\"TBX8\",\"YSUU\",\"TBP9\",\"TBY1\",\"QSAT\",\"KSLP\",\"WBM1\",\"WBLP\",\"QSAK\",\"WBLY\",\"BLR72\",\"YSYD\",\"BLR86\",\"XSAJ\",\"QSAR\",\"BLR5\",\"TBZ1\",\"RSBA\",\"KSLL\",\"YEY5\",\"BLR51\",\"QSDH\",\"QRRS\",\"YZZT\",\"RSBH\",\"TBW8\",\"WBA4\",\"ZSIJ\",\"HBL5\",\"BLU40\",\"YSE4\",\"BLR82\",\"BLR999\",\"FBLF\",\"YEYQ\",\"BLR41\",\"YSL5\",\"BLR92\",\"BLU45\",\"PNLE\",\"UBLZ\",\"IRXF\",\"TBA11\",\"SBLT\",\"BLR46\",\"TBX3\",\"WBA2\",\"TBQ7\",\"QSBR\",\"YSUD\",\"UBL6\",\"PBL1\",\"BLU88\",\"TBP2\",\"HBB41\",\"TBN9\",\"ZSEB\",\"BLU93\",\"TBY8\",\"SMA4\",\"BLT02\",\"HBM7\",\"WBLK\",\"YESG\",\"YSYG\",\"QSAY\",\"FBLP\",\"TBY3\",\"WBLF\",\"BLR140\",\"ZSEG\",\"YSDX\",\"QSAM\",\"RSA7\",\"BLR263\",\"BLX1\",\"RSAJ\",\"FBLK\",\"BLT3\",\"RSBO\",\"YSNY\",\"YESL\",\"BLR74\",\"TBT5\",\"TBN2\",\"BRU40\",\"BLR200\",\"WBLR\",\"SBLC\",\"TBP7\"],\"normalizedCityName\":\"Bengaluru\"}","{\"normalizedStateName\":\"Tamil Nadu\",\"normalizedCountryCode\":\"IND\",\"city\":\"Chennai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TN, Chennai\",\"coordinates\":\"13.08404,80.28274\",\"normalizedCountyName\":\"Chennai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Chennai, Tamil Nadu, IND\",\"location\":\"IN, TN, Chennai\",\"region\":\"TN\",\"buildingCodeList\":[\"TCI2\",\"MAA2\",\"YSFC\",\"MAA200\",\"SMAA\",\"MAA10\",\"HBC93\",\"MAA55\",\"TCG5\",\"TCJ8\",\"TCA3\",\"IRXA\",\"TCD6\",\"MAA43\",\"TCC4\",\"RSBF\",\"UIXS\",\"TCB5\",\"MAA140\",\"TCF3\",\"MAA84\",\"TCJ4\",\"YZZI\",\"QSN1\",\"TCH4\",\"SMAS\",\"HBC40\",\"TCC7\",\"SMAT\",\"TCH3\",\"MAAO\",\"ZSE5\",\"TCB1\",\"YSFK\",\"TCG9\",\"TCE4\",\"YSYO\",\"TCE5\",\"PMA5\",\"PMQF\",\"PIXR\",\"QSDA\",\"TCB6\",\"TCI9\",\"MAA54\",\"TCE9\",\"MAA23\",\"MAA99\",\"ZSE0\",\"MAA71\",\"UMA93\",\"SUTH\",\"TCJ5\",\"TCF2\",\"MAA56\",\"TCE7\",\"TCI5\",\"FTPA\",\"PMA1\",\"YEXF\",\"IRCB\",\"TCD7\",\"TCG2\",\"ZSE4\",\"TCF9\",\"TCJ7\",\"MAA81\",\"MAA11\",\"FMAA\",\"TCF7\",\"VOMM\",\"MAA46\",\"TCI7\",\"XSAC\",\"TCE2\",\"TCB2\",\"HSCC\",\"TCB4\",\"UMA8\",\"MAA48\",\"TCD9\",\"MAA51\",\"TCC9\",\"UMAD\",\"QSO2\",\"TCH7\",\"TCD2\",\"PIXU\",\"YSIY\",\"KEL40\",\"TCG7\",\"MAA41\",\"TCB9\",\"QSN9\",\"PNOH\",\"UMAS\",\"QSAG\",\"TCF1\",\"TCJ6\",\"TCD4\",\"MAA400\",\"TCH9\",\"HMAA\",\"YSYM\",\"TCC2\",\"TCB7\",\"SMAC\",\"MAT1\",\"UMA2\",\"TCG3\",\"MAA53\",\"UIXU\",\"TCE6\",\"QSAV\",\"YZZR\",\"TCK1\",\"UMA9\",\"XINC\",\"TCI4\",\"QSLE\",\"TCH5\",\"TCH2\",\"TCI8\",\"MAA15\",\"ZSE6\",\"UMAA\",\"MAA8\",\"MAA252\",\"TCC6\",\"MAA16\",\"YZZ1\",\"MAA251\",\"MAA7\",\"UMAL\",\"TCC5\",\"YSIW\",\"TCF5\",\"MAA45\",\"FMAC\",\"UIXR\",\"PIXS\",\"KERS\",\"TCJ9\",\"TCF4\",\"TCJ3\",\"TCJ2\",\"MAA82\",\"TCG4\",\"MAA44\",\"YSUW\",\"IRDV\",\"TCI3\",\"MAA98\",\"HCI4\",\"YEY6\",\"TCB8\",\"MAA85\",\"MAA40\",\"TCD5\",\"IRYO\",\"UIXV\",\"TCI1\",\"MAD41\",\"TCD3\",\"IRDW\",\"MAA83\",\"TCG6\",\"MAA49\",\"IRXT\",\"MAA52\",\"RSBE\",\"HMA1\",\"TCD1\",\"TCG8\",\"TCH8\",\"TCA8\",\"FMAB\",\"TCF6\",\"MAA87\",\"TCJ1\",\"HCI2\",\"TCE3\",\"YSFI\",\"RSB6\",\"PTMG\",\"TCC8\",\"SMAF\",\"MAA80\",\"TCE1\",\"TCF8\",\"MAA50\",\"PIXV\",\"MAA12\",\"SMAK\",\"TCD8\",\"MAA255\",\"PMMK\",\"QSO3\",\"IRXC\",\"MAAY\",\"TCC3\",\"TCH6\",\"TCG1\",\"MAA47\",\"UMA7\",\"MAA22\",\"TCE8\",\"TCB3\",\"XSIQ\",\"TCI6\",\"MAT2\"],\"normalizedCityName\":\"Chennai\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"January  6, 2026","preferred_qualifications":"- Experience implementing repeatable processes and driving automation or standardization\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"retail.no-team-listed","source_system":"JobCreator","state":"KA","title":"Senior Manager - Value Excellence , Retail Business Services","university_job":null,"updated_time":"29 minutes","url_next_step":"https://account.amazon.com/jobs/3153032/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent\u003cbr/\u003e- 5+ years of Human Resources Business Partner or HR Generalist experience.\u003cbr/\u003e- 2+ years of experience in Talent Management\u003cbr/\u003e- 2+ years of experience in operations environment (call center, distribution center, or manufacturing) supporting hourly employee client groups\u003cbr/\u003e- Proficiency with HR Information Systems\u003cbr/\u003e- Advanced proficiency in English (written and verbal)\u003cbr/\u003e- Full proficiency in Spanish (written and verbal)\u003cbr/\u003e- Knowledge of local labor law and legislation","business_category":"global-corporate","city":"Tepotzotlán","company_name":"Servicios Comerciales Amazon Mexico S. de R.L. de C.V.","country_code":"MEX","description":"The HRBP provides support to Fulfillment Center Operations team by partnering with senior stakeholders on the MEX5 site. This role manages projects independently, serving as a strategic partner to leadership in driving business results through effective people strategies.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eCompany Culture Steward\u003cbr/\u003eThe HRBP applies understanding of Leadership Principles and values when consulting with employees and managers on matters such as performance improvement, coaching plans, team meetings, employee development and promotions. This role initiates and supports client groups or site leadership (including multiple site leadership teams) to develop and strengthen the culture for that site or business unit.\u003cbr/\u003e\u003cbr/\u003eOrganization Development \u0026 Planning\u003cbr/\u003eThe HRBP understands key business goals and priorities, applying them to core areas of HR responsibilities to effectively prioritize work and set strategic goals. This role provides valuable input into organizational design discussions, including information about talent for succession planning and attrition risks. The HRBP implements communication plans for organizational changes, ensuring smooth transitions and stakeholder alignment.\u003cbr/\u003e\u003cbr/\u003eOrganization Health\u003cbr/\u003eThe HRBP conducts diagnostics to identify trends and environmental employee relations or workplace issues, communicating findings to leadership. This role partners with management to drive positive employee relations or negotiation of works council or labor agreements. The HRBP proactively monitors and acts to address employee relations or labor changes for the operation, implementing components of strategy and action plans that address workplace environment, employee engagement, or retention issues. The HRBP leads client group or site engagement activities and audits to monitor organizational health and engage with employees and associates.\u003cbr/\u003e\u003cbr/\u003eTalent Management \u0026 Development\u003cbr/\u003eThe HRBP facilitates or assists multiple department or group level talent discussions, driving identification and management of forward-looking promotions for managers. This role coaches and develops business and site leadership on performance and talent management with the business teams. The HRBP identifies participants for programs and manages internal communications related to training and development, partnering with leaders on talent development initiatives.\u003cbr/\u003e\u003cbr/\u003eHR Operations\u003cbr/\u003eThe HRBP analyzes data and shares insights with leaders, training and consulting with managers on employee life cycle issues. This role utilizes Connections data and provides ideas and strategies for how to improve engagement and manager capability. The HRBP is able to speak to attendance, attrition, and staffing trends, identifying gaps in policy and services and making recommendations for system process improvement. The HRBP may draft and maintain policies for the site, rolls out new policy changes and services, and ensures business adoption and understanding of changes. This role may recommend exceptions to policies with input from senior leaders or HR management.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eInclusive team culture \u003cbr/\u003eAt Amazon we embrace our differences and we are committed to furthering our culture of inclusion. We host annual and ongoing learning experiences. Amazon’s culture of inclusion is reinforced within our 14 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.\u003cbr/\u003e \u003cbr/\u003eWork Life Balance \u003cbr/\u003eWe believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfillment. We offer flexibility in working hours and encourage you to find your own balance between your work and personal lives.\u003cbr/\u003e \u003cbr/\u003eMentorship \u0026 Career Growth \u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded professional.","department_cost_center":null,"description_short":"The HRBP provides support to Fulfillment Center Operations team by partnering with senior stakeholders on the MEX5 site. This role manages projects independently, serving as a strategic partner to leadership","display_distance":null,"id":"bd9eac68-ccae-48d8-8809-5601ce25872a","id_icims":"3179481","is_intern":null,"is_manager":null,"job_category":"Human Resources","job_family":"Human Resources","job_function_id":null,"job_path":"/en/jobs/3179481/human-resources-business-partner","job_schedule_type":"full-time","location":"MX, MEX, Tepotzotlán","locations":["{\"normalizedStateName\":\"Mexico\",\"normalizedCountryCode\":\"MEX\",\"city\":\"Tepotzotlán\",\"countryIso3a\":\"MEX\",\"countryIso2a\":\"MX\",\"locationNonStemming\":\"Mexico, MEX, Tepotzotlán\",\"coordinates\":\"19.71323,-99.2196\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Mexico\",\"normalizedLocation\":\"Tepotzotlán, Mexico, MEX\",\"location\":\"MX, MEX, Tepotzotlán\",\"region\":\"MEX\",\"buildingCodeList\":[\"MEX5\"],\"normalizedCityName\":\"Tepotzotlán\"}"],"normalized_location":"Tepotzotlán, Mexico, MEX","optional_search_labels":["ops.lander-mexico","mx-stores"],"posted_date":"February 12, 2026","preferred_qualifications":"- Master's degree or MBA in Human Resources Management\u003cbr/\u003e- Proficiency with MS Office tools\u003cbr/\u003e- Experience working with unions (particularly relevant for Mexico operations)\u003cbr/\u003e- Experience in human resources with companies supporting 250-500 or more associates\u003cbr/\u003e- Exceptional analytical skills, comfortable working with large amounts of data and communicating data findings\u003cbr/\u003e- Strong problem-solving capability and analytical skills; demonstrates root cause analysis; acts decisively, promptly and confidently\u003cbr/\u003e- Successful record of building and improving operational processes and procedures, ability to drive program efficiency and high levels of customer satisfaction\u003cbr/\u003e- Proven ability to prioritize, meet deadlines, and make best use of limited resources\u003cbr/\u003e- Experience in Workforce Staffing\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"global-corporate.team-hr-for-hr","source_system":"JobCreator","state":"MEX","title":"Human Resources Business Partner","university_job":null,"updated_time":"31 minutes","url_next_step":"https://account.amazon.com/jobs/3179481/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-hr-for-hr","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Penultimate year student working towards a Bachelor’s degree\u003cbr/\u003e- Able to commit to a 6-months full-time internship from Jan - Jun 2026\u003cbr/\u003e- Expected graduation from Dec 2026 to Aug 2027\u003cbr/\u003e- Candidates must be able to legally work in Singapore\u003cbr/\u003e- Excellent English written and verbal communication skills","business_category":"studentprograms","city":"Singapore","company_name":"Amazon Web Services Singapore Private Limited","country_code":"SGP","description":"This is a 6-months full-time internship opportunity in 2026 July-December. \u003cbr/\u003e*2026 January–June internship program is no longer available. Please ingnore the Basic qualification line - Able to commit to a 6-months full-time internship from 2026 Jan - Jun\u003cbr/\u003e\u003cbr/\u003e*Applicants to this internship opportunity will need the work authorization for Singapore*\u003cbr/\u003e\u003cbr/\u003eAt Amazon, we are working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is continually evolving and is a place where motivated employees thrive and also where employee ownership and accountability lead to meaningful results.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform, offering over 200 fully featured services from data centers globally. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—are using AWS to lower costs, become more agile, and innovate faster.\u003cbr/\u003e\u003cbr/\u003eAmazon is a place where builders can build. Our internships offer exceptional opportunities for you to grow your technical and non-technical skills. From day one, you will be working with experienced colleagues who love what they do.\u003cbr/\u003e\u003cbr/\u003eAWS is looking to hire and develop the next generation of leaders for our organization. We are seeking talented and enthusiastic students who are passionate about solving business problems, innovating and building new processes, and leading high-impact initiatives. Gain exposure to the AWS business and our unique Amazonian culture through a rewarding learning experience. For this internship (6 months), interns will be based in our Singapore office, and will be assigned to our ASEAN Cloud Sales Center (CSC) function.\u003cbr/\u003e\u003cbr/\u003eThe CSC is the Inside Sales organization of AWS and is focused on new customer acquisitions across ASEAN at scale. You will have the exciting opportunity to work cross-functionally and cross-geographically, as you collaborate with internal stakeholders across sales, operations, partner, and marketing teams, while being part of an entirely new concept at AWS.\u003cbr/\u003e\u003cbr/\u003eAs an intern, experience what it is like as a Demand Generation Rep here at AWS. You will have the exciting opportunity to help promote the growth and shape the future of an emerging technology in this region. You will be the frontline for our customers in their new/early stage of cloud adoption, and connect their key stakeholders to AWS. You will actively identify and hunt key decision makers from target customers and leverage lead sources from various AWS marketing, sales, and external databases and help the customers start their transformational journey. You will profile, nurture and qualify customer leads by understanding their business issues and proposing solutions to their problems with AWS services. You will also complete a sales-related project which would benefit customers and Partners, while gaining and leveraging exposure to cloud services.\u003cbr/\u003e\u003cbr/\u003eAre you ready to embrace the challenge? Come build the future with us.\u003cbr/\u003e\u003cbr/\u003eWho are we looking for?\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate:\u003cbr/\u003e\u003cbr/\u003e* Has interest and aptitude to learn about the cloud, is curious to learn and has a ‘can-do’ attitude with strong ownership\u003cbr/\u003e* Is able to work independently and as part of a team in a fast-paced and dynamic environment\u003cbr/\u003e* Adept at problem-solving, and can come up with creative and innovative solutions\u003cbr/\u003e* Results driven with analytical capability to provide data-driven insights\u003cbr/\u003e* Able to handle competing stakeholder requests\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003e* Acquire new customer contacts, earn trust and engage with customers mainly through calls\u003cbr/\u003e* Qualify and create a sales funnel of opportunities and track in CRM (Salesforce)\u003cbr/\u003e* Educate customers on AWS products/services \u0026 evangelize key wins\u003cbr/\u003e* Collaborate with Cloud Sales Representatives (CSR) and Solution Architects (SA)\u003cbr/\u003e* Collaborate with partners to extend reach \u0026 drive adoption\u003cbr/\u003e* Evangelize customer success stories\u003cbr/\u003e\u003cbr/\u003eFor this role, you will require:\u003cbr/\u003e\u003cbr/\u003e* Ability to profile customers from various internal/external sources to attain key business contacts\u003cbr/\u003e* Ability to listen to customers, understand needs, and ask clarifying/probing questions to qualify opportunities\u003cbr/\u003e* Ability to think logically and structure answers, and ability to deal with ambiguity\u003cbr/\u003e* Openness and ability to learn sales automation tools (e.g. Salesforce, LinkedIn Sales Navigator) and processes\u003cbr/\u003e\u003cbr/\u003e#auta-sg","department_cost_center":null,"description_short":"This is a 6-months full-time internship opportunity in 2026 July-December. *2026 January–June internship program is no longer available. Please ingnore the Basic qualification line - Able to commit to","display_distance":null,"id":"6a8fdd3c-6d29-4a92-a5ce-3c7b3a0c5da8","id_icims":"3125227","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Tech Sales","job_function_id":null,"job_path":"/en/jobs/3125227/demand-generation-rep-intern-philippines-market","job_schedule_type":"full-time","location":"SG, Singapore","locations":["{\"normalizedCountryCode\":\"SGP\",\"city\":\"Singapore\",\"countryIso3a\":\"SGP\",\"countryIso2a\":\"SG\",\"locationNonStemming\":\"Singapore, Singapore\",\"coordinates\":\"1.29087,103.85238\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Singapore\",\"normalizedLocation\":\"SGP\",\"location\":\"SG, Singapore\",\"region\":\"\",\"buildingCodeList\":[\"SIN18\"]}"],"normalized_location":"SGP","optional_search_labels":["aws.team-wisner-interns-optional"],"posted_date":"November 12, 2025","preferred_qualifications":"- Professional fluency in Tagalog is highly preferred\u003cbr/\u003e- Effective writing and speaking communication skills to engage with customers (through emails, phone calls, etc.) and internal stakeholders/other teams.\u003cbr/\u003e- Strong analytical and quantitative skills, with the ability to use Excel to provide data, and present recommendations and insights from that data.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"studentprograms.team-internships-for-students","source_system":"JobCreator","state":null,"title":"Demand Generation Rep Intern - Philippines market","university_job":null,"updated_time":"41 minutes","url_next_step":"https://account.amazon.com/jobs/3125227/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-internships-for-students","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- 1+ years of Microsoft Office products and applications experience\u003cbr/\u003e- 1+ years of using a computer maintenance management system in planning, scheduling and auditing overall facilities/maintenance activities experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- Travel up to 15% of the time","business_category":"operations","city":"Byhalia","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our Reliability \u0026 Maintenance Engineering (RME) team is integral to the success of Amazon worldwide. They manage risks, minimize system downtime, and find innovative ways to improve the way we work. It’s how we’ll become a more sustainable business while building the future one innovative product, service, and idea at a time. \u003cbr/\u003e\u003cbr/\u003eThe Reliability Maintenance Planner / Scheduler will be a member of the Reliability Maintenance and Engineering team and will work with network the Enterprise Asset Management (EAM) team as well as the Reliability Manager to maximize material handling equipment uptime for Operations associates.\u003cbr/\u003e\u003cbr/\u003eThis position is responsible for developing maintenance plans and schedules based on recurring preventive maintenance activities, predictive maintenance data and KPIs. Key activities for this position include screening EAM work orders, auditing equipment to document work requirements and quality, estimate labor hours, materials, tools and equipment for all assigned work orders to support a proactive, reliability-centered maintenance (RCM) program. This role will work closely with Maintenance management, Maintenance Technicians, Control Systems Technicians and Operations teams to plan, coordinate and schedule proactive maintenance activities during available downtime windows. This will help prevent unplanned downtime of material handling equipment and disruption to production activities. The Reliability Maintenance Planner / Scheduler will have a strong focus on Amazon’s leadership principles of Innovation, Bias for Action and Ownership of their maintenance program.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey Responsibilities include, but are not limited to\u003cbr/\u003e- Responsible for screening work orders, identification of scope, analysis of required level of planning and overall scheduling of maintenance activities given available resources, criticality of work, and available maintenance windows\u003cbr/\u003e- Perform equipment quality audits to identify and document job requirement\u003cbr/\u003e- Identify specific safety hazards associated with planned maintenance activities\u003cbr/\u003e- Estimate required work hours associated with work order tasks and total work duration\u003cbr/\u003e- Plan parts and materials for reliability improvement projects in order to maximize technician wrench time, improve efficiency, increase system reliability and performance\u003cbr/\u003e- Ensure all work orders and maintenance activities are derived from EAM and accurately closed out in the system in accordance with Amazon’s maintenance virtuous cycle\u003cbr/\u003e- Compile equipment information into a job package that is ready for technicians to accomplish each shift; clearly communicate the critical steps in the work process\u003cbr/\u003e- Collect necessary engineering drawings, technical documents and specifications\u003cbr/\u003e- Analyze equipment downtime data and develop \u0026 manage a warranty process that will drive OEM uptime and lower cost\u003cbr/\u003e- Drive a proactive maintenance program that ensure 85% of planned work is proactive\u003cbr/\u003e- Partner with local Reliability Maintenance and Engineering leadership groups to coordinate maintenance activities in support of driving a World Class Maintenance organization\u003cbr/\u003e- Own and regularly respond with subject matter expertise to maintenance/equipment related questions, own access to and distribution of OEM technical bulletin updates, and facilitate strong communication with OEM vendors\u003cbr/\u003e- Communicates with Maintenance Managers, Technicians and Control Systems Technicians regarding ideas and procedures that will enhance and optimize future work activities","department_cost_center":null,"description_short":"Our Reliability \u0026 Maintenance Engineering (RME) team is integral to the success of Amazon worldwide. They manage risks, minimize system downtime, and find innovative ways to improve the way we work. It’s","display_distance":null,"id":"ff20a591-3ae0-41ed-8800-c7b2f80f3270","id_icims":"3113068","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3113068/rme-planner-scheduler","job_schedule_type":"full-time","location":"US, MS, Byhalia","locations":["{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Byhalia\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Byhalia\",\"coordinates\":\"34.8696,-89.68864\",\"normalizedCountyName\":\"Marshall\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Byhalia, Mississippi, USA\",\"location\":\"US, MS, Byhalia\",\"region\":\"MS\",\"buildingCodeList\":[\"OLV1\"],\"normalizedCityName\":\"Byhalia\"}"],"normalized_location":"Byhalia, Mississippi, USA","optional_search_labels":["operations.team-reliability-maintenance-engineering-na"],"posted_date":"October 21, 2025","preferred_qualifications":"- 2+ years of maintenance planner/scheduler working within an industrial maintenance complex, manufacturing/distribution industries, or equivalent experience\u003cbr/\u003e- Experience in material handling systems (MHS) installation, operation and maintenance\u003cbr/\u003e- Subject matter expert (SME) level knowledge of CMMS use (preferably EAM)\u003cbr/\u003e- Certified on infrared thermal imaging, ultrasound and other predictive technologies Amazon is committed to a diverse and inclusive workplace.\u003cbr/\u003e- 4+ years’ working experience working with enterprise asset management software suit. Infor EAM ASE is highly desired.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $54,900/year in our lowest geographic market up to $94,900/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"operations.team-reliability-maintenance-engineering","source_system":"JobCreator","state":"MS","title":" RME Planner/Scheduler","university_job":null,"updated_time":"43 minutes","url_next_step":"https://account.amazon.com/jobs/3113068/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-reliability-maintenance-engineering","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}