{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 3+ years of technical support, or 3+ years of software development experience\u003cbr/\u003e- Experience troubleshooting and debugging technical systems\u003cbr/\u003e- Experience developing operational processes and technologies\u003cbr/\u003e- Experience developing customer relationships and influencing key decision-makers\u003cbr/\u003e- Experience of live streaming or in a similar live production environment\u003cbr/\u003e- Knowledge of streaming video pipelines and technologies, including encoding hardware/software video delivery, acquisition, codecs, adaptive bit rate video playback, and common streaming protocols\u003cbr/\u003e- Proven ability to troubleshoot and identify the root cause of issues, you're a natural problem solver!\u003cbr/\u003e- Fundamental knowledge of AWS\u003cbr/\u003e- Basic knowledge of networking systems and hardware installation, including server and switch configuration","business_category":"entertainment","city":"Hyderabad","company_name":"ADCI - Karnataka","country_code":"IND","description":"Come build the future of entertainment with us. Are you interested in shaping the future of movies and television? Do you want to define the next generation of how and what Amazon customers are watching?\u003cbr/\u003e\u003cbr/\u003ePrime Video is a premium streaming service that offers customers a vast collection of TV shows, movies and live events - all with the ease of finding what they love to watch in one place. We offer customers thousands of popular movies and TV shows including Amazon Originals and exclusive licensed content to exciting live sports events. We also offer our members the opportunity to subscribe to add-on channels which they can cancel at anytime and to rent or buy new release movies and TV box sets on the Prime Video Store. Prime Video is a fast-paced, growth business - available in over 240 countries and territories worldwide. The team works in a dynamic environment where innovating on behalf of our customers is at the heart of everything we do. If this sounds exciting to you, please read on.\u003cbr/\u003e\u003cbr/\u003eThe Live Operations Event Support team are seeking Support Engineers are seeking Support Engineers to own the operation and end-to-end monitoring of linear TV on Prime Video. The role involves working with internal and external partners to ensure the video signal from partners is received from the various venues, routed through our encoding/packaging infrastructure and successfully delivered to customer devices. We use tools and consumer devices in fully-equipped operations centers to monitor every stage of the signal path. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eExecute multiple live streaming events concurrently, ensuring our customers have the highest quality experience\u003cbr/\u003e\u003cbr/\u003eMake in-room decisions, organising tasks between service partners, and directing other support engineers working on live events. \u003cbr/\u003e\u003cbr/\u003eWork with peers and other teams on high-severity, active support issues, prioritising mitigation while investigating root-cause fixes\u003cbr/\u003e\u003cbr/\u003eDeliver reports to senior leadership\u003cbr/\u003e\u003cbr/\u003eProvide on-call support and act as point of escalation for high-severity issues\u003cbr/\u003e\u003cbr/\u003eAid in the development and testing of operational tools that improve efficiency through automation\u003cbr/\u003e\u003cbr/\u003eOwnership of one or more systems or tools\u003cbr/\u003e\u003cbr/\u003eCustomer notification and workflow co-ordination with follow-up to maintain service level agreements\u003cbr/\u003e\u003cbr/\u003eCreating and maintaining team specific knowledge-base articles and operational and training documentation\u003cbr/\u003e\u003cbr/\u003eAssist in the training of new support staff as the team grows\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThe Linear Ops team monitor playback continuously using automation along with more traditional forms of broadcast monitoring. Should an issue arise Amazon has a highly skilled global team of engineers and developers whom our support engineers work with to quickly mitigate and resolve any issues, to prevent disruption to customers.\u003cbr/\u003e\u003cbr/\u003eSupport engineers collate any relevant data points and communicate these out to stakeholders. Due to the nature of linear TV there will be occasional weekend shifts as well as varying hours,\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur role is to monitor and mitigate on behalf of the customer 24x7.\u003cbr/\u003e\u003cbr/\u003eOur primary goal is to deliver a stellar streaming experience across hundreds of linear channels to PV customers worldwide, collaborating with content providers to uphold standards.\u003cbr/\u003eWe maintain thousands of hours of content per day, measuring success by the number of hours of content delivered without issues.","department_cost_center":null,"description_short":"Come build the future of entertainment with us. Are you interested in shaping the future of movies and television? Do you want to define the next generation of how and what Amazon customers are watching?Prime","display_distance":null,"id":"70d79347-8b3b-47cb-95ba-8d31fbe72395","id_icims":"3122868","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Support Engineering","job_function_id":null,"job_path":"/en/jobs/3122868/live-ops-support-engineer-prime-video-live-operations-prime-video-playback-live-operations","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD11\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":[],"posted_date":"November  7, 2025","preferred_qualifications":"- Experience scripting in modern program languages\u003cbr/\u003e- Experience communicating technical details verbally and in writing\u003cbr/\u003e- Experience with live broadcast production, transmission, NOC or MCR operations\u003cbr/\u003e- Experience with video quality metric tools (i.e. TAG)\u003cbr/\u003e- Experience working in live sports\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"entertainment.team-primevideo","source_system":"JobCreator","state":"TS","title":"Live Ops Support Engineer, Prime Video Live Operations, Prime Video Playback Live Operations","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3122868/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-primevideo","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of building machine learning models for business application experience\u003cbr/\u003e- PhD, or Master's degree and 6+ years of applied research experience\u003cbr/\u003e- Experience programming in Java, C++, Python or related language\u003cbr/\u003e- Experience with neural deep learning methods and machine learning","business_category":"aws","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"As part of the AWS Solutions organization, we have a vision to provide business applications, leveraging Amazon’s unique experience and expertise, that are used by millions of companies worldwide to manage day-to-day operations. We will accomplish this by accelerating our customers’ businesses through delivery of intuitive and differentiated technology solutions that solve enduring business challenges. We blend vision with curiosity and Amazon’s real-world experience to build opinionated, turnkey solutions. Where customers prefer to buy over build, we become their trusted partner with solutions that are no-brainers to buy and easy to use.\u003cbr/\u003e\u003cbr/\u003eThe Team\u003cbr/\u003e\u003cbr/\u003eJust Walk Out (JWO) is a new kind of store with no lines and no checkout—you just grab and go! Customers simply use the Amazon Go app to enter the store, take what they want from our selection of fresh, delicious meals and grocery essentials, and go!\u003cbr/\u003e\u003cbr/\u003eOur checkout-free shopping experience is made possible by our Just Walk Out Technology, which automatically detects when products are taken from or returned to the shelves and keeps track of them in a virtual cart. When you’re done shopping, you can just leave the store. Shortly after, we’ll charge your account and send you a receipt. Check it out at amazon.com/go. Designed and custom-built by Amazonians, our Just Walk Out Technology uses a variety of technologies including computer vision, sensor fusion, and advanced machine learning. Innovation is part of our DNA! Our goal is to be Earths’ most customer centric company and we are just getting started. We need people who want to join an ambitious program that continues to push the state of the art in computer vision, machine learning, distributed systems and hardware design.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eEveryone on the team needs to be entrepreneurial, wear many hats and work in a highly collaborative environment that’s more startup than big company. We’ll need to tackle problems that span a variety of domains: computer vision, image recognition, machine learning, real-time and distributed systems. \u003cbr/\u003e\u003cbr/\u003eAs a Sr. Applied Scientist, you will help solve a variety of technical challenges and mentor other scientists. You will be the thought leader of the team. You will tackle challenging, novel situations every day and given the size of this initiative, you’ll have the opportunity to work with multiple technical teams at Amazon in different locations. You should be comfortable with a degree of ambiguity that’s higher than most projects and relish the idea of solving problems that, frankly, haven’t been solved at scale before - anywhere. Along the way, we guarantee that you’ll learn a ton, have fun and make a positive impact on millions of people.\u003cbr/\u003e\u003cbr/\u003eA key focus of this role will be developing and implementing advanced visual reasoning systems that can understand complex spatial relationships and object interactions in real-time. You'll work on designing autonomous AI agents that can make intelligent decisions based on visual inputs, understand customer behavior patterns, and adapt to dynamic retail environments. This includes developing systems that can perform complex scene understanding, reason about object permanence, and predict customer intentions through visual cues.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Solutions\u003cbr/\u003e\u003cbr/\u003eAs part of the AWS solutions organization, we have a vision to provide business applications, leveraging Amazon's unique experience and expertise, that are used by millions of companies worldwide to manage day-to-day operations. We will accomplish this by accelerating our customers' businesses through delivery of intuitive and differentiated technology solutions that solve enduring business challenges. we blend vision with curiosity and Amazon's real-world experience to build opinionated, turnkey solutions. Where customers prefer to buy over build, we become their trusted partner with solutions that are no-brainers to buy and easy to use.\u003cbr/\u003e\u003cbr/\u003eAbout AWS\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003e AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003e Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003e We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e","department_cost_center":null,"description_short":"As part of the AWS Solutions organization, we have a vision to provide business applications, leveraging Amazon’s unique experience and expertise, that are used by millions of companies worldwide to manage","display_distance":null,"id":"dc9319b5-65f6-4848-9854-ea46041b8890","id_icims":"3131362","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3131362/sr-applied-scientist-aws-just-walk-out-science-team","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA55\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["amazon.artificial-intelligence"],"posted_date":"November 24, 2025","preferred_qualifications":"- Experience in visual design expertise with ability to produce fresh, simple, elegant and exceedingly usable layouts and interactions and iconography\u003cbr/\u003e- Demonstrated experience in AI agent architecture design, including decision-making frameworks and behavioral modeling;\u003cbr/\u003e- Experience with advanced computer vision techniques including scene graph generation, visual relationship detection, and spatial reasoning\u003cbr/\u003e- Knowledge of modern visual-language models and multi-modal AI systems\u003cbr/\u003e- Experience implementing reinforcement learning for autonomous agent behavior\u003cbr/\u003e- Experience in professional software development\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $150,400/year in our lowest geographic market up to $260,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-machine-learning-primary","source_system":"JobCreator","state":"WA","title":"Sr. Applied Scientist, AWS Just-Walk-Out Science Team","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3131362/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-machine-learning-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of experience in electrical design and development\u003cbr/\u003e- Proficiency with schematic capture and PCB layout tools (Altium, Cadence, or similar)\u003cbr/\u003e- Experience with analog and digital circuit design\u003cbr/\u003e- Knowledge of power management and power supply design\u003cbr/\u003e- Understanding of signal integrity and high-speed design principles\u003cbr/\u003e- Experience with hardware debugging tools (oscilloscopes, logic analyzers, spectrum analyzers)\u003cbr/\u003e- Strong problem-solving and analytical skills\u003cbr/\u003e- Basic understanding of AI concepts and applications in electrical engineering\u003cbr/\u003e- Experience using AI-assisted design tools for circuit optimization","business_category":"alexa-and-amazon-devices","city":"Taipei","company_name":"Amazon Development Center Taiwan Limited","country_code":"TWN","description":"As a Hardware Development Engineer (Electrical Engineer), you will design, develop, and validate electrical systems for Ring devices and services. You will lead complex technical projects, mentor junior engineers, and collaborate with cross-functional teams to deliver innovative hardware solutions that delight our customers. You will also leverage AI tools and methodologies to enhance electrical design processes and outcomes.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Design and develop analog and digital circuits for consumer electronics\u003cbr/\u003e- Create and review schematics and PCB layouts\u003cbr/\u003e- Develop power management solutions and power distribution networks\u003cbr/\u003e- Implement high-speed digital interfaces and ensure signal integrity\u003cbr/\u003e- Design for EMI/EMC compliance and conduct pre-compliance testing\u003cbr/\u003e- Develop electrical test plans and validation procedures\u003cbr/\u003e- Troubleshoot and resolve complex electrical issues\u003cbr/\u003e- Collaborate with firmware, mechanical, and manufacturing teams\u003cbr/\u003e- Document designs, test results, and technical specifications\u003cbr/\u003e- Evaluate new components and technologies for future products\u003cbr/\u003e- Manage relationships with external vendors and manufacturing partners\u003cbr/\u003e- Apply AI tools and techniques to optimize electrical designs and processes\u003cbr/\u003e- Collaborate with data scientists to develop AI-driven solutions for electrical engineering challenges\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Ring Accessories Hardware Development team creates the devices that millions of customers use every day. We work backwards from customer needs to develop innovative hardware solutions that seamlessly integrate with Amazon's ecosystem of products and services. We value builders who are passionate about creating high-quality, reliable hardware that delights our customers. We are increasingly leveraging AI to enhance our design processes, optimize product performance, and create more innovative solutions.","department_cost_center":null,"description_short":"As a Hardware Development Engineer (Electrical Engineer), you will design, develop, and validate electrical systems for Ring devices and services. You will lead complex technical projects, mentor junior","display_distance":null,"id":"e49ded02-92e3-4bd8-ba71-ac812cde2e54","id_icims":"3130733","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/3130733/hardware-development-engineer-ring-accessories-hw-team","job_schedule_type":"full-time","location":"TW, TPE, Taipei","locations":["{\"normalizedCountryCode\":\"TWN\",\"city\":\"Taipei\",\"countryIso3a\":\"TWN\",\"countryIso2a\":\"TW\",\"locationNonStemming\":\"Taiwan, TPE, Taipei\",\"coordinates\":\"25.03737,121.56355\",\"normalizedCountyName\":\"Taipei City\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Taiwan\",\"normalizedLocation\":\"Taipei City, TWN\",\"location\":\"TW, TPE, Taipei\",\"region\":\"TPE\",\"buildingCodeList\":[\"TPE12\"],\"normalizedCityName\":\"Taipei City\"}"],"normalized_location":"Taipei City, TWN","optional_search_labels":["alexa-and-amazon-devices.team-hardware-development-job-family"],"posted_date":"November 21, 2025","preferred_qualifications":"- Experience with embedded systems and microcontroller programming\u003cbr/\u003e- Knowledge of wireless technologies (Wi-Fi, Bluetooth, cellular)\u003cbr/\u003e- Experience with FPGA design and implementation\u003cbr/\u003e- Familiarity with regulatory compliance requirements (FCC, CE)\u003cbr/\u003e- Experience with design for manufacturing and test (DFM/DFT)\u003cbr/\u003e- Track record of innovation and technical leadership\u003cbr/\u003e- Experience mentoring junior engineers\u003cbr/\u003e- Advanced knowledge of machine learning applications in electrical design optimization\u003cbr/\u003e- Experience implementing AI for automated test pattern generation or fault diagnosis\u003cbr/\u003e- Ability to collaborate with data scientists to develop custom AI solutions for electrical engineering problems\u003cbr/\u003e- Experience with AI-driven circuit simulation and optimization\u003cbr/\u003e- Knowledge of how to integrate sensor data with AI/ML models for electrical systems\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"alexa-and-amazon-devices.team-ring-key-blink","source_system":"JobCreator","state":"TPE","title":"Hardware Development Engineer, Ring Accessories HW Team","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3130733/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-ring-key-blink","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"no-business-category","city":"Chennai","company_name":"ADCI MAA 15 SEZ","country_code":"IND","description":"                 Amazon is looking for exceptional, motivated software engineers to work in the Kindle Reader organization. As a Software Engineer you will take an exciting and challenging role on a team that is innovating on the Reading experience on Kindle mobile devices and services for millions of Amazon customers. You will work with world-class engineers, business leaders, and other talented engineering teams while you design, architect, and code for Kindle Reader iOS, Android app and E-Reader software. You will join a team that is developing a platform on which many other Amazon partner teams innovate their reader experiences. As a software engineer, you will think big and drive architecture decisions Kindle Library, cross OS development, app UX experience and service integrations to deliver awesome reader experience. We are looking for a passionate, hard-working, and talented software engineer who has experience building mission critical, high volume applications that customers love. \u003cbr/\u003e  \u003cbr/\u003e\u003cbr/\u003eBy submitting your application here, you can apply once to be considered for multiple Software Engineer openings across various Amazon teams. If you are successful in passing through the initial application review and assessment, you will be asked to submit your career and personal preferences so that our dedicated recruiters can match you to the right role based on these preferences.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAs a engineer you will have opportunity to work with:\u003cbr/\u003e\u003cbr/\u003e- The foundational tech stack for syncing and storing structured annotations (i.e. text sticky notes, highlights, bookmarks).\u003cbr/\u003e- Sync CX features such as MRPR (most recent page read CX) and FPR (furthest page read).\u003cbr/\u003e- The core sync architecture driving our vision to be a federated, scalable, “plug and play” sync service for any Kindle and Books feature requiring sync.\u003cbr/\u003eNotetaking Sync: The effective back-end for handwritten notetaking (via Kindle Scribe), this team supports handwritten note sync and storage, data integrity, privacy/security for notetaking, and architectural improvements.","department_cost_center":null,"description_short":"                 Amazon is looking for exceptional, motivated software engineers to work in the Kindle Reader organization. As a Software Engineer you will take an exciting and challenging role on a team","display_distance":null,"id":"14d4463d-a9b6-4fe3-9356-1f4846718dda","id_icims":"3078179","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3078179/software-development-engineer-kindle-reader","job_schedule_type":"full-time","location":"IN, TN, Chennai","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bangalore\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bangalore\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bangalore\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR13\"],\"normalizedCityName\":\"Bengaluru\"}","{\"normalizedStateName\":\"Tamil Nadu\",\"normalizedCountryCode\":\"IND\",\"city\":\"Chennai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TN, Chennai\",\"coordinates\":\"13.08404,80.28274\",\"normalizedCountyName\":\"Chennai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Chennai, Tamil Nadu, IND\",\"location\":\"IN, TN, Chennai\",\"region\":\"TN\",\"buildingCodeList\":[\"MAA15\"],\"normalizedCityName\":\"Chennai\"}"],"normalized_location":"Chennai, Tamil Nadu, IND","optional_search_labels":[],"posted_date":"September  8, 2025","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"TN","title":"Software Development Engineer, Kindle Reader","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3078179/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- 1+ years of Microsoft Office products and applications experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- certification from Amazon's Mechatronics and Robotics Apprenticeship Program, or 2+ years of automated conveyor systems and controls experience\u003cbr/\u003e- 2+ years of conducting predictive and preventative maintenance procedures experience\u003cbr/\u003e- 2+ years of reading blueprints and electrical schematics experience\u003cbr/\u003e- 2+ years of demonstrating safety standards experience\u003cbr/\u003e- 2+ years of troubleshooting and diagnostics of material handling equipment (MHE) experience","business_category":"operations","city":"Aurora","company_name":"Amazon.com Services LLC - A57","country_code":"USA","description":"Application deadline: Feb 9, 2026\u003cbr/\u003e\u003cbr/\u003eAbout Maintenance at Amazon\u003cbr/\u003e\u003cbr/\u003eOperations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every day. Reliability Maintenance \u0026 Engineering (RME) are the business partners that work tirelessly behind the scenes to make it all happen. We drive continuous improvement and maintain all of the Robotics and Material Handling Equipment (MHE) to ensure our customers are met with the Amazon smile. Come join us on our journey!\u003cbr/\u003e\u003cbr/\u003eAbout the Role\u003cbr/\u003e\u003cbr/\u003eAs a Mechatronics \u0026 Robotics Technician, you will use your skills to support the Operations Maintenance team in repairing and maintaining material handling equipment and pneumatic systems throughout the building. You will have the opportunity to install, maintain, and repair automated packaging and distribution equipment. In addition to developing your skills, you will mentor junior technicians to grow in their roles.\u003cbr/\u003e\u003cbr/\u003eWhat Do We Offer?\u003cbr/\u003e\u003cbr/\u003eAmazon offers competitive compensation packages including comprehensive healthcare benefits starting on Day 1, matching 401(k) program, and up to 20 weeks of paid parental leave. But wait, there is more: We provide lightweight fire-resistant daily wear and composite toe safety shoes for your safety!\u003cbr/\u003e\u003cbr/\u003eHere is what you can expect with the Reliability \u0026 Maintenance Engineering (RME) selection process for Mechatronics \u0026 Robotics Technicians: (Timeframe: Approximately 30-days)\u003cbr/\u003e\u003cbr/\u003eStep 1: Congratulations! You successfully submitted your application! \u003cbr/\u003e\u003cbr/\u003eStep 2: Amazon Recruiting will review your application and invite the most qualified candidate to complete a pre-employment assessment. \u003cbr/\u003e\u003cbr/\u003eStep 3: If you meet the role qualifications, you will receive an invitation from Amazon Recruiting (do-not-reply@criteriacorp.com) to begin your Criteria assessment. You have 5 days to complete. \u003cbr/\u003e\u003cbr/\u003eStep 4: Once you successfully meet the pre-employment assessment requirements, you will be invited to complete a video interview. Your video interview invitation will be from HireVue (interviews@hirevue.com) and you will have 7 days to record your interview.\u003cbr/\u003e\u003cbr/\u003eStep 5: Your video interview will be reviewed by the Amazon Hiring Team and you will be notified of next steps via email within 5 business days. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities include, but are not limited to: \u003cbr/\u003e- You will promote a safe working environment by following all safety procedures \u003cbr/\u003e- You will complete preventative maintenance routines with proper documentation \u003cbr/\u003e- You will troubleshoot electrical and mechanical problems related to all Material Handling Equipment (MHE) which includes belts, motors, photo-eyes, relays, and more \u003cbr/\u003e- You will maintain a positive working relationship across all of the Amazon Operations facility \u003cbr/\u003e- You must be able to move up to 49lbs, stand and walk during shifts lasting up to 12 hours, climb ladders and gangways safely, and without limitation, as well as perform regular bending, lifting, stretching, and reaching both below the waist and above the head\u003cbr/\u003e\u003cbr/\u003ePlease note that while we strive to accommodate employees' preferences for shift assignments, due to operational requirements and scheduling constraints, we cannot guarantee a specific shift assignment.\u003cbr/\u003e","department_cost_center":null,"description_short":"About Maintenance at AmazonOperations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds","display_distance":null,"id":"d7ad4b11-d85f-4151-899a-9e49c5cb56a4","id_icims":"3152809","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3152809/mechatronics-robotics-tech-service-technician-ii","job_schedule_type":"full-time","location":"US, CO, Aurora","locations":["{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Aurora\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Aurora\",\"coordinates\":\"39.70932,-104.81458\",\"normalizedCountyName\":\"Arapahoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Aurora, Colorado, USA\",\"location\":\"US, CO, Aurora\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN5\"],\"normalizedCityName\":\"Aurora\"}"],"normalized_location":"Aurora, Colorado, USA","optional_search_labels":[],"posted_date":"January  5, 2026","preferred_qualifications":"- Experience with robotic operation and maintenance\u003cbr/\u003e- 2+ years of electrical and electronic principles experience\u003cbr/\u003e- Associate's degree in Mechnical or Electrical\u003cbr/\u003e- 2+ years of Mechanical or Electrical apprenticeship experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below including the base pay rate plus the highest available shift differential which applies depending on the shift you select. As a total compensation company, you are eligible for additional earnings including overtime pay and performance bonuses. Final pay will be based on factors including shift selection and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Aurora - 35.00 - 37.00 USD hourly","primary_search_label":"operations.team-reliability-maintenance-engineering","source_system":"JobCreator","state":"CO","title":"Mechatronics \u0026 Robotics Tech , Service Technician II","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3152809/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-reliability-maintenance-engineering","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 1+ years of designing and developing large-scale, multi-tiered, multi-threaded, embedded or distributed software applications, tools, systems, and services using: C#, C++, Java, or Perl experience\u003cbr/\u003e- 1+ years of Object Oriented Design experience\u003cbr/\u003e- Bachelor's degree or foreign equivalent in Computer Science, Engineering, Mathematics, or a related field\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"advertising","city":"Boulder","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Application deadline: Feb 12, 2026\u003cbr/\u003e\u003cbr/\u003eAre you passionate about operating at internet scale? Do you want to work at the intersection of machine learning, data science, and causal inference? Are you eager to invent, grow, and learn alongside world-class engineers and scientists? If so, we want to hear from you!\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003eYou will design and develop software products that deliver measurement data to a diverse set of users across Amazon's entire advertising suite. You'll demonstrate expertise in various architectural approaches and design patterns, with proven competence in building maintainable and scalable software using high-level languages. Collaborating with Data \u0026 Applied Scientists, Economists, and senior technical leaders who are advancing measurement science and causal inference, you'll adapt to evolving technical environments and devise creative solutions to complex software challenges. You'll tackle some of the most demanding and inspiring technical problems of your career—building petabyte-scale services, inventing new big data paradigms, and architecting for exponential growth.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e\u003cbr/\u003eWe measure advertising effectiveness through sophisticated causal measurement and modeling techniques, including rigorous scientific experiments and machine learning. Our mission is to enable advertisers to optimize ad spend and allocate budgets effectively by providing accurate, actionable, and timely causal measurement across all Amazon ad products. We combine deterministic and modeled measurement techniques to produce estimates that are fast, precise, and actionable. Using AWS big data and machine learning technologies, we process over 50 billion new events daily, operating petabyte-scale clusters. We continuously innovate on our event-driven architectures to stay ahead of rapidly growing scale.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003e\u003cbr/\u003eThis team builds the core causal measurement and modeling capabilities serving all of Amazon Ads. We work with diverse systems and languages, combining AWS services like EMR and DynamoDB with Spark and Scala. We also leverage generative AI tools to accelerate our development, testing, and deployment cycles.","department_cost_center":null,"description_short":"Are you passionate about operating at internet scale? Do you want to work at the intersection of machine learning, data science, and causal inference? Are you eager to invent, grow, and learn alongside","display_distance":null,"id":"bb85fc4e-0b64-493d-9b68-4c1d879c97fd","id_icims":"3155394","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3155394/software-dev-engineer-ii-measurement-ad-tech-and-data-science-mads","job_schedule_type":"full-time","location":"US, CO, Boulder","locations":["{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Boulder\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Boulder\",\"coordinates\":\"40.01574,-105.27924\",\"normalizedCountyName\":\"Boulder\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Boulder, Colorado, USA\",\"location\":\"US, CO, Boulder\",\"region\":\"CO\",\"buildingCodeList\":[\"WBU11\"],\"normalizedCityName\":\"Boulder\"}"],"normalized_location":"Boulder, Colorado, USA","optional_search_labels":[],"posted_date":"January  8, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eThe base salary range for this position is listed below. For salaried roles, your Amazon package will include listed sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003ca href=\"https://amazon.jobs/en/benefits/us-benefits-and-stock\"\u003ehttps://amazon.jobs/en/benefits/us-benefits-and-stock\u003c/a\u003e.\u003cbr\u003e\u003cbr\u003eColorado $143,700 - $194,400 annually","primary_search_label":"advertising.team-ad-serving-and-measurement","source_system":"JobCreator","state":"CO","title":"Software Dev Engineer II, Measurement, Ad Tech, and Data Science (MADS)","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3155394/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-ad-serving-and-measurement","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of experience in cloud architecture and implementation\u003cbr/\u003e- Bachelor’s degree in computer science, Engineering, related field, or equivalent experience\u003cbr/\u003e- 5+ years of experience in working with enterprise customers in cloud transformation activities including building, migrating and modernizing enterprise applications\u003cbr/\u003e- 5+ years of large-scale software development or application engineering with recent coding experience in two or more of the following languages: React/ReactJS, Java/Kotlin, JavaScript, Python, C/C++, C#, Objective-C, Node.js, .NET, PHP or Ruby\u003cbr/\u003e- 3+ years experience with Continuous Integration and Continuous Delivery (CI/CD) using industry standard tooling","business_category":"aws","city":"Arlington","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Application deadline: Feb 12, 2026\u003cbr/\u003e\u003cbr/\u003eThe Amazon Web Services Professional Services (ProServe) team is seeking a skilled Delivery Consultant to join our team at Amazon Web Services (AWS). In this role, you'll work closely with customers to design, implement, and manage AWS solutions that meet their technical requirements and business objectives. You'll be a key player in driving customer success through their cloud journey, providing technical expertise and best practices throughout the project lifecycle.\u003cbr/\u003ePossessing a deep understanding of AWS products and services, as a Delivery Consultant you will be proficient in architecting complex, scalable, and secure solutions tailored to meet the specific needs of each customer. You’ll work closely with stakeholders to gather requirements, assess current infrastructure, and propose effective migration strategies to AWS. As trusted advisors to our customers, providing guidance on industry trends, emerging technologies, and innovative solutions, you will be responsible for leading the implementation process, ensuring adherence to best practices, optimizing performance, and managing risks throughout the project.\u003cbr/\u003eThe AWS Professional Services organization is a global team of experts that help customers realize their desired business outcomes when using the AWS Cloud. We work together with customer teams and the AWS Partner Network (APN) to execute enterprise cloud computing initiatives. Our team provides assistance through a collection of offerings which help customers achieve specific outcomes related to enterprise cloud adoption. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKEY RESPONSIBILITIES\u003cbr/\u003eAs an experienced technology professional, you will be responsible for:\u003cbr/\u003e1. Designing and implementing complex, scalable, and secure AWS solutions tailored to customer needs\u003cbr/\u003e2. Providing technical guidance and troubleshooting support throughout project delivery\u003cbr/\u003e3. Collaborating with stakeholders to gather requirements and propose effective migration strategies\u003cbr/\u003e4. Acting as a trusted advisor to customers on industry trends and emerging technologies\u003cbr/\u003e5. Sharing knowledge within the organization through mentoring, training, and creating reusable artifacts\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS:\u003cbr/\u003eDiverse Experiences: AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job below, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003eInclusive Team Culture - Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003eMentorship \u0026 Career Growth - We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003eWork/Life Balance - We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.","department_cost_center":null,"description_short":"The Amazon Web Services Professional Services (ProServe) team is seeking a skilled Delivery Consultant to join our team at Amazon Web Services (AWS). In this role, you'll work closely with customers to","display_distance":null,"id":"4c048837-b23f-4146-9e9b-0d970cf02372","id_icims":"3044078","is_intern":null,"is_manager":null,"job_category":"Solutions Architect","job_family":"Professional Services","job_function_id":null,"job_path":"/en/jobs/3044078/sr-delivery-consultant-appmod-wwps-proserve-non-profits-organization-npo","job_schedule_type":"full-time","location":"US, VA, Arlington","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS17\"],\"normalizedCityName\":\"Arlington\"}","{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Atlanta\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Atlanta\",\"coordinates\":\"33.74831,-84.39111\",\"normalizedCountyName\":\"Fulton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Atlanta, Georgia, USA\",\"location\":\"US, GA, Atlanta\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL11\"],\"normalizedCityName\":\"Atlanta\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD28\"],\"normalizedCityName\":\"Herndon\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Dallas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Dallas\",\"coordinates\":\"32.77822,-96.79512\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Dallas, Texas, USA\",\"location\":\"US, TX, Dallas\",\"region\":\"TX\",\"buildingCodeList\":[\"DFW15\"],\"normalizedCityName\":\"Dallas\"}"],"normalized_location":"Arlington, Virginia, USA","optional_search_labels":[],"posted_date":"July 27, 2025","preferred_qualifications":"- AWS experience preferred, with proficiency in a wide range of AWS services (e.g., EC2, S3, RDS, Lambda, IAM, VPC, CloudFormation)\u003cbr/\u003e- AWS Professional level certifications (e.g., Solutions Architect Professional, DevOps Engineer Professional) preferred\u003cbr/\u003e- Experience with automation and scripting (e.g., Terraform, Python, CDK, shell, Ruby, Powershell)\u003cbr/\u003e- Knowledge of security and compliance standards (e.g., HIPAA, GDPR)\u003cbr/\u003e- Strong communication skills with the ability to explain technical concepts to both technical and non-technical audiences\u003cbr/\u003e- Experience with AWS services (e.g. AWS Application Migration Service (MGN), Cloud Migration Factory, Portfolio analysis tooling) and managing large scale data center to data center and/or data center to cloud migrations; data center operations (e.g. data assurance, monitoring, alerting and notifications)\u003cbr/\u003e- Experience integrating AWS AI/ML services (SageMaker, Bedrock, Amazon Q); understanding of AI/ML governance and responsible AI practices\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eThe base salary range for this position is listed below. For salaried roles, your Amazon package will include listed sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003ca href=\"https://amazon.jobs/en/benefits/us-benefits-and-stock\"\u003ehttps://amazon.jobs/en/benefits/us-benefits-and-stock\u003c/a\u003e.\u003cbr\u003e\u003cbr\u003eColorado $153,600 - $207,800 annually\u003cbr\u003eNational $138,200 - $239,000 annually","primary_search_label":"aws.team-pro-serv","source_system":"JobCreator","state":"VA","title":"Sr. Delivery Consultant- AppMod, WWPS, ProServe Non Profits Organization (NPO)","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3044078/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-pro-serv","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent\u003cbr/\u003e- 7+ years of finance, business management and sales operations experience\u003cbr/\u003e- Experience developing and executing sales strategies, tactics, plans, processes, systems and programs\u003cbr/\u003e- AML related certification\u003cbr/\u003e- Experience communicating and presenting to senior leadership","business_category":"aws","city":"Seattle","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Application deadline: Feb 12, 2026\u003cbr/\u003e\u003cbr/\u003eAWS is seeking a Senior Business Operations Lead, to lead drive data-driven decision-making and operational excellence for the APO (Partner) Tech organization. This role is crucial in leading and scaling mission-critical frameworks, including goal setting, key initiatives, monthly business reviews, and data analysis, to inform strategic recommendations in a rapidly growing, complex environment. \u003cbr/\u003e\u003cbr/\u003eWorking closely with APO Tech leadership, the Senior Business Operations Lead develops, implements, and manages sales processes, systems, and metrics to help sellers and those involved in the sales process increase revenue growth and customer acquisition. Analyzes sales performance data to identify growth opportunities and process improvements.  Partners with stakeholders to drive day-to-day operational excellence through sales process management, performance analysis, technology support, business reviews, operational planning, and communicating actionable insights, both verbally and in writing, while fostering strong stakeholder relationships.\u003cbr/\u003e\u003cbr/\u003eAs the AI-powered sales ecosystem continues to evolve, this role will be instrumental in leveraging the latest artificial intelligence and machine learning technologies to enhance sales processes and decision-making. The Senior Business Operations Lead will work closely with APO Tech leadership and cross-functional teams to responsibly implement and optimize AI-driven tools and workflows that augment the sales organization's productivity and effectiveness.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tDocuments and implements standardized sales processes and metrics, including KPI definitions and goal cascades, to support sales operational effectiveness\u003cbr/\u003e•\tDevelops and manages pipeline qualification, attribution, and/or routing rules to ensure proper distribution, and resolves attribution escalations to ensure accurate financial reporting\u003cbr/\u003e•\tOrchestrates AI-human collaboration in the sales process, including AI-powered lead scoring and opportunity prioritization\u003cbr/\u003e•\tManages and optimizes AI sales intelligence tools and automated customer interaction systems\u003cbr/\u003e•\tMaintains CRM and sales tools data quality to ensure accurate reporting and forecasting\u003cbr/\u003e•\tImplements sales workflows and automation to streamline process and improve seller efficiency\u003cbr/\u003e•\tMaintains dashboards to provide real-time visibility into key sales metrics to make business decisions\u003cbr/\u003e•\tConducts sales performance analysis on win/loss data, conversion rates, quota attainment, and/or forecast accuracy to identify potential risks\u003cbr/\u003e•\tDrives regular business reviews with insights on pipeline health, revenue forecast trends, and operational efficiency\u003cbr/\u003e•\tActs as primary point of contact to resolve stakeholders’ requests and execute daily operational processes \u003cbr/\u003e•\tLeads sales tools training and adoption initiatives to improve utilization and productivity\u003cbr/\u003e•\tLeads cross-functional projects to improve sales efficiency and processes\u003cbr/\u003e•\tDrives escalations, gap-to-green, and/or other issues to resolution\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e \u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e \u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e \u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e \u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eAWS Sales, Marketing, and Global Services (SMGS) is responsible for driving revenue, adoption, and growth from the largest and fastest growing small- and mid-market accounts to enterprise-level customers including public sector. The AWS Global Support team interacts with leading companies and believes that world-class support is critical to customer success. AWS Support also partners with a global list of customers that are building mission-critical applications on top of AWS services.","department_cost_center":null,"description_short":"AWS is seeking a Senior Business Operations Lead, to lead drive data-driven decision-making and operational excellence for the APO (Partner) Tech organization. This role is crucial in leading and scaling","display_distance":null,"id":"7464f7f5-d04a-46ad-b3ef-f520a627d2d5","id_icims":"3107090","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Sales Operations Job Family","job_function_id":null,"job_path":"/en/jobs/3107090/smgs-ops-business-operations-lead-apo-tech","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA44\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Dallas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Dallas\",\"coordinates\":\"32.77822,-96.79512\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Dallas, Texas, USA\",\"location\":\"US, TX, Dallas\",\"region\":\"TX\",\"buildingCodeList\":[\"DFW15\"],\"normalizedCityName\":\"Dallas\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"October 13, 2025","preferred_qualifications":"- Ability to evaluate and implement AI sales tools\u003cbr/\u003e- Understanding of AI capabilities and limitations in sales contexts\u003cbr/\u003e- Experience in training and fine-tuning AI models with sales data\u003cbr/\u003e- Experience in prompt engineering and working with large language models\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eThe base salary range for this position is listed below. For salaried roles, your Amazon package will include listed sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003ca href=\"https://amazon.jobs/en/benefits/us-benefits-and-stock\"\u003ehttps://amazon.jobs/en/benefits/us-benefits-and-stock\u003c/a\u003e.\u003cbr\u003e\u003cbr\u003eColorado $133,900 - $181,200 annually\u003cbr\u003eNational $120,500 - $199,300 annually","primary_search_label":"aws.team-no-matching-primary-label-listed","source_system":"JobCreator","state":"WA","title":"SMGS Ops - Business Operations Lead, APO Tech","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3107090/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-no-matching-primary-label-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma, or A+ or CND (Certified Network Defender) or Network+ or Security+\u003cbr/\u003e- 1+ years of computer hardware troubleshooting and repair experience\u003cbr/\u003e- Current, active US Government Security Clearance of TS/SCI with Polygraph","business_category":"aws","city":"Aurora","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Application deadline: Feb 12, 2026\u003cbr/\u003e\u003cbr/\u003eThe Decommissioning Technical team is responsible for processing and facilitating large scale legacy Data Center equipment through a liquidation process to ensure that targeted equipment is ready to be removed off premises. Team members will also process large volumes of customer media to ensure that all customer media is sanitized and properly managed. Proper accountability of equipment throughout the process is of great importance.\u003cbr/\u003e\u003cbr/\u003eThis Entry Level position requires candidates to be a self-starter, highly motivated individual who can adhere to strict processes and be able to diligently perform repetitive tasks with no deviation and deliver consistent results.\u003cbr/\u003e\u003cbr/\u003eTeam Members will be working in a team environment not only with other members of the team, but also from other teams and must be able to communicate and promote cross-team functionality.\u003cbr/\u003e\u003cbr/\u003eAmazon Data Centers protect customer data with utmost vigilance, and selected candidates must be able to perform repetitive tasks without fault and adhere to strict Standard Operating Procedures (SOP) that ensures customer data is protected and properly handled.\u003cbr/\u003e\u003cbr/\u003eThis position requires that the candidate selected be a US Citizen and must currently possess and maintain an active TS/SCI security clearance with polygraph. Upon application you will be asked qualifying questions that will be used only in relation to the US Government Security Clearance required for this role.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eOur technicians have industry-leading technical abilities and demonstrate a breadth of knowledge while they:\u003cbr/\u003e\u003cbr/\u003e- Take ownership of technical issues brought by their customer base, engaging other teams when needed to drive resolution\u003cbr/\u003e- Show a strong aptitude for troubleshooting and problem solving\u003cbr/\u003e- Solve problems at their root and step back to understand the broader context\u003cbr/\u003e- Demonstrate the ability to lift up to 40 lbs. and work in cramped and/or elevated locations\u003cbr/\u003e- Maintain service level agreements through the implementation of proactive issue detection and reporting\u003cbr/\u003e- Are biased to act in the absence of direction or support\u003cbr/\u003e- Improve effectiveness through process innovation\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e","department_cost_center":null,"description_short":"The Decommissioning Technical team is responsible for processing and facilitating large scale legacy Data Center equipment through a liquidation process to ensure that targeted equipment is ready to be","display_distance":null,"id":"747a8201-bd8e-4028-b49f-42d402ca6427","id_icims":"3042679","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3042679/decom-tech-data-center-operations","job_schedule_type":"full-time","location":"US, CO, Aurora","locations":["{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Aurora\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Aurora\",\"coordinates\":\"39.70932,-104.81458\",\"normalizedCountyName\":\"Arapahoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Aurora, Colorado, USA\",\"location\":\"US, CO, Aurora\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN22\"],\"normalizedCityName\":\"Aurora\"}"],"normalized_location":"Aurora, Colorado, USA","optional_search_labels":["aws.team-ais","aws.team-adc-infra-optional","amazon-cleared-jobs","aws.team-clearedvets","military"],"posted_date":"July 24, 2025","preferred_qualifications":"- 1+ years of data center experience, knowledge of cloud computing technologies, and previous experience migrating and decommissioning of data center assets\u003cbr/\u003e- Decommissioning and processing of legacy hardware out of the data center facilities, unpacking/repacking fragile electronics, and relocating and moving of large enterprise equipment\u003cbr/\u003e- Experience tracking and accounting for a large amount of IT parts, creating/attaching labels and barcodes, and hard drive installation and removal, and destruction\u003cbr/\u003e- Basic Networking removal/installation and clearing of configurations, updating progress through a web ticketing system, and familiarity with basic PC components/hardware: HDD/SSD/Flash/Removable storage media Ram/CPU/Motherboard/Input-Output devices\u003cbr/\u003e- Previous experience working on IT equipment (racking \u0026 stacking gear, cable management, building computers, troubleshooting PC/Desktops/Laptops)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eThe base salary range for this position is listed below. For salaried roles, your Amazon package will include listed sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003ca href=\"https://amazon.jobs/en/benefits/us-benefits-and-stock\"\u003ehttps://amazon.jobs/en/benefits/us-benefits-and-stock\u003c/a\u003e.\u003cbr\u003e\u003cbr\u003eColorado $62,100 - $108,800 annually","primary_search_label":"aws.team-us-security-clearance-jobs-primary","source_system":"JobCreator","state":"CO","title":"Decom Tech, Data Center Operations","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3042679/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-us-security-clearance-jobs-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- A Bachelor's Degree in an IT, Computer Science, Engineering, or equivalent combination of education and work experience. \u003cbr/\u003e\u003cbr/\u003e- Minimum of 5-years telecommunications industry experience in a similar environment. \u003cbr/\u003e\u003cbr/\u003e- Direct technical experience working in a company owning or operating long haul dark fiber networks and DWDM systems. \u003cbr/\u003e\u003cbr/\u003e- Ability to demonstrate where they have influenced the planning, design, development, contracting, implementation, and operation of long-haul backbone networks. \u003cbr/\u003e\u003cbr/\u003e- Extensive knowledge of IP peering ecosystems, fiber optic networks, submarine cables and the interconnection of these networks in order to obtain the highest availability for delivering online services globally. \u003cbr/\u003e\u003cbr/\u003e- Demonstrated ability to formulate data driven decisions that lead to results. ","business_category":"aws","city":"Denver","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Application deadline: Feb 12, 2026\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eAs a Backbone Network Planner, you are responsible for managing the planning and development of Amazon’s physical network infrastructure. You will be experienced in planning and designing physical network infrastructure (dark fiber, colocation and ISP cabling), optical transport technologies, backbone network engineering design principles, and you will have good market knowledge of network infrastructure providers in your region. This role requires extensive collaboration, driving strategic planning initiatives, designing high-availability solutions at scale, and delivering precise documentation. You will actively drive backbone infrastructure solutions within your designated region, working with Business Developers, suppliers, technology partners, as well as Amazon networking teams to meet our customers’ demands.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Act as the Americas (North America and South America) cross regional subject matter expert on topology change management and infrastructure demand planning. \u003cbr/\u003e\u003cbr/\u003e- Collaboratively develop network infrastructure execution plans in partnership with Business Developers that involve leased wavelengths, dark fibre and submarine cable capacity/builds. \u003cbr/\u003e\u003cbr/\u003e- Develop strategic regional backbone network plans for approval by internal customers and stakeholders, with a focus on short-, medium- and long-term needs \u003cbr/\u003e\u003cbr/\u003e- Work with network engineering to ensure that the highest degree of design consistency, network efficiency, cost optimization, and long-term scalability of the backbone network is delivered. \u003cbr/\u003e\u003cbr/\u003e- Compile topology information and performance metrics and make recommendations for improvements based on their findings. \u003cbr/\u003e\u003cbr/\u003e- Manage network change (migrations) as our network evolves to support increased traffic volumes and geographic expansion. \u003cbr/\u003e\u003cbr/\u003e- Translate backbone and edge forecasts into actionable network infrastructure projects. \u003cbr/\u003e\u003cbr/\u003e- Own network availability, performance and remediation plans to address non-compliance. \u003cbr/\u003e\u003cbr/\u003e- Document the physical infrastructure of the rest of world backbone infrastructure\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThe Planner role focuses on driving backbone performance improvements and managing network planning across AMER region. Daily activities include coordinating with Business Development and Network Engineering teams to develop infrastructure plans, analyse performance metrics, and implement optimization strategies. You'll maintain topology documentation, manage network changes, and serve as a subject matter expert for cross-regional planning. The role requires strong analytical skills to translate forecasts into actionable projects while ensuring network efficiency and cost optimization. You'll work closely with internal stakeholders to drive strategic planning initiatives and maintain high-availability solutions at scale.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences \u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. ","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"9f06a715-8e60-476a-b091-f9a8bee4bd1b","id_icims":"3047919","is_intern":null,"is_manager":null,"job_category":"Business \u0026 Merchant Development","job_family":"Infra Business Dev - Tech","job_function_id":null,"job_path":"/en/jobs/3047919/backbone-network-planner-amer-backbone-network-development","job_schedule_type":"full-time","location":"US, CO, Denver","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA29\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS17\"],\"normalizedCityName\":\"Arlington\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD28\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Denver, Colorado, USA","optional_search_labels":["aws.team-ais","aws.team-neteng"],"posted_date":"July 30, 2025","preferred_qualifications":"- Experience working at a large network operator, OTT or Internet Service Provider. \u003cbr/\u003e\u003cbr/\u003e- Experience with co-location ecosystem, and site selection and development for data-center and networking scaling and expansion projects. \u003cbr/\u003e\u003cbr/\u003e- Demonstrated ability to anticipate customer requirements and development of strategic plans. \u003cbr/\u003e\u003cbr/\u003e- Experience interacting with senior executives and other management within your own company and externally; and working across commercial, technical, domestic, and international arms of an organization. \u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eThe base salary range for this position is listed below. For salaried roles, your Amazon package will include listed sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003ca href=\"https://amazon.jobs/en/benefits/us-benefits-and-stock\"\u003ehttps://amazon.jobs/en/benefits/us-benefits-and-stock\u003c/a\u003e.\u003cbr\u003e\u003cbr\u003eColorado $92,400 - $160,000 annually\u003cbr\u003eNational $83,100 - $177,800 annually","primary_search_label":"aws.team-business-development-primary","source_system":"JobCreator","state":"CO","title":"Backbone Network Planner, AMER Backbone Network Development","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3047919/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-business-development-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}