{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- This role requires you to be a national of an EU member state\u003cbr/\u003e- Bachelor's degree in computer science (or related IT discipline) or equivalent industry experience\u003cbr/\u003e- Knowledge or experience in scripting (Bash, Python, or Ruby) or software development (Java, TypeScript, or similar), coupled with Linux and networking fundamentals to effectively troubleshoot and optimize system performance and reliability.","business_category":"aws","city":"Dublin","company_name":"Amazon Development Centre Ireland Limited","country_code":"IRL","description":"AWS is set to introduce the inaugural European Sovereign Cloud (ESC), marking a significant development in Utility Computing (UC). To spearhead this initiative, we are actively seeking experienced systems engineers with a strong background in cloud operations. As part of the AWS Managed Operations team, you will play a pivotal role in building and leading operations and development teams dedicated to delivering high-availability AWS services, including EC2, S3, Dynamo, Lambda, and Bedrock, exclusively for EU customers. For more information on ESC please check out our blog: https://aws.amazon.com/blogs/aws/in-the-works-aws-european-sovereign-cloud/\u003cbr/\u003e\u003cbr/\u003eYour responsibilities will encompass overseeing the launch of the ESC in 2025, working closely with global AWS teams, and influencing the evolution of AWS services and technology. A typical day in this role involves collaborating with technology leaders, contributing to the enhancement of day-to-day operations, and ensuring improvements in availability, reliability, latency, performance, and efficiency of the ESC. \u003cbr/\u003e\u003cbr/\u003eThe overarching goal is to deliver scalable services and ensure a high-availability experience for EU customers. If you are an experienced professional ready for a challenging and impactful opportunity, we invite you to join our efforts in building a best-in-class development engineering and operations team that aligns with AWS' commitment to customer satisfaction and continual innovation.\u003cbr/\u003e\u003cbr/\u003eUtility Computing (UC) \u003cbr/\u003eEuropean Sovereign Cloud (ESC) is a part of AWS Utility Computing (UC).\u003cbr/\u003eAWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS. Within AWS UC, Managed Operations engineers engage with AWS customers who require specialized security solutions for their cloud services.\u003cbr/\u003e\u003cbr/\u003eEligibility Requirement \u003cbr/\u003e* Fluency in written and spoken English is required. \u003cbr/\u003e* Candidate must be a national of an EU member state and residing in the EU to operate the AWS European Sovereign Cloud.\u003cbr/\u003e* Amazon will provide relocation support for successful applicants relocating within the European Union.\u003cbr/\u003e* Employees will participate in an On-Call rota.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eA Day in the Life\u003cbr/\u003eYou’ll spend a majority of your time operating and improving one of the largest software systems. Over the course of a week, you will review the operational health of the services in your team’s care, and as soon as you figure out why there was an anomaly, you write up an actionable bug report. As a responsible engineer, you’ve learned never to make changes to production systems without a plan, so you reviewed then executed changes following a change management process to one of the production systems in your care. Later in the week, you help to resolve your team’s backlog of operational issues. You round off the week by writing a cool script that you shared with your team which helps get to root cause faster of a hard problem that you diagnosed earlier.\u003cbr/\u003e\u003cbr/\u003eYou will be required to occasionally participate in an “on-call” rotations to resolve incidents occurring out-of-hours.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences \u003cbr/\u003e AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.  \u003cbr/\u003e\u003cbr/\u003eWhy AWS \u003cbr/\u003e Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003e We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003e AWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.  ","department_cost_center":null,"description_short":"AWS is set to introduce the inaugural European Sovereign Cloud (ESC), marking a significant development in Utility Computing (UC). To spearhead this initiative, we are actively seeking experienced systems","display_distance":null,"id":"b701f138-70bc-40db-bea2-9aabe89dcea4","id_icims":"3153221","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"System Planning/Administration","job_function_id":null,"job_path":"/en/jobs/3153221/systems-engineer-devops-eng-managed-operations","job_schedule_type":"full-time","location":"IE, D, Dublin","locations":["{\"normalizedCountryCode\":\"IRL\",\"city\":\"Dublin\",\"countryIso3a\":\"IRL\",\"countryIso2a\":\"IE\",\"locationNonStemming\":\"Ireland, D, Dublin\",\"coordinates\":\"53.34807,-6.24827\",\"normalizedCountyName\":\"County Dublin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Ireland\",\"normalizedLocation\":\"Dublin, IRL\",\"location\":\"IE, D, Dublin\",\"region\":\"D\",\"buildingCodeList\":[\"DUB12\"],\"normalizedCityName\":\"Dublin\"}"],"normalized_location":"Dublin, IRL","optional_search_labels":["military-emea","aws.team-eu-sovereign-cloud","aws.team-utility-computing"],"posted_date":"January  6, 2026","preferred_qualifications":"- Able to execute standard operating procedures and following operational best practices\u003cbr/\u003e- Knowledge or experience operating service in AWS or other cloud systems or services\u003cbr/\u003e- Knowledge or experience operating 24x7 high-availability, distributed software applications, performance tuning software applications and optimizing fleet utilization and monitoring frameworks (such as CloudWatch, Datadog, Grafana, Elastic or similar)\u003cbr/\u003e- Knowledge or experience with Infrastructure as Code, (such as CDK, CloudFormation, Puppet, Chef, Ansible, or similar)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-system-development-engineer-primary","source_system":"JobCreator","state":"D","title":"Systems Engineer/DevOps Eng, Managed Operations","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/3153221/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-system-development-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Podstawowe kwalifikacje\u003cbr/\u003e- Kwalifikacje techniczne\u003cbr/\u003e- Wcześniejsze doświadczenie w roli mistrza na stanowisku technicznym\u003cbr/\u003e- Wcześniejsze doświadczenie w pracy zarówno w zakresie elektryki, jak i mechaniki\u003cbr/\u003e- Wcześniejsze doświadczenie w automatyzacji lub w środowisku wykorzystującym urządzenia do transportu bliskiego\u003cbr/\u003e- Biegła znajomość języka polskiego w mowie i piśmie oraz języka angielskiego na poziomie średniozaawansowanym CEFR B2 lub wyższym\u003cbr/\u003e- Gotowość do pracy zmianowej w środowisku całodobowym","business_category":"fulfillment-ops","city":"Bielany Wroclawskie","company_name":"Amazon Fulfillment Poland sp. z o.o.","country_code":"POL","description":"Nasz zespół ds. utrzymania ruchu i infrastruktury jest centralnym ogniwem zaangażowania firmy Amazon w innowacyjność. W miarę rozwoju i przystosowania się firmy Amazon do ciągłych zmian, zespół ten dba o to, aby wykorzystywane przez nas narzędzia i technologie również szły z duchem czasu. Mistrz utrzymania ruchu i infrastruktury (m/k) pomaga nam być zawsze o krok do przodu, wdrażając najnowsze technologie i identyfikując nowe, wydajne sposoby pracy. Zwraca szczególną uwagę na nasze procesy, aby pomóc utrzymać wysokie standardy, a także wprowadza ulepszenia, aby podnieść je jeszcze wyżej. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Modelowanie najlepszych praktyk w zakresie bezpiecznego użytkowania sprzętu i monitorowanie zespołów w celu zapewnienia, że wszyscy przestrzegają właściwych procesów\u003cbr/\u003e- Śledzenie wydajności sprzętu poprzez kontrole wizualne, monitorowanie stanu technicznego i zadania związane z konserwacją zapobiegawczą oraz, w razie potrzeby, planowanie dodatkowych czynności serwisowych\u003cbr/\u003e- Nadzorowanie techników na zmianie w celu wspierania ich rozwoju i pełnienie roli pierwszego punktu kontaktu dla inżynierów utrzymania ruchu i infrastruktury\u003cbr/\u003e- Rozwiązywanie problemów związanych z urządzeniami w celu ograniczenia przestojów w pracy, umożliwiając jak najszybszą obsługę paczek\u003cbr/\u003e- Udział w poszukiwaniu sposobów ciągłego usprawnienia systemów i standaryzacji procesów w całej sieci europejskiej\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eOsoba na tym stanowisku zarządza zespołem na swojej zmianie, upewniając się, że odpowiedni sprzęt jest dla każdego dostępny i że działa prawidłowo. Obejmuje to monitorowanie procesów w celu zapewnienia przestrzegania przepisów i zasad oraz zagwarantowanie, że przeprowadzana jest konserwacja zapobiegawcza w celu zwiększenia niezawodności sprzętu.\u003cbr/\u003eBiorąc pod uwagę wszystko, co obserwuje podczas swojej pracy, przedstawia sugestie dotyczące ulepszeń, aby nasze systemy były bardziej wydajne i produktywne, a następnie wdraża je w obrębie całej UE. Monitoruje również procesy za pomocą narzędzi takich jak Scada, aby zagwarantować ich wydajność, a także ściśle współpracuje ze swoim bezpośrednim przełożonym, pomagając w zadaniach administracyjnych.\u003cbr/\u003eOsoba na tym stanowisku pracuje w jednym z naszych centrów logistycznych w systemie zmianowym, który obejmuje niektóre weekendy oraz pracę nocną. W miarę rozwoju doświadczenia w tym ekscytującym segmencie firmy Amazon otrzyma dobre przygotowanie do awansu na wyższe stanowiska. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe minimum base pay salary for this position is listed below. As a total compensation company, Amazon's package may include further pay components such as a sign on bonus and the eligibility to participate in a restricted stock unit scheme operated independently by Amazon.com Inc. in USA. Your recruiting team will share final base pay and any applicable total compensation elements depending on skills and requirements.\u003cbr/\u003eCompany discretionary, supplementary benefits apply subject to further terms, including pension plans, health insurance, life and disability insurance, business travel insurance, MultiSport card, discounts for meals at the company’s canteen, employee discount code and program (EDC/Extras), and the Employee Assistance Program (private and confidential counselling and referral service to support health and well-being).\u003cbr/\u003e\u003cbr/\u003eThe minimum base pay for this position is 12066 PLN monthly","department_cost_center":null,"description_short":"Nasz zespół ds. utrzymania ruchu i infrastruktury jest centralnym ogniwem zaangażowania firmy Amazon w innowacyjność. W miarę rozwoju i przystosowania się firmy Amazon do ciągłych zmian, zespół ten dba","display_distance":null,"id":"5b3a9e18-1a73-427e-b687-1108278e0cb7","id_icims":"3133707","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/facilities","job_function_id":null,"job_path":"/en/jobs/3133707/mistrz-utrzymania-ruchu-i-infrastruktury-m-k-rme","job_schedule_type":"full-time","location":"PL, Bielany Wroclawskie","locations":["{\"normalizedStateName\":\"Lower Silesian Voivodeship\",\"normalizedCountryCode\":\"POL\",\"city\":\"Bielany Wroclawskie\",\"countryIso3a\":\"POL\",\"countryIso2a\":\"PL\",\"locationNonStemming\":\"Poland, Bielany Wroclawskie\",\"coordinates\":\"51.0326,16.96807\",\"normalizedCountyName\":\"Powiat Wrocławski\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Poland\",\"normalizedLocation\":\"Kobierzyce, Lower Silesian Voivodeship, POL\",\"location\":\"PL, Bielany Wroclawskie\",\"region\":\"\",\"buildingCodeList\":[\"WRO4\",\"WRO2\",\"WRO1\"],\"normalizedCityName\":\"Kobierzyce\"}"],"normalized_location":"Kobierzyce, Lower Silesian Voivodeship, POL","optional_search_labels":["ops.rme-sr-technician"],"posted_date":"November 27, 2025","preferred_qualifications":"- Preferowane kwalifikacje nie są wymagane do starania się o stanowisko w firmie Amazon. Z przyjemnością zapoznamy się z kandydaturą osób, które posiadają wszystkie wyżej wymienione kwalifikacje podstawowe.\u003cbr/\u003e- Doświadczenie w pracy z wieloma kontrahentami i w środowisku wielozakładowym\u003cbr/\u003e- Znajomość systemów sterowania opartych na sterownikach PLC oraz wymogów dotyczących zgodności z przepisami\u003cbr/\u003e- Doświadczenie w używaniu komputerowych systemów zarządzania utrzymaniem ruchu do planowania konserwacji zapobiegawczej i rejestrowania czynności interwencyjnych\u003cbr/\u003e- Wykształcenie wyższe, szczególnie w dziedzinie techniki, operacji lub administracji biznesowej\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":null,"title":"Mistrz utrzymania ruchu i infrastruktury (m/k), RME","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/3133707/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 精通普通话（用简体和/或繁体中文阅读、听、说和写作）和英语，能够撰写语法正确、简洁和准确的书面答复\u003cbr/\u003e- 较强的书面和口头沟通能力，包括与内部和外部客户轻松互动的能力。\u003cbr/\u003e- 能够超越标准操作程序（SOP）进行思考，并推荐正确的结果。\u003cbr/\u003e- 利用多个专业领域的团队知识来帮助解决反复出现的卖家问题。\u003cbr/\u003e- 展示对优先任务和目标进行自我管理的能力。\u003cbr/\u003e- 快速学习者，寻找并愿意分享最佳实践项目。\u003cbr/\u003e- 能够随时随地跟踪数据并做出准确的决策。\u003cbr/\u003e- 能够进行困难而全面的调查，并留下详细、周到的注释。","business_category":"customer-trust-and-partner-support","city":"Pasay City","company_name":"AOSP - Manila","country_code":"PHL","description":"亚马逊面对面身份核验(IPI)团队致力于确保不良行为者无法利用我们的服务来损害客户、销售合作伙伴或我们的商店。我们正在寻找风险专员，以遏制不法行为并提出建议，帮助我们了解不良行为者重点关注的领域。\u003cbr/\u003e\u003cbr/\u003e风险专员将有众多机会获得风险/管理人员职位。这些领导力职位将基于绩效表现而获得，特别是能够开展准确、全面的调查并作出详细、周密的报告的能力。我们的领导者将是那些能够培养、教导和指导其他调查员，使其能够开展准确、全面的调查并作出详细、周密报告的调查员。\u003cbr/\u003e\u003cbr/\u003e我们正在寻找在视频验证、调查、风险管理方面专长的优秀人才，以及未来的领导者。随着团队的扩张和发展，他们将成为我们团队的基础。\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e我们的理想候选人是在欺诈调查、身份验证和验证虚假文件和发票方面有经验的个人。 该职位将包括通过视频通话来采访卖家，工作时间将与中国的营业时间保持一致。\u003cbr/\u003e\u003cbr/\u003eOur ideal candidates are individuals with experience in fraud investigations, identity verification and authenticating fraudulent documents and invoices. This role will involve interviewing sellers through video call. The working hours will align with business hours in China.","department_cost_center":null,"description_short":"亚马逊面对面身份核验(IPI)团队致力于确保不良行为者无法利用我们的服务来损害客户、销售合作伙伴或我们的商店。我们正在寻找风险专员，以遏制不法行为并提出建议，帮助我们了解不良行为者重点关注的领域。风险专员将有众多机会获得风险/管理人员职位。这些领导力职位将基于绩效表现而获得，特别是能够开展准确、全面的调查并作出详细、周密的报告的能力。我们的领导者将是那些能够培养、教导和指导其他调查员，使其能够开展准确、全面的调查并作出详细、周密报告的调查员。我们正在寻找在视频验证、调查、风险管理方面专长的优秀人才，以及未来的领导者。随着团队的扩张和发展，他们将成为我们团队的基础。Key","display_distance":null,"id":"a9b6e230-80b5-46d4-8b4f-95a1aad674a9","id_icims":"3155328","is_intern":null,"is_manager":null,"job_category":"Investigation \u0026 Loss Prevention","job_family":"Risk Family","job_function_id":null,"job_path":"/en/jobs/3155328/risk-specialist-mandarin-speaker-in-person-investigation-support","job_schedule_type":"full-time","location":"PH, Pasay City","locations":["{\"normalizedStateName\":\"National Capital Region\",\"normalizedCountryCode\":\"PHL\",\"city\":\"Pasay City\",\"countryIso3a\":\"PHL\",\"countryIso2a\":\"PH\",\"locationNonStemming\":\"Philippines, Pasay City\",\"coordinates\":\"14.52797,121.00492\",\"normalizedCountyName\":\"Fourth District NCR\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Philippines\",\"normalizedLocation\":\"Pasay City, National Capital Region, PHL\",\"location\":\"PH, Pasay City\",\"region\":\"\",\"buildingCodeList\":[\"MNL13\"],\"normalizedCityName\":\"Pasay City\"}"],"normalized_location":"Pasay City, National Capital Region, PHL","optional_search_labels":[],"posted_date":"January  8, 2026","preferred_qualifications":"- 首选资格\u003cbr/\u003e- 具有进行过对面身份验证的经验是一个优势。\u003cbr/\u003e- 在法律、客户服务、调查、风险管理、项目管理等相关行业工作经验。\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"customer-trust-and-partner-support.team-selling-partner-support","source_system":"JobCreator","state":null,"title":"Risk Specialist - Mandarin Speaker, In-Person Investigation - Support","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/3155328/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-selling-partner-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in a quantitative/technical field such as computer science, engineering, statistics\u003cbr/\u003e- Experience with Excel","business_category":"transportation-and-logistics","city":"Virtual","company_name":"ASSPL - Telangana - D82","country_code":"IND","description":"External job description\u003cbr/\u003e\u003cbr/\u003eNOC (Network Operations Center) is the central command and control center for ‘Transportation Execution’ across the Amazon Supply Chain network supporting multiple geographies like NA, India and EU. It ensures hassle free, timely pick-up and delivery of freight from vendors to Amazon fulfillment centers (FC) and from Amazon FCs to carrier hubs. In case of any exceptions, NOC steps in to resolve the issue and keeps all the stakeholders informed on the proceedings. Along with this tactical problem solving NOC is also charged with understanding trends in network exceptions and then automating processes or proposing process changes to streamline operations. This second aspect involves network monitoring and significant analysis of network data. Overall, NOC plays a critical role in ensuring the smooth functioning of Amazon transportation and thereby has a direct impact on Amazon’s ability to serve its customers on time.\u003cbr/\u003eThis role is based in Central Operations, which is a part of NOC. This team acts as a single point of contact for managing the route plans, scheduling and payments for the last mile stations for LATAM and AMET regions.\u003cbr/\u003e\u003cbr/\u003ePurview of a Transportation Specialist\u003cbr/\u003eIn this role, the candidate will work with business and operations team to solve customer escalations, analyze historic results, initiate programs – all in an environment of rapid growth and increasing complexity. Candidate will drive improvements to the visibility tools, methods, and processes utilized by the team to increase the availability and granularity of actionable data to internal and external partners. The successful candidate must show significant ownership on customer issues and proactively initiate SOPs and process changes as required. He/she will be passionate about their work, detail-oriented, and have excellent problem-solving abilities. He/she will have superb communication and customer-relationship skills, outstanding analytic insight, and be a passionate advocate of customer to other stakeholders. He/she will drive towards simple, scalable solutions to difficult problems, and have excellent project-management skills Responsibilities include, but are not limited to:\u003cbr/\u003eCommunication with internal customers (CS, MM, LM, FC, Trans Program, HR).\u003cbr/\u003eExceptional written and verbal communication skills with the ability to create compelling positioning / messaging strategy and present complex information clearly and concisely.\u003cbr/\u003eHigh attention to detail and proven ability to manage multiple, competing priorities simultaneously with minimal supervision.\u003cbr/\u003eStrong analytical, mediation and problem resolution skills.\u003cbr/\u003eDemonstrated leadership with a bias towards action, supporting a culture of ownership and learning.\u003cbr/\u003eSkilled in collaborative management environment, clear formal and informal communication with members of the remote and local management teams.\u003cbr/\u003eStrong understanding of process improvement technique\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eUnderstand execution and daily production goals.\u003cbr/\u003e\u003cbr/\u003eReview and update SOPs as required. At times assist with execution duties, training associates and verifying SOP compliance.\u003cbr/\u003e\u003cbr/\u003eHandle incoming work requests within standard service level agreements (SLAs).\u003cbr/\u003e\u003cbr/\u003eProvide direction utilizing independent judgment.\u003cbr/\u003e\u003cbr/\u003eConduct regular audits with associates for engagement and standard work adherence.\u003cbr/\u003e\u003cbr/\u003eAssist in shift execution with shift managers.\u003cbr/\u003e\u003cbr/\u003eWork a flexible schedule as business demands, including overnight, weekends and holidays.","department_cost_center":null,"description_short":"External job descriptionNOC (Network Operations Center) is the central command and control center for ‘Transportation Execution’ across the Amazon Supply Chain network supporting multiple geographies like","display_distance":null,"id":"1e8f936c-47b0-4835-b51e-243c737328a0","id_icims":"3173527","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3173527/transportation-specialist-central-operations","job_schedule_type":"full-time","location":"IN, TS, Virtual","locations":["{\"normalizedStateName\":\"West Bengal\",\"normalizedCountryCode\":\"IND\",\"city\":\"Virtual\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, WB, Virtual\",\"coordinates\":\"22.57052,88.37123\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"West Bengal, IND\",\"location\":\"IN, WB, Virtual\",\"region\":\"WB\",\"buildingCodeList\":[\"VCC21\"]}","{\"normalizedStateName\":\"Maharashtra\",\"normalizedCountryCode\":\"IND\",\"city\":\"Virtual\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, MH, Virtual\",\"coordinates\":\"18.94018,72.83484\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Maharashtra, IND\",\"location\":\"IN, MH, Virtual\",\"region\":\"MH\",\"buildingCodeList\":[\"VCC25\"]}","{\"normalizedStateName\":\"Uttar Pradesh\",\"normalizedCountryCode\":\"IND\",\"city\":\"Virtual\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, UP, Virtual\",\"coordinates\":\"26.85471,80.92135\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Uttar Pradesh, IND\",\"location\":\"IN, UP, Virtual\",\"region\":\"UP\",\"buildingCodeList\":[\"VCC15\"]}","{\"normalizedStateName\":\"Andhra Pradesh\",\"normalizedCountryCode\":\"IND\",\"city\":\"Na - Virtual\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, AP, Na - Virtual\",\"coordinates\":\"16.57011,80.35992\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Andhra Pradesh, IND\",\"location\":\"IN, AP, Na - Virtual\",\"region\":\"AP\",\"buildingCodeList\":[\"VCCAPIND\"]}","{\"normalizedStateName\":\"Rajasthan\",\"normalizedCountryCode\":\"IND\",\"city\":\"Virtual\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, RJ, Virtual\",\"coordinates\":\"26.92589,75.80674\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Rajasthan, IND\",\"location\":\"IN, RJ, Virtual\",\"region\":\"RJ\",\"buildingCodeList\":[\"VCC19\"]}","{\"normalizedStateName\":\"Punjab\",\"normalizedCountryCode\":\"IND\",\"city\":\"Virtual\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, PB, Virtual\",\"coordinates\":\"30.84323,75.41766\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Punjab, IND\",\"location\":\"IN, PB, Virtual\",\"region\":\"PB\",\"buildingCodeList\":[\"VCC20\"]}","{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Virtual\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Virtual\",\"coordinates\":\"17.3949,78.47081\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Telangana, IND\",\"location\":\"IN, TS, Virtual\",\"region\":\"TS\",\"buildingCodeList\":[\"VCC13\"]}","{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Virtual\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Virtual\",\"coordinates\":\"12.96646,77.58723\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Karnataka, IND\",\"location\":\"IN, KA, Virtual\",\"region\":\"KA\",\"buildingCodeList\":[\"VCC16\"]}","{\"normalizedStateName\":\"Tamil Nadu\",\"normalizedCountryCode\":\"IND\",\"city\":\"Virtual\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TN, Virtual\",\"coordinates\":\"13.08404,80.28273\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Tamil Nadu, IND\",\"location\":\"IN, TN, Virtual\",\"region\":\"TN\",\"buildingCodeList\":[\"VCC14\"]}"],"normalized_location":"Telangana, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"February  4, 2026","preferred_qualifications":"- Experience with SQL\u003cbr/\u003e- Experience with programming languages such as Python, Java, C++\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-supply-chain","source_system":"JobCreator","state":"TS","title":"Transportation Specialist, CENTRAL OPERATIONS","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/3173527/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-supply-chain","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- University degree (Bachelor's or Master's degree), completed before start date Advanced proficiency in written and verbal English and local language Relevant experience in performing data analysis","business_category":"fulfillment-ops","city":"Haydock","company_name":"Amazon UK Services Ltd.","country_code":"GBR","description":"When you join Amazon as an Area/Shift Manager, you’ll gain experience leading a large and diverse team to make sure your area of the business keeps pace with demand. In this hands-on role, you’ll learn about the complexity of operations at a global business and what it takes to make everything run seamlessly. While you implement your team’s approach to drive productivity, you’ll also work closely with your colleagues to address challenges, which means no two days will be the same. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003ePromote a culture of safety and wellbeing\u003cbr/\u003eAnalyse and implement corrective actions to make sure quality and productivity are at consistently high levels, and business objectives are met across all shifts\u003cbr/\u003eSupport and lead a team and handle administrative work alongside building and supporting a strong team culture\u003cbr/\u003eAnalyse performance and suggest process improvements to optimise work and improve customer service\u003cbr/\u003eCollaborate with other managers to standardise shift processes \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou’ll work shifts and be based at one of our operational sites. Your main focus will be to maintain safety standards within your team and across your site. You’ll also monitor and maintain process efficiency. Your days will always include prioritising routine team management and daily operational tasks, alongside other tasks like individual escalations, process improvement work and wide-scale operational contingency planning.\u003cbr/\u003e\u003cbr/\u003eBeing a key part of the operations team involves working with colleagues in other teams and external partners to make sure we stay on track to meet our customer demands and targets. This will involve analysing data and performance metrics with leaders in your business area, as well as discussing the operational pros and cons of technical improvements with engineers. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon couldn’t deliver at pace without the Amazon Transportation Service (ATS) team. As part of ATS, you’ll be welcomed into a diverse team that plays a central role in our success. Using air, sea and road transport, as well as sortation centres equipped with the latest technology, you’ll help Amazon’s transport run at maximum efficiency. Our team captures data and uses it to drive decisions. They are key to making Amazon more innovative and efficient.\u003cbr/\u003eWe put safety first as our people are our priority. And we use the expertise of our people to get packages to their destination – quickly, conveniently and sustainably.","department_cost_center":null,"description_short":"When you join Amazon as an Area/Shift Manager, you’ll gain experience leading a large and diverse team to make sure your area of the business keeps pace with demand. In this hands-on role, you’ll learn","display_distance":null,"id":"e9cbbcab-b362-4ea1-a5a9-f93cf1833acf","id_icims":"3183105","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3183105/area-manager","job_schedule_type":"full-time","location":"GB, Haydock","locations":["{\"normalizedStateName\":\"England\",\"normalizedCountryCode\":\"GBR\",\"city\":\"Haydock\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, Haydock\",\"coordinates\":\"53.46763,-2.6844\",\"normalizedCountyName\":\"Merseyside\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"St Helens, England, GBR\",\"location\":\"GB, Haydock\",\"region\":\"\",\"buildingCodeList\":[\"MAN8\"],\"normalizedCityName\":\"St Helens\"}"],"normalized_location":"St Helens, England, GBR","optional_search_labels":[],"posted_date":"February 17, 2026","preferred_qualifications":"- Experience of communicating with a wide range of stakeholders, including your peers and leadership.\u003cbr/\u003e- Experience in a logistical working environment.\u003cbr/\u003e- Experience working with the MS Office suite (Word, Excel, Outlook) in a professional environment.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-global-specialty-fulfillment","source_system":"JobCreator","state":null,"title":"Area Manager ","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3183105/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-specialty-fulfillment","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- University degree (Bachelor's or Master's degree), completed before start date Advanced proficiency in written and verbal English and local language Relevant experience in performing data analysis","business_category":"fulfillment-ops","city":"Haydock","company_name":"Amazon UK Services Ltd.","country_code":"GBR","description":"When you join Amazon as an Area/Shift Manager, you’ll gain experience leading a large and diverse team to make sure your area of the business keeps pace with demand. In this hands-on role, you’ll learn about the complexity of operations at a global business and what it takes to make everything run seamlessly. While you implement your team’s approach to drive productivity, you’ll also work closely with your colleagues to address challenges, which means no two days will be the same. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003ePromote a culture of safety and wellbeing\u003cbr/\u003eAnalyse and implement corrective actions to make sure quality and productivity are at consistently high levels, and business objectives are met across all shifts\u003cbr/\u003eSupport and lead a team and handle administrative work alongside building and supporting a strong team culture\u003cbr/\u003eAnalyse performance and suggest process improvements to optimise work and improve customer service\u003cbr/\u003eCollaborate with other managers to standardise shift processes \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou’ll work shifts and be based at one of our operational sites. Your main focus will be to maintain safety standards within your team and across your site. You’ll also monitor and maintain process efficiency. Your days will always include prioritising routine team management and daily operational tasks, alongside other tasks like individual escalations, process improvement work and wide-scale operational contingency planning.\u003cbr/\u003e\u003cbr/\u003eBeing a key part of the operations team involves working with colleagues in other teams and external partners to make sure we stay on track to meet our customer demands and targets. This will involve analysing data and performance metrics with leaders in your business area, as well as discussing the operational pros and cons of technical improvements with engineers. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon couldn’t deliver at pace without the Amazon Transportation Service (ATS) team. As part of ATS, you’ll be welcomed into a diverse team that plays a central role in our success. Using air, sea and road transport, as well as sortation centres equipped with the latest technology, you’ll help Amazon’s transport run at maximum efficiency. Our team captures data and uses it to drive decisions. They are key to making Amazon more innovative and efficient.\u003cbr/\u003eWe put safety first as our people are our priority. And we use the expertise of our people to get packages to their destination – quickly, conveniently and sustainably.","department_cost_center":null,"description_short":"When you join Amazon as an Area/Shift Manager, you’ll gain experience leading a large and diverse team to make sure your area of the business keeps pace with demand. In this hands-on role, you’ll learn","display_distance":null,"id":"7e7e2584-3f65-41da-ae96-2e726133afc3","id_icims":"3183107","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3183107/area-manager","job_schedule_type":"full-time","location":"GB, Haydock","locations":["{\"normalizedStateName\":\"England\",\"normalizedCountryCode\":\"GBR\",\"city\":\"Haydock\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, Haydock\",\"coordinates\":\"53.46763,-2.6844\",\"normalizedCountyName\":\"Merseyside\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"St Helens, England, GBR\",\"location\":\"GB, Haydock\",\"region\":\"\",\"buildingCodeList\":[\"MAN8\"],\"normalizedCityName\":\"St Helens\"}"],"normalized_location":"St Helens, England, GBR","optional_search_labels":[],"posted_date":"February 17, 2026","preferred_qualifications":"- Experience of communicating with a wide range of stakeholders, including your peers and leadership Experience in a logistical working environment Experience working with the MS Office suite (Word, Excel, Outlook) in a professional environment Amazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates. Amazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status. Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e- Amazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e- Amazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e- Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-global-specialty-fulfillment","source_system":"JobCreator","state":null,"title":"Area Manager ","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3183107/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-specialty-fulfillment","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Abgeschlossene technische Berufsausbildung, anerkannt durch die Industrie- und Handelskammer (IHK) oder Handwerkskammer (HWK). Alternativ Nachweis eines erfolgreich abgeschlossen Hochschulstudiums im Ingenieurwissenschaftlichen Bereich (Maschinenbau / Mechatronik / Elektrotechnik oder artverwandt) einer deutschen Hochschule oder anerkannte ausländische Hochschulabschlüsse (BA, B. Sc., MA, M. Sc., Dipl.-Ing.)\u003cbr/\u003e- Berufserfahrung in dem entsprechenden Handwerk\u003cbr/\u003e- Erfahrung in der Instandhaltung von industriellen Produktionsanlagen\u003cbr/\u003e- Fortgeschrittene Deutschkenntnisse in Wort und Schrift","business_category":"fulfillment-ops","city":"Messkirch","company_name":"Amazon Deutschland S15 Transport GmbH - J65","country_code":"DEU","description":"Für unseren Standort in Meßkirch bei Konstanz suchen wir nach einem Servicetechniker / Mechatroniker / Elektroniker / Mechaniker oder vergleichbar als Instandhaltungstechniker:in!\u003cbr/\u003e\u003cbr/\u003eDas Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) ist für unseren Betrieb von fundamentaler Bedeutung – es sorgt dafür, dass unsere technischen Systeme und Anlagen laufend funktionieren. Als Instandhaltungstechniker:in bist Du für die Wartung und Instandhaltung unserer förder- und haustechnischen Anlagen sowie Produktionsanlagen zuständig. Du hilfst, die höchsten Sicherheitsstandards im Arbeitsschutz zu gewährleisten und Maschinenausfallzeiten zu verhindern. Unser technisches Team stellt eine hohe Verfügbarkeit der technischen Anlagen sicher und verbessert die Qualität unserer Geräte.\u003cbr/\u003e\u003cbr/\u003e*** Die Stelle beinhaltet die Arbeit in einem rotierenden Dreischichtsystem, welches Samstage, Nachtschichten sowie Rufbereitschaft umfassen kann. Zudem besteht das Logistiknetzwerk in der Region aus mehreren Standorten, bei denen gelegentlich Unterstützung an einem nahegelegenen Standort erforderlich sein kann. ***\u003cbr/\u003e\u003cbr/\u003eWir bieten:\u003cbr/\u003e- Einen unbefristeten Vertrag direkt mit Amazon\u003cbr/\u003e- Ein attraktives Vergütungspaket inklusive Winterbonus und Sommerbonus (abhängig von der Betriebszugehörigkeitsdauer)\u003cbr/\u003e- Eine kostenlose Lebens- und Erwerbsunfähigkeitsversicherung und Unterstützung bei der betrieblichen Altersvorsorge\u003cbr/\u003e- Amazon Career Choice Programm, mit dem wir Weiterbildungen mit bis zu 8.000€ unterstützen\u003cbr/\u003e- Mitarbeiterrabatte auf amazon.de sowie Amazon Extras (z.B. Rabatte in Reisen, Restaurants, Unterhaltung, Elektronik, Heim etc.)\u003cbr/\u003e- Pendlerleistungen: Kostenloses Parken oder Kostenübernahme für das Deutschlandticket\u003cbr/\u003e- Familienbonus (Einmalzahlung für Eltern in Elternzeit)\u003cbr/\u003e- Vermittlungsservices für die Betreuung von Kindern, Senioren und Menschen mit besonderen Bedürfnissen\u003cbr/\u003e- Ein kostenloses Mitarbeiterhilfeprogramm (auch für Familienmitglieder) für eine Beratung bei beruflichen oder privaten Angelegenheiten\u003cbr/\u003e- Hervorragende Weiterentwicklungsmöglichkeiten in einem globalen Unternehmen\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Ausführung präventiver Wartungsmaßnahmen an einer breiten Vielfalt von Geräten an unseren Standorten\u003cbr/\u003e- Durchführung von Reparaturen und Fehlerdiagnosen\u003cbr/\u003e- Verwendung neuester Tools zur Maximierung der Geräteeffektivität\u003cbr/\u003e- Einhaltung aller Arbeitsschutzrichtlinien und -praktiken \u003cbr/\u003e- Unterstützung der Entwicklung und des beruflichen Fortschritts von Auszubildenden am Standort\u003cbr/\u003e- Arbeit an Projekten zur kontinuierlichen Verbesserung und Einführung von Best Practices an verschiedenen EU-Standorten\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e\u003ciframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/KF1WQa7Iih0?si=PVNLk5s70pmWmz0w\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen\u003e\u003c/iframe\u003e\u003cbr/\u003e\u003cbr/\u003eAls Instandhaltungstechniker:in bist Du vor Ort in einem unserer Logistikzentren tätig, um schnell auf technische Störungen reagieren zu können. Du führst eine Reihe geplanter präventiver Wartungsmaßnahmen an Geräten durch, um für ihren sicheren Betrieb zu sorgen. Außerdem reagierst Du als Instandhaltungstechniker:in unverzüglich auf Störungen und Ausfälle. Du untersuchst die Ursachen, findest so schnell wie möglich Lösungen und wendest sie an.  Zudem machst Du Vorschläge für langfristige Verbesserungen.\u003cbr/\u003eIn Zusammenarbeit mit leitenden Kolleg:innen nimmst Du tägliche Wartungsaufgaben wahr und kommunizierst mit Dienstleistern, falls Du externe Expertise benötigst. Du arbeitest in rotierenden Schichten, damit wir rund um die Uhr unsere Standorte unterstützen – und dafür sorgen, dass Amazon weiterhin in dem Tempo liefern kann, für das wir bekannt sind. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eUnser Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) sorgt dafür, dass unsere Geräte und Ausstattung jederzeit optimal funktionieren. Wir sind ein Team von Techniker:innen und Ingenieur:innen, das aus hervorragenden Teamplayern besteht und von erfahrenen Führungskräften geleitet wird. Wir arbeiten gemeinsam daran, die Geräte in unserem gesamten globalen Netzwerk von Fulfillment-Centern zu warten, zu reparieren und ihre Fehler zu beheben. Einige unserer Mitarbeiter:innen sind Führungskräfte, die das Team bei der Arbeit an spannender, innovativer Technologie beaufsichtigen – die es teilweise nur bei Amazon gibt.\u003cbr/\u003eVon der Installation automatisierter Verpackungssysteme bis hin zur Beaufsichtigung der allgemeinen Wartungsarbeiten eines Standorts sowie der Reparatur von für den Vertrieb wesentlichen Geräten wickelt unser Team einen Großteil der technischen Aufgaben bei Amazon ab. Unter anderem sorgt es auch dafür, dass Gebäude weiterhin den rechtlichen Auflagen entsprechen, damit alle sicher bleiben und unsere Standorte mit maximaler Effizienz betrieben werden. Es gibt zahlreiche Aufstiegschancen im RME-Team selbst ebenso wie im gesamten Amazon-Unternehmen.\u003cbr/\u003eAlle unsere Aktivitäten sind darauf ausgerichtet, die Ausfallzeiten an Amazons wichtigsten Betriebsstandorten zu reduzieren, damit Kund:innen ihre Bestellungen rechtzeitig erhalten. Oft arbeiten wir früh morgens, spät abends oder in der Nachtschicht, um Wartungsarbeiten mit den geringstmöglichen Störungen vorzunehmen. Falls wir eine bessere Möglichkeit finden, eine bestimmte Aufgabe zu erledigen, verfügen wir über die Fertigkeiten und Gelegenheiten, vollständig neue Prozesse oder bahnbrechende Technologie wie Amazon Robotics oder unseren Complex Item Sorter einzuführen.","department_cost_center":null,"description_short":"Für unseren Standort in Meßkirch bei Konstanz suchen wir nach einem Servicetechniker / Mechatroniker / Elektroniker / Mechaniker oder vergleichbar als Instandhaltungstechniker:in!Das Wartungs- und Instandhaltungsteam","display_distance":null,"id":"032511cd-1355-4f92-8bf0-264cb5b0421f","id_icims":"3139413","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3139413/servicetechniker-mechatroniker-elektroniker-mechaniker-messkirch-bei-konstanz","job_schedule_type":"full-time","location":"DE, BW, Messkirch","locations":["{\"normalizedStateName\":\"Baden-Wurttemberg\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Tubingen\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, BW, Tubingen\",\"coordinates\":\"48.52035,9.04913\",\"normalizedCountyName\":\"Tübingen\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Tübingen, Baden-Wurttemberg, DEU\",\"location\":\"DE, BW, Tubingen\",\"region\":\"BW\",\"buildingCodeList\":[\"STR11\"],\"normalizedCityName\":\"Tübingen\"}","{\"normalizedStateName\":\"Baden-Wurttemberg\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Konstanz\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, BW, Konstanz\",\"coordinates\":\"47.66385,9.17758\",\"normalizedCountyName\":\"Constance\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Constance, Baden-Wurttemberg, DEU\",\"location\":\"DE, BW, Konstanz\",\"region\":\"BW\",\"buildingCodeList\":[\"DBX1\"],\"normalizedCityName\":\"Constance\"}","{\"normalizedStateName\":\"Baden-Wurttemberg\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Messkirch\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, BW, Messkirch\",\"coordinates\":\"47.9952,9.11568\",\"normalizedCountyName\":\"Sigmaringen\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Meßkirch, Baden-Wurttemberg, DEU\",\"location\":\"DE, BW, Messkirch\",\"region\":\"BW\",\"buildingCodeList\":[\"DBW8\"],\"normalizedCityName\":\"Meßkirch\"}","{\"normalizedStateName\":\"Baden-Wurttemberg\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Ulm\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, BW, Ulm\",\"coordinates\":\"48.39719,9.98759\",\"normalizedCountyName\":\"Ulm\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Ulm, Baden-Wurttemberg, DEU\",\"location\":\"DE, BW, Ulm\",\"region\":\"BW\",\"buildingCodeList\":[\"DBY3\"],\"normalizedCityName\":\"Ulm\"}","{\"normalizedStateName\":\"Baden-Wurttemberg\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Deißlingen\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, BW, Deißlingen\",\"coordinates\":\"48.11335,8.60531\",\"normalizedCountyName\":\"Rottweil\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Deißlingen, Baden-Wurttemberg, DEU\",\"location\":\"DE, BW, Deißlingen\",\"region\":\"BW\",\"buildingCodeList\":[\"DZQ2\"],\"normalizedCityName\":\"Deißlingen\"}"],"normalized_location":"Meßkirch, Baden-Wurttemberg, DEU","optional_search_labels":["ops.lander-emea-rme-technician","ops.rme-technician","hourly"],"posted_date":"December  9, 2025","preferred_qualifications":"- (Bevorzugte Qualifikationen sind nicht erforderlich, um sich bei Amazon zu bewerben. Wenn Sie alle oben genannten Grundqualifikationen erfüllen, würden wir uns freuen, von Ihnen zu hören.)\u003cbr/\u003e- Erfahrung mit zustandsorientierter Überwachung\u003cbr/\u003e- Erfahrung in der Arbeit mit Druck- und Applikationsmaschinen\u003cbr/\u003e- Erfahrung in der Störungssuche und Wartung von Förder- oder Automationssystemen\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":"BW","title":"Servicetechniker / Mechatroniker / Elektroniker / Mechaniker - Meßkirch bei Konstanz","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3139413/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree, or Advanced degree\u003cbr/\u003e- Experience in security services, asset protection, loss prevention, risk management, inventory management, investigations, supply chain, auditing, compliance, or similar\u003cbr/\u003e- Experience managing people including development, hiring, performance management, and leading teams dispersed across various regions\u003cbr/\u003e- Experience working with the MS Office suite (Word, Excel, Outlook) in a professional environment\u003cbr/\u003e- Advanced proficiency in written and verbal Spanish and upper intermediate proficiency in written and verbal English","business_category":"fulfillment-and-operations","city":"Dos Hermanas","company_name":"Amazon Spain Fulfillment, S.L.U. - C05","country_code":"ESP","description":"Our operations network, known for our speed, accuracy, and exceptional service, delivers millions of packages and smiles to Amazon customers every day. To keep our operations network secure and assure operational continuity, we are looking for an experienced and customer obsessed professional who wants to join our team as Cluster Loss Prevention Manager. In this key role, you will be accountable for the delivery of security as a service to a cluster of operational sites across the end-to-end supply chain to protect our people and prevent loss.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tBe accountable for Security \u0026 Loss Prevention performance within your cluster\u003cbr/\u003e•\tManage a team of Security and Loss Prevention professionals who provide security as a service to operational sites within a geographical area of responsibility that make up a cluster\u003cbr/\u003e•\tEnsure site compliance, regular site audits, and physical security posture of sites within your cluster\u003cbr/\u003e•\tManage relevant risks within your cluster (prevention, intervention, investigation)\u003cbr/\u003e•\tEngage senior management within your cluster to ensure a positive working relationship, understand opportunities to support, and provide security risk guidance\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Cluster Loss Prevention Manager, you are responsible for a team of Security and Loss Prevention professionals who provide security as a service to operational sites from across the Amazon supply chain within a geographical area of responsibility that make up a cluster. You will be accountable for the performance of Security and Loss Prevention within your cluster. Thus, you manage the day-to-day tactical deployment of your team to manage security and loss prevention related workload. You prioritize incoming workload and assess risks to ensure meeting service level agreements agreed with your internal customers and proactively avoid adverse impact to the business. \u003cbr/\u003e\u003cbr/\u003eYou coach your team and provide expert guidance throughout prevention, intervention and investigation. Your team manages the day-to-day operational activities; however, you will take ownership when problems become complex. You work with your team to identify, evaluate, and mitigate all security risks within your cluster and share findings and best practices with the wider business. \u003cbr/\u003e\u003cbr/\u003eYou will be responsible for ensuring site compliance, regular site audits, and physical security posture of sites within your cluster. Additionally, you will be responsible for budgetary planning for external service providers as well as the recruiting of your direct reports in your cluster. Finally, you engage senior management within your cluster to ensure a positive working relationship, understand opportunities to support, and provide security risk guidance.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eSitting within the Global Security Operations organisation, Security and Loss Prevention supports the accomplishment of Amazon´s business targets and the strengthening of our brand by effectively protecting against relevant threats and by managing security and loss prevention risks that could:\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e•\tPut our associates and customers under jeopardy\u003cbr/\u003e•\tDisrupt the continuity of our business operations\u003cbr/\u003e•\tInflict damage to our assets\u003cbr/\u003e•\tHave adverse impact on our brand reputation\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eWorking in partnership with our stakeholders, we secure the Amazon supply chain end-to-end and promote security during business conversations. We do this by preventing security and loss prevention-related risks and vulnerabilities as early as possible, intervening in unfolding incidents to minimize any negative impact as well as thoroughly investigating security-related incidents to identify and remove root causes, preventing reoccurrence.\u003cbr/\u003e","department_cost_center":null,"description_short":"Our operations network, known for our speed, accuracy, and exceptional service, delivers millions of packages and smiles to Amazon customers every day. To keep our operations network secure and assure","display_distance":null,"id":"f31ac87f-4bf5-4fe5-bbba-636a0ace0f55","id_icims":"3183710","is_intern":null,"is_manager":null,"job_category":"Investigation \u0026 Loss Prevention","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3183710/cluster-loss-prevention-manager-security-loss-prevention","job_schedule_type":"full-time","location":"ES, SE, Dos Hermanas","locations":["{\"normalizedStateName\":\"Andalucia\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Dos Hermanas\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, SE, Dos Hermanas\",\"coordinates\":\"37.2831,-5.92833\",\"normalizedCountyName\":\"Seville\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Dos Hermanas, Andalucia, ESP\",\"location\":\"ES, SE, Dos Hermanas\",\"region\":\"SE\",\"buildingCodeList\":[\"SVQ1\"],\"normalizedCityName\":\"Dos Hermanas\"}"],"normalized_location":"Dos Hermanas, Andalucia, ESP","optional_search_labels":["ops.lander-emea-slp"],"posted_date":"February 18, 2026","preferred_qualifications":"- Experience managing contract security and physical security operation programs such as Access Control/Intrusion Detection and CCTV Surveillance systems\u003cbr/\u003e- Experience within a distribution center, logistics, or manufacturing environment\u003cbr/\u003e- Experience communicating clearly and concisely with leadership, stakeholders, and cross-functional teams\u003cbr/\u003e- Driver's license\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-global-fulfillment-loss-prevention-and-security","source_system":"JobCreator","state":"SE","title":"Cluster Loss Prevention Manager , Security \u0026 Loss Prevention","university_job":null,"updated_time":"26 minutes","url_next_step":"https://account.amazon.com/jobs/3183710/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-fulfillment-loss-prevention-and-security","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of technical product or program management experience\u003cbr/\u003e- 3+ years of software development experience\u003cbr/\u003e- Bachelor's degree in engineering, computer science or equivalent","business_category":"operations","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"Amazon has spent years building one of the world’s most efficient and optimized supply chains. The Supply Chain Services Team, part of Santos org, will build on that foundation and continue to innovate end-to-end supply chain capabilities for merchants to conduct their off-Amazon business. \u003cbr/\u003eOur vision is to enable every entrepreneur in the world to reach every customer in the world through every channel they can imagine. The Supply Chain Services team is in exciting next step in our mission/vision to help merchants of all sizes grow their business beyond Amazon by using Amazon’s optimized and efficient supply chain network and services.\u003cbr/\u003e\u003cbr/\u003eAs we rapidly scale to serve our off-Amazon customers, we need a Senior Technical Program Manager (Sr.TPM) who can work across our organization and stakeholders, with both strategic and tactical vision. We are building products that are fundamental to Amazon’s future, and we are tackling some of the world’s most intriguing problems involving software architecture design, customer experience, and business strategy.\u003cbr/\u003e\u003cbr/\u003eAs a Senior Technical Program Manager, you will be responsible for identifying, scoping, and delivering end to end deliverables. You will apply both business and technical acumen in a fast-paced, ambiguous, and innovative environment. You thrive through building consensus and driving teams towards results. You will anticipate bottlenecks, provide escalation management, anticipate and make tradeoffs, and balance the business needs versus technical constraints. An ability to take large, complex projects and break them down into manageable pieces to deliver them in a successful and timely manner. Maturity, high judgment, negotiation skills, ability to influence, analytical talent and leadership are essential to success in this role.\u003cbr/\u003e\u003cbr/\u003eYou will join a highly technical and entrepreneurial culture defining and building the next generation of a fulfillment solution for 3rd party merchants and brand owners.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities:\u003cbr/\u003e* Develop and execute project plans with an impact across teams.\u003cbr/\u003e* Demonstrate the ability to provide both structured and creative thinking in a dynamic, evolving, multi team-based environment\u003cbr/\u003e* Demonstrate the ability to communicate effectively at multiple levels of management, building trust across the organization, and demonstrating discretion with sensitive information\u003cbr/\u003e* Show ownership and leadership skills in coordinating projects across multiple teams, driving them to successful conclusion while building strong, lasting relationships with both internal and external customers\u003cbr/\u003e* Be comfortable working in a fast-paced, ever-changing environment while driving teams to complete goals\u003cbr/\u003e* Demonstrate the ability to break abstract goals into attainable, measurable work items\u003cbr/\u003e* Manage a cross-functional process to translate the desired customer experience into a logically sequenced and optimized product roadmap and product releases","department_cost_center":null,"description_short":"Amazon has spent years building one of the world’s most efficient and optimized supply chains. The Supply Chain Services Team, part of Santos org, will build on that foundation and continue to innovate","display_distance":null,"id":"48df6c83-10b3-43f4-8799-c73ead238cff","id_icims":"3177577","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Technical Program Management","job_function_id":null,"job_path":"/en/jobs/3177577/senior-technical-program-manager-multichannel-fulfilment-buy-with-prime","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR27\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"February 10, 2026","preferred_qualifications":"- 5+ years of project management disciplines including scope, schedule, budget, quality, along with risk and critical path management experience\u003cbr/\u003e- Experience defining KPI's/SLA's used to drive multi-million dollar businesses and reporting to senior leadership\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"operations.team-global-fulfillment-services","source_system":"JobCreator","state":"KA","title":"Senior Technical Program Manager, Multichannel Fulfilment, Buy With Prime","university_job":null,"updated_time":"30 minutes","url_next_step":"https://account.amazon.com/jobs/3177577/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-fulfillment-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of computer hardware troubleshooting and repair experience\u003cbr/\u003e- 1+ years of computer networking experience\u003cbr/\u003e- High school or equivalent diploma","business_category":"aws","city":"Mumbai","company_name":"ADSIPL - Maharashtra","country_code":"IND","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eData Center Operations designs, installs \u0026 maintains the world’s largest Cloud Computing Infrastructure. We are looking for skilled Data Centre Linux \u0026 HW Engineer at Amazon Data Services India Private Limited (“ADSIPL”) with a passion for technology to help us expand AWS Cloud offerings to the next level.\u003cbr/\u003e  \u003cbr/\u003eADSIPL offers an exciting, dynamic and challenging environment encouraging creativity and personal development while maintaining AWS computing environments in a secure, scalable, and cost-effective manner. \u003cbr/\u003e \u003cbr/\u003eAt ADSIPL, career progression is part of our environment. We want you to progress. If your career path is in Systems, Network or Database Engineering, Software Development or maybe AWS Support, Technical Operations or perhaps Project Management, we will create a development plan to enable you to succeed reaching those goals. This begins on Day One!\u003cbr/\u003e  \u003cbr/\u003eA Data Centre Linux \u0026 HW Engineer at ADSIPL may be the primary point of contact for both internal customers (for example: Network Engineers, Systems Engineers, Software Developers, Database Engineers, Technical Operations) and external customers (Hardware Vendors, Contractors, Service Providers among others). \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eA Data Centre Operation Technician at ADSIPL, expectation from role are:\u003cbr/\u003e\u003cbr/\u003e• You work as part of the Operations team, whose primary responsibility is the maintenance and upkeep of the data center infrastructure.\u003cbr/\u003e• your role and responsibilities include, but are not limited to, server rack installation, hardware break-fix on various components, troubleshooting network issues also responding to emergent situations that affect operational stability.\u003cbr/\u003e• You may be the primary contact point for both internal customers (for example: Network Engineers, Systems Engineers, Software Developers, Technical Operations) and external service partners (Hardware Vendors, Contractors, Service Providers among others).\u003cbr/\u003e• You will work and meet SLAs against assigned trouble tickets via a directed workflow, be the first line touch point for hardware troubleshooting and technical issues.\u003cbr/\u003e• You perform on-call duties and will participate in Data Center operations, handling scheduled maintenance and change management activities that require monitoring of the data center infrastructure.\u003cbr/\u003e• You participate in team meetings for metric analysis and to discuss achieving daily/weekly goals.\u003cbr/\u003e• You possess knowledge of the policies and procedures, including safety and security, within your department, and understand the appropriate application of such knowledge\u003cbr/\u003e• You contribute to documentation on technical issues through root cause analysis for operational issues that occur, and contribute to process improvement initiatives relevant to the data center environment.\u003cbr/\u003e• More experienced technicians may assist in training less experienced members of the team.\u003cbr/\u003e* This position also has a physical component requiring the ability to lift \u0026 rack equipment up to 20kg; it may require working in cramped spaces or in elevated locations while adhering to health \u0026 safety guidelines.\u003cbr/\u003e* This role involves covering 24x7 shift rotation\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. ","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"223f93df-3cbb-4b4b-8b1c-2c972f811b14","id_icims":"3124243","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3124243/data-centre-operation-technician-dco-tech","job_schedule_type":"full-time","location":"IN, MH, Mumbai","locations":["{\"normalizedStateName\":\"Maharashtra\",\"normalizedCountryCode\":\"IND\",\"city\":\"Mumbai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, MH, Mumbai\",\"coordinates\":\"18.94018,72.83484\",\"normalizedCountyName\":\"Mumbai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Mumbai, Maharashtra, IND\",\"location\":\"IN, MH, Mumbai\",\"region\":\"MH\",\"buildingCodeList\":[\"BOM109\"],\"normalizedCityName\":\"Mumbai\"}"],"normalized_location":"Mumbai, Maharashtra, IND","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"November 11, 2025","preferred_qualifications":"- Experience dealing effectively with customers during problem resolution and operating efficiently under pressure\u003cbr/\u003e- 2+ years of data center engineering experience\u003cbr/\u003e- Experience with network hardware: copper and optical fiber cabling, switches, routers\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-no-matching-primary-label-listed","source_system":"JobCreator","state":"MH","title":"Data Centre Operation Technician, DCO Tech","university_job":null,"updated_time":"31 minutes","url_next_step":"https://account.amazon.com/jobs/3124243/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-no-matching-primary-label-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}