{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Experience with test plan development, building the necessary test bench infrastructure, developing tests and verifying the design\u003cbr/\u003e- 4+ years of design verification experience using constrained-random simulation techniques (such as UVM)\u003cbr/\u003e- 4+ years of experience in testbench development including stimulus, checkers, assertions and coverage","business_category":"aws","city":"Toronto","company_name":"Amazon Development Centre Canada ULC","country_code":"CAN","description":"Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform, and our Custom Silicon organization is revolutionizing how we deliver cloud services to our customers.  You’ll be part of a team that drives innovation in custom chip development, directly impacting the future of cloud computing.\u003cbr/\u003e\u003cbr/\u003eAs a member of the Cloud-Scale Machine Learning Acceleration team you’ll be developing hardware solution for AWS data center including AWS Inferentia,Trainium systems - custom designed machine learning data center accelerator.\u003cbr/\u003e\u003cbr/\u003eWe are looking for a passionate Design Verification Engineer to join our newly formed team responsible for verifying high-speed I/O and scale-up/out components across the SoC. You will take full ownership of delivering comprehensive verification solutions at a sub-system/chip level, with strong emphasis on system-wide implications and interactions. This role requires developing and implementing verification environments using state-of-the-art simulation methodology. You will create robust test scenarios and collaborate closely with design, architecture, and software teams to ensure thorough coverage of hardware-software interfaces and cross-module functionality.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Own the development and execution of verification plans for components at sub-system and chip levels\u003cbr/\u003e- Build and implement verification environments using advanced simulation methodologies and industry-standard tools\u003cbr/\u003e- Define, create and execute comprehensive test scenarios covering system-level flows, critical paths, and corner cases\u003cbr/\u003e- Drive coverage closure and verification sign-off to ensure high-quality, tape-out ready design\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences. Amazon’s culture of inclusion is reinforced within our 16 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.\u003cbr/\u003e \u003cbr/\u003eWork/Life Balance\u003cbr/\u003eOur team puts a high value on work-life balance. It isn’t about how many hours you spend at home or at work; it’s about the flow you establish that brings energy to both parts of your life. We believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfillment. We offer flexibility in working hours and encourage you to find your own balance between your work and personal lives.\u003cbr/\u003e \u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded professional and enable them to take on more complex tasks in the future.","department_cost_center":null,"description_short":"Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform, and our Custom Silicon organization is revolutionizing how we deliver cloud services to our customers.  You’ll","display_distance":null,"id":"a70cb1f7-3763-4565-92e0-5f228aa45633","id_icims":"3155631","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"ASIC","job_function_id":null,"job_path":"/en/jobs/3155631/design-verification-engineer-annapurna-labs","job_schedule_type":"full-time","location":"CA, ON, Toronto","locations":["{\"normalizedStateName\":\"Ontario\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Toronto\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, ON, Toronto\",\"coordinates\":\"43.64869,-79.38544\",\"normalizedCountyName\":\"Toronto\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Toronto, Ontario, CAN\",\"location\":\"CA, ON, Toronto\",\"region\":\"ON\",\"buildingCodeList\":[\"YYZ18\"],\"normalizedCityName\":\"Toronto\"}"],"normalized_location":"Toronto, Ontario, CAN","optional_search_labels":["aws.team-annapurna-labs","aws.team-utility-computing"],"posted_date":"January  8, 2026","preferred_qualifications":"- Experience with C/C++ and Object-Oriented Programming\u003cbr/\u003e- Experience with AMBA protocols, for e.g. AHB/APB/AXI\u003cbr/\u003e- Experience with interconnect protocols, such as PCIe and UCIe\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(34, 34, 34)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. As a total compensation company, Amazon's package may include other elements such as sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon offers comprehensive benefits including health insurance (medical, dental, vision, prescription, basic life \u0026amp; AD\u0026amp;D insurance), Registered Retirement Savings Plan (RRSP), Deferred Profit Sharing Plan (DPSP), paid time off, and other resources to improve health and well-being. We thank all applicants for their interest, however only those interviewed will be advised as to hiring status.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eCAN, ON, Toronto - 104,900.00 - 175,100.00 CAD annually","primary_search_label":"aws.team-machine-learning-primary","source_system":"JobCreator","state":"ON","title":"Design Verification Engineer, Annapurna Labs","university_job":null,"updated_time":"1 minute","url_next_step":"https://account.amazon.com/jobs/3155631/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-machine-learning-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of non-internship professional software development experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"selling-partner-services","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"Would you like to work on one of the world's largest transactional distributed systems? How about working with customers and peers from the entire range of Amazon's business on cool new features? Whether you're passionate about building highly scalable and reliable systems or a software developer who likes to solve business problems, Selling Partner Services (SPS) is the place for you. Our team is responsible for Case Management System.\u003cbr/\u003e\u003cbr/\u003eWe are looking for software engineers who thrive on complex problems and solve for operating complex and mission critical systems under high loads. Our systems manage case resolution systems with hundreds of millions of requests, and respond to millions of service requests. We have both frontend and backend code stack and opportunities. We are aimed to provide customizable and LLM based solution to our clients. Do you think you are up for this challenge? Or would you like to learn more and stretch your skills and career?\u003cbr/\u003eThe successful candidate is expected to contribute to all parts of the software development and deployment lifecycle, including design, development, documentation, testing and maintenance. They must possess good verbal and written communication skills, be self-driven and deliver high quality results in a fast paced environment. \u003cbr/\u003eYou will thrive in our collaborative environment, working alongside accomplished engineers who value teamwork and technical excellence. We're looking for experienced technical leaders.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs a Software Development Engineer on the team you will take ownership over the software design, documentation, development, engineering approach, delivery and support of systems built natively in AWS. In this role you will collaborate with leaders, work backwards from customers, identify problems, propose innovative solutions, relentlessly raise standards, and have a positive impact on hundreds of millions of customers.","department_cost_center":null,"description_short":"Would you like to work on one of the world's largest transactional distributed systems? How about working with customers and peers from the entire range of Amazon's business on cool new features? Whether","display_distance":null,"id":"824c0c51-a839-4eac-b158-0eac4c34ba6d","id_icims":"3127171","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3127171/software-dev-engineer-ii-paragon","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR27\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"November 15, 2025","preferred_qualifications":"- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"selling-partner-services.no-team-listed","source_system":"JobCreator","state":"KA","title":"Software Dev Engineer II, Paragon","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3127171/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- 3+ years of increasing responsibilities in WHS and/or environmental programs in manufacturing, production, or service operations\u003cbr/\u003e- 3+ years of increasing responsibilities in people and performance management, or 2+ years of Amazon Safety (blue badge/FTE) experience","business_category":"fulfillment-and-operations","city":"Reno","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We're seeking a dedicated Workplace Health \u0026 Safety (WHS) Manager to join our mission of creating the world's safest work environment. This role offers an exciting opportunity to directly impact associate well being while driving operational excellence.\u003cbr/\u003e\u003cbr/\u003eAs a WHS Manager, you'll be the site's safety champion, leading our Global WHS Program implementation. You'll combine hands-on safety management with strategic thinking to protect our most valuable asset – our people. Your role bridges the gap between safety requirements and operational success, requiring both technical expertise and strong interpersonal skills. Working closely with Operations leadership, you'll drive safety initiatives that make a real difference. You'll conduct comprehensive risk assessments, analyze safety data, and implement practical solutions that protect associates while supporting productivity. Your ability to build relationships and influence positive change will be essential as you help shape our safety culture. You'll lead safety compliance efforts, conduct thorough site audits, and analyze incident trends to target improvements where they matter most. Managing our first aid program and emergency response capabilities, you'll ensure immediate care is always available. Your analytical skills will transform safety data into actionable insights, while your leadership abilities will help engage associates in our safety mission.\u003cbr/\u003e\u003cbr/\u003eCore Impact Areas:\u003cbr/\u003eSafety Leadership \u0026 Innovation - Transform safety culture through leadership and innovative solutions. Drive continuous improvement initiatives that set new benchmarks in workplace safety. Leverage technology and data analytics to drive preventive safety measures that protect our associates while enhancing operational excellence. Develop leadership plans, communicate expectations, and drive initiatives to create a safe work environment. Measure performance against WHS policies, analyze metrics, and conduct site audits to address non-compliance issues. \u003cbr/\u003e\u003cbr/\u003eStrategic Partnership \u0026 Influence - Build partnerships with Operations leadership to integrate safety into every aspect of our business. Use compelling data analysis and risk insights to influence positive change and drive strategic decision-making. Establish yourself as a trusted advisor who balances safety excellence with operational demands. Oversee recordkeeping, workplace organization, and WHS training programs. \u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements include: \u003cbr/\u003e- Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Stand/walk for up to 12 hours during shifts\u003cbr/\u003e- Work in an environment where the noise level varies \u003cbr/\u003e- Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e- Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e- Maintain effective care delivery in emergencies and assist emergency response at the site\u003cbr/\u003e\u003cbr/\u003eFor those that do not have an adult First Aid, CPR, AED certification from the American Heart Association or American Red Cross, must obtain within 3 weeks of start date.\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We're seeking","display_distance":null,"id":"d7e0afbc-4247-454e-a360-389aad3014b3","id_icims":"3180507","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3180507/site-ehs-manager-ii","job_schedule_type":"full-time","location":"US, NV, Reno","locations":["{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"Reno\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, Reno\",\"coordinates\":\"39.52766,-119.81353\",\"normalizedCountyName\":\"Washoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Reno, Nevada, USA\",\"location\":\"US, NV, Reno\",\"region\":\"NV\",\"buildingCodeList\":[\"SNV4\"],\"normalizedCityName\":\"Reno\"}"],"normalized_location":"Reno, Nevada, USA","optional_search_labels":[],"posted_date":"February 13, 2026","preferred_qualifications":"- Experience in Distribution Center or Manufacturing EHS with mix of exempt and non-exempt employees at a site of at least 250 people\u003cbr/\u003e- Master's degree\u003cbr/\u003e- Experience implementing lean principles and process improvement in an operational environment\u003cbr/\u003e- Experience in a fast paced, dynamic organization\u003cbr/\u003e- Certified Safety Professional\u003cbr/\u003e- Excellent written and verbal communication skills, including comfort interfacing with site leader\u003cbr/\u003e- Ability to develop and implement department goals and strategies\u003cbr/\u003e- Strong analytical skills with demonstrated problem solving ability\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NV, Reno - 70,100.00 - 105,200.00 USD annually","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"NV","title":"Site EHS Manager II","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3180507/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 6+ years of design experience\u003cbr/\u003e- Have an available online portfolio\u003cbr/\u003e- Experience that includes strong analytical skills, attention to detail, and effective communication abilities\u003cbr/\u003e- Experience working effectively across cross-functional teams and partnering well with people at all levels within an organization\u003cbr/\u003e- Experience creating terminology and usage lists, content patterns, and UI text style guidelines.\u003cbr/\u003e- Positive energy and leadership capabilities, as well as a willingness to work outside of a typical content role to deliver holistic solutions to customer problems.","business_category":"advertising","city":"New York","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Are you a seasoned UX Writer who is passionate about complex enterprise systems and delivering elevated writing for user experiences? \u003cbr/\u003e\u003cbr/\u003eThe Advertising User Experience team is looking for a Senior UX Writer with exceptional skills for crafting simple straightforward, and human copy that makes even the most complex concepts intuitive and easy to understand. Our team builds innovative tools that simplify and optimize complex reporting and metrics into intuitive solutions for our advertising customers. We work backwards from the customer’s needs in order to deliver billions of ad impressions and millions of clicks daily with our world-class products. \u003cbr/\u003e\u003cbr/\u003eAs a Senior UX writer on the Ads team, you will help craft experiences that allow advertisers of all sizes to effectively understand the measurement, insights, and reporting value of their marketing strategies on Amazon and beyond. In this role, you will work directly with UX, product, and engineering to deliver engaging user experiences, as well as translating writing guidance into our design system, Storm, to help UX writing scale while raising the bar. You will define and create standards, patterns, and mechanisms to elevate and scale our UX writing to be crisp, clear, and transparent.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Communicate complex concepts clearly by crafting advertiser-facing content for a broad suite of products.\u003cbr/\u003e- Create product content that is clear, helpful, human, scalable, and inclusive, being mindful of internationalization and the nuances and interpretations of language.\u003cbr/\u003e- Collaborate with cross-functional partners (designers, researchers, product managers, and engineering), driving consensus across teams and advocating for solutions that balance customer needs and business goals.\u003cbr/\u003e- Earn trust with product managers to develop shared vision and use research and data to identify opportunities and inform decisions.\u003cbr/\u003e- Develop content frameworks, guidelines, product narratives, and other deliverables that explain your recommendations and help people understand the practice of UX writing and content strategy.\u003cbr/\u003e- Work in a start-up style environment, where iteration is encouraged, thinking long-term and strategically while still achieving quick wins and short-term objectives.\u003cbr/\u003e- Make sure that customers have the right information at the right time.","department_cost_center":null,"description_short":"Are you a seasoned UX Writer who is passionate about complex enterprise systems and delivering elevated writing for user experiences? The Advertising User Experience team is looking for a Senior UX Writer","display_distance":null,"id":"2634ab08-a955-4c2c-bb7d-9276ea3f902f","id_icims":"3167891","is_intern":null,"is_manager":null,"job_category":"Design","job_family":"Design","job_function_id":null,"job_path":"/en/jobs/3167891/sr-ux-writer-amazon-advertiser-user-experience","job_schedule_type":"full-time","location":"US, NY, New York","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA40\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK24\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"New York, New York, USA","optional_search_labels":[],"posted_date":"January 27, 2026","preferred_qualifications":"- Experience working with agile development methodologies\u003cbr/\u003e- Experience designing, planning, and delivering content projects\u003cbr/\u003e- Successful delivery of multi-channel content strategy for a global audience.\u003cbr/\u003e- Experience writing for advertising or enterprise products.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, New York - 155,400.00 - 210,300.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 137,800.00 - 186,400.00 USD annually","primary_search_label":"advertising.team-amazon-ads","source_system":"JobCreator","state":"NY","title":"Sr. UX Writer, Amazon Advertiser User Experience","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3167891/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-ads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience with network hardware: copper and optical fiber cabling, switches, routers\u003cbr/\u003e- 18+ months of experience in data center or critical environment or similar technical roles: Computer Hardware Repair, Infrastructure Cabling, Network Deployment, Data Center Operations\u003cbr/\u003e- 18+ months of experience with network cabling, optic types, and test equipment (VFL, power meter, OTDR, etc.)","business_category":"aws","city":"Sterling","company_name":"Amazon Data Services, Inc. - A19","country_code":"USA","description":"Transform network infrastructure by joining our dynamic team! You'll be at the forefront of developing innovative solutions that drive network stability and scalability, using your technical expertise to create automated systems that power global technological advancement. InfraDelivery Install Technicians will collaborate with cross-functional teams, troubleshoot complex technical scenarios, and implement strategic solutions that keep our network running seamlessly. Expect to engage in hands-on technical work that requires creativity, precision, and a passion for technological innovation.\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role.\u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e\u003cbr/\u003e· All physical requirements are expected with reasonable accommodations:\u003cbr/\u003e\u003cbr/\u003e· Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds\u003cbr/\u003e\u003cbr/\u003e· Ability to work in an environment that operates 24/7 with an ability to participate in primary responder rotation and provide after-hours support as needed\u003cbr/\u003e\u003cbr/\u003e· Working in cramped and/or elevated and/or noisy environments\u003cbr/\u003e\u003cbr/\u003e· Bending, lifting, stretching, reaching, standing and walking for up to 8+ hours a day\u003cbr/\u003e\u003cbr/\u003e· Ascending and descending ladders, stairs, and gangways safely and without limitation\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational.\u003cbr/\u003e\u003cbr/\u003eEssential Requirements:\u003cbr/\u003e\u003cbr/\u003e· Ability to travel to or commute between data center locations as needed\u003cbr/\u003e\u003cbr/\u003e· Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational\u003cbr/\u003e\u003cbr/\u003e· Travel frequency will vary based on business needs and operational status of assigned facility\u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e· Moving and implementing large enterprise equipment\u003cbr/\u003e\u003cbr/\u003e· Installing Fiber and Copper cabling and patching cabling between equipment\u003cbr/\u003e\u003cbr/\u003e· Ensuring proper safety and security standards are maintained during cabling and rack installation,\u003cbr/\u003e\u003cbr/\u003e· Following well established hardware installation procedures and break-fix activities\u003cbr/\u003e\u003cbr/\u003e· Safely using material handling tools and equipment\u003cbr/\u003e\u003cbr/\u003e· Traveling within and outside of the regional work area is required. ","department_cost_center":null,"description_short":"Transform network infrastructure by joining our dynamic team! You'll be at the forefront of developing innovative solutions that drive network stability and scalability, using your technical expertise","display_distance":null,"id":"fbd3f8b8-96a1-4f5a-b086-b99a9f9f66cf","id_icims":"3183941","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3183941/infradelivery-technician","job_schedule_type":"full-time","location":"US, VA, Sterling","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sterling\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Sterling\",\"coordinates\":\"39.03336,-77.40713\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sterling, Virginia, USA\",\"location\":\"US, VA, Sterling\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD119\"],\"normalizedCityName\":\"Sterling\"}"],"normalized_location":"Sterling, Virginia, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"February 24, 2026","preferred_qualifications":"- Experience in a data center or other critical environment\u003cbr/\u003e- Bachelor's degree or equivalent professional or military experience in an IT-related field (e.g. computer science, network engineering, etc.)\u003cbr/\u003e- Certifications in a relevant field (CCENT, Network+, CCNA)\u003cbr/\u003e- Behavioral interviewing and hiring experience\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Sterling - 30.00 - 54.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"VA","title":"InfraDelivery Technician","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3183941/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience with network hardware: copper and optical fiber cabling, switches, routers\u003cbr/\u003e- 18+ months of experience in data center or critical environment or similar technical roles: Computer Hardware Repair, Infrastructure Cabling, Network Deployment, Data Center Operations\u003cbr/\u003e- 18+ months of experience with network cabling, optic types, and test equipment (VFL, power meter, OTDR, etc.)","business_category":"aws","city":"Sterling","company_name":"Amazon Data Services, Inc. - A19","country_code":"USA","description":"Transform network infrastructure by joining our dynamic team! You'll be at the forefront of developing innovative solutions that drive network stability and scalability, using your technical expertise to create automated systems that power global technological advancement. InfraDelivery Install Technicians will collaborate with cross-functional teams, troubleshoot complex technical scenarios, and implement strategic solutions that keep our network running seamlessly. Expect to engage in hands-on technical work that requires creativity, precision, and a passion for technological innovation.\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role.\u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e\u003cbr/\u003e· All physical requirements are expected with reasonable accommodations:\u003cbr/\u003e\u003cbr/\u003e· Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds\u003cbr/\u003e\u003cbr/\u003e· Ability to work in an environment that operates 24/7 with an ability to participate in primary responder rotation and provide after-hours support as needed\u003cbr/\u003e\u003cbr/\u003e· Working in cramped and/or elevated and/or noisy environments\u003cbr/\u003e\u003cbr/\u003e· Bending, lifting, stretching, reaching, standing and walking for up to 8+ hours a day\u003cbr/\u003e\u003cbr/\u003e· Ascending and descending ladders, stairs, and gangways safely and without limitation\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational.\u003cbr/\u003e\u003cbr/\u003eEssential Requirements:\u003cbr/\u003e\u003cbr/\u003e· Ability to travel to or commute between data center locations as needed\u003cbr/\u003e\u003cbr/\u003e· Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational\u003cbr/\u003e\u003cbr/\u003e· Travel frequency will vary based on business needs and operational status of assigned facility\u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e· Moving and implementing large enterprise equipment\u003cbr/\u003e\u003cbr/\u003e· Installing Fiber and Copper cabling and patching cabling between equipment\u003cbr/\u003e\u003cbr/\u003e· Ensuring proper safety and security standards are maintained during cabling and rack installation,\u003cbr/\u003e\u003cbr/\u003e· Following well established hardware installation procedures and break-fix activities\u003cbr/\u003e\u003cbr/\u003e· Safely using material handling tools and equipment\u003cbr/\u003e\u003cbr/\u003e· Traveling within and outside of the regional work area is required. ","department_cost_center":null,"description_short":"Transform network infrastructure by joining our dynamic team! You'll be at the forefront of developing innovative solutions that drive network stability and scalability, using your technical expertise","display_distance":null,"id":"bb54f575-d64d-4597-b066-e0268143edf9","id_icims":"3183939","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3183939/infradelivery-technician","job_schedule_type":"full-time","location":"US, VA, Sterling","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sterling\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Sterling\",\"coordinates\":\"39.03336,-77.40713\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sterling, Virginia, USA\",\"location\":\"US, VA, Sterling\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD119\"],\"normalizedCityName\":\"Sterling\"}"],"normalized_location":"Sterling, Virginia, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"February 24, 2026","preferred_qualifications":"- Experience in a data center or other critical environment\u003cbr/\u003e- Bachelor's degree or equivalent professional or military experience in an IT-related field (e.g. computer science, network engineering, etc.)\u003cbr/\u003e- Certifications in a relevant field (CCENT, Network+, CCNA)\u003cbr/\u003e- Behavioral interviewing and hiring experience\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Sterling - 30.00 - 54.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"VA","title":"InfraDelivery Technician","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3183939/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience with network hardware: copper and optical fiber cabling, switches, routers\u003cbr/\u003e- 18+ months of experience in data center or critical environment or similar technical roles: Computer Hardware Repair, Infrastructure Cabling, Network Deployment, Data Center Operations\u003cbr/\u003e- 18+ months of experience with network cabling, optic types, and test equipment (VFL, power meter, OTDR, etc.)","business_category":"aws","city":"Sterling","company_name":"Amazon Data Services, Inc. - A19","country_code":"USA","description":"Transform network infrastructure by joining our dynamic team! You'll be at the forefront of developing innovative solutions that drive network stability and scalability, using your technical expertise to create automated systems that power global technological advancement. InfraDelivery Install Technicians will collaborate with cross-functional teams, troubleshoot complex technical scenarios, and implement strategic solutions that keep our network running seamlessly. Expect to engage in hands-on technical work that requires creativity, precision, and a passion for technological innovation.\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role.\u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e\u003cbr/\u003e· All physical requirements are expected with reasonable accommodations:\u003cbr/\u003e\u003cbr/\u003e· Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds\u003cbr/\u003e\u003cbr/\u003e· Ability to work in an environment that operates 24/7 with an ability to participate in primary responder rotation and provide after-hours support as needed\u003cbr/\u003e\u003cbr/\u003e· Working in cramped and/or elevated and/or noisy environments\u003cbr/\u003e\u003cbr/\u003e· Bending, lifting, stretching, reaching, standing and walking for up to 8+ hours a day\u003cbr/\u003e\u003cbr/\u003e· Ascending and descending ladders, stairs, and gangways safely and without limitation\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational.\u003cbr/\u003e\u003cbr/\u003eEssential Requirements:\u003cbr/\u003e\u003cbr/\u003e· Ability to travel to or commute between data center locations as needed\u003cbr/\u003e\u003cbr/\u003e· Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational\u003cbr/\u003e\u003cbr/\u003e· Travel frequency will vary based on business needs and operational status of assigned facility\u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e· Moving and implementing large enterprise equipment\u003cbr/\u003e\u003cbr/\u003e· Installing Fiber and Copper cabling and patching cabling between equipment\u003cbr/\u003e\u003cbr/\u003e· Ensuring proper safety and security standards are maintained during cabling and rack installation,\u003cbr/\u003e\u003cbr/\u003e· Following well established hardware installation procedures and break-fix activities\u003cbr/\u003e\u003cbr/\u003e· Safely using material handling tools and equipment\u003cbr/\u003e\u003cbr/\u003e· Traveling within and outside of the regional work area is required. ","department_cost_center":null,"description_short":"Transform network infrastructure by joining our dynamic team! You'll be at the forefront of developing innovative solutions that drive network stability and scalability, using your technical expertise","display_distance":null,"id":"8f199ba7-57d5-4b7c-a9e9-21638604f3c9","id_icims":"3183937","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3183937/infradelivery-technician","job_schedule_type":"full-time","location":"US, VA, Sterling","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sterling\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Sterling\",\"coordinates\":\"39.03336,-77.40713\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sterling, Virginia, USA\",\"location\":\"US, VA, Sterling\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD119\"],\"normalizedCityName\":\"Sterling\"}"],"normalized_location":"Sterling, Virginia, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"February 24, 2026","preferred_qualifications":"- Experience in a data center or other critical environment\u003cbr/\u003e- Bachelor's degree or equivalent professional or military experience in an IT-related field (e.g. computer science, network engineering, etc.)\u003cbr/\u003e- Certifications in a relevant field (CCENT, Network+, CCNA)\u003cbr/\u003e- Behavioral interviewing and hiring experience\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Sterling - 30.00 - 54.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"VA","title":"InfraDelivery Technician","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3183937/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of relevant work experience\u003cbr/\u003e- Experience in relevant work\u003cbr/\u003e- Can bend or twist the body into unusual positions while working\u003cbr/\u003e- Can use hands to manipulate small wires and objects\u003cbr/\u003e- Can walk on job sites in uneven terrain\u003cbr/\u003e- Can work at heights and from ladders","business_category":"aws","city":"Manassas","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Amazon Web Services (AWS) is looking for a motivated, goal-driven  individual to join our Data Center Engineering Operations Team! The Data  Center Engineering Operations Technician (EOT) serves a key role as a  cornerstone of facility operations, supporting Amazon within its owned  and operated data centers. All data center equipment supporting customer  services must maintain better than 99.999% uptime. \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e• Walk job sites in uneven terrain \u003cbr/\u003e• Work at heights and from ladders\u003cbr/\u003e• Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41 pounds or more\u003cbr/\u003e• Coordinate body movements when using tools or equipment \u003cbr/\u003e• Reach and stretch to position equipment and fixtures while maintaining balance \u003cbr/\u003e• Use hands to manipulate small wires and objects \u003cbr/\u003e• Push or pull heavy objects into position \u003cbr/\u003e• Work in noisy environments \u003cbr/\u003e• Work at depths, such as under raised floors\u003cbr/\u003e\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe  EOT is responsible for ensuring that all electrical, mechanical, and  fire/life safety equipment within the data center is operating at peak  efficiency. This involves conducting both planned preventative  maintenance of equipment, daily corrective work, and emergency response  to emergent issues. The EOT serves as an operator as well as a  first-line resource reporting to a site’s Data Center Facility Manager  (FM), receiving daily instruction from the Chief Engineer (CE) and  interacting with third party vendors.  The EOT maintains training  compliance as related to their role of operating, troubleshooting and  repairing electrical and mechanical equipment. \u003cbr/\u003e\u003cbr/\u003eThis equipment includes, but is not limited to: \u003cbr/\u003e*    Stand-by emergency generators\u003cbr/\u003e*    Low and medium voltage electrical systems\u003cbr/\u003e*    Uninterruptible Power Supplies (UPS)\u003cbr/\u003e*    Automatic Transfer Switches (ATS)\u003cbr/\u003e*    Chilled water systems\u003cbr/\u003e*    Water treatment systems\u003cbr/\u003e*    Building automation systems\u003cbr/\u003e*    Fire detection and air quality monitoring systems\u003cbr/\u003e*    Server racks \u003cbr/\u003e\u003cbr/\u003eAlso expected from the EOT is the ability to execute  small-to-medium impacting projects from conception to completion. These  projects involve moderate amounts of independent work as well as  collaboration with external support groups including engineering,  automation, processing, and finance in controlled environments. The EOT  will be tasked with creating and delivering on key milestones, obtaining  and tracking quotes for all necessary costs, and documenting project  results. The goals of such projects are to drive innovation and  resiliency while reducing operational costs in the facilities.  \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThe  Data Center Engineering Operations Team is a group committed to  maintaining the critical data center infrastructure that supports Amazon  Web Services. Specifically, this team works to ensure that the  facility's Mechanical, Electrical, and Plumbing systems operate at near  100% availability while maintaining first-class customer service to the  supporting teams and key stakeholders of the data centers.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Data Center Engineering Operations Team is a group committed to maintaining the critical data center infrastructure that supports Amazon Web Services. Specifically, this team works to ensure that the facility's Mechanical, Electrical, and Plumbing systems operate at near 100% availability while maintaining first-class customer service to the supporting teams and key stakeholders of the data centers. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Web Services (AWS) is looking for a motivated, goal-driven  individual to join our Data Center Engineering Operations Team! The Data  Center Engineering Operations Technician (EOT) serves a key","display_distance":null,"id":"b4a0c4bb-010e-484a-ac90-847005c11338","id_icims":"3137357","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3137357/dceo-engr-4-dc-communities","job_schedule_type":"full-time","location":"US, VA, Manassas","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Manassas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Manassas\",\"coordinates\":\"38.75125,-77.47086\",\"normalizedCountyName\":\"Manassas (City)\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Manassas, Virginia, USA\",\"location\":\"US, VA, Manassas\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD105\"],\"normalizedCityName\":\"Manassas\"}"],"normalized_location":"Manassas, Virginia, USA","optional_search_labels":["aws.team-dc","hourly","military","aws.team-ais"],"posted_date":"December  4, 2025","preferred_qualifications":"- 4+ years of data center engineering experience\u003cbr/\u003e- Bachelor's degree in Electrical Engineering, Mechanical Engineering, or a related field\u003cbr/\u003e- Knowledge of network design and layout as well as low voltage (copper/ fiber) cabling\u003cbr/\u003e- Experience in data center engineering\u003cbr/\u003e- Can perform physical tasks all day without becoming overly tired\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Manassas - 37.00 - 65.00 USD hourly","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"VA","title":"DCEO Engr 4, DC Communities ","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3137357/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of relevant work experience\u003cbr/\u003e- Experience in relevant work\u003cbr/\u003e- Can bend or twist the body into unusual positions while working\u003cbr/\u003e- Can use hands to manipulate small wires and objects\u003cbr/\u003e- Can walk on job sites in uneven terrain\u003cbr/\u003e- Can work at heights and from ladders","business_category":"aws","city":"Herndon","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Amazon Web Services (AWS) is currently hiring for an Engineering Technician to support our data centers. The Engineering Technician will help ensure overall availability and reliability to meet or exceed defined service levels of data center operations.\u003cbr/\u003eThe Data Center Engineering Technician will be responsible for ensuring the overall operation and maintenance of all electrical, mechanical, and HVAC equipment within the data center. This equipment supports mission-critical servers and must maintain better than 99.999% uptime. The Data Center Engineering Technician will continue to maintain high reliability and performance while keeping operating costs in facilities at a minimum.\u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors.\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eResponsibilities:\u003cbr/\u003e- Supervise contractors who perform servicing or preventive maintenance\u003cbr/\u003e\u003cbr/\u003e- Perform limited maintenance tasks to include: filter changes, battery system PMs, and Rack PDU \u0026 Rack ATS replacements\u003cbr/\u003e\u003cbr/\u003e- Perform root cause analysis for operational issues\u003cbr/\u003e\u003cbr/\u003e- Troubleshoot facility and rack level events\u003cbr/\u003e\u003cbr/\u003e- Ensure all personnel on-site follow safety protocols\u003cbr/\u003e\u003cbr/\u003e- Work on-call and a rotating schedule as needed\u003cbr/\u003e\u003cbr/\u003e- Take daily operational readings and provide metrics reporting to senior engineers\u003cbr/\u003e\u003cbr/\u003e- Perform basic support concepts such as ticketing systems, root cause analysis, and task prioritization\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eAll physical requirements are expected with reasonable accommodations\u003cbr/\u003e\u003cbr/\u003e- Walk job sites in uneven terrain\u003cbr/\u003e\u003cbr/\u003e- Work at heights and from ladders\u003cbr/\u003e\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or craw\u003cbr/\u003e\u003cbr/\u003e- Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41 pounds or more\u003cbr/\u003e\u003cbr/\u003e- Carry objects weighing up to 40 pounds for short distances\u003cbr/\u003e\u003cbr/\u003e- Work shifts longer than eight hours in duration\u003cbr/\u003e\u003cbr/\u003e- Respond to off hour emergency calls\u003cbr/\u003e\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e\u003cbr/\u003e- Coordinate body movements when using tools or equipment\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"Amazon Web Services (AWS) is currently hiring for an Engineering Technician to support our data centers. The Engineering Technician will help ensure overall availability and reliability to meet or exceed","display_distance":null,"id":"a006fd2b-7a59-4ef3-90ea-66d4b24b42c0","id_icims":"3183219","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3183219/data-center-engineering-operations-technician-dceo-data-center-communities","job_schedule_type":"full-time","location":"US, VA, Herndon","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD168\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Herndon, Virginia, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"February 17, 2026","preferred_qualifications":"- 4+ years of data center engineering experience\u003cbr/\u003e- Bachelor's degree in Electrical Engineering, Mechanical Engineering, or a related field\u003cbr/\u003e- Knowledge of network design and layout as well as low voltage (copper/ fiber) cabling\u003cbr/\u003e- Experience in data center engineering\u003cbr/\u003e- Can perform physical tasks all day without becoming overly tired\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Herndon - 37.00 - 65.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"VA","title":"Data Center Engineering Operations Technician , DCEO, Data Center Communities","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3183219/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- PhD, or Master's degree and 7+ years of industry or academic research experience\u003cbr/\u003e- 7+ years of experience using CFD thermal simulation software in consumer electronics\u003cbr/\u003e- 7+ years of experience using Star-CCM+, FloTherm XT/EFD or comparable tool\u003cbr/\u003e- Experience using geometric tolerances and statistical tolerance analysis techniques\u003cbr/\u003e- Use of programming languages like Python and Matlab for analytical/statistical analyses and automation\u003cbr/\u003e- Experience in manufacturing processes such as injection molding, sheet metal forming and die casting, Design for Manufacturability (DFM) and Design for Assembly (DFA)","business_category":"alexa-and-amazon-devices","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"You will be working with a unique and gifted team developing exciting products for consumers. The team is a multidisciplinary group of engineers and scientists engaged in a fast paced mission to deliver new products. The team faces a challenging task of balancing cost, schedule, and performance requirements. You should be comfortable collaborating in a fast-paced and often uncertain environment, and contributing to innovative solutions, while demonstrating leadership, technical competence, and meticulousness.\u003cbr/\u003e\u003cbr/\u003eYour deliverables will include development of thermal solutions, concept design, feature development, product architecture and system validation through to manufacturing release. You will support creative developments through application of analysis and testing of complex electronic assemblies using advanced simulation and experimentation tools and techniques.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eIn this role, you will:\u003cbr/\u003e\u003cbr/\u003e- Evaluate and optimize thermal solution requirements of consumer electronic products\u003cbr/\u003e\u003cbr/\u003e- Use simulation tools like Star-CCM+ or FloTherm XT/EFD for analysis and design of products\u003cbr/\u003e\u003cbr/\u003e- Validate design modifications for thermal concerns using simulation and actual prototypes\u003cbr/\u003e\u003cbr/\u003e- Establish temperature thresholds for user comfort level and component level considering reliability requirements\u003cbr/\u003e\u003cbr/\u003e- Have intimate knowledge of various materials and heat spreaders solutions to resolve thermal issues\u003cbr/\u003e\u003cbr/\u003e- Use of programming languages like Python and Matlab for analytical/statistical analyses and automation\u003cbr/\u003e\u003cbr/\u003e- Collaborate as part of device team to iterate and optimize design parameters of enclosures and structural parts to establish and deliver project performance objectives\u003cbr/\u003e\u003cbr/\u003e- Design and execute of tests using statistical tools to validate analytical models, identify risks and assess design margins\u003cbr/\u003e\u003cbr/\u003e-  Create and present analytical and experimental results\u003cbr/\u003e\u003cbr/\u003e- Develop and apply design guidelines based on project learnings\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Lab126 is an inventive research and development company that designs and engineers high-profile consumer electronics. Lab126 began in 2004 as a subsidiary of Amazon.com, Inc., originally creating the best-selling Kindle family of products. Since then, we have produced devices like Fire tablets, Fire TV and Amazon Echo. What will you help us create?","department_cost_center":null,"description_short":"You will be working with a unique and gifted team developing exciting products for consumers. The team is a multidisciplinary group of engineers and scientists engaged in a fast paced mission to deliver","display_distance":null,"id":"6ea239fa-9f4d-4a3a-a2a5-f3b9b3ee1afb","id_icims":"3147621","is_intern":null,"is_manager":null,"job_category":"Research Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3147621/sr-thermal-scientist-engineer-product-integrity-hardware-product-integrity","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sunnyvale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Sunnyvale\",\"coordinates\":\"37.37188,-122.03751\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sunnyvale, California, USA\",\"location\":\"US, CA, Sunnyvale\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC11\"],\"normalizedCityName\":\"Sunnyvale\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA107\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":["alexa-and-amazon-devices.team-hardware-development-job-family"],"posted_date":"December 22, 2025","preferred_qualifications":"- Experience in mentoring, leading and coaching\u003cbr/\u003e- Demonstrated design experience with consumer electronics enclosure materials\u003cbr/\u003e- PhD in mechanical engineering or related field\u003cbr/\u003e- Creo Systems knowledge, Experience with Matlab or other engineering tools for modeling systems\u003cbr/\u003e- Demonstrated experience with statistical analysis tools like JMP and ReliaSoft\u003cbr/\u003e- This position may require international travel\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $150,400/year in our lowest geographic market up to $260,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"alexa-and-amazon-devices.team-hardware-and-eero","source_system":"JobCreator","state":"WA","title":"Sr. Thermal Scientist/Engineer, Product Integrity, Hardware - Product Integrity","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3147621/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-hardware-and-eero","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}