{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 2+ years of team management experience\u003cbr/\u003e- 2+ years of HR transactional processes experience\u003cbr/\u003e- Experience with Microsoft Office products and applications\u003cbr/\u003e- Bachelor's degree, or 2+ years of Amazon (blue badge/FTE) experience","business_category":"fulfillment-and-operations","city":"Bessemer","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our mission is to be Earth's most customer-centric company. This is what unites Amazonians across teams and geographies as we are all striving to delight our customers and make their lives easier, one innovative product, service, and idea at a time.\u003cbr/\u003e\u003cbr/\u003eThe Workforce Staffing (WFS) Team is a skilled, customer obsessed, business partner hiring across multiple locations for entry-level warehouse and fulfillment associate roles. We are looking for exceptionally talented, bright and driven leaders to help build the future Amazon talent pipeline.\u003cbr/\u003e\u003cbr/\u003eThe Workforce Staffing (WFS) Team is looking for an ambitious and enthusiastic leader that can inspire others to reach the highest level of service in every candidate interaction. As a leader, the Staffing Manager owns candidate experience and operational excellence for a defined geography (node). The Staffing Manager ensures delivery of business goals and Key business indicator by creating a collaborative team environment with a strong candidate-oriented culture.\u003cbr/\u003e\u003cbr/\u003eStaffing Managers direct a high-performing team of Staffing Administrators and seasonal/flexible Associates who thrive in an innovative, fast-paced environment. These teams work onsite with varying schedules and require travel to multiple sites according to business needs. At Amazon, our teams roll up our sleeves, work hard, have fun and make history!\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Manages the day-to-day operations to ensure a positive candidate experience and alignment with business goals\u003cbr/\u003e• Leads and develops a team of administrators, including regular performance evaluations and coaching for performance improvement\u003cbr/\u003e• Assists with interviewing and onboarding new administrators \u003cbr/\u003e• Coordinates team schedule and assigns duties based on business needs\u003cbr/\u003e• Understands new hire workflow and technical systems and makes recommendations to drive improvement\u003cbr/\u003e• Develops and maintains relationships with both internal and external stakeholders to build successful long-term partnerships\u003cbr/\u003e• Analyzes daily, weekly, and monthly reporting of Key Performance Indicators and provides meaningful solutions\u003cbr/\u003e• Leads and drives change initiatives and projects, of increasing scale and complexity, through to completion\u003cbr/\u003e• Forecasts labor demand plans and creates scalable staffing strategies to build infrastructure and ensure team resource capabilities meet business demand ","department_cost_center":null,"description_short":"Our mission is to be Earth's most customer-centric company. This is what unites Amazonians across teams and geographies as we are all striving to delight our customers and make their lives easier, one","display_distance":null,"id":"1f63447a-3442-4ea6-9b17-671b21eff9a3","id_icims":"3169115","is_intern":null,"is_manager":null,"job_category":"Human Resources","job_family":"Human Resources","job_function_id":null,"job_path":"/en/jobs/3169115/staffing-manager-workforce-staffing","job_schedule_type":"full-time","location":"US, AL, Bessemer","locations":["{\"normalizedStateName\":\"Alabama\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bessemer\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AL, Bessemer\",\"coordinates\":\"33.40203,-86.95399\",\"normalizedCountyName\":\"Jefferson\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bessemer, Alabama, USA\",\"location\":\"US, AL, Bessemer\",\"region\":\"AL\",\"buildingCodeList\":[\"BHM1\"],\"normalizedCityName\":\"Bessemer\"}"],"normalized_location":"Bessemer, Alabama, USA","optional_search_labels":[],"posted_date":"January 30, 2026","preferred_qualifications":"- Experience developing and implementing of standards, policies and programs or equivalent\u003cbr/\u003e- Experience handling confidential information and maintaining professionalism in dealing with senior executives, or experience with end-to-end project management\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, AL, Bessemer - 53,700.00 - 93,900.00 USD annually","primary_search_label":"fulfillment-and-operations.team-workforce-staffing","source_system":"JobCreator","state":"AL","title":"Staffing Manager, Workforce Staffing ","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3169115/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-workforce-staffing","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or above in a technical or engineering related field, such as Electrical Engineering, Computer Science, etc.\u003cbr/\u003e- Knowledge of programming languages such as C/C++, Python, Java or Perl\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- 3+ years of professional work (non-internship) experience\u003cbr/\u003e- Experience working with version control systems\u003cbr/\u003e- Ability to work at computer workstations for extended periods\u003cbr/\u003e- Ability to respond to urgent on-call situations\u003cbr/\u003e- Experience with real-time system monitoring and anomaly response\u003cbr/\u003e- Demonstrated ability to execute technical procedures and follow operational protocols\u003cbr/\u003e- Experience with data analysis tools and software","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon Leo will serve people and organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement: Due to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eAmazon Leo's Propulsion Team seeks a Flight Operations Engineer to support the execution of the full mission lifecycle for Leo's satellite constellation. This critical support spans: propulsion pre-launch and go/no-go decisions; early mission propulsion checkouts and commissioning; ascending each vehicle to the altitude and station necessary to provide customer service; formation keeping for the service life of each satellite; as well as the the descent and decommissioning of each satellite. This role will work with Amazon Leo's Mission Operations team, and other Guidance, Navigation, and Control operators to ensure the safe and effective execution of each satellite's mission.\u003cbr/\u003e\u003cbr/\u003eThe Propulsion Operations Engineer serves as a critical liaison between Amazon Leo Mission Operations and the Propulsion Design Engineering team, executing approved operational responses while supporting the development of improved operational automation. This role combines hands-on operational support with the continuous improvement of processes and automated operational capabilities for the Amazon Leo Propulsion System.\u003cbr/\u003e\u003cbr/\u003eA significant portion of the position focuses on developing and improving automated operational responses, including telemetry monitoring and flight data analysis. The engineer will be responsible for creating and reviewing new scripted operations procedures, enhancing existing automated sequences, and formulating responses to novel scenarios that arise. This work requires close collaboration with GNC and Propulsion design engineers (both hardware and software) to ensure all solutions align with established safety and operational parameters.\u003cbr/\u003e\u003cbr/\u003eThe role involves active participation in troubleshooting and investigating in-flight anomalies, working alongside propulsion subject matter experts and systems engineers. The engineer will contribute to maintaining propulsion system operational health by identifying and assessing potential risks, while also evaluating system health and maneuverability across the constellation, applying criteria approved by the Propulsion Design Engineering team.\u003cbr/\u003e\u003cbr/\u003eProfessional growth opportunities include potential cross-training in other GNC disciplines, such as attitude determination and control, and supporting the GNC's Flight Dynamics Operations team. This expansion of responsibilities helps ensure comprehensive understanding and support of constellation operations.\u003cbr/\u003e\u003cbr/\u003eGiven that automated constellation operations run continuously throughout the year, this position requires flexibility in work scheduling. Initially, the role may involve standard working hours with rotating 24/7 on-call responsibilities. As the team expands, the schedule will evolve to cover morning, night, and day shifts across all days of the week, distributed among a team of operators. This scheduling structure ensures continuous coverage and support for the constellation's operational needs.\u003cbr/\u003e \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eOperations Engineering\u003cbr/\u003e- Serve as primary operational liaison between Propulsion Design Engineering and Amazon Leo flight operations stakeholders\u003cbr/\u003e- Execute defined propulsion operational responses\u003cbr/\u003e- Monitor and assess propulsion system health across the constellation\u003cbr/\u003e- Support investigation and troubleshooting of in-flight anomalies\u003cbr/\u003e- Escalate to responsible engineers for scenarios where existing automation or runbooks do not apply\u003cbr/\u003e- Document operational instructions and procedures for the benefit of other Propulsion operators\u003cbr/\u003e\u003cbr/\u003eAutomation \u0026 Software Development\u003cbr/\u003e- Develop and enhance operational procedures, both manual and automated\u003cbr/\u003e- Create and review scripted operations procedures (i.e. software development)\u003cbr/\u003e- Improve telemetry monitoring and flight data analysis capabilities\u003cbr/\u003e- Support continuous automation improvements for operational sequences\u003cbr/\u003e- Formulate responses to new operational scenarios for review and approval from the Propulsion Design Engineering team\u003cbr/\u003e\u003cbr/\u003eRisk Management \u0026 System Health\u003cbr/\u003e- Identify and assess operational risks\u003cbr/\u003e- Collaborate in the definition of risk mitigations, owning the their implementation and in-space execution\u003cbr/\u003e- Apply and scale mechanisms to asses propulsion system health \u0026 maneuverability during all mission phases\u003cbr/\u003e- Contribute to improvements propulsion system concepts of operations (CONOPs)\u003cbr/\u003e\u003cbr/\u003eSchedule Availability Requirements\u003cbr/\u003e- Staff rotating shifts including early morning, late night, and weekends - on a rotating basis constrained by 40h shift assignments\u003cbr/\u003e- Respond to needs for 24/7 on-call support on a rotating basis\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Leo's Propulsion Design Engineering team is part of the broader Guidance, Navigation, and Control (GNC) organization. The Propulsion Design team includes subject matter experts in propulsion technologies, systems engineers, test engineers, mechanical design engineers, and technical program managers. Flight operations is currently supported by this engineering team, and this role is part of an effort to hire and develop dedicated support for Flight Operations to support full scale constellation operations.","department_cost_center":null,"description_short":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to","display_distance":null,"id":"173ddee4-fe93-43ed-878d-e32b2db856a1","id_icims":"3104511","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"System Development Engineering","job_function_id":null,"job_path":"/en/jobs/3104511/propulsion-flight-operations-engineer-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA131\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":["alexa-and-amazon-devices.team-systems-security-quality-job-family"],"posted_date":"October  8, 2025","preferred_qualifications":"- Experience in satellite operations\u003cbr/\u003e- Experience in ground systems development of satellite operations systems\u003cbr/\u003e- Experience in any of the operations roles in satellite navigation, conjunction risk assessment, and maneuver planning.\u003cbr/\u003e- Experience in cloud-based software systems development\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Redmond - 129,200.00 - 174,800.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Propulsion Flight Operations Engineer, Amazon Leo","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3104511/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- 3+ years of increasing responsibilities in WHS and/or environmental programs in manufacturing, production, or service operations\u003cbr/\u003e- 3+ years of increasing responsibilities in people and performance management, or 2+ years of Amazon Safety (blue badge/FTE) experience","business_category":"fulfillment-and-operations","city":"Joplin","company_name":"Amazon.com Services LLC - A57","country_code":"USA","description":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We're seeking a dedicated Workplace Health \u0026 Safety (WHS) Manager to join our mission of creating the world's safest work environment. This role offers an exciting opportunity to directly impact associate well being while driving operational excellence.\u003cbr/\u003e\u003cbr/\u003eAs a WHS Manager, you'll be the site's safety champion, leading our Global WHS Program implementation. You'll combine hands-on safety management with strategic thinking to protect our most valuable asset – our people. Your role bridges the gap between safety requirements and operational success, requiring both technical expertise and strong interpersonal skills. Working closely with Operations leadership, you'll drive safety initiatives that make a real difference. You'll conduct comprehensive risk assessments, analyze safety data, and implement practical solutions that protect associates while supporting productivity. Your ability to build relationships and influence positive change will be essential as you help shape our safety culture. You'll lead safety compliance efforts, conduct thorough site audits, and analyze incident trends to target improvements where they matter most. Managing our first aid program and emergency response capabilities, you'll ensure immediate care is always available. Your analytical skills will transform safety data into actionable insights, while your leadership abilities will help engage associates in our safety mission.\u003cbr/\u003e\u003cbr/\u003eCore Impact Areas:\u003cbr/\u003eSafety Leadership \u0026 Innovation - Transform safety culture through leadership and innovative solutions. Drive continuous improvement initiatives that set new benchmarks in workplace safety. Leverage technology and data analytics to drive preventive safety measures that protect our associates while enhancing operational excellence. Develop leadership plans, communicate expectations, and drive initiatives to create a safe work environment. Measure performance against WHS policies, analyze metrics, and conduct site audits to address non-compliance issues.\u003cbr/\u003e\u003cbr/\u003eStrategic Partnership \u0026 Influence - Build partnerships with Operations leadership to integrate safety into every aspect of our business. Use compelling data analysis and risk insights to influence positive change and drive strategic decision-making. Establish yourself as a trusted advisor who balances safety excellence with operational demands. Oversee recordkeeping, workplace organization, and WHS training programs.\u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements include:\u003cbr/\u003e\u003cbr/\u003e- Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Stand/walk for up to 12 hours during shifts\u003cbr/\u003e- Work in an environment where the noise level varies\u003cbr/\u003e- Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e- Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e- Maintain effective care delivery in emergencies and assist emergency response at the site\u003cbr/\u003e\u003cbr/\u003eFor those that do not have an adult First Aid, CPR, AED certification from the American Heart Association or American Red Cross, must obtain within 3 weeks of start date.","department_cost_center":null,"description_short":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We're seeking","display_distance":null,"id":"1ba42cc9-3d63-4887-aca7-abb2c3aac688","id_icims":"3164548","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3164548/multi-site-ehs-manager-ii","job_schedule_type":"full-time","location":"US, MO, Joplin","locations":["{\"normalizedStateName\":\"Oklahoma\",\"normalizedCountryCode\":\"USA\",\"city\":\"Tulsa\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OK, Tulsa\",\"coordinates\":\"36.15011,-95.99352\",\"normalizedCountyName\":\"Tulsa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Tulsa, Oklahoma, USA\",\"location\":\"US, OK, Tulsa\",\"region\":\"OK\",\"buildingCodeList\":[\"TUL400\",\"LYLE\",\"DOK6\",\"QKT1\",\"DOK2\",\"TUL5\",\"WFM472\",\"DOK8\",\"HKO1\",\"TUL2\",\"DOK7\",\"WFM304\",\"LOK2\",\"VCB1\"],\"normalizedCityName\":\"Tulsa\"}","{\"normalizedStateName\":\"Missouri\",\"normalizedCountryCode\":\"USA\",\"city\":\"Joplin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MO, Joplin\",\"coordinates\":\"37.08476,-94.51347\",\"normalizedCountyName\":\"Jasper\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Joplin, Missouri, USA\",\"location\":\"US, MO, Joplin\",\"region\":\"MO\",\"buildingCodeList\":[\"VUHL\",\"JLN250\",\"WMO1\"],\"normalizedCityName\":\"Joplin\"}","{\"normalizedStateName\":\"Missouri\",\"normalizedCountryCode\":\"USA\",\"city\":\"Springfield\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MO, Springfield\",\"coordinates\":\"37.20897,-93.2916\",\"normalizedCountyName\":\"Greene\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Springfield, Missouri, USA\",\"location\":\"US, MO, Springfield\",\"region\":\"MO\",\"buildingCodeList\":[\"KSGF\",\"XJO2\",\"WMO2\"],\"normalizedCityName\":\"Springfield\"}","{\"normalizedStateName\":\"Oklahoma\",\"normalizedCountryCode\":\"USA\",\"city\":\"Mcalester\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OK, Mcalester\",\"coordinates\":\"34.93397,-95.76961\",\"normalizedCountyName\":\"Pittsburg\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"McAlester, Oklahoma, USA\",\"location\":\"US, OK, Mcalester\",\"region\":\"OK\",\"buildingCodeList\":[\"WOM5\",\"QMA5\",\"QOM5\"],\"normalizedCityName\":\"McAlester\"}"],"normalized_location":"Joplin, Missouri, USA","optional_search_labels":[],"posted_date":"January 22, 2026","preferred_qualifications":"- Distribution Center or Manufacturing EHS experience with mix of exempt and non-exempt employees at a site of at least 250 people\u003cbr/\u003e- Master’s degree\u003cbr/\u003e- Experience implementing lean principles and process improvement in an operational environment.\u003cbr/\u003e- Experience in a fast paced, dynamic organization\u003cbr/\u003e- Certified Safety Professional\u003cbr/\u003e- Excellent written and verbal communication skills, including comfort interfacing with site leader\u003cbr/\u003e- Ability to develop and implement department goals and strategies\u003cbr/\u003e- Strong analytical skills with demonstrated problem solving ability\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MO, Joplin - 70,100.00 - 105,200.00 USD annually\u003cbr/\u003eUSA, MO, Springfield - 70,100.00 - 105,200.00 USD annually\u003cbr/\u003eUSA, OK, Mcalester - 63,100.00 - 94,700.00 USD annually\u003cbr/\u003eUSA, OK, Tulsa - 70,100.00 - 105,200.00 USD annually","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"MO","title":"Multi-Site EHS Manager II","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3164548/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of team management experience\u003cbr/\u003e- 2+ years of HR transactional processes experience\u003cbr/\u003e- Experience with Microsoft Office products and applications\u003cbr/\u003e- Bachelor's degree, or 2+ years of Amazon (blue badge/FTE) experience","business_category":"fulfillment-and-operations","city":"Shepherdsville","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our mission is to be Earth's most customer-centric company. This is what unites Amazonians across teams and geographies as we are all striving to delight our customers and make their lives easier, one innovative product, service, and idea at a time.\u003cbr/\u003e\u003cbr/\u003eThe Workforce Staffing (WFS) Team is a skilled, customer obsessed, business partner hiring across multiple locations for entry-level warehouse and fulfillment associate roles. We are looking for exceptionally talented, bright and driven leaders to help build the future Amazon talent pipeline.\u003cbr/\u003e\u003cbr/\u003eThe Workforce Staffing (WFS) Team is looking for an ambitious and enthusiastic leader that can inspire others to reach the highest level of service in every candidate interaction. As a leader, the Staffing Manager owns candidate experience and operational excellence for a defined geography (node). The Staffing Manager ensures delivery of business goals and Key business indicator by creating a collaborative team environment with a strong candidate-oriented culture.\u003cbr/\u003e\u003cbr/\u003eStaffing Managers direct a high-performing team of Staffing Administrators and seasonal/flexible Associates who thrive in an innovative, fast-paced environment. These teams work onsite with varying schedules and require travel to multiple sites according to business needs. At Amazon, our teams roll up our sleeves, work hard, have fun and make history!\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Manages the day-to-day operations to ensure a positive candidate experience and alignment with business goals\u003cbr/\u003e• Leads and develops a team of administrators, including regular performance evaluations and coaching for performance improvement\u003cbr/\u003e• Assists with interviewing and onboarding new administrators \u003cbr/\u003e• Coordinates team schedule and assigns duties based on business needs\u003cbr/\u003e• Understands new hire workflow and technical systems and makes recommendations to drive improvement\u003cbr/\u003e• Develops and maintains relationships with both internal and external stakeholders to build successful long-term partnerships\u003cbr/\u003e• Analyzes daily, weekly, and monthly reporting of Key Performance Indicators and provides meaningful solutions\u003cbr/\u003e• Leads and drives change initiatives and projects, of increasing scale and complexity, through to completion\u003cbr/\u003e• Forecasts labor demand plans and creates scalable staffing strategies to build infrastructure and ensure team resource capabilities meet business demand ","department_cost_center":null,"description_short":"Our mission is to be Earth's most customer-centric company. This is what unites Amazonians across teams and geographies as we are all striving to delight our customers and make their lives easier, one","display_distance":null,"id":"a44d91c4-9d78-4f67-86d2-08139967072e","id_icims":"3169123","is_intern":null,"is_manager":null,"job_category":"Human Resources","job_family":"Human Resources","job_function_id":null,"job_path":"/en/jobs/3169123/staffing-manager-workforce-staffing","job_schedule_type":"full-time","location":"US, KY, Shepherdsville","locations":["{\"normalizedStateName\":\"Kentucky\",\"normalizedCountryCode\":\"USA\",\"city\":\"Shepherdsville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, KY, Shepherdsville\",\"coordinates\":\"37.98825,-85.71655\",\"normalizedCountyName\":\"Bullitt\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Shepherdsville, Kentucky, USA\",\"location\":\"US, KY, Shepherdsville\",\"region\":\"KY\",\"buildingCodeList\":[\"SDF9\"],\"normalizedCityName\":\"Shepherdsville\"}"],"normalized_location":"Shepherdsville, Kentucky, USA","optional_search_labels":[],"posted_date":"January 30, 2026","preferred_qualifications":"- Experience developing and implementing of standards, policies and programs or equivalent\u003cbr/\u003e- Experience handling confidential information and maintaining professionalism in dealing with senior executives, or experience with end-to-end project management\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, KY, Shepherdsville - 48,300.00 - 84,500.00 USD annually","primary_search_label":"fulfillment-and-operations.team-workforce-staffing","source_system":"JobCreator","state":"KY","title":"Staffing Manager, Workforce Staffing ","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3169123/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-workforce-staffing","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- 3+ years of increasing responsibilities in WHS and/or environmental programs in manufacturing, production, or service operations\u003cbr/\u003e- 3+ years of increasing responsibilities in people and performance management, or 2+ years of Amazon Safety (blue badge/FTE) experience","business_category":"fulfillment-and-operations","city":"Kansas City","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We're seeking a dedicated Workplace Health \u0026 Safety (WHS) Manager to join our mission of creating the world's safest work environment. This role offers an exciting opportunity to directly impact associate well being while driving operational excellence.\u003cbr/\u003e\u003cbr/\u003eAs a WHS Manager, you'll be the site's safety champion, leading our Global WHS Program implementation. You'll combine hands-on safety management with strategic thinking to protect our most valuable asset – our people. Your role bridges the gap between safety requirements and operational success, requiring both technical expertise and strong interpersonal skills. Working closely with Operations leadership, you'll drive safety initiatives that make a real difference. You'll conduct comprehensive risk assessments, analyze safety data, and implement practical solutions that protect associates while supporting productivity. Your ability to build relationships and influence positive change will be essential as you help shape our safety culture. You'll lead safety compliance efforts, conduct thorough site audits, and analyze incident trends to target improvements where they matter most. Managing our first aid program and emergency response capabilities, you'll ensure immediate care is always available. Your analytical skills will transform safety data into actionable insights, while your leadership abilities will help engage associates in our safety mission.\u003cbr/\u003e\u003cbr/\u003eCore Impact Areas:\u003cbr/\u003eSafety Leadership \u0026 Innovation - Transform safety culture through leadership and innovative solutions. Drive continuous improvement initiatives that set new benchmarks in workplace safety. Leverage technology and data analytics to drive preventive safety measures that protect our associates while enhancing operational excellence. Develop leadership plans, communicate expectations, and drive initiatives to create a safe work environment. Measure performance against WHS policies, analyze metrics, and conduct site audits to address non-compliance issues. \u003cbr/\u003e\u003cbr/\u003eStrategic Partnership \u0026 Influence - Build partnerships with Operations leadership to integrate safety into every aspect of our business. Use compelling data analysis and risk insights to influence positive change and drive strategic decision-making. Establish yourself as a trusted advisor who balances safety excellence with operational demands. Oversee recordkeeping, workplace organization, and WHS training programs. \u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements include: \u003cbr/\u003e- Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Stand/walk for up to 12 hours during shifts\u003cbr/\u003e- Work in an environment where the noise level varies \u003cbr/\u003e- Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e- Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e- Maintain effective care delivery in emergencies and assist emergency response at the site\u003cbr/\u003e\u003cbr/\u003eFor those that do not have an adult First Aid, CPR, AED certification from the American Heart Association or American Red Cross, must obtain within 3 weeks of start date.","department_cost_center":null,"description_short":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We're seeking","display_distance":null,"id":"bf268541-7d2d-4561-a197-f06a02911bd7","id_icims":"3184240","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3184240/site-ehs-manager-ii","job_schedule_type":"full-time","location":"US, MO, Kansas City","locations":["{\"normalizedStateName\":\"Missouri\",\"normalizedCountryCode\":\"USA\",\"city\":\"Kansas City\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MO, Kansas City\",\"coordinates\":\"39.10344,-94.58311\",\"normalizedCountyName\":\"Jackson\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Kansas City, Missouri, USA\",\"location\":\"US, MO, Kansas City\",\"region\":\"MO\",\"buildingCodeList\":[\"MCI4\"],\"normalizedCityName\":\"Kansas City\"}","{\"normalizedStateName\":\"Missouri\",\"normalizedCountryCode\":\"USA\",\"city\":\"KANSAS CITY\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MO, KANSAS CITY\",\"coordinates\":\"39.10344,-94.58311\",\"normalizedCountyName\":\"Jackson\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Kansas City, Missouri, USA\",\"location\":\"US, MO, KANSAS CITY\",\"region\":\"MO\",\"buildingCodeList\":[\"MCI4\"],\"normalizedCityName\":\"Kansas City\"}"],"normalized_location":"Kansas City, Missouri, USA","optional_search_labels":[],"posted_date":"February 18, 2026","preferred_qualifications":"- Experience in Distribution Center or Manufacturing EHS with mix of exempt and non-exempt employees at a site of at least 250 people\u003cbr/\u003e- Master's degree\u003cbr/\u003e- Experience implementing lean principles and process improvement in an operational environment\u003cbr/\u003e- Experience in a fast paced, dynamic organization\u003cbr/\u003e- Certified Safety Professional\u003cbr/\u003e- Excellent written and verbal communication skills, including comfort interfacing with site leader\u003cbr/\u003e- Ability to develop and implement department goals and strategies.\u003cbr/\u003e- Strong analytical skills with demonstrated problem solving ability.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MO, KANSAS CITY - 70,100.00 - 105,200.00 USD annually","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"MO","title":"Site EHS Manager II","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3184240/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience with fire and building codes and standards, including the National Fire Protection Association (NFPA), National Electrical Code (NEC), FM Global standards, International Fire Code (IFC) and the Comprehensive International Building Code (IBC)\u003cbr/\u003e- Bachelor's degree in Fire Protection Engineering or equivalent.\u003cbr/\u003e- Knowledge of fire alarm and fire suppression system installation, operation and design.\u003cbr/\u003e- Knowlege of principles of fire protection engineering, fire hazards and fire behavior.","business_category":"aws","city":"Lithia Springs","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"As an Amazon Critical Infrastructure Field Engineer, you will provide full life-cycle support to AWS Data Centers from design inception through site improvement and maintenance. You will be the ‘go to’ engineering resource for your region when technical advice is needed, and will use your subject matter expertise and engage with diverse teams to:\u003cbr/\u003e- Serve as the recognized fire protection engineering expert for a broad range of fire and life safety issues across a wide geographic area. \u003cbr/\u003e- Develop relationships with authorities having jurisdiction to better serve our customers and our communities in providing safe and effective solutions.\u003cbr/\u003e- Perform design and equipment submittal review for new Data Centers in your region.\u003cbr/\u003e- Troubleshoot, conduct Root Cause Analysis (RCA) and create Corrective Action (CA) documentation for site/equipment failures.\u003cbr/\u003e- Directly support operational issues with ad-hoc training, complex operating procedure reviews, including critical equipment, and event support.\u003cbr/\u003e- Mentor and train customers and partner engineers in fire protection principles to scale and improve solutions to fire protection problems.\u003cbr/\u003e- Own the conceptual design for existing data center upgrades and design-solutions, which add capacity, improve availability, increase efficiency and sustainability.\u003cbr/\u003e- Interface with internal data center operations team, data center design engineering team, server hardware team, environmental health and safety team to promote standards that maintain consistency and reliability in services delivered.\u003cbr/\u003e- Develop innovative solutions for AWS’s data centers.\u003cbr/\u003e- Work on concurrent projects, sometimes in multiple geographical regions.\u003cbr/\u003e- Initiate and lead engineering audits including on-site visits within Amazon’s data centers. Produce reports outlining risks with recommended mitigations and remediation.\u003cbr/\u003e- Act as resident engineer during new construction projects. Support construction, commissioning, and turnover. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAmazon's vision is to be the world's most customer-centric company, and this role is key to that vision. As an Amazon Field Engineer, you will provide full life-cycle support to AWS Data Centers from design inception through site improvement and maintenance. You will be the ‘go to’ engineering resource for your region when technical advice is needed, and will use your subject matter expertise and engage with diverse teams to:. As an ideal candidate you:\u003cbr/\u003e- Possess Strong Engineering Judgement and are able to provide recommendations despite uncertainty/ambiguity.\u003cbr/\u003e- Are detail and data oriented.\u003cbr/\u003e- Have experience solving problems with engineered solutions.\u003cbr/\u003e- Have experience managing engineering projects and consultants.\u003cbr/\u003e- Build trust and relationships with different stakeholders (e.g., Operations, Controls, Construction, Design, Commissioning, Product Managers, Technical Program Managers, ).\u003cbr/\u003e- Are adaptable and inclined to get into the field to see things up close.\u003cbr/\u003e- Excited about a mix of office and field work.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eEach day you will interact with different teams responsible for all aspects of the data centers. You will prioritize your activities to support data center capacity availability and safety focusing on the actions that are most impactful. You will have the opportunity to work on projects locally and globally. We have an immediate opening for a Field Engineer in, America. If you meet these qualifications, exude passion, and enjoy the challenge of innovative projects at hyper-scale, this job is for you!\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e","department_cost_center":null,"description_short":"As an Amazon Critical Infrastructure Field Engineer, you will provide full life-cycle support to AWS Data Centers from design inception through site improvement and maintenance. You will be the ‘go to’","display_distance":null,"id":"ca1f0ee4-f31d-4486-aac0-520e52ac3c80","id_icims":"3180050","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Infrastructure Eng","job_function_id":null,"job_path":"/en/jobs/3180050/critical-infrastructure-fire-protection-engineer-field-engineering-dcc-communities","job_schedule_type":"full-time","location":"US, GA, Lithia Springs","locations":["{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Atlanta\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Atlanta\",\"coordinates\":\"33.74831,-84.39111\",\"normalizedCountyName\":\"Fulton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Atlanta, Georgia, USA\",\"location\":\"US, GA, Atlanta\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL11\"],\"normalizedCityName\":\"Atlanta\"}","{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Lithia Springs\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Lithia Springs\",\"coordinates\":\"33.79382,-84.66073\",\"normalizedCountyName\":\"Douglas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Lithia Springs, Georgia, USA\",\"location\":\"US, GA, Lithia Springs\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL68\"],\"normalizedCityName\":\"Lithia Springs\"}"],"normalized_location":"Lithia Springs, Georgia, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"February 12, 2026","preferred_qualifications":"- Professional Engineer License\u003cbr/\u003e- Experience with building codes and regulations for your region\u003cbr/\u003e- Experience carrying design concepts through exploration, development, and into deployment or mass production\u003cbr/\u003e- Experience reading, interpreting, and creating construction drawings, specifications, and submittal documents\u003cbr/\u003e- 3+ years of working directly with government officials and regulatory bodies experience\u003cbr/\u003e- Experience working with fire hazards analysis, hazard mitigation analysis and alternative means and methods for hazardous materials, energy storage systems and related topics.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, GA, Atlanta - 116,800.00 - 160,000.00 USD annually\u003cbr/\u003eUSA, GA, Lithia Springs - 116,800.00 - 160,000.00 USD annually","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"GA","title":"Critical Infrastructure Fire Protection Engineer (Field Engineering), DCC Communities ","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3180050/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of team management experience\u003cbr/\u003e- 2+ years of HR transactional processes experience\u003cbr/\u003e- Experience with Microsoft Office products and applications\u003cbr/\u003e- Bachelor's degree, or 2+ years of Amazon experience","business_category":"fulfillment-and-operations","city":"Imperial","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our mission is to be Earth's most customer-centric company. This is what unites Amazonians across teams and geographies as we are all striving to delight our customers and make their lives easier, one innovative product, service, and idea at a time.\u003cbr/\u003e\u003cbr/\u003eThe Workforce Staffing (WFS) Team is a skilled, customer obsessed, business partner hiring across multiple locations for entry-level warehouse and fulfillment associate roles. We are looking for exceptionally talented, bright and driven leaders to help build the future Amazon talent pipeline.\u003cbr/\u003e\u003cbr/\u003eThe Workforce Staffing (WFS) Team is looking for an ambitious and enthusiastic leader that can inspire others to reach the highest level of service in every candidate interaction. As a leader, the Staffing Manager owns candidate experience and operational excellence for a defined geography (node). The Staffing Manager ensures delivery of business goals and Key business indicator by creating a collaborative team environment with a strong candidate-oriented culture.\u003cbr/\u003e\u003cbr/\u003eStaffing Managers direct a high-performing team of Staffing Administrators and seasonal/flexible Associates who thrive in an innovative, fast-paced environment. These teams work onsite with varying schedules and require travel to multiple sites according to business needs. At Amazon, our teams roll up our sleeves, work hard, have fun and make history!\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Manages the day-to-day operations to ensure a positive candidate experience and alignment with business goals\u003cbr/\u003e• Leads and develops a team of administrators, including regular performance evaluations and coaching for performance improvement\u003cbr/\u003e• Assists with interviewing and onboarding new administrators \u003cbr/\u003e• Coordinates team schedule and assigns duties based on business needs\u003cbr/\u003e• Understands new hire workflow and technical systems and makes recommendations to drive improvement\u003cbr/\u003e• Develops and maintains relationships with both internal and external stakeholders to build successful long-term partnerships\u003cbr/\u003e• Analyzes daily, weekly, and monthly reporting of Key Performance Indicators and provides meaningful solutions\u003cbr/\u003e• Leads and drives change initiatives and projects, of increasing scale and complexity, through to completion\u003cbr/\u003e• Forecasts labor demand plans and creates scalable staffing strategies to build infrastructure and ensure team resource capabilities meet business demand ","department_cost_center":null,"description_short":"Our mission is to be Earth's most customer-centric company. This is what unites Amazonians across teams and geographies as we are all striving to delight our customers and make their lives easier, one","display_distance":null,"id":"b62606b5-c4b8-4916-a553-0aae041aca64","id_icims":"3169126","is_intern":null,"is_manager":null,"job_category":"Human Resources","job_family":"Human Resources","job_function_id":null,"job_path":"/en/jobs/3169126/staffing-manager-workforce-staffing","job_schedule_type":"full-time","location":"US, PA, Imperial","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Imperial\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Imperial\",\"coordinates\":\"40.4503,-80.24705\",\"normalizedCountyName\":\"Allegheny\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Imperial, Pennsylvania, USA\",\"location\":\"US, PA, Imperial\",\"region\":\"PA\",\"buildingCodeList\":[\"PIT2\"],\"normalizedCityName\":\"Imperial\"}"],"normalized_location":"Imperial, Pennsylvania, USA","optional_search_labels":[],"posted_date":"January 30, 2026","preferred_qualifications":"- Experience developing and implementing of standards, policies and programs or equivalent\u003cbr/\u003e- Experience handling confidential information and maintaining professionalism in dealing with senior executives, or experience with end-to-end project management\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, PA, Imperial - 53,700.00 - 93,900.00 USD annually","primary_search_label":"fulfillment-and-operations.team-workforce-staffing","source_system":"JobCreator","state":"PA","title":"Staffing Manager, Workforce Staffing ","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3169126/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-workforce-staffing","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- Experience owning/driving roadmap strategy and definition\u003cbr/\u003e- Experience with feature delivery and tradeoffs of a product\u003cbr/\u003e- Experience contributing to engineering discussions around technology decisions and strategy related to a product\u003cbr/\u003e- Experience managing technical products or online services\u003cbr/\u003e- Experience in representing and advocating for a variety of critical customers and stakeholders during executive-level prioritization and planning","business_category":"aws","city":"Seattle","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"AWS enables customers of all sizes to run their applications on our industry leading cloud infrastructure. As customers around the world move to the cloud, we need high-powered, technical, and analytical Product Managers to understand how customers around the world deploy, manage, and pay for their GenAI/ML and Compute, Storage, and Networking infrastructure and how AWS pricing and product capabilities should fit the unique needs of the global customer base. Customers around the world rely on AWS to provide elastic, high performance, secure, and cost-effective resources to scale their infrastructure to keep up with their changing business needs.\u003cbr/\u003e\u003cbr/\u003eAWS is looking for a Senior Product Manager to join the Private Pricing Deals Desk to help define and build the future of cloud computing and networking. The ideal candidate has a passion for building hyper-scale cloud products and enabling businesses to take their compute infrastructures and applications to the Cloud. As a member of Deals Desk, you will help build our worldwide private pricing strategy as well as pricing models designed to accelerate cloud adoption, simplify complex migrations, and transition customers financial planning from capex to opex.\u003cbr/\u003e\u003cbr/\u003eWithin this team, you will help build our worldwide pricing strategy as well as pricing models designed to accelerate cloud adoption and simplify migrations; and the tooling we require to improve the customer experience. As a member of the broader AWS Product Management team, you'll join other respected product and engineering leaders to create the future of the compute and networking platform. In this role you will play a pivotal role in solving challenges for our large and strategic customers, defining products, go-to-market strategy, and tirelessly champion the needs of our customers. Given the breadth of the AWS services this role will require coordination across many internal and external teams and will be visible at the highest levels of the company. You’ll work with our customers, partners, strategic sales teams and operational stakeholders in structuring solutions, prioritize product roadmap features, and spearhead the definition of new capabilities through expertly crafted business requirements documents.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eYou will be surrounded by people who are smart, passionate about cloud computing, and believe that world class support is critical to customer success. Every day will bring new and exciting challenges on the job while you:\u003cbr/\u003e\u003cbr/\u003e· Develop detailed, crisp business narratives and user stories that can be used to create pricing strategies, product specifications and new features\u003cbr/\u003e· Define business cases, competitive analysis, pricing analysis, and financial (P\u0026L) models\u003cbr/\u003e· Work closely with product and service leaders, sales teams, solution architects, business development and engineering teams to solve complex product and pricing issues\u003cbr/\u003e· Become the subject matter expert on specific services and use cases; recommend features, functionality, and tools to help customers more easily adopt AWS products and services\u003cbr/\u003e· Define high-quality roadmaps based on team strategy and vision\u003cbr/\u003e· Manage prioritization and trade-offs between customer experience, performance and operational support load\u003cbr/\u003e· Develop high quality reporting for executive leadership","department_cost_center":null,"description_short":"AWS enables customers of all sizes to run their applications on our industry leading cloud infrastructure. As customers around the world move to the cloud, we need high-powered, technical, and analytical","display_distance":null,"id":"a649c06b-1b85-4d9d-9373-8dcf5b26ef6e","id_icims":"3177246","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Product Management - Technical","job_function_id":null,"job_path":"/en/jobs/3177246/sr-product-mgr-technical-private-pricing","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA42\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February  9, 2026","preferred_qualifications":"- Experience in using analytical tools, such as Tableau, Qlikview, QuickSight\u003cbr/\u003e- Experience in building and driving adoption of new tools\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 151,200.00 - 204,600.00 USD annually","primary_search_label":"aws.team-product-management-primary","source_system":"JobCreator","state":"WA","title":"Sr Product Mgr - Technical, Private Pricing","university_job":null,"updated_time":"21 minutes","url_next_step":"https://account.amazon.com/jobs/3177246/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-product-management-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or above\u003cbr/\u003e- Experience supporting hourly employee client groups (warehouse/distribution, manufacturing, or call center environments)\u003cbr/\u003e- Experience leading, coaching, and mentoring direct reports and managing large HR teams with talented HR professionals\u003cbr/\u003e- Advanced level of English\u003cbr/\u003e- Human resources leadership, or equivalent experience","business_category":"global-corporate","city":"Cajamar","company_name":"Amazon Servicos de Varejo do Brasil Ltda.","country_code":"BRA","description":"The HR Manager leads and is responsible for operational excellence and organizational health through strategic PXT (People eXperience and Technology) leadership and effective people management. They strengthen culture and deliver business results by translating organizational priorities into actionable plans through their site’s PXT function. HR Managers execute business goals through hands-on leadership and data-driven decision making, while partnering with site leaders to improve leadership effectiveness and employee experience.\u003cbr/\u003e\u003cbr/\u003eSuccess Measures: Deliver sustainable improvements in both operational employees and leadership attrition, attendance, and engagement at the site level. Use data, floor presence, and feedback to coach leaders, drive accountability, and strengthen team and organizational culture.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe HR Manager is responsible for the overall employee experience and culture at their assigned site(s). Key responsibilities include:\u003cbr/\u003e\u003cbr/\u003e- Employee Experience \u0026 Culture: Manage feedback mechanisms, recognition programs, and environment standards. Foster communication, engagement, inclusion, and safety.\u003cbr/\u003e- Strategic PXT Leadership: Navigate workplace challenges, lead investigations, manage corrective actions, and handle escalations. Partner with site leadership to balance operational needs with Amazon's values.\u003cbr/\u003e- Ops Talent Planning \u0026 Org Health: Execute talent and performance routines, support succession planning, and coach on bar-raising talent practices.\u003cbr/\u003e- PXT Leadership \u0026 Org Health: Lead the PXT team, oversee hiring, promotions, and headcount planning. Develop talent and ensure high performance.\u003cbr/\u003e- PXT Operational Excellence: Ensure rigorous execution of core PXT processes, maintaining standards, compliance, and escalation protocols.\u003cbr/\u003e- The HR Manager must demonstrate strong leadership skills, strategic thinking, and the ability to influence decision-making through data and insights. They should be adept at managing complex situations, fostering a positive workplace culture, and driving continuous improvement in HR practices. The role requires a balance of operational excellence, people management, and strategic partnership with site leadership to support long-term business success.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eA typical day on our team involves managing multiple priorities simultaneously - oriented on results, with excellent organizational and interpersonal skills. You will balance technical, high-judgment HR work with actively engaging our teams on the production floor, coaching our leaders and creating Earth’s best place to work. You will coach and support leaders through stakeholder management, talent management, organizational health, organizational strategy, and team development strategies. You will own and create sustainable HR strategies, setting the vision, direction and establishing routines for the HR team through coaching and development, monitoring service levels, and holding teams accountable to meet and exceed key people, operational, financial, and team goals.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eYou will manage a team that partner with the operational leaders to ensure positive organizational health. ","department_cost_center":null,"description_short":"The HR Manager leads and is responsible for operational excellence and organizational health through strategic PXT (People eXperience and Technology) leadership and effective people management. They strengthen","display_distance":null,"id":"90f16852-6897-4c48-88c3-9c50c682ee86","id_icims":"3184328","is_intern":null,"is_manager":null,"job_category":"Human Resources","job_family":"Human Resources","job_function_id":null,"job_path":"/en/jobs/3184328/human-resources-manager-pxt-pxt-people-experience-and-technology","job_schedule_type":"full-time","location":"BR, SP, Cajamar","locations":["{\"normalizedStateName\":\"Sao Paulo\",\"normalizedCountryCode\":\"BRA\",\"city\":\"Cajamar\",\"countryIso3a\":\"BRA\",\"countryIso2a\":\"BR\",\"locationNonStemming\":\"Brazil, SP, Cajamar\",\"coordinates\":\"-23.35635,-46.87702\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Brazil\",\"normalizedLocation\":\"Cajamar, Sao Paulo, BRA\",\"location\":\"BR, SP, Cajamar\",\"region\":\"SP\",\"buildingCodeList\":[\"GRU5\"],\"normalizedCityName\":\"Cajamar\"}"],"normalized_location":"Cajamar, Sao Paulo, BRA","optional_search_labels":[],"posted_date":"February 18, 2026","preferred_qualifications":"- Master's degree or above in Human Resources Management, Business Administration or a related field\u003cbr/\u003e- Experience prior success in driving execution of large-scale project plans with multiple teams in support of business goals\u003cbr/\u003e- Experience prioritizing and handling multiple assignments at any given time while maintaining commitment to deadlines\u003cbr/\u003e- Experience delivering results by partnering with and influencing others\u003cbr/\u003e- Experience using analytical thinking and problem-solving skills to identify root causes of technical problems\u003cbr/\u003e- Experience managing conflict, escalations, negotiating compromise, influencing others and problem solving with engineering teams\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"global-corporate.team-hr-for-hr","source_system":"JobCreator","state":"SP","title":"Human Resources Manager, PXT, PXT - People eXperience and Technology","university_job":null,"updated_time":"28 minutes","url_next_step":"https://account.amazon.com/jobs/3184328/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-hr-for-hr","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Chantilly","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e- Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003e- Candidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"2a30d3bd-ebf1-4f0f-bec3-18900b611670","id_icims":"3184316","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3184316/engineering-operations-technician-dcc-communities","job_schedule_type":"full-time","location":"US, VA, Chantilly","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Chantilly\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Chantilly\",\"coordinates\":\"38.88675,-77.43892\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Chantilly, Virginia, USA\",\"location\":\"US, VA, Chantilly\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD61\"],\"normalizedCityName\":\"Chantilly\"}"],"normalized_location":"Chantilly, Virginia, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"February 18, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Technical (Military/Trade School) training\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Chantilly - 32.00 - 57.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"VA","title":"Engineering Operations Technician, DCC Communities","university_job":null,"updated_time":"31 minutes","url_next_step":"https://account.amazon.com/jobs/3184316/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}