{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Bachelor's degree, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Bachelor's degree, or 2+ years of increasing responsibilities in WHS or environmental programs in manufacturing, production, or service operations experience\u003cbr/\u003e- 3+ years of increasing responsibilities in people and performance management, or 2+ years of Amazon Safety (blue badge/FTE) experience","business_category":"fulfillment-and-operations","city":"Hampton","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We're seeking a dedicated Workplace Health \u0026 Safety (WHS) Manager to join our mission of creating the world's safest work environment. This role offers an exciting opportunity to directly impact associate wellbeing while driving operational excellence.\u003cbr/\u003e\u003cbr/\u003eAs a WHS Manager, you'll be the site's safety champion, leading our Global WHS Program implementation. You'll combine hands-on safety management with strategic thinking to protect our most valuable asset – our people. Your role bridges the gap between safety requirements and operational success, requiring both technical expertise and strong interpersonal skills. Working closely with Operations leadership, you'll drive safety initiatives that make a real difference. You'll conduct comprehensive risk assessments, analyze safety data, and implement practical solutions that protect associates while supporting productivity. Your ability to build relationships and influence positive change will be essential as you help shape our safety culture. You'll lead safety compliance efforts, conduct thorough site audits, and analyze incident trends to target improvements where they matter most. Managing our first aid program and emergency response capabilities, you'll ensure immediate care is always available. Your analytical skills will transform safety data into actionable insights, while your leadership abilities will help engage associates in our safety mission.\u003cbr/\u003e\u003cbr/\u003eCore Impact Areas:\u003cbr/\u003eSafety Leadership \u0026 Innovation - Transform safety culture through leadership and innovative solutions. Drive continuous improvement initiatives that set new benchmarks in workplace safety. Leverage technology and data analytics to drive preventive safety measures that protect our associates while enhancing operational excellence. Develop leadership plans, communicate expectations, and drive initiatives to create a safe work environment. Measure performance against WHS policies, analyze metrics, and conduct site audits to address non-compliance issues.\u003cbr/\u003e\u003cbr/\u003eStrategic Partnership \u0026 Influence - Build partnerships with Operations leadership to integrate safety into every aspect of our business. Use compelling data analysis and risk insights to influence positive change and drive strategic decision-making. Establish yourself as a trusted advisor who balances safety excellence with operational demands. Oversee recordkeeping, workplace organization, and WHS training programs.\u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements include:\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e    Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e\u003cbr/\u003e    Stand/walk for up to 12 hours during shifts\u003cbr/\u003e\u003cbr/\u003e    Work in an environment where the noise level varies\u003cbr/\u003e\u003cbr/\u003e    Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e\u003cbr/\u003e    Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e\u003cbr/\u003eMaintain effective care delivery in emergencies and assist emergency response at the site\u003cbr/\u003e\u003cbr/\u003eThis position requires the flexibility to travel 50-70% of the time and work various shifts.\u003cbr/\u003e\u003cbr/\u003eFor those that do not have an adult First Aid, CPR, AED certification from the American Heart Association or American Red Cross, must obtain within 3 weeks of start date.","department_cost_center":null,"description_short":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We're seeking","display_distance":null,"id":"825b24c5-1465-4c99-896b-61fb30083842","id_icims":"3144053","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3144053/multi-site-ehs-manager-ii","job_schedule_type":"full-time","location":"US, VA, Hampton","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Hampton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Hampton\",\"coordinates\":\"37.0278,-76.34501\",\"normalizedCountyName\":\"Hampton (City)\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Hampton, Virginia, USA\",\"location\":\"US, VA, Hampton\",\"region\":\"VA\",\"buildingCodeList\":[\"DOR3\"],\"normalizedCityName\":\"Hampton\"}"],"normalized_location":"Hampton, Virginia, USA","optional_search_labels":[],"posted_date":"December 16, 2025","preferred_qualifications":"- Distribution Center or manufacturing safety experience with mix of exempt and non-exempt employees at a site of at least 250 people preferred.\u003cbr/\u003e- Master’s degree preferred\u003cbr/\u003e- Experience in a fast-paced, changing/growing organization\u003cbr/\u003e- Certified Safety Professional preferred\u003cbr/\u003e- Excellent written and verbal communication skills, including comfort collaborating with site leaders.\u003cbr/\u003e- Ability to develop and implement department goals and strategies.\u003cbr/\u003e- Strong analytical skills with demonstrated problem solving ability.\u003cbr/\u003e- Ability to adapt well to fast-paced environments with changing circumstances, direction, and strategy\u003cbr/\u003e- Proficient in Microsoft Office and the use of pivot tables and the development of charts and graphics.\u003cbr/\u003e- Ability to manage multiple sites/remotely.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $63,100/year in our lowest geographic market up to $115,700/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"VA","title":"Multi-Site EHS Manager II","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3144053/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience with strong project management skills and the ability to thrive in a fast-paced environment","business_category":"aws","city":"Virtual","company_name":"Amazon Development Center U.S., Inc.","country_code":"USA","description":"Application deadline: Feb 18, 2026\u003cbr/\u003e\u003cbr/\u003eAs part of the AWS Applied AI Solutions organization, we have a vision to provide business applications, leveraging Amazon’s unique experience and expertise, that are used by millions of companies worldwide to manage day-to-day operations. We will accomplish this by accelerating our customers’ businesses through delivery of intuitive and differentiated technology solutions that solve enduring business challenges. We blend vision with curiosity and Amazon’s real-world experience to build opinionated, turnkey solutions. Where customers prefer to buy over build, we become their trusted partner with solutions that are no-brainers to buy and easy to use.  \u003cbr/\u003e\u003cbr/\u003eAmazon Just Walk Out as a Service (JWOS) delivers solutions to our Retail Customers to simplify shopping for their shoppers. Our enterprise-ready, autonomous retail technology enables shoppers to simply enter a store, grab what they want, and just go. Born from experience at Amazon Go, Just Walk Out uses a combination of technologies to eliminate checkout lines bringing fast and convenient transactional experiences to shoppers. JWOS is seeking a Manager, Customer Success to build first class customer service and operational support programs for our customers. This role drives customer success in several ways such as value realization, steady-state operational support, continuing customer education, and operational excellence initiatives. This function plays a critical role in defining our global customer success strategy and building the tactical playbooks, processes, and mechanisms to deliver this mandate. In this role, you will design the infrastructure for post-launch customer support, engage with customers to define requirements, and help see around corners for future needs. This role never stops iterating and never stops inventing on behalf of our customers. \u003cbr/\u003e \u003cbr/\u003eThe ideal candidate has a track record of success leading in ambiguous and high-pressure entrepreneurial situations, has impeccable communication and project management skills, and has demonstrable experience in driving customer growth through creation of scalable mechanisms and processes. Our team values an ability to own projects and work autonomously, to deliver results scrappily and at scale, and be authentic as we accomplish our goals together. This candidate understands the profundity of our revolutionary technology and the power of building and earning trust. \u003cbr/\u003e \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey Responsibilities\u003cbr/\u003e·        While always placing the customer first, drive global strategy to serve both our end users: the customer and the shopper\u003cbr/\u003e·        Develop and track customer success metrics\u003cbr/\u003e·        Develop and hit monthly, quarterly, and annual goals to improve customer satisfaction\u003cbr/\u003e·        Track and monitor industry trends and make recommendations\u003cbr/\u003e·        Develop operational excellence series and drive partner teams to deliver upon action items to improve customer experience\u003cbr/\u003e·        Parlay operational excellence outputs into value realization initiatives to strengthen our value proposition\u003cbr/\u003e·        Pursue new ideas for value creation\u003cbr/\u003e·        Solve ad hoc operational concerns as they arise in the field and apply learnings across all other customers\u003cbr/\u003e·        Develop and launch customer support infrastructure- processes, SOPs, platform\u003cbr/\u003e·        Ideate and build formal customer support program\u003cbr/\u003e·        Invent and collaborate both launch + ongoing learning and development to improve customer capabilities and retention\u003cbr/\u003e·        Gather VOC and VOS data to cross-functionally share with JWOS cross-functional teams to iterate our service\u003cbr/\u003e·        Gain alignment from sr. internal stakeholders who own multiple products\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eABOUT AWS:\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"As part of the AWS Applied AI Solutions organization, we have a vision to provide business applications, leveraging Amazon’s unique experience and expertise, that are used by millions of companies worldwide","display_distance":null,"id":"8f0fa208-3c92-4cd7-addf-e1ccd857fc69","id_icims":"3156221","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Customer Success","job_function_id":null,"job_path":"/en/jobs/3156221/program-manager-customer-growth-just-walk-out-jwo","job_schedule_type":"full-time","location":"US, Virtual","locations":["{\"normalizedCountryCode\":\"USA\",\"city\":\"Virtual\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, Virtual\",\"coordinates\":\"38.89036,-77.03196\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"USA\",\"location\":\"US, Virtual\",\"region\":\"\",\"buildingCodeList\":[\"VIR\"]}"],"normalized_location":"USA","optional_search_labels":[],"posted_date":"January  9, 2026","preferred_qualifications":"- Experience managing multiple projects and meeting aggressive deadlines\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, ,  - 80,000.00 - 140,000.00 USD annually","primary_search_label":"aws.team-program-management-primary","source_system":"JobCreator","state":null,"title":"Program Manager, Customer Growth, Just Walk Out, (JWO)","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3156221/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-program-management-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- * Formation supérieure (Bac+3/4/5) ou expérience équivalente en gestion opérationnelle * Maîtrise des outils d'analyse de données et capacité à interpréter des données complexes * Capable de communiquer en français et en anglais, à l'oral comme à l'écrit * Expertise avancée de la suite Microsoft Office, en particulier Excel","business_category":"fulfillment-and-operations","city":"Colombier-saugnieu","company_name":"Amazon France Logistique SAS","country_code":"FRA","description":"Chez Amazon, la satisfaction de nos clients est notre priorité absolue. En tant que Responsable Contrôle d'Inventaire et Audit Qualité, vous jouerez un rôle crucial dans la réalisation de notre promesse : pour chaque commande, livrer le bon produit, au bon moment. Votre expertise garantira l'intégrité de notre inventaire et la qualité de nos opérations, impactant directement la satisfaction de millions de clients à travers l'Europe.\u003cbr/\u003e\u003cbr/\u003e Vous cherchez à mettre votre expertise en gestion d'inventaire et assurance qualité au service de défis à grande échelle ? Ce poste vous place au cœur de l'un des systèmes de contrôle d'inventaire les plus avancés au monde. Vous utiliserez des outils d'analyse de pointe et des systèmes WMS sophistiqués pour garantir une précision sans précédent sur des millions d'articles. Cette expérience, combinant expertise technique, leadership et vision stratégique, vous ouvrira de nombreuses portes au sein des Opérations d'Amazon, où la maîtrise des processus de contrôle et d'amélioration continue est essentielle à tous les niveaux de l'organisation. \u003cbr/\u003e\u003cbr/\u003eLe poste à pourvoir suit le rythme des équipes opérationnelles, et vous travaillez en horaires décalés.  \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e1. Manager et développer votre équipe: Accompagner des collaborateurs aux parcours et expériences variés, favoriser leur montée en compétences, notamment dans l'analyse de données et les techniques d'investigation approfondies. \u003cbr/\u003e2. Piloter la qualité et le contrôle d'inventaire : Mettre en œuvre des stratégies pour maintenir une précision d'inventaire exceptionnelle, en utilisant des outils d'analyse avancés pour identifier et résoudre les écarts.\u003cbr/\u003e3. Conduire l'amélioration continue : Identifier les opportunités d'optimisation des processus, mener des projets d'amélioration et promouvoir une culture d'excellence opérationnelle.\u003cbr/\u003e4. Contribuer aux initiatives stratégiques : Participer à des projets d'envergure impactant le réseau logistique en France et en Europe, en apportant votre expertise pour relever des défis complexes.\u003cbr/\u003e5. Collaborer de manière transversale : En local et au sein du réseau Europe du Sud, vous travaillez en étroite collaboration avec les équipes Opérations, Finance, Loss Prevention et autres départements pour aligner les stratégies et relever les défis.","department_cost_center":null,"description_short":"Chez Amazon, la satisfaction de nos clients est notre priorité absolue. En tant que Responsable Contrôle d'Inventaire et Audit Qualité, vous jouerez un rôle crucial dans la réalisation de notre promesse","display_distance":null,"id":"74b592ac-dfd1-4aaf-a518-d2d51f690fba","id_icims":"3181642","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3181642/responsable-controle-d-inventaire-et-audit-h-f","job_schedule_type":"full-time","location":"FR, Colombier-saugnieu","locations":["{\"normalizedStateName\":\"Auvergne-Rhone-Alpes\",\"normalizedCountryCode\":\"FRA\",\"city\":\"Colombier-Saugnieu\",\"countryIso3a\":\"FRA\",\"countryIso2a\":\"FR\",\"locationNonStemming\":\"France, Colombier-Saugnieu\",\"coordinates\":\"45.71521,5.12736\",\"normalizedCountyName\":\"Rhône\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"France\",\"normalizedLocation\":\"Colombier-Saugnieu, Auvergne-Rhone-Alpes, FRA\",\"location\":\"FR, Colombier-Saugnieu\",\"region\":\"\",\"buildingCodeList\":[\"LYS2\"],\"normalizedCityName\":\"Colombier-Saugnieu\"}","{\"normalizedStateName\":\"Auvergne-Rhone-Alpes\",\"normalizedCountryCode\":\"FRA\",\"city\":\"Colombier-saugnieu\",\"countryIso3a\":\"FRA\",\"countryIso2a\":\"FR\",\"locationNonStemming\":\"France, Colombier-saugnieu\",\"coordinates\":\"45.71521,5.12736\",\"normalizedCountyName\":\"Rhône\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"France\",\"normalizedLocation\":\"Colombier-Saugnieu, Auvergne-Rhone-Alpes, FRA\",\"location\":\"FR, Colombier-saugnieu\",\"region\":\"\",\"buildingCodeList\":[\"LYS2\"],\"normalizedCityName\":\"Colombier-Saugnieu\"}"],"normalized_location":"Colombier-Saugnieu, Auvergne-Rhone-Alpes, FRA","optional_search_labels":[],"posted_date":"February 16, 2026","preferred_qualifications":"- Expérience dans un environnement logistique ou industriel * Connaissance des méthodologies Lean ou Six Sigma * Maîtrise des outils d'analyse de données et des systèmes de gestion d'entrepôt (WMS) Rejoignez Amazon et soyez au cœur de l'innovation dans le e-commerce mondial. Ensemble, repoussons les limites de ce qui est possible en logistique ! “Every Day is Day One\"!\" Amazon est un employeur engagé pour l'égalité des chances. Nous sommes convaincus qu'une main d'oeuvre diversifée est essentielle à notre réussite. Nous prenons nos décisions de recrutement en fonction de votre expérience et de vos compétences. Nous apprécions votre envie de découvrir, d'inventer, de simplifier et de construire. La protection de votre vie privée et la sécurité de vos données constituent depuis longtemps une priorité absolue pour Amazon. Veuillez consulter notre Politique de Confidentialité pour en savoir plus sur la façon dont nous collectons, utilisons et traitons les données personnelles de nos candidats. Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e- Amazon est un employeur engagé pour l'égalité des chances. Nous sommes convaincus qu'une main d'oeuvre diversifée est essentielle à notre réussite. Nous prenons nos décisions de recrutement en fonction de votre expérience et de vos compétences. Nous apprécions votre envie de découvrir, d'inventer, de simplifier et de construire. La protection de votre vie privée et la sécurité de vos données constituent depuis longtemps une priorité absolue pour Amazon. Veuillez consulter notre Politique de Confidentialité pour en savoir plus sur la façon dont nous collectons, utilisons et traitons les données personnelles de nos candidats. Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eAmazon est un employeur engagé pour l'égalité des chances. Nous sommes convaincus qu'une main d'oeuvre diversifée est essentielle à notre réussite. Nous prenons nos décisions de recrutement en fonction de votre expérience et de vos compétences. Nous apprécions votre envie de découvrir, d'inventer, de simplifier et de construire. La protection de votre vie privée et la sécurité de vos données constituent depuis longtemps une priorité absolue pour Amazon. Veuillez consulter notre Politique de Confidentialité pour en savoir plus sur la façon dont nous collectons, utilisons et traitons les données personnelles de nos candidats.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.quality","source_system":"JobCreator","state":null,"title":" Responsable Contrôle d'Inventaire et Audit (H/F)","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3181642/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"quality","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Computer Science or a related field\u003cbr/\u003e- Experience in any combination of the following: application security frameworks, security code reviews, incident response, secure infrastructure, penetration testing, mobile security, cloud security, AI security, identity and access controls, threat modeling, cryptography, threat intelligence, or secure software development\u003cbr/\u003e- Experience working as a technical lead\u003cbr/\u003e- Experience mentoring an engineering community on complex technical issues\u003cbr/\u003e- Experience in building effective security solutions at large scale","business_category":"subsidiaries","city":"Newark","company_name":"Audible, Inc.","country_code":"USA","description":"At Audible, we believe stories have the power to transform lives. It’s why we work with some of the world’s leading creators to produce and share audio storytelling with our millions of global listeners. We are dreamers and inventors who come from a wide range of backgrounds and experiences to empower and inspire each other. Imagine your future with us.\u003cbr/\u003e\u003cbr/\u003eABOUT THIS ROLE\u003cbr/\u003eAs a Security Engineering Lead at Audible you will advocate for information security throughout all our software development and business processes. You will work with other Security Engineers, Application Developers, System Engineers and Business Leaders to protect our customers and Audible’s business.\u003cbr/\u003e\u003cbr/\u003eABOUT THE TEAM\u003cbr/\u003eAudible Information Security team is looking for an experienced Security Engineering Leader to join our world class team. We are obsessed with protecting customer trust. We are a hands-on team working to protect our computer networks, servers, applications and data assets.\u003cbr/\u003e\u003cbr/\u003eAs a Security Engineering Lead, you will...\u003cbr/\u003e- Drive the security architecture of the industry leading technology underlying the Audible web and mobile applications and services to define and implement secure-by-default and defense-in-depth strategies\u003cbr/\u003e- Partner with the developer teams developing our services, and contribute security expertise to the architecture and design of Audible systems\u003cbr/\u003e- Apply your knowledge to conduct or guide deep testing of these systems to uncover security issues both manually and using developing automation tools as needed to support your work\u003cbr/\u003e- Research new techniques, vulnerabilities, and attack vectors in these components to proactively drive security improvement across each functional area\u003cbr/\u003e- Play a leadership role in Audible InfoSec and Audible development community setting direction for security of key technologies and serving as a subject matter expert resource for security engineers and business leaders inside and outside of your organization\u003cbr/\u003e- Apply your security and business knowledge to drive secure and pragmatic improvements broadly to Audible services, making technical trade-offs between short versus long term security and business goals\u003cbr/\u003e\u003cbr/\u003eABOUT AUDIBLE\u003cbr/\u003eAudible is the leading producer and provider of audio storytelling. We spark listeners’ imaginations, offering immersive, cinematic experiences full of inspiration and insight to enrich our customers daily lives. We are a global company with an entrepreneurial spirit. We are dreamers and inventors who are passionate about the positive impact Audible can make for our customers and our neighbors. This spirit courses throughout Audible, supporting a culture of creativity and inclusion built on our People Principles and our mission to build more equitable communities in the cities we call home.","department_cost_center":null,"description_short":"At Audible, we believe stories have the power to transform lives. It’s why we work with some of the world’s leading creators to produce and share audio storytelling with our millions of global listeners.","display_distance":null,"id":"0ccc1109-0706-4e2f-8dab-9105af0486fa","id_icims":"3147564","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"Systems Security Engineering","job_function_id":null,"job_path":"/en/jobs/3147564/security-engineering-lead-audible-security","job_schedule_type":"full-time","location":"US, NJ, Newark","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Culver City\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Culver City\",\"coordinates\":\"34.02202,-118.39589\",\"normalizedCountyName\":\"Los Angeles\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Culver City, California, USA\",\"location\":\"US, CA, Culver City\",\"region\":\"CA\",\"buildingCodeList\":[\"LAX35\"],\"normalizedCityName\":\"Culver City\"}","{\"normalizedStateName\":\"New Jersey\",\"normalizedCountryCode\":\"USA\",\"city\":\"Newark\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NJ, Newark\",\"coordinates\":\"40.73197,-74.17421\",\"normalizedCountyName\":\"Essex\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Newark, New Jersey, USA\",\"location\":\"US, NJ, Newark\",\"region\":\"NJ\",\"buildingCodeList\":[\"EWR11\"],\"normalizedCityName\":\"Newark\"}","{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Cambridge\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Cambridge\",\"coordinates\":\"42.36679,-71.10601\",\"normalizedCountyName\":\"Middlesex\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Cambridge, Massachusetts, USA\",\"location\":\"US, MA, Cambridge\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS11\"],\"normalizedCityName\":\"Cambridge\"}"],"normalized_location":"Newark, New Jersey, USA","optional_search_labels":[],"posted_date":"December 22, 2025","preferred_qualifications":"- Experience applying threat modeling or other risk identification techniques or equivalent\u003cbr/\u003e- Experience with security in service-oriented architectures/microservices and web services\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Culver City - 178,400.00 - 226,700.00 USD annually\u003cbr/\u003eUSA, MA, Cambridge - 178,400.00 - 226,700.00 USD annually\u003cbr/\u003eUSA, NJ, Newark - 175,100.00 - 236,900.00 USD annually","primary_search_label":"subsidiaries.team-global-audible","source_system":"JobCreator","state":"NJ","title":"Security Engineering Lead, Audible Security","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3147564/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-audible","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"•\tDoctorate or Bachelor’s Degree in Pharmacy \u003cbr/\u003e•\tActive/Good Standing Pharmacist license in domicile state\u003cbr/\u003e•\tExtensive knowledge of state and federal laws, rules, and regulations surrounding pharmacy practices and patient safety \u003cbr/\u003e•\tExperience with performance metrics, process improvement and Lean techniques \u003cbr/\u003e•\tStrong in oral and written communication skills with the ability to think clearly, analyze quantitatively, problem-solve, support scope of requirements and prioritize. \u003cbr/\u003e•\tAble to manage detail, establish root cause and be able to extract and manipulate data \u003cbr/\u003e•\tWork a flexible schedule/shift/work area, including weekends, nights, and/or holidays. \u003cbr/\u003e•\t1 year Staff Pharmacist experience within Amazon Pharmacy (if currently an Amazon employee)\u003cbr/\u003e","business_category":"healthcare","city":"Modesto","company_name":"PillPack, LLC","country_code":"USA","description":"Innovation is at the core of what we do. We believe that by removing and reducing the barriers that prevent people from taking their medications, we can help customers conveniently get the medications they need, when they need them and take them as prescribed. We have provided customers with the ability to find transparent and simple pricing, receive 24/7 customer service support, and have their meds delivered to their doorsteps while creating programs and products that embody our mission and position ourselves in becoming the world’s safest and fastest online pharmacy. \u003cbr/\u003e\u003cbr/\u003eWe are looking for a Pharmacy Manager to join us on our journey to make it drastically easier for customers to find, choose, afford, and engage with the services, products, and professionals they need to get and stay healthy! \u003cbr/\u003e\u003cbr/\u003eAt Amazon Pharmacy, the Pharmacy Manager is a licensed Pharmacist who is responsible for the operation oversight and compliance of a small format pharmacy site, including; safety, quality, customer experience, budgetary, people development and operations objectives. The Pharmacy Manager will lead a small team of technicians and pharmacists, coaching and mentoring the team to ensure performance objectives are met, building positive employee relations and building leadership bench strength within the organization. This role will require hands-on involvement in the operation, handling tasks ranging from dispensing medications to managing the entire process of prescription fulfillment, ensuring completion from initiation to the final stage. This includes, filling, verifying and packing orders for shipment, in addition to pharmacist verifications. The Pharmacy Manager will have a strong commitment to patient safety and with high standards of service to deliver on being the earth’s most customer-centric pharmacy.\u003cbr/\u003e\u003cbr/\u003e#everydaybetter\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tResponsible for the overall safety, quality, performance and customer experience of the operations. \u003cbr/\u003e•\tManage daily operations within the site, including meeting CPT times for same day deliveries, in partnership with co-located facilities and transportation.\u003cbr/\u003e•\tEvaluate physician medication orders for appropriateness of drug, dosage, potential interactions, and route of administration. Make recommendations for therapy changes to the prescriber as appropriate. \u003cbr/\u003e•\tWill set and clarify requirements and expectations for employees. Measures performance, provides feedback, and holds the team to a high bar. \u003cbr/\u003e•\tEducate pharmacy staff on policies, reporting guidelines, and expectations as they relate to best quality practices \u003cbr/\u003e•\tDrives creation of quality initiatives, process change initiatives and other Lean initiatives to enable their site to meet and exceed the operating plan. \u003cbr/\u003e•\tManaging workflow, escalations and effectively delegating across your leadership team in partnership with the Sr Pharmacy Operations Manager.\u003cbr/\u003e•\tStay informed and adhere to local, state, and federal laws related to pharmacy practices, including changes or developments and their impact on Amazon Pharmacy and its customers \u003cbr/\u003e•\tCoordinate with the corporate legal team to maintain licensure of the pharmacy and its staff with various state pharmacy boards. Continuously monitor licensure requirements \u003cbr/\u003e•\tAlign policies and initiatives with requirements and demands of accrediting/licensing bodies (BOP, VIPPS, URAC, DEA, FDA, USP) \u003cbr/\u003e•\tResponsible for the site’s growth and partnering with capacity planning and facilities for all growth workforce management needs \u003cbr/\u003e•\tDevelops talent - Create, lead, engage with and direct a workforce to drive enhanced performance through our people agenda. This will include all levels of the business - safety of our people, employee engagement, performance leadership, training and development, as well as talent \u0026 succession planning. \u003cbr/\u003e•\tImplements change and/or develop new processes as required to provide ability to better service customers, reduce cost to serve and improve contribution. \u003cbr/\u003e•\tMaintain the customer’s profile through leveraging our PharmacyOS/Pharmacy Lite database to include appropriate current and past medical history, appropriate clinical and laboratory data, and concurrent medication (including over the counter and home remedies). \u003cbr/\u003e•\tOther duties as assigned. \u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Innovation is at the core of what we do. We believe that by removing and reducing the barriers that prevent people from taking their medications, we can help customers conveniently get the medications","display_distance":null,"id":"418857de-a10f-463e-89b0-f25197dcdf67","id_icims":"3086007","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Pharmacy","job_function_id":null,"job_path":"/en/jobs/3086007/pharmacy-manager-modesto-ca-amazon-pharmacy","job_schedule_type":"full-time","location":"US, CA, Modesto","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Modesto\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Modesto\",\"coordinates\":\"37.64163,-121.00355\",\"normalizedCountyName\":\"Stanislaus\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Modesto, California, USA\",\"location\":\"US, CA, Modesto\",\"region\":\"CA\",\"buildingCodeList\":[\"DRD9\",\"VUWE\",\"CMKT46\",\"DOF1\",\"LYSM24\",\"MOD400\",\"PCA9\",\"SCA9\"],\"normalizedCityName\":\"Modesto\"}"],"normalized_location":"Modesto, California, USA","optional_search_labels":["hs3c-health-safety-sustainability-security-compliance"],"posted_date":"September 16, 2025","preferred_qualifications":"•\t2+ years direct management experience, including a salaried workforce, in a manufacturing, production or distribution environment \u003cbr/\u003e•\tExperience with the full staffing lifecycle, including interviewing, hiring, performance management, promotions and terminations \u003cbr/\u003e•\tAbility to handle changing priorities and use good judgment in stressful situation \u003cbr/\u003e•\tDemonstrated ability to successfully develop others into higher levels of leadership in an organization \u003cbr/\u003e•\tEntrepreneurial in mind, with the tenacity to develop ideas independently and thrive in fast-paced environment is crucial \u003cbr/\u003e•\tAn analytical thinker with project management skills, attention to detail, an ability to influence others, and exceptional organizational skills. \u003cbr/\u003e•\tInterest in long-term career development through assignments in multiple FCs across the nation. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Modesto - 120,000.00 - 162,400.00 USD annually","primary_search_label":"healthcare.team-pharmacy","source_system":"JobCreator","state":"CA","title":"Pharmacy Manager - Modesto, CA, Amazon Pharmacy","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3086007/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-pharmacy","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in management, business administration, economics, engineering, marketing\u003cbr/\u003e- 7+ years of team management experience\u003cbr/\u003e- 5+ years of delivering cross functional projects experience\u003cbr/\u003e- 10+ years of program or project management experience","business_category":"transportation-and-logistics","city":"Nashville","company_name":"Amazon.com Services LLC","country_code":"USA","description":"We are seeking an experienced Sr. Manager, Quick Commerce Expansions, with a breadth of Amazon experience across different business units and pillars for an exciting new role in the North America Launch \u0026 Expansion organization. The Sr. Manager, QC Expansions, will play a critical role in the rapid network growth and expansion of Amazon's newest customer offering – Amazon Now! The accomplishment of these ambitious program goals will require the individual to index extremely high on Ownership, Bias For Action, Deliver Results, and Learn \u0026 Be Curious.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eDirectly partners with Global Real Estate to develop site selection strategy \u0026 execution for Amazon Now's rapid expansion by collaborating with Pre-Construction, Design, Topology, and Finance teams to identify and validate optimal locations that meet sub-30-minute delivery SLAs.\u003cbr/\u003eDrive multi-dimensional site evaluation by assessing every proposed location through financial guardrails, capacity requirements, and service area optimization to ensure each site supports Quick Commerce's ambitious growth targets.\u003cbr/\u003eChallenge conventional approaches and think creatively to identify innovative solutions that break through process bottlenecks, questioning established norms when they impede optimal site selection outcomes, and proposing bold alternatives that accelerate launch timelines.\u003cbr/\u003eOperate at high velocity to keep pace with business expansion needs, making data-driven recommendations quickly while maintaining rigorous standards for site viability and long-term operational success.\u003cbr/\u003eDeliver executive-level strategic insights by leading VP-attended business reviews, presenting complex site selection analyses, and influencing critical launch decisions that shape the Amazon Now footprint.\u003cbr/\u003eBuild and develop a high-performing team that can balance speed with analytical rigor, fostering collaboration across multiple stakeholder groups while maintaining focus on the most impactful site selection criteria.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon's Quick Commerce Launch \u0026 Expansion Team manages end-to-end launch activities from site selection through store opening. As Sr. Manager, QC Expansions, you'll collaborate closely with team members who lead pre-construction, construction, design, start-up, \u0026 launch processes. This integrated approach enables rapid scaling while maintaining high standards, and your work will directly impact millions of customers experiencing Amazon's fastest delivery promise yet!","department_cost_center":null,"description_short":"We are seeking an experienced Sr. Manager, Quick Commerce Expansions, with a breadth of Amazon experience across different business units and pillars for an exciting new role in the North America Launch","display_distance":null,"id":"558e894f-36ea-4398-abfc-d17a1569ad89","id_icims":"3179971","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Program Management","job_function_id":null,"job_path":"/en/jobs/3179971/senior-manager-program-management-quick-commerce-expansions-na-launch-expansion","job_schedule_type":"full-time","location":"US, TN, Nashville","locations":["{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Nashville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Nashville\",\"coordinates\":\"36.16792,-86.77798\",\"normalizedCountyName\":\"Davidson\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Nashville, Tennessee, USA\",\"location\":\"US, TN, Nashville\",\"region\":\"TN\",\"buildingCodeList\":[\"BNA12\"],\"normalizedCityName\":\"Nashville\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA82\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Nashville, Tennessee, USA","optional_search_labels":[],"posted_date":"February 12, 2026","preferred_qualifications":"- MBA\u003cbr/\u003e- 10+ years of working cross functionally with tech and non-tech teams experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TN, Nashville - 136,200.00 - 184,300.00 USD annually\u003cbr/\u003eUSA, WA, Bellevue - 151,400.00 - 204,800.00 USD annually","primary_search_label":"transportation-and-logistics.team-na-operations","source_system":"JobCreator","state":"TN","title":"Senior Manager, Program Management , Quick Commerce Expansions, NA Launch \u0026 Expansion","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3179971/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-na-operations","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one modern language such as Java, C++, or C# including object-oriented design\u003cbr/\u003e- Bachelor's degree in computer science or equivalent","business_category":"amazon-business","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"Amazon is seeking passionate, talented and inventive Software Development Engineers with a strong development background to help build Agentic AI solutions for Selling Partners and Retail users. Our mission is to elevate their experience through intelligent, collaborative Agentic AI solution powered by specialized agents that deliver seamless, personalized support at scale.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs part of our team in Amazon PGX, you will work alongside internationally recognised experts to develop solutions to advance the state-of-the-art in Generative and Agentic AI. Your work will directly impact millions of our users in the form of products and services that improves their experience. You will gain hands on experience with Amazon’s native/partnered Large Language Models (LLMs), technologies like AgentCore, AgentMemory, Strands and Model Context Protocol (MCPs). We are also looking for talents with experiences/expertise in building large-scale and high-performing systems.","department_cost_center":null,"description_short":"Amazon is seeking passionate, talented and inventive Software Development Engineers with a strong development background to help build Agentic AI solutions for Selling Partners and Retail users. Our mission","display_distance":null,"id":"b09aa90d-4933-49b8-b3f4-437aa0279282","id_icims":"3179756","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3179756/software-dev-engineer-ii-eu-intech-partner-growth-experience","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR18\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"February 12, 2026","preferred_qualifications":"- Experience in building and deploying AI agents\u003cbr/\u003e- Knowledge of Selling Partner business domain\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-business.no-team-listed","source_system":"JobCreator","state":"KA","title":"Software Dev Engineer II, EU INTech Partner Growth Experience","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3179756/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of developing, negotiating and executing business agreements experience\u003cbr/\u003e- 5+ years of professional or military experience\u003cbr/\u003e- 5+ years of Go-To-Market, Business Development, Sales, or Consulting experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Experience developing strategies that influence leadership decisions at the organizational level\u003cbr/\u003e- Experience explaining complex technical concepts to various business and technical audiences\u003cbr/\u003e- Experience presenting to both technical and non-technical executive audiences","business_category":"amazon-business","city":"Arlington","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Come be a part of a rapidly expanding $35B global business. At Amazon Business, we set out every day to innovate and disrupt the status quo. We stand at the intersection of tech and retail in the B2B space developing innovative purchasing and procurement solutions to help businesses and organizations re-imagine buying. Bring your insight, imagination and a healthy disregard for the impossible. Join us in building and celebrating the value of Amazon Business to buyers and sellers of all sizes, unlocking our potential worldwide.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Define and execute on a contracted spend market development plan and ensure it's in line with the Amazon Business strategic direction, in partnership with key internal stakeholders (e.g. sales teams, service teams, marketing, partner team, contracts, legal, support, etc.).\u003cbr/\u003e• Define and size segments, identify and engage key customers, and identify and engage key partners including defense contractors and system integrators to formulate deal strategy.\u003cbr/\u003e• Support business development pipeline by engaging with key prospects and partners.\u003cbr/\u003e• Understand the technical requirements of our customers and work closely with the internal development teams to guide the direction of our product offerings to meet customer mission requirements.\u003cbr/\u003e• Understand the use of Salesforce.com and other internal Amazon systems.\u003cbr/\u003e• Present business reviews to the senior management team regarding progress and roadblocks to expanding planned/contracted/RFX spend across the Federal market. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eIn this role, you will identify opportunities for US Federal customers and their contractor community to adopt Amazon Business as a capability that promotes competition with every purchase, and highlight credentialed (small, women owned, veteran, AbilityOne, etc.) sellers and their products. Daily focus will be on identifying opportunities and driving pipeline with both the US Federal Program and Prime Contractors and their sub-contractors.","department_cost_center":null,"description_short":"Come be a part of a rapidly expanding $35B global business. At Amazon Business, we set out every day to innovate and disrupt the status quo. We stand at the intersection of tech and retail in the B2B space","display_distance":null,"id":"fcc63325-19b5-4b33-92f0-7af10a39d24a","id_icims":"3153531","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Business/Merchant Development","job_function_id":null,"job_path":"/en/jobs/3153531/capture-manager-federal-amazon-business-managed-spend-solutions","job_schedule_type":"full-time","location":"US, VA, Arlington","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS19\"],\"normalizedCityName\":\"Arlington\"}"],"normalized_location":"Arlington, Virginia, USA","optional_search_labels":[],"posted_date":"January  6, 2026","preferred_qualifications":"- Experience interpreting data and making business recommendations\u003cbr/\u003e- Experience identifying, negotiating, and executing complex legal agreements\u003cbr/\u003e- Experience developing, leading, negotiating and executing corporate and/or business transactions\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Arlington - 147,900.00 - 200,100.00 USD annually","primary_search_label":"amazon-business.no-team-listed","source_system":"JobCreator","state":"VA","title":"Capture Manager - Federal, Amazon Business - Managed Spend Solutions","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3153531/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of direct sales or business development in software, cloud or SaaS markets selling to C-level executives experience\u003cbr/\u003e- 5+ years experience selling into contact centers","business_category":"aws","city":"Atlanta","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"This position is part of the AWS Specialist and Partner Organization (ASP). Specialists own the end-to-end go-to-market strategy for their respective technology domains, providing the business and technical expertise to help our customers succeed. Partner teams own the strategy, recruiting, development, and growth of our key technology and consulting partners. Together they provide our customers with the expertise and scale needed to build innovative solutions for their most complex challenges.\u003cbr/\u003e\u003cbr/\u003eAmazon Connect is one of the fastest growing services in the history of AWS, and a leader in the Contact Center as a Service (CCaaS) space. This AI-powered cloud contact center delivers a rapid pace of innovation that enables companies to unlock bar raising experiences for customers and agents at lower cost.\u003cbr/\u003e\u003cbr/\u003eWith a robust and ever-growing product roadmap, the Connect Sales Specialist must be a seasoned Enterprise Salesperson equipped to position Amazon Connect impact drivers to technical and business stakeholders. This offering was built in direct response to customer feedback and seeks to address daily pain points and deliver improved customer service. Amazon Connect offers a compelling alternative for our customers when faced with multiple components, channels and vendors, managing long term commitments and very complex pricing models, and scaling based upon the specific needs of their businesses. The ideal candidate has enterprise sales experience in related areas (i.e. customer experience management, contact center), is a self-starter, and is willing to operate both tactically and strategically. As a key team member in this fast growing space, sellers have the opportunity to shape and develop the future of a service category that drives significant impact on our customers’ business.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Drive revenue in a defined territory with multiple account teams and partners.\u003cbr/\u003e- Meet or exceed revenue targets by helping AWS sellers navigate sales cycles and accelerate implementations by working with cross-functional team to originate and close opportunities that drive Amazon Connect revenue.\u003cbr/\u003e- Build deep relationships with customers to fully understand their business, solutions, and technical needs.\u003cbr/\u003e- Develop and execute against a comprehensive account/territory plan supporting multiple account teams to drive achievement of revenue and win goals.\u003cbr/\u003e- Create \u0026 articulate compelling value propositions that address specific needs of your customers.\u003cbr/\u003e- Build, manage, and close a pipeline of Amazon Connect revenue in your territory.\u003cbr/\u003e- Drive business development initiatives in your territory in partnership with Go To Market Strategy team and Partner Development resources to help expand market penetration for Amazon Connect.\u003cbr/\u003e- Prepare and give business reviews to AWS senior management teams.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003e\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003e\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.","department_cost_center":null,"description_short":"This position is part of the AWS Specialist and Partner Organization (ASP). Specialists own the end-to-end go-to-market strategy for their respective technology domains, providing the business and technical","display_distance":null,"id":"34f4db86-668b-40e5-8d8f-ca9602acc55e","id_icims":"3091608","is_intern":null,"is_manager":null,"job_category":"Business \u0026 Merchant Development","job_family":"Tech Sales","job_function_id":null,"job_path":"/en/jobs/3091608/sr-sales-specialist-amazon-connect","job_schedule_type":"full-time","location":"US, GA, Atlanta","locations":["{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Atlanta\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Atlanta\",\"coordinates\":\"33.74831,-84.39111\",\"normalizedCountyName\":\"Fulton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Atlanta, Georgia, USA\",\"location\":\"US, GA, Atlanta\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL11\"],\"normalizedCityName\":\"Atlanta\"}"],"normalized_location":"Atlanta, Georgia, USA","optional_search_labels":["aws.team-aspo"],"posted_date":"September 23, 2025","preferred_qualifications":"- 5+ years of building profitable partner ecosystems experience\u003cbr/\u003e- Experience developing detailed go to market plans\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $128,600/year in our lowest geographic market up to $212,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-business-development-primary","source_system":"JobCreator","state":"GA","title":"Sr Sales Specialist- Amazon Connect","university_job":null,"updated_time":"26 minutes","url_next_step":"https://account.amazon.com/jobs/3091608/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-business-development-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience completing complex tasks quickly with little to no guidance and react with appropriate urgency to situations that require a quick turnaround, or experience managing multiple calendars\u003cbr/\u003e- Experience handling confidential information\u003cbr/\u003e- Bachelor's degree is a must to apply for this position. Advanced working knowledge of MS Office Suite; in particular, Advanced Excel skills.\u003cbr/\u003e- Excellent written and spoken communication skills in Arabic and English languages are mandatory.\u003cbr/\u003e- Excellent interpersonal skills, with the ability to communicate complex issues concisely and clearly to both internal and external customers.\u003cbr/\u003e- Effective work time prioritization to ensure productivity and utilization.\u003cbr/\u003e- 3+ years of compliance, audit or risk management experience","business_category":"finance","city":"Dubai","company_name":"Q-Express Documents Transport","country_code":"ARE","description":"Amazon seeks an experienced investigator to be part of a centralized Denied Party Screening team (DPS).\u003cbr/\u003e \u003cbr/\u003e Amazon has a diverse set of global businesses, and each business has some level of compliance requirements across multiple areas, including Sellers, Retail, Trade, Human Resources, Tax, Social Responsibility, and others. While the responsibility for maintaining compliance is with the individual business areas, this team will ensure that an effective compliance program is in place to validate each business has identified their regulatory responsibilities and established effective processes, controls and self-testing to understand current status of compliance and identify gaps.\u003cbr/\u003e \u003cbr/\u003e The Sanctions Risk Specialist position focuses on accomplishing production goals and will work closely with the Operations Management Team in DPS. Individual problem-solving and analytical skills are used to authenticate and make determinations on customers and complex transactions and accounts. Nearly all decisions are expected to be made independently and with a high degree of accuracy following standard operating procedures (SOP’s).\u003cbr/\u003e \u003cbr/\u003e This position performs a 1st level review function of escalation decisions from the screening system, assists with responding to audits and outside inquiries, offers guidance, feedback and support for investigators and other operations team members working in denied entities/lists and Sanctions compliance investigations. The position will help the business comply with applicable OFAC and other agencies laws and regulations, investigate and mitigate risk, and adhere to company policies and procedures.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eInvestigate denied entities/lists and sanctions potential matches that arise from Amazon’s screening solution to support various business units.\u003cbr/\u003eParticipate in ongoing customer due diligence and KYC.\u003cbr/\u003eAssist in identifying gaps and training opportunities for escalations that come through the operations and compliance workflows.\u003cbr/\u003eDrive operational metrics reconciliation with the DPS leadership.\u003cbr/\u003eAnalyze guidance and help identify remediations for identified gaps.\u003cbr/\u003eConsistently meet set goals and KPIs. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon Security values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy Amazon Security\u003cbr/\u003eAt Amazon, security is central to maintaining customer trust and delivering delightful customer experiences. Our organization is responsible for creating and maintaining a high bar for security across all of Amazon’s products and services. We offer talented security professionals the chance to accelerate their careers with opportunities to build experience in a wide variety of areas including cloud, devices, retail, entertainment, healthcare, operations, and physical stores.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eIn Amazon Security, it’s in our nature to learn and be curious. Ongoing DEI events and learning experiences inspire us to continue learning and to embrace our uniqueness. Addressing the toughest security challenges requires that we seek out and celebrate a diversity of ideas, perspectives, and voices.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, training, and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"Amazon seeks an experienced investigator to be part of a centralized Denied Party Screening team (DPS).  Amazon has a diverse set of global businesses, and each business has some level of compliance requirements","display_distance":null,"id":"d410a48f-338d-4e4f-9ed5-0c0adefc9b61","id_icims":"3181755","is_intern":null,"is_manager":null,"job_category":"Investigation \u0026 Loss Prevention","job_family":"Amazon future builders program","job_function_id":null,"job_path":"/en/jobs/3181755/sanctions-risk-specialist-uae-national-denied-party-screening","job_schedule_type":"full-time","location":"AE, Dubai","locations":["{\"normalizedCountryCode\":\"ARE\",\"city\":\"Dubai\",\"countryIso3a\":\"ARE\",\"countryIso2a\":\"AE\",\"locationNonStemming\":\"United Arab Emirates, Dubai\",\"coordinates\":\"25.26951,55.30884\",\"normalizedCountyName\":\"Dubai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Arab Emirates\",\"normalizedLocation\":\"Dubai, ARE\",\"location\":\"AE, Dubai\",\"region\":\"\",\"buildingCodeList\":[\"DXB30\"],\"normalizedCityName\":\"Dubai\"}"],"normalized_location":"Dubai, ARE","optional_search_labels":[],"posted_date":"February 16, 2026","preferred_qualifications":"- Experience that includes strong analytical skills, attention to detail, and effective communication abilities\u003cbr/\u003e- Experience working with global cross-functional teams\u003cbr/\u003e- Experience in identifying, leading, and executing opportunities to improve, automate, standardize or simplify finance or business tools and processes\u003cbr/\u003e- CAMS certification\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-dps","source_system":"JobCreator","state":null,"title":"Sanctions Risk Specialist - UAE National, Denied Party Screening","university_job":null,"updated_time":"33 minutes","url_next_step":"https://account.amazon.com/jobs/3181755/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-dps","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}