{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 3+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 1+ years of designing and developing large-scale, multi-tiered, multi-threaded, embedded or distributed software applications, tools, systems, and services using: C#, C++, Java, or Perl experience\u003cbr/\u003e- Bachelor's degree or foreign equivalent in Computer Science, Engineering, Mathematics, or a related field\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"amazon-security","city":"Arlington","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"We are responsible for the protection of customer and corporate data, while being connected to all parts of Amazon's business and its massive worldwide service-oriented architecture. Whether you're passionate about building highly scalable and reliable systems in the cloud or a software developer who likes to solve interesting and complex business problems, AWS Security is the place for you.\u003cbr/\u003e\u003cbr/\u003eWe are looking for a Software Development Engineer to design and build large scale next generation of Authentication Management System. There is ample opportunity to innovate and deliver high impact outcomes. You will collaborate with the leadership team to drive key engineering and business decisions that will influence the Amazon developer experience. You will contribute to all parts of the software development and deployment lifecycle across the entire Amazon development community, including design, implementation, documentation, deployment and operations across multiple products.\u003cbr/\u003e\u003cbr/\u003eSuccessful candidates for this position will have strong software engineering fundamentals such as object-oriented design, algorithms, data structures, and a good grasp of advanced systems concepts and design. They must possess strong verbal and written communication skills, be self-driven and deliver high results. They need to really enjoy working closely with their peers within a group of very talented engineers and builders.\u003cbr/\u003e\u003cbr/\u003eThis position involves on-call responsibilities, typically for one week every two months. We don’t like getting paged in the middle of the night or on the weekend, so we work to ensure that our systems are fault tolerant. When we do get paged, we work together to resolve the root cause so that we don’t get paged for the same issue twice.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon Security values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003eWhy Amazon Security?\u003cbr/\u003eAt Amazon, security is central to maintaining customer trust and delivering delightful customer experiences. Our organization is responsible for creating and maintaining a high bar for security across all of Amazon’s products and services. We offer talented security professionals the chance to accelerate their careers with opportunities to build experience in a wide variety of areas including cloud, devices, retail, entertainment, healthcare, operations, and physical stores\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eIn Amazon Security, it’s in our nature to learn and be curious. Ongoing DEI events and learning experiences inspire us to continue learning and to embrace our uniqueness. Addressing the toughest security challenges requires that we seek out and celebrate a diversity of ideas, perspectives, and voices.\u003cbr/\u003eTraining \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, training, and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e","department_cost_center":null,"description_short":"We are responsible for the protection of customer and corporate data, while being connected to all parts of Amazon's business and its massive worldwide service-oriented architecture. Whether you're passionate","display_distance":null,"id":"d4d6f347-c930-43a7-83cc-9d8b894e6e31","id_icims":"3183024","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3183024/software-dev-engineer-ii-amazon-security-amazon-foundational-security-services-afss","job_schedule_type":"full-time","location":"US, VA, Arlington","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS17\"],\"normalizedCityName\":\"Arlington\"}"],"normalized_location":"Arlington, Virginia, USA","optional_search_labels":[],"posted_date":"February 17, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Arlington - 143,700.00 - 194,400.00 USD annually","primary_search_label":"amazon-security.no-team-list","source_system":"JobCreator","state":"VA","title":"Software Dev Engineer II, Amazon Security, Amazon Foundational Security Services (AFSS)","university_job":null,"updated_time":"2 minutes","url_next_step":"https://account.amazon.com/jobs/3183024/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-list","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Undergraduate degree","business_category":"transportation-and-logistics","city":"Virtual","company_name":"ASSPL - Telangana - D82","country_code":"IND","description":"Job Description for Transportation Representative – NOC\u003cbr/\u003eNOC Overview\u003cbr/\u003e\u003cbr/\u003eNOC (Network Operation Center) is the central command and control center for ‘Transportation Execution’ across the Amazon Supply Chain network supporting multiple geographies like NA, India and EU. It ensures hassle free, timely pick-up and delivery of freight from vendors to Amazon fulfillment centers (FC) and from Amazon FCs to carrier hubs. In case of any exceptions, NOC steps in to resolve the issue and keeps all the stakeholders informed on the proceedings. Along with this tactical problem solving NOC is also charged with understanding trends in network exceptions and then automating processes or proposing process changes to streamline operations. This second aspect involves network monitoring and significant analysis of network data.\u003cbr/\u003eOverall, NOC plays a critical role in ensuring the smooth functioning of Amazon transportation and thereby has a direct impact on Amazon’s ability to serve its customers on time.\u003cbr/\u003e\u003cbr/\u003ePurview of a Trans Ops Representative:\u003cbr/\u003eA Trans Ops Representative at NOC facilitates flow of information between different stakeholders (Trans Carriers/Hubs/Warehouses) and resolves any potential issues that impacts customer experience and business continuity. Trans Ops Specialist at NOC works across two verticals – Inbound and Outbound operations.\u003cbr/\u003eInbound Operations deals with Vendor/Carrier/FC relationship, ensuring that the freight is picked-up on time and is delivered at FC as per the given appointment. Trans Ops Specialist on Inbound addresses any potential issues occurring during the lifecycle of pick-up to delivery.\u003cbr/\u003eOutbound Operations deals with FC/Carrier/Carrier Hub relationship, ensuring that the truck leaves the FC in order to delivery customer orders as per promise. Trans Ops Specialist on Outbound addresses any potential issues occurring during the lifecycle of freight leaving the FC and reaching customer premises.\u003cbr/\u003e\u003cbr/\u003eA Trans Ops Representative provides timely resolution to the issue in hand by researching and querying internal tools and by taking real-time decisions. An ideal candidate should be able to understand the requirements/be able to analyze data and notice trends and be able to drive Customer Experience without compromising on time. The candidate should have the basic understanding of Logistics and should be able to communicate clearly in the written and oral form. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eTrans Ops Representative should be able to ideate process improvements and should have the zeal to drive them to conclusion.\u003cbr/\u003eResponsibilities include, but are not limited to:\u003cbr/\u003e\u003cbr/\u003e· Communication with external customers (Carriers, Vendors/Suppliers) and internal customers (Retail, Finance, Software Support, Fulfillment Centers)\u003cbr/\u003e· Must be able to systematically escalate problems or variance in the information and data to the relevant owners and teams and follow through on the resolutions to ensure they are delivered.\u003cbr/\u003e· Excellent communication, both verbal and written as one may be required to create a narrative outlining weekly findings and the variances to goals, and present these finding in a review forum.\u003cbr/\u003e\u003cbr/\u003e    Providing real-time customer experience by working in 24*7 operating environment.","department_cost_center":null,"description_short":"Job Description for Transportation Representative – NOCNOC OverviewNOC (Network Operation Center) is the central command and control center for ‘Transportation Execution’ across the Amazon Supply Chain","display_distance":null,"id":"43720598-2d59-44c4-99ab-3da26c348e52","id_icims":"3155973","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Cust. Experience Qualit Ops","job_function_id":null,"job_path":"/en/jobs/3155973/transportation-representative-gsf-mena_anow","job_schedule_type":"full-time","location":"IN, TS, Virtual","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Virtual\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Virtual\",\"coordinates\":\"17.3949,78.47081\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Telangana, IND\",\"location\":\"IN, TS, Virtual\",\"region\":\"TS\",\"buildingCodeList\":[\"VCC13\"]}"],"normalized_location":"Telangana, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"January  9, 2026","preferred_qualifications":"- Experience using Excel and SQL\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-supply-chain","source_system":"JobCreator","state":"TS","title":"Transportation Representative, GSF MENA_ANow","university_job":null,"updated_time":"3 minutes","url_next_step":"https://account.amazon.com/jobs/3155973/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-supply-chain","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Electrical Engineering or a related field\u003cbr/\u003e- Experience in developing functional specifications, design verification plans and functional test procedures\u003cbr/\u003e- 5+ years of relevant work experience with complex accelerator, storage or network server designs.\u003cbr/\u003e- 3+ years of development experience in hardware/ firmware. Proven ability to debug PCIe, memory or storage subsystems.\u003cbr/\u003e- Working with interdisciplinary teams to execute product design from concept to production spanning internal hardware, firmware and software teams as well as external design partners.","business_category":"aws","city":"Austin","company_name":"Annapurna Labs (U.S.) Inc.","country_code":"USA","description":"AWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for customers who require specialized security solutions for their cloud services.\u003cbr/\u003e\u003cbr/\u003eAnnapurna Labs (our organization within AWS UC) designs silicon and software that accelerates innovation. Customers choose us to create cloud solutions that solve challenges that were unimaginable a short time ago—even yesterday. Our custom chips, accelerators, and software stacks enable us to take on technical challenges that have never been seen before, and deliver results that help our customers change the world.\u003cbr/\u003e\u003cbr/\u003eWe are seeking a Hardware Design Engineer with role in the definition, design and validation of AWS next generation ML Chips, Cards and server integration. As a senior member of our hardware team, you will have the outstanding and meaningful opportunity to ownn the design and execution of new building block components and server products, with the goal of creating and customized platforms that fit within AWS datacenter’s world leading technology.\u003cbr/\u003e\u003cbr/\u003eAs a member of the Machine Learning Acceleration team you’ll be responsible for the design and optimization of hardware in our data centers. You’ll provide leadership of new  server deployments in a continuous effort to deliver a world-class customer experience. This is a fast-paced, intellectually challenging position, and you’ll work with thought leaders in multiple technology areas. You’ll have high standards for yourself and everyone you work with, and you’ll be constantly looking for ways to improve your products performance, quality and cost. We’re changing an industry, and we want individuals who are ready for this challenge and want to reach beyond what is possible today.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eYou will work closely with internal design teams throughout AWS as well as with Design Partner teams worldwide to produce world class server and rack products.  You will own the integration of multiple bespoke components developed by internal Annapurna labs teams and integration of the rack into AWS's infrastructure.  \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eUtility Computing (UC) \u003cbr/\u003eAWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (IoT), Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for their cloud services. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product","display_distance":null,"id":"522786b2-9912-40c9-9bb3-fd90e2a583d4","id_icims":"3117427","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"Cloud Hardware Development","job_function_id":null,"job_path":"/en/jobs/3117427/sr-hardware-engineer-ml-acceleration-annapurna-labs","job_schedule_type":"full-time","location":"US, TX, Austin","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS16\"],\"normalizedCityName\":\"Austin\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA84\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Cupertino\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Cupertino\",\"coordinates\":\"37.31913,-122.02929\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Cupertino, California, USA\",\"location\":\"US, CA, Cupertino\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC29\"],\"normalizedCityName\":\"Cupertino\"}"],"normalized_location":"Austin, Texas, USA","optional_search_labels":["aws.team-annapurna-labs","aws.team-utility-computing"],"posted_date":"October 29, 2025","preferred_qualifications":"- Master's degree or Ph.D. degree in Electrical Engineering or related field\u003cbr/\u003e- Experience in RTL coding and debug, as well as performance, power, area analysis and trade-offs\u003cbr/\u003e- Experience with modern ASIC/FPGA design and verification tools\u003cbr/\u003e- Experience with SOC bring-up and post-silicon validation\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $143,300/year in our lowest geographic market up to $257,300/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-hardware-development-primary","source_system":"JobCreator","state":"TX","title":"Sr. Hardware Engineer - ML Acceleration, Annapurna Labs","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3117427/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-hardware-development-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Hebron","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager. In this role, you will lead a team of hourly workforce and will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e\u003cbr/\u003eOur Operation’s workflow has three major components: First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Support, mentor, and motivate your hourly workforce\u003cbr/\u003e- Manage safety, quality, productivity, and customer delivery promises\u003cbr/\u003e- Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e- Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Stand/walk for up to 12 hours during shifts\u003cbr/\u003e- Work in an environment where the noise level varies and can be loud\u003cbr/\u003e- Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e- Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e\u003cbr/\u003eOur fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Area Managers based on location preference and the business’ current openings.","department_cost_center":null,"description_short":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager.","display_distance":null,"id":"6868d3be-4343-48d7-bdcf-b217df076f8c","id_icims":"3158197","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3158197/area-manager-ll","job_schedule_type":"full-time","location":"US, KY, Hebron","locations":["{\"normalizedStateName\":\"Kentucky\",\"normalizedCountryCode\":\"USA\",\"city\":\"Hebron\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, KY, Hebron\",\"coordinates\":\"39.06603,-84.70084\",\"normalizedCountyName\":\"Boone\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Hebron, Kentucky, USA\",\"location\":\"US, KY, Hebron\",\"region\":\"KY\",\"buildingCodeList\":[\"CVG2\"],\"normalizedCityName\":\"Hebron\"}"],"normalized_location":"Hebron, Kentucky, USA","optional_search_labels":[],"posted_date":"January 13, 2026","preferred_qualifications":"- Experience managing teams of 20 people or greater\u003cbr/\u003e- Experience with process improvements (Lean Six Sigma and/or Kaizen)\u003cbr/\u003e- Experience using strong customer service, communication, and interpersonal skills\u003cbr/\u003e- Bachelor's degree in Engineering, Operations, Supply Chain/Logistics, or a related field\u003cbr/\u003e- Experience in an industry role\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, KY, Hebron - 70,000.00 - 90,900.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"KY","title":"Area Manager ll ","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3158197/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 3+ years of programming with at least one software programming language experience\u003cbr/\u003e- Bachelor's degree in Computer Science, Robotics, or related field\u003cbr/\u003e- Direct, hands-on experience with developing and debugging complex embedded systems\u003cbr/\u003e- 2+ years of experience contributing to design or architecture of new and existing systems\u003cbr/\u003e- 2+ years of experience developing embedded C applications that use an RTOS (such as FreeRTOS, uC-OS, Zephyr, VxWorks, QNX) and embedded Linux environments","business_category":"subsidiaries","city":"N.reading","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Industrial Robotics is seeking exceptional talent to help develop the next generation of advanced robotics systems that will transform automation at Amazon's scale. We're building revolutionary robotic systems that combine cutting-edge AI, sophisticated control systems, and advanced mechanical design to create adaptable automation solutions capable of working safely alongside humans in dynamic environments. This is a unique opportunity to shape the future of robotics and automation at an unprecedented scale, working with world-class teams pushing the boundaries of what's possible in robotic manipulation, locomotion, and human-robot interaction. \u003cbr/\u003e\u003cbr/\u003eIf you’re passionate about safety and performance and have an interest in robotics systems, then we’d like to talk to you about becoming part of an organization with global impact on millions of customers. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe ideal candidate is enthusiastic about building the right solutions for our customers and will collaborate with other teams to ensure that our product meets Amazon-scale requirements. They will: \u003cbr/\u003e- Develop embedded software for controlling complex mechatronic systems. \u003cbr/\u003e\u003cbr/\u003e- Work with multiple components including motor control, networking/Wi-Fi, security, sensing, and safety on modern real-time actuation and system hardware. \u003cbr/\u003e- Contribute to the architecture of these complex systems and work effectively with team members to implement solutions. \u003cbr/\u003e- Develop solutions that balance performance and maintainability under the guidance of senior engineers. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Software Engineer you will work within cross functional teams to develop, test, and debug both our low-level sensing and motor control firmware and integrate it into a mid-level real time software controlling the entire robotic system. The development process will involve contributing to the design process, analyzing potential pitfalls of proposed approaches, and implementing new products and features. Testing efforts involve writing automated tests to vet the newly created features and live testing to debug and root cause issues.  ","department_cost_center":null,"description_short":"Amazon Industrial Robotics is seeking exceptional talent to help develop the next generation of advanced robotics systems that will transform automation at Amazon's scale. We're building revolutionary","display_distance":null,"id":"ed19bb3b-fc97-458d-81bb-f2eefd59ba2e","id_icims":"3168533","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3168533/software-development-engineer-ii-amazon-industrial-robotics","job_schedule_type":"full-time","location":"US, MA, N.reading","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"N.Reading\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, N.Reading\",\"coordinates\":\"42.57455,-71.07888\",\"normalizedCountyName\":\"Middlesex\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"North Reading, Massachusetts, USA\",\"location\":\"US, MA, N.Reading\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS38\"],\"normalizedCityName\":\"North Reading\"}","{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"N.reading\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, N.reading\",\"coordinates\":\"42.57455,-71.07888\",\"normalizedCountyName\":\"Middlesex\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"North Reading, Massachusetts, USA\",\"location\":\"US, MA, N.reading\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS38\"],\"normalizedCityName\":\"North Reading\"}"],"normalized_location":"North Reading, Massachusetts, USA","optional_search_labels":[],"posted_date":"January 28, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- 3+ years of experience in developing and maintaining robotics control systems in Simulink in a Hardware-In-the-Loop setting, and transferring the results to an operational robotic system\u003cbr/\u003e- 4+ years of development experience within an embedded environment or with robotic systems\u003cbr/\u003e- Experience with open-source Linux-based development tools and architectures\u003cbr/\u003e- Embedded development of Machine Learning applications\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MA, N.Reading - 143,700.00 - 194,400.00 USD annually","primary_search_label":"subsidiaries.team-amazon-robotics","source_system":"JobCreator","state":"MA","title":"Software Development Engineer II, Amazon Industrial Robotics","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3168533/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-robotics","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- 5+ years of industrial engineer, operations engineer, manufacturing engineer, or project engineer in a manufacturing environment experience\u003cbr/\u003e- Knowledge of Microsoft Office products and applications (Excel, PowerPoint, Word, Visio, and MS Project) at an advanced level\u003cbr/\u003e- English proficiency: +B2","business_category":"fulfillment-ops","city":"Mexico City","company_name":"Servicios Comerciales Amazon Mexico S. de R.L. de C.V.","country_code":"MEX","description":"Which of these options would you most value in your next job?\u003cbr/\u003e• Working in a team where talent and potential have more value than paper based qualifications\u003cbr/\u003e• Global opportunities to develop in role and choose long term career paths\u003cbr/\u003e• Working at the cutting edge of high speed automated logistics technology\u003cbr/\u003e• Finding and conquering emerging challenges as the company grows and scales rapidly\u003cbr/\u003e• Working in data driven environment where accuracy and clarity is prized above personal opinion\u003cbr/\u003e• Where support of colleagues is paramount and “Not my Job” is not in the vocabulary\u003cbr/\u003e\u003cbr/\u003eWhy choose? Join us in the Amazon Reliability Maintenance Engineering team and have them all. We maintain and optimize all technologies in the Global Amazon Warehouse \u0026 Delivery Network ranging from large, modern, purpose built warehouses utilizing robotics and high volume conveyance all the way through the value chain to small, high speed, delivery stations placed as close to our customers as possible.\u003cbr/\u003e\u003cbr/\u003ePURPOSE OF THE JOB:\u003cbr/\u003eThe Senior Reliability Maintenance Engineering Planner is responsible for asset and spares management, preventative maintenance planning and implementation of maintenance standards within the network. They support multiple sites as a subject matter expert for the CMMS (Computerised Maintenance Management System) and is a key driver of standardisation and continuous improvement within the Reliability Maintenance Engineering team.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Be a network level Subject Matter Expert (SME) on the CMMS\u003cbr/\u003e(Computerised Maintenance Management System), train and support the local Reliability Maintenance Engineering Planner and support network initiatives.\u003cbr/\u003e• Drive International standards roll-out in cross-country initiatives and participate in International led projects.\u003cbr/\u003e• Be a CMMS key user and drive programs to roll out new functionality, procedures, scheduling or reports. Monitor standards implementation through reporting and audits.\u003cbr/\u003e• Analyse and improve forecasting of preventative maintenance routines to make equipment maintenance less intrusive and more effective.\u003cbr/\u003e• Compile equipment information, performance metrics and machine histories and make recommendations for improvements based on their findings to the entire network.\u003cbr/\u003e• Work with the International network and initiatives on cost reduction and process improvement for spare parts management, equipment maintenance and maintenance routines.\u003cbr/\u003e","department_cost_center":null,"description_short":"Which of these options would you most value in your next job?• Working in a team where talent and potential have more value than paper based qualifications• Global opportunities to develop in role and","display_distance":null,"id":"7acae923-1f37-4b6e-93d5-c52f6b6c4962","id_icims":"3088159","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3088159/senior-maintenance-planner-international-reliability-maintenance-engineering-rme-team","job_schedule_type":"full-time","location":"MX, DIF, Mexico City","locations":["{\"normalizedStateName\":\"Morelos\",\"normalizedCountryCode\":\"MEX\",\"city\":\"Tepotzetlan\",\"countryIso3a\":\"MEX\",\"countryIso2a\":\"MX\",\"locationNonStemming\":\"Mexico, MEX, Tepotzetlan\",\"coordinates\":\"18.98615,-99.1015\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Mexico\",\"normalizedLocation\":\"Tepoztlán, Morelos, MEX\",\"location\":\"MX, MEX, Tepotzetlan\",\"region\":\"MEX\",\"buildingCodeList\":[\"MEX6\"],\"normalizedCityName\":\"Tepoztlán\"}","{\"normalizedStateName\":\"Nuevo Leon\",\"normalizedCountryCode\":\"MEX\",\"city\":\"Apodaca\",\"countryIso3a\":\"MEX\",\"countryIso2a\":\"MX\",\"locationNonStemming\":\"Mexico, NLE, Apodaca\",\"coordinates\":\"25.78207,-100.18896\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Mexico\",\"normalizedLocation\":\"Apodaca, Nuevo Leon, MEX\",\"location\":\"MX, NLE, Apodaca\",\"region\":\"NLE\",\"buildingCodeList\":[\"MTY2\"],\"normalizedCityName\":\"Apodaca\"}","{\"normalizedStateName\":\"Mexico City\",\"normalizedCountryCode\":\"MEX\",\"city\":\"Mexico City\",\"countryIso3a\":\"MEX\",\"countryIso2a\":\"MX\",\"locationNonStemming\":\"Mexico, DIF, Mexico City\",\"coordinates\":\"19.43195,-99.13315\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Mexico\",\"normalizedLocation\":\"Mexico City, Mexico City, MEX\",\"location\":\"MX, DIF, Mexico City\",\"region\":\"DIF\",\"buildingCodeList\":[\"MEX16\"],\"normalizedCityName\":\"Mexico City\"}"],"normalized_location":"Mexico City, Mexico City, MEX","optional_search_labels":["mx-stores"],"posted_date":"September 18, 2025","preferred_qualifications":"- Knowledge of AutoCAD, VBA, and SQL at the intermediate level\u003cbr/\u003e- Experience working with and managing third party vendors\u003cbr/\u003e- Experience with Six Sigma, lean manufacturing\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":"DIF","title":"Senior Maintenance Planner, International Reliability Maintenance Engineering (RME) Team","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3088159/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"• Bachelor’s degree or relevant experience \u003cbr/\u003e• 10+ years of Operations experience (supply chain, logistics, transportation, manufacturing, retail, etc.) \u003cbr/\u003e• Experience to lead/manage a team of 10+ people and develop them \u003cbr/\u003e• Business level English","business_category":"transportation-and-logistics","city":"Tokyo","company_name":"Amazon Japan G.K.","country_code":"JPN","description":"Amazon seeks a Senior Operations Manager to join our Japan Amazon Logistics team. The goal of Amazon Logistics (AMZL) is to build a world class last mile operation delivering to customers. Amazon aims to exceed the expectations of our customers by ensuring that their orders are delivered as quickly, accurately, and in the most cost effective way as possible and we are expanding rapidly in Japan.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe Hub Delivery Expansion \u0026 Capacity Management Lead is accountable for driving partner acquisition strategy, Sales team expansion, and network capacity optimization to meet growing operational demands.\u003cbr/\u003eThe Hub Delivery Expansion \u0026 Capacity Management Lead will lead the end-to-end aspects of partner onboarding, tracking and reviewing, utilizing technologies like Hugo and CTO for optimal location and partner selection. The position requires close collaboration with the Hub Delivery Program team to execute partner acquisition strategies while ensuring alignment with marketing initiatives and Sales member hiring timelines.\u003cbr/\u003e The role demands strong leadership skills in scaling the Sales team including hiring of other role members. The role will need to possess an out-of-the-box thinking capability to ensure innovative ways of building the talent pool of the Hub Delivery team and create structured training modules to enhance performance of both Sales \u0026 other function team.\u003cbr/\u003eStakeholder management will be a key prerequisite for the role as they would need to liaise with multiple teams of program \u0026 planning as also vendors. Capacity planning for high volume events will be a critical responsibility, directed towards building driver’s capacity for AMZL. This also includes developing bonus structures, partner communication templates, and leading all peak planning initiatives.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e As the single-threaded leader, this role will address all partner onboarding concerns raised by Program and leadership teams while establishing necessary cadences for expedited onboarding and launches.\u003cbr/\u003eThe role will need to possess strong skills in managing large teams. This will involve both recruitment and developing talent across levels. The ability to positively influence the team and be able to deliver results against business odds will be important.\u003cbr/\u003eSuccess in this role demands excellence in strategic planning, analytical thinking, and cross-functional collaboration to ensure optimal capacity management across the network while maintaining service quality and compliance standards.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003e【More Information】\u003cbr/\u003e■Job information;\u003cbr/\u003e\u003ca href=\"https://www.amazon.co.jp/b?node=5609903051\"\u003eBusiness Strategy and Planning\u003c/a\u003e\u003cbr/\u003e\u003ca href=\"https://www.amazon.co.jp/b?node=5609898051\"\u003eOperations\u003c/a\u003e\u003cbr/\u003e■\u003ca href=\"https://www.amazon.co.jp/b?node=5637343051\"\u003eAMZL department\u003c/a\u003e\u003cbr/\u003e～\u003ca href=\"https://www.aboutamazon.jp/news/delivery-and-logistics/deliver-to-neighbors-in-your-spare-time-amazon-hub-delivery-partner-program\"\u003eAmazon Hub Delivery Program in Japan\u003c/a\u003e～\u003cbr/\u003e■\u003ca href=\"https://www.amazon.co.jp/b?node=5589794051\"\u003eShinagawa, Tokyo office\u003c/a\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon seeks a Senior Operations Manager to join our Japan Amazon Logistics team. The goal of Amazon Logistics (AMZL) is to build a world class last mile operation delivering to customers. Amazon aims","display_distance":null,"id":"95911d68-a3f9-4145-a77a-4d8a554f0a6e","id_icims":"3093576","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3093576/senior-operations-manager-hub-delivery-expansion-capacity-management-lead","job_schedule_type":"full-time","location":"JP, 13, Tokyo","locations":["{\"normalizedStateName\":\"Tokyo\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Tokyo\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, 13, Tokyo\",\"coordinates\":\"35.68946,139.69172\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Tokyo, JPN\",\"location\":\"JP, 13, Tokyo\",\"region\":\"13\",\"buildingCodeList\":[\"HND21\"]}"],"normalized_location":"Tokyo, JPN","optional_search_labels":[],"posted_date":"September 26, 2025","preferred_qualifications":"• Strong operations experience in a fast growing company/industry \u003cbr/\u003e• 15+ years of Operations experience (supply chain, logistics, transportation, manufacturing, retail, etc.)\u003cbr/\u003e• Previous experience leading a rapid expansion plan \u003cbr/\u003e• Proven record of delivering multi programs on time \u003cbr/\u003e• Excellent communication skills \u003cbr/\u003e• Business level of Japanese \u003cbr/\u003e• Excited about working in a diverse group and contributing to an inclusive culture Our inclusive culture empowers Amazonians to deliver the best results for our customers. \u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-amzl","source_system":"JobCreator","state":"13","title":"Senior Operations Manager, Hub Delivery Expansion \u0026 Capacity Management Lead","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3093576/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amzl","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- Are 18 years of age or older\u003cbr/\u003e- 1+ years retail or customer-facing, or 1+ years floor leader or other  leadership, or 1+ years Amazon (Blue Badge/FTE) experience","business_category":"fulfillment-ops","city":"Redondo Beach","company_name":"Prime Now LLC - E78","country_code":"USA","description":"Pay starts at $20.30 per hour with benefits available.\u003cbr/\u003e\u003cbr/\u003eReduced Time Hours: Average work between 30-39 hrs per week. \u003cbr/\u003e\u003cbr/\u003e\u003cspan style=\"font-style: italic;\"\u003eThis role requires open availability Tuesday-Saturday between 3:45pm and 10:15pm.\u003c/span\u003e\u003cbr/\u003e\u003cbr/\u003eAs a Retail Lead Associate, you will be the face of Amazon and contribute to the culture based on customer obsession, trust, respect, integrity, continuous learning, and fun. You possess strong attention to detail, the ability to quickly prioritize tasks, the willingness to learn new things, and a commitment to delighting our customers. You will assist with customer service operations and floor leader responsibilities.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Interact with customers by effectively using customer engagement strategies and model desired behavior for the rest of the team.\u003cbr/\u003e- Utilize inventory management systems to scan, process, and count product.\u003cbr/\u003e- Provide peer-to-peer feedback on processes and standards, serving as the escalation point to assist associate peers in solving customer issues, where appropriate.\u003cbr/\u003e- Contribute to continuous improvement of the customer experience and operations by participating in the development of best practices.\u003cbr/\u003e- Help identify and communicate barriers and trends that contribute to the customer and associate experience and support the manager in building a strong site culture.\u003cbr/\u003e- Work with a manager to maintain the physical safety and quality standards of the site.\u003cbr/\u003e- Work in a fast changing and ambiguous environment.\u003cbr/\u003e- Perform additional duties, as assigned\u003cbr/\u003e- Work flexible hours including nights, weekends, and holidays.\u003cbr/\u003e- Lift up to 49 pounds, stand and walk during shifts lasting up to 12 hours, and frequently push, pull, squat, bend, and reach, as well as continuously climb and descend stairs.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eInterested in joining our dedicated team at Amazon that makes the return of pickup and packages convenient for our customers at our Locker+ retail locations? Curious to be at the heart of where innovation meets customer obsession? \u003cbr/\u003e\u003cbr/\u003eCustomer Experience Operations (CXO) is an exciting organization within Amazon specializing in delighting our customers with quality service in an ever-changing environment. Our goal is to go beyond assisting with customer orders. We strive to connect personally with our customers and uplift their lives – even if for just a few moments. We operate out of designated retail locations – where it’s convenient for our customers – helping facilitate the delivery and return of customer orders.","department_cost_center":null,"description_short":"Pay starts at $20.30 per hour with benefits available.Reduced Time Hours: Average work between 30-39 hrs per week. This role requires open availability Tuesday-Saturday between 3:45pm and 10:15pm.As a","display_distance":null,"id":"34040a98-3e77-4216-a80b-e920d379eeef","id_icims":"3159608","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Physical Retail Store","job_function_id":null,"job_path":"/en/jobs/3159608/retail-lead-associate-reduced-time-customer-experience-operations","job_schedule_type":"part-time","location":"US, CA, Redondo Beach","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redondo Beach\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Redondo Beach\",\"coordinates\":\"33.84468,-118.38765\",\"normalizedCountyName\":\"Los Angeles\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redondo Beach, California, USA\",\"location\":\"US, CA, Redondo Beach\",\"region\":\"CA\",\"buildingCodeList\":[\"LRDB\"],\"normalizedCityName\":\"Redondo Beach\"}"],"normalized_location":"Redondo Beach, California, USA","optional_search_labels":[],"posted_date":"January 14, 2026","preferred_qualifications":"- Experience in training others\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below including the base pay rate plus the highest available shift differential which applies depending on the shift you select. As a total compensation company, you are eligible for additional earnings including overtime pay and performance bonuses. Final pay will be based on factors including shift selection and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Redondo Beach - 20.00 - 20.00 USD hourly","primary_search_label":"fulfillment-ops.team-global-specialty-fulfillment","source_system":"JobCreator","state":"CA","title":"Retail Lead Associate (Reduced-Time), Customer Experience Operations","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3159608/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-specialty-fulfillment","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of engineering team management experience\u003cbr/\u003e- 7+ years of working directly within engineering teams experience\u003cbr/\u003e- 3+ years of designing or architecting (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 8+ years of leading the definition and development of multi tier web services experience\u003cbr/\u003e- Knowledge of engineering practices and patterns for the full software/hardware/networks development life cycle, including coding standards, code reviews, source control management, build processes, testing, certification, and livesite operations\u003cbr/\u003e- Experience partnering with product or program management teams","business_category":"operations","city":"Toronto","company_name":"Amazon Development Centre Canada ULC","country_code":"CAN","description":"Procurement Infrastructure owns the software systems which generate purchase orders to procure hundreds-of-billions of dollars’ worth of retail inventory each year. It's important that we reliably create, store, update, and convey purchase orders to thousands of vendors, then listen and act when they reply with signals regarding their ability to fulfill those orders, helping to ensure that Amazon will have the products in-stock that our customers want and love.\u003cbr/\u003e\u003cbr/\u003eThe systems and interfaces our business uses are a mixture of leading-edge technologies (ex: AWS cloud services, GenAI-powered agents) and legacy or proprietary technologies (ex: EDI, Amazon private cloud, Amazon proprietary data warehouse). \u003cbr/\u003e\u003cbr/\u003eAs the Software Development Manager III of Procurement Infrastructure, you will lead and motivate a talented, diverse 2-pizza team that develops and maintains business critical supply chain software systems. Our web services have over 400 internal system clients, and powers internal and customer-facing portals that serve tens-of-thousands of business users. In 2026, your team will own development of a GenAI-powered agent that takes requests for PO or chargeback changes from internal resources, collects additional data or context, and then determines and executes an optimal mitigation based on the user’s input.     \u003cbr/\u003e\u003cbr/\u003eIn your role, you will collaborate with senior leadership, product managers, engineering managers, and senior engineers across Amazon teams to drive a technical and business vision, manage 1-3 year roadmaps, and produce results. As part of Amazon’s annual planning process, you will develop technical and business goals. You will be accountable for the software development lifecycle process, ensuring that deliverables and goals are met, while also managing the daily operational needs of the business.\u003cbr/\u003e\u003cbr/\u003eYou should be comfortable in developing high-level architecture for software systems, but also be able to deep-dive into design and low-level details. You have the ability to suggest and carry out practical actions to deal with urgent issues while also building highly available, high-throughput software systems to address the long-term needs of the business. To excel in this role, it is also necessary to have strong written and verbal communication skills, business-savvy, and an ability to effectively communicate customer and product requirements. As the owner of critical systems that impact a broad audience, you will need to be able to drive alignment amongst internal stakeholders that often have conflicting requirements or priorities.\u003cbr/\u003e\u003cbr/\u003eIf you’re excited about managing a high-impact software engineering team which owns a critical piece of Amazon’s supply chain infrastructure, then apply today!","department_cost_center":null,"description_short":"Procurement Infrastructure owns the software systems which generate purchase orders to procure hundreds-of-billions of dollars’ worth of retail inventory each year. It's important that we reliably create,","display_distance":null,"id":"2e65a8bf-0180-4b9e-9f68-cd22fd0d3abc","id_icims":"3184117","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3184117/software-development-manager-procurement-lifecycle","job_schedule_type":"full-time","location":"CA, ON, Toronto","locations":["{\"normalizedStateName\":\"Ontario\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Toronto\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, ON, Toronto\",\"coordinates\":\"43.64869,-79.38544\",\"normalizedCountyName\":\"Toronto\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Toronto, Ontario, CAN\",\"location\":\"CA, ON, Toronto\",\"region\":\"ON\",\"buildingCodeList\":[\"YYZ14\"],\"normalizedCityName\":\"Toronto\"}"],"normalized_location":"Toronto, Ontario, CAN","optional_search_labels":[],"posted_date":"February 18, 2026","preferred_qualifications":"- Experience in communicating with users, other technical teams, and senior leadership to collect requirements, describe software product features, technical designs, and product strategy\u003cbr/\u003e- Experience in recruiting, hiring, mentoring/coaching and managing teams of Software Engineers to improve their skills, and make them more effective, product software engineers\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(34, 34, 34)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. As a total compensation company, Amazon's package may include other elements such as sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon offers comprehensive benefits including health insurance (medical, dental, vision, prescription, basic life \u0026amp; AD\u0026amp;D insurance), Registered Retirement Savings Plan (RRSP), Deferred Profit Sharing Plan (DPSP), paid time off, and other resources to improve health and well-being. We thank all applicants for their interest, however only those interviewed will be advised as to hiring status.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eCAN, ON, Toronto - 171,400.00 - 286,200.00 CAD annually","primary_search_label":"operations.team-supply-chain-optimization","source_system":"JobCreator","state":"ON","title":"Software Development Manager, Procurement Lifecycle","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3184117/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-supply-chain-optimization","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"•\tMasters’s or higher degree in a relevant field (computational linguistics or equivalent field with computational analysis) \u003cbr/\u003e•\t2+ years experience in computational linguistics or language data processing\u003cbr/\u003e•\tExperience with language annotation and other forms of data markup\u003cbr/\u003e•\tExperience with scripting languages, such as Python\u003cbr/\u003e•\tExperience working with speech and text language data in multiple languages\u003cbr/\u003e•\tExcellent communication, strong organizational skills and very detailed oriented\u003cbr/\u003e•\tComfortable working in a fast paced, highly collaborative, dynamic work environment ","business_category":"amazon-artificial-general-intelligence","city":"Boston","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The Amazon Artificial General Intelligence (AGI) Data Services organization is looking for a Language Engineer with experience in dataset construction, linguistic annotation, dialog/semantic schemas, and automatic processing of large datasets. You will play a critical role in driving innovation and advancing the state-of-the-art in natural language processing and machine learning. You will work closely with cross-functional teams, including product managers, engineers, and data scientists to ensure that our AI systems are aligned with human policies and preferences. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eSpecifically, the Language Engineer will: \u003cbr/\u003e•\tDesign data collection/creation tasks in response to science needs: author instructions, define and implement quality targets and mechanisms, provide day-to-day coordination of data collection efforts (including planning, scheduling, and reporting), and be responsible for the final deliverables\u003cbr/\u003e•\tAnalyze and extract language-related insights from large amounts of data\u003cbr/\u003e•\tBuild tools or tool prototypes for data analysis or data authoring, using Python or another scripting language\u003cbr/\u003e•\tUse modeling tools to bootstrap or test new functionalities \u003cbr/\u003e•\tCollaborate with scientists and software engineers to evaluate performance of language models\u003cbr/\u003e•\tHandle competing requests from a range of data customers \u003cbr/\u003e","department_cost_center":null,"description_short":"The Amazon Artificial General Intelligence (AGI) Data Services organization is looking for a Language Engineer with experience in dataset construction, linguistic annotation, dialog/semantic schemas, and","display_distance":null,"id":"ad27cbf4-c0e6-48f2-a187-af778a8e5efe","id_icims":"3020566","is_intern":null,"is_manager":null,"job_category":"Data Science","job_family":"Language Engineer","job_function_id":null,"job_path":"/en/jobs/3020566/language-engineer-artificial-general-intelligence-data-services","job_schedule_type":"full-time","location":"US, MA, Boston","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Boston\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Boston\",\"coordinates\":\"42.35866,-71.05674\",\"normalizedCountyName\":\"Suffolk\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Boston, Massachusetts, USA\",\"location\":\"US, MA, Boston\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS17\"],\"normalizedCityName\":\"Boston\"}"],"normalized_location":"Boston, Massachusetts, USA","optional_search_labels":[],"posted_date":"June 27, 2025","preferred_qualifications":"PhD in Computational Linguistics (or equivalent field with computational emphasis)\u003cbr/\u003e•\tExpertise in bootstrapping language data collections in a quickly changing environment\u003cbr/\u003e•\tComfortable working with speech and text language data in multiple languages \u003cbr/\u003e•\tExperience in writing grammars and building FSTs\u003cbr/\u003e•\tExperience with statistical language modeling \u003cbr/\u003e•\tPractical knowledge of version control and agile development\u003cbr/\u003e•\tFamiliarity with database queries and data analysis processes (SQL, R, Matlab, etc.) \u003cbr/\u003e•\tWillingness to support several projects at one time, and to accept reprioritization as necessary \u003cbr/\u003e•\tAble to think creatively and possess strong analytical and problem solving skills\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MA, Boston - 65,200.00 - 114,000.00 USD annually","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":"MA","title":"Language Engineer, Artificial General Intelligence - Data Services","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3020566/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}