{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 7+ years of business intelligence and analytics experience\u003cbr/\u003e- 5+ years of delivering results managing a business intelligence or analytics team, including employee development and performance management experience\u003cbr/\u003e- Experience with SQL\u003cbr/\u003e- Experience with ETL\u003cbr/\u003e- Experience with data visualization using Tableau, Quicksight, or similar tools\u003cbr/\u003e- Experience with R, Python, Weka, SAS, Matlab or other statistical/machine learning software","business_category":"operations","city":"Toronto","company_name":"Amazon.com.ca, ULC","country_code":"CAN","description":"Amazon has the world’s most complex supply chain: we fulfill global demand for hundreds of millions of products at lightning fast delivery speeds. We need your skills to optimize our supply chain, with the end goal of delighting our customers. A core part of the supply chain operations is Demand and Inbound Forecasting: We forecast the demand and arrival of tens of millions of products. The forecasts are used to make many decisions, such as automatically order hundreds of millions worth of inventory, decide where to place that inventory, and establish labor plans for WW warehouses.\u003cbr/\u003e\u003cbr/\u003eWe are looking for a Sr. Business Intelligence Engineering Manager to lead a team developing new tools and metrics to oversee the delivery of analytics solutions across the product development lifecycle, from entitlement through implementation and ongoing business operations. \u003cbr/\u003e\u003cbr/\u003eA successful candidate will be customer obsessed - the Forecasting org has 50+ unique customers. You will need to balance long-term thinking with short-term actions. You will be comfortable navigating an ambiguous environment, know how to confirm and reconfirm assumptions, and be able to harmonize disparate points of view.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eTeam Leadership \u0026 Development\u003cbr/\u003e• Leadership and development of a team of business intelligence engineers (BIEs), set team priorities, and ensure alignment with organization priorities and goals \u003cbr/\u003e• Facilitate team member growth and career development\u003cbr/\u003e• Continuously improve team capabilities by establishing best practices for analytics delivery and technical knowledge\u003cbr/\u003e\u003cbr/\u003eAnalytics \u0026 Insights\u003cbr/\u003e• Lead projects using data modeling, and statistical analysis best practices to create reporting and give insight to the forecast against large, multi-dimensional datasets from multiple sources\u003cbr/\u003e• Direct the design and implementation of analytics solutions for new product initiatives\u003cbr/\u003e• Ensure quality and consistency of analytical outputs across team deliverables\u003cbr/\u003e• Build tools to analyze large amounts of data that uncover forecasting issues and convey insights which highlight forecast performance and explain variance \u003cbr/\u003e• Oversee the development and maintenance of recurring reporting frameworks\u003cbr/\u003e\u003cbr/\u003eProduct Development Support\u003cbr/\u003e• Partner with product, science, and engineering teams throughout the development lifecycle to define success metrics and measurement approaches\u003cbr/\u003e• Guide analytics strategy during project entitlement phases\u003cbr/\u003e\u003cbr/\u003eBusiness Partnership\u003cbr/\u003e• Translate complex analytical findings into actionable business recommendations\u003cbr/\u003e• Build and maintain relationships with cross-functional stakeholders\u003cbr/\u003e\u003cbr/\u003eKeys to success in this role include exceptional analytical thinking, knowledge of statistical analysis tools, judgment, and communication skills. As well as the ability to coach and develop these capabilities within their team. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include:\u003cbr/\u003e1. Medical, Dental, and Vision Coverage\u003cbr/\u003e2. Maternity and Parental Leave Options\u003cbr/\u003e3. Paid Time Off (PTO)\u003cbr/\u003e4. RRSP\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe are ASIN Forecasting Analytics Team. We monitor the ASIN demand and inbound inventory forecasts for Amazon businesses WW. We report on historical forecast performance, the changes of future forecasts, and the health of future forecasts. We partner with stakeholder teams across supply chain, retail, and operations to assess the future forecast against existing supply conditions. Lastly, we develop intervention models to correct forecasts when defects exist or for scenarios that are not addressed adequately by core models. In addition to forecast accuracy, we help manage forecast volatility. ","department_cost_center":null,"description_short":"Amazon has the world’s most complex supply chain: we fulfill global demand for hundreds of millions of products at lightning fast delivery speeds. We need your skills to optimize our supply chain, with","display_distance":null,"id":"bc1b7104-e966-48e0-8cdd-4e70952265a1","id_icims":"3161242","is_intern":null,"is_manager":null,"job_category":"Business Intelligence","job_family":"Business Intel Engineer","job_function_id":null,"job_path":"/en/jobs/3161242/bi-manager-forecasting-analytics","job_schedule_type":"full-time","location":"CA, ON, Toronto","locations":["{\"normalizedStateName\":\"Ontario\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Toronto\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, ON, Toronto\",\"coordinates\":\"43.64869,-79.38544\",\"normalizedCountyName\":\"Toronto\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Toronto, Ontario, CAN\",\"location\":\"CA, ON, Toronto\",\"region\":\"ON\",\"buildingCodeList\":[\"YYZ14\"],\"normalizedCityName\":\"Toronto\"}"],"normalized_location":"Toronto, Ontario, CAN","optional_search_labels":[],"posted_date":"January 16, 2026","preferred_qualifications":"- 4+ years of working with very large data warehousing environment experience\u003cbr/\u003e- 10+ years of data warehouse technical architectures, data modeling, infrastructure components, ETL/ ELT and reporting/analytic tools and environments, data structures and hands-on SQL coding experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(34, 34, 34)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. As a total compensation company, Amazon's package may include other elements such as sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon offers comprehensive benefits including health insurance (medical, dental, vision, prescription, basic life \u0026amp; AD\u0026amp;D insurance), Registered Retirement Savings Plan (RRSP), Deferred Profit Sharing Plan (DPSP), paid time off, and other resources to improve health and well-being. We thank all applicants for their interest, however only those interviewed will be advised as to hiring status.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eCAN, ON, Toronto - 110,100.00 - 183,900.00 CAD annually","primary_search_label":"operations.team-amazon-delivery-technology","source_system":"JobCreator","state":"ON","title":"BI Manager, Forecasting Analytics","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3161242/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-delivery-technology","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience programming with at least one software programming language\u003cbr/\u003e- 1+ years of contributing to new and current systems architecture and design (architecture, design patterns, reliability and scaling) experience\u003cbr/\u003e- 2+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 3+ years of experience with Master's degree in Computer Science or equivalent OR 5+ years experience with Bachelor's Degree in Computer Science or equivalent, in: software development, including design, implementation, debugging, and support\u003cbr/\u003e- Very strong Computer Science fundamentals in algorithm design, data structures, problem solving, and complexity analysis\u003cbr/\u003e- Strong proficiency in developing objected-oriented software, with deep experience in one or more relevant languages (Java, C, C++, C#)","business_category":"aws","city":"Arlington","company_name":"Amazon Development Center U.S., Inc.","country_code":"USA","description":"Want to change the world with Big Data and Analytics? Come join us on the Amazon Analytics team in Amazon Web Services!\u003cbr/\u003e\u003cbr/\u003eAmazon Athena is an analytics service that makes it easy to get insights from Amazon S3 based data lakes using open standards like SQL, Parquet, Apache Iceberg and others. Athena is serverless, so there is no infrastructure to set up or manage as the service scales automatically based on data volume and query complexity. Creating a simple, rich and performant experience for customers requires solving challenging engineering problems.\u003cbr/\u003e\u003cbr/\u003eWe are working on our own scaling infrastructure (virtualization, tenant isolation, forecasting, scheduling, containers, admission control, infrastructure deployment) and making significant performance and reliability improvements to our Open Source based engine (memory management, micro-optimizations, CBO, vectorization, etc.) We’re looking for top engineers to design and build features that bridge the gap between OSS query engines and hyper-scaler performance.\u003cbr/\u003e\u003cbr/\u003eWe value highly technical, hands-on, data driven leaders who know multiple query engine internals and are willing to learn new areas. A successful engineer is hardwired towards engineering excellence and understands what it takes to run a production service. We look for individuals who will set aside meaningful time to develop themselves as we continually learn from customers.\u003cbr/\u003e\u003cbr/\u003eYou will work backwards from the customer needs and you will get to do everything from designing and building large scale systems and features for the savviest customers in the business.\u003cbr/\u003e\u003cbr/\u003eBy joining our team, you will get to work with a minimum of technical supervision, while playing a variety of roles as needed to respond efficiently to multiple program priorities. You will get to collaborate with some of the best and brightest minds in the industry. You'll enjoy a competitive salary, great benefits, a creative and agile work environment, and the exciting opportunity to be part of a fast-paced and growing team and one of the most innovative technology companies - but most of all, you will get the satisfaction of making products that millions use everyday to great effect!\u003cbr/\u003eTo learn more about Athena and EMR: \u003cbr/\u003e\u003cbr/\u003e* Amazon Athena: https://aws.amazon.com/athena/\u003cbr/\u003e* AWS Big Data Blog: https://aws.amazon.com/blogs/big-data/ \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Designing and building the next-generation technologies that will make Athena SQL the best environment to run analytic SQL at any scale\u003cbr/\u003e- Working on complex problems in distributed systems and query engines.\u003cbr/\u003e- Translation of complex functional and technical requirements into detailed architecture and design.\u003cbr/\u003e- Deliver systems and features with top-notch quality, on time.\u003cbr/\u003e- Own the software development process end-to-end, including: working with engineers and product managers to develop requirements; designing, architecting, planning, implementing, and testing new systems and features; deploying, and operating the production Athena systems. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.","department_cost_center":null,"description_short":"Want to change the world with Big Data and Analytics? Come join us on the Amazon Analytics team in Amazon Web Services!Amazon Athena is an analytics service that makes it easy to get insights from Amazon","display_distance":null,"id":"d19d8e9c-ed99-4573-bcde-2444f8553d25","id_icims":"3170473","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3170473/software-development-engineer-open-data-analytics-engines","job_schedule_type":"full-time","location":"US, VA, Arlington","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS17\"],\"normalizedCityName\":\"Arlington\"}"],"normalized_location":"Arlington, Virginia, USA","optional_search_labels":[],"posted_date":"January 30, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- * Experience in query processing, query engines, and/or query optimization.\u003cbr/\u003e- * Thorough understanding of parallel algorithms, concurrency, asynchronous architectures\u003cbr/\u003e- * Proficiency in high-performance, multi-threaded programming\u003cbr/\u003e- * Knowledge of and contribution to Hadoop ecosystem\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Arlington - 143,700.00 - 194,400.00 USD annually","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"VA","title":"Software Development Engineer, Open Data Analytics - Engines","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3170473/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- An Associate’s Degree or related work experience.\u003cbr/\u003e- C1+ or equivalent fluency in English and Spanish.\u003cbr/\u003e- Strong business writing skills with ability to create reports, proposals, and professional correspondence.\u003cbr/\u003e- Advanced reading comprehension with ability to analyze complex business documents.\u003cbr/\u003e- Developed analytical thinking and structured problem-solving capabilities.\u003cbr/\u003e- Strong ability to interpret and implement detailed instructions across various projects.\u003cbr/\u003e- Proficient research skills with experience gathering and synthesizing information from multiple sources.\u003cbr/\u003e- Proven attention to detail in managing complex tasks and documents.","business_category":"amazon-artificial-general-intelligence","city":"Heredia","company_name":"Amazon Support Services Costa Rica SRL","country_code":"CRI","description":"\u003cbr/\u003eAI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment of large language models (LLMs) across all of our businesses. Come build the future of human-technology interaction with us.\u003cbr/\u003eWe are looking for those candidates who just don’t think out of the box, but make the box they are in ‘Bigger’. The future is now, do you want to be a part of it? Then read on!\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eMaintain and follow strict confidentiality as customer privacy is our most important tenet\u003cbr/\u003e• Work with a range of different types of data including, but not limited to: text, speech, audio, image, and video\u003cbr/\u003e• Deliver high-quality labelled data, using guidelines provided to meet our KPIs and using in-house tools and software, as part of Amazon's commitment to developing and deploying AI responsibly.\u003cbr/\u003e• Demonstrate proficiency in generating high quality human insight data across a range of modalities, inclusive of text, image video and audio.\u003cbr/\u003e• Capable of making sound judgments and logical decisions when faced with ambiguous or incomplete information while performing tasks.\u003cbr/\u003e• Eye for detail and ability to pivot from one category of requirement to another instantaneously.\u003cbr/\u003e• Demonstrate support on daily operational deliverables for multiple task types assigned to you and the team\u003cbr/\u003e• Analyze root causes, identify error patterns, and propose solutions to enhance the quality of labeling tasks and their outputs.\u003cbr/\u003e• Responsible for identifying day-to-day process and operational issues in Standard Operating Procedure, tools and suggest changes to unblock operations\u003cbr/\u003e• Demonstrate ownership in floor support to clarify internal queries during execution on need basis\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are looking for a ML Data Associate (MLDA) to undertake the task of foundational labeling functions, such as dialogue evaluation on speech, text, audio, video data.\u003cbr/\u003eYour ability to concentrate, multi-task and your high attention to detail helps you deliver high-quality work as well as maintaining strict confidentiality and follow all applicable Amazon policies for securing confidential information. You will be a part of a diverse team with the shared vision of improving customers’ lives with practical, useful generative AI innovations. An inner drive, individuality, and a creative mind are extremely beneficial.","department_cost_center":null,"description_short":"AI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment","display_distance":null,"id":"f837f08d-38e5-473e-99de-c879118f155a","id_icims":"3139088","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Machine Learning Data Operatio","job_function_id":null,"job_path":"/en/jobs/3139088/ml-data-associate-ii-s-agi-data-services-operations","job_schedule_type":"full-time","location":"CR, H, Heredia","locations":["{\"normalizedStateName\":\"Heredia\",\"normalizedCountryCode\":\"CRI\",\"city\":\"Heredia\",\"countryIso3a\":\"CRI\",\"countryIso2a\":\"CR\",\"locationNonStemming\":\"Costa Rica, H, Heredia\",\"coordinates\":\"9.99969,-84.11717\",\"normalizedCountyName\":\"Heredia\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Costa Rica\",\"normalizedLocation\":\"Heredia, Heredia, CRI\",\"location\":\"CR, H, Heredia\",\"region\":\"H\",\"buildingCodeList\":[\"SJO16\"],\"normalizedCityName\":\"Heredia\"}"],"normalized_location":"Heredia, Heredia, CRI","optional_search_labels":[],"posted_date":"December  8, 2025","preferred_qualifications":"- Bachelor’s degree in a relevant field\u003cbr/\u003e- 2+ years of professional work experience with demonstrated task execution ability\u003cbr/\u003e- Proven capacity to leverage open-source resources effectively for comprehensive research purposes\u003cbr/\u003e- Ability to adapt well to fast-paced environments with changing circumstances, direction, and strategy\u003cbr/\u003e- 2-3 years project coordination or management experience (for support functions teams)\u003cbr/\u003e- Experience managing stakeholder relationships across departments\u003cbr/\u003e- Advanced proficiency in Microsoft Office Suite and common business applications Our inclusive culture empowers Amazonians to deliver the best results for our customers\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":"H","title":"ML Data Associate II - (S),  AGI Data Services - Operations","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3139088/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of engineering team management experience\u003cbr/\u003e- 7+ years of working directly within engineering teams experience\u003cbr/\u003e- 3+ years of designing or architecting (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 8+ years of leading the definition and development of multi tier web services experience\u003cbr/\u003e- Knowledge of engineering practices and patterns for the full software/hardware/networks development life cycle, including coding standards, code reviews, source control management, build processes, testing, certification, and livesite operations\u003cbr/\u003e- Experience partnering with product or program management teams","business_category":"aws","city":"Seattle","company_name":"Amazon Development Center U.S., Inc.","country_code":"USA","description":"The Amazon Web Services (AWS) Identity team builds, operates, and innovates the identity, authentication, and authorization stack for the AWS cloud. Our mission is to push the technical boundaries to enable AWS customers to run their business workloads confidently and securely. As part of this mission, we leverage customer obsession and technologies to help customers set appropriate access controls across all their AWS environments.\u003cbr/\u003e\u003cbr/\u003eAWS Identity and Access Management (IAM) enables customers to secure their workloads in the cloud by providing authentication and authorization mechanisms. With the growth of AWS, the workloads and access patterns keep evolving, demanding the next order of magnitude scalability. We are looking for strong software engineers to build the next generation functionality in this area. Individuals interested in this position should have experience building high-performing, reliable systems in a complex, multi-tenancy, and distributed environment in a highly contingent environment.\u003cbr/\u003e\u003cbr/\u003eWe are seeking an experienced Software Development Manager with a strong technical background and proven delivery track record to lead the AuthRuntimeService (ARS) Storage Team, a critical component of AWS Identity and Access Management (IAM) data plane infrastructure. This role will be responsible for owning the persistence layer for IAM data plane, including the current architecture and the new architecture we are building to scale the data plane services for the next decade. This is a once-in-a-decade opportunity to build something that will positively impact every single AWS customer by enabling AWS to scale authentication and authorization services to meet growing customer demands.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- As a Software Development Manager on the storage team, you will be responsible for leading a strong team of software engineers to build a high performance storage service / engine that is able to support the scale of authentication and authorization services at AWS. \u003cbr/\u003e- You will be responsible for mentoring and coaching a high performing team of engineers with expertise in both low-level and distributed systems. You will be responsible for the full development life cycle and and operation of services. \u003cbr/\u003e- Lead the design and implementation of IAM data plane architecture \u003cbr/\u003e- Drive technical decisions for distributed data storage systems handling massive scale\u003cbr/\u003e- Architect solutions for data consistency, availability, and performance across multiple AWS regions\u003cbr/\u003e- Ensure seamless migration from current architecture to new architecture\u003cbr/\u003e - You will partner with the product team and other engineering teams to help build the roadmap and ensure the right thing is being built and delivered to customers.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe IAM Data Plane Storage team owns the data storage layer of auth runtime services, supporting correct authentication and authorization for all AWS services. We build and maintain high-performance, durable, correct, and secure storage solutions while supporting massive AWS-level scale.","department_cost_center":null,"description_short":"The Amazon Web Services (AWS) Identity team builds, operates, and innovates the identity, authentication, and authorization stack for the AWS cloud. Our mission is to push the technical boundaries to enable","display_distance":null,"id":"efdfd009-b94d-452f-b24b-45a0837fd65d","id_icims":"3159537","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3159537/software-dev-manager-aws-iam-data-plane","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA33\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"January 14, 2026","preferred_qualifications":"- Experience in communicating with users, other technical teams, and senior leadership to collect requirements, describe software product features, technical designs, and product strategy\u003cbr/\u003e- Experience in recruiting, hiring, mentoring/coaching and managing teams of Software Engineers to improve their skills, and make them more effective, product software engineers\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 184,900.00 - 250,200.00 USD annually","primary_search_label":"aws.team-aws-sdm","source_system":"JobCreator","state":"WA","title":"Software Dev Manager, AWS IAM Data Plane","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3159537/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-aws-sdm","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 7+ years of technology sales selling enterprise software, networking, infrastructure, managed hosting services, or cloud computing services experience\u003cbr/\u003e- Bachelor's degree or equivalent","business_category":"aws","city":"San Diego","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Amazon Web Services (“AWS”) is the world’s most comprehensive and broadly adopted cloud platform. AWS offers over 200 fully featured services to millions of active customers around the world—including the fastest-growing startups, largest enterprises, and leading government agencies—to power their infrastructure.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eDrive digital transformation through meaningful engagement with C-level executives, IT leaders, architects, developers, and various lines of businesses within your customers. In this role, you will represent the entire portfolio of AWS products and services across the strategic accounts you manage within the Enterprise customer market segment. With AWS, our customers benefit from the fastest pace of innovation, the broadest and deepest functionality, the most secure computing environment, and the most proven operational expertise.\u003cbr/\u003e- Drive revenue and increase market share in a defined set of accounts.\u003cbr/\u003e- Meet or exceed quarterly revenue targets.\u003cbr/\u003e- Develop and execute a plan to grow the AWS footprint within your set of accounts.\u003cbr/\u003e- Manage numerous accounts concurrently \u0026 strategically.\u003cbr/\u003e- Create \u0026 articulate compelling value propositions around AWS services.\u003cbr/\u003e- Accelerate customer adoption through well-developed sales engagements and successful go-to-market strategy to achieve customer outcomes.\u003cbr/\u003e- Maintain a robust sales pipeline.\u003cbr/\u003e- Work with partners to extend reach \u0026 drive adoption.\u003cbr/\u003e- Ensure customer satisfaction.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eBe a critical part of a team focused on increasing adoption of Amazon Web Services by developing a set of named customers. As a Enterprise Greenfield Account Manager at AWS, you will have the exciting opportunity to directly impact the growth and shape of emerging technologies. Your responsibilities will include driving revenue, adoption, and market saturation in our largest customers. With an emphasis on growing Accounts with minimal AWS adoption, who have large spend potential.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eEnterprise Greenfield is a team of Field Sellers, made up of 150+ Account Managers and 350+ cross functional team members in the United States, who work toward the collective goal of solving challenges and innovating new ways to enable our customers to achieve their desired outcomes for their customers. We are at the forefront of emerging technology that may seem unimaginable now, but will be tomorrow's standard.","department_cost_center":null,"description_short":"Amazon Web Services (“AWS”) is the world’s most comprehensive and broadly adopted cloud platform. AWS offers over 200 fully featured services to millions of active customers around the world—including","display_distance":null,"id":"96d23744-28ff-4151-b2fc-37c6e1725273","id_icims":"3155694","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Tech Sales","job_function_id":null,"job_path":"/en/jobs/3155694/aws-sr-account-manager-enterprise-greenfield-scale","job_schedule_type":"full-time","location":"US, CA, San Diego","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS11\"],\"normalizedCityName\":\"Austin\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA81\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Santa Monica\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Santa Monica\",\"coordinates\":\"34.01158,-118.49227\",\"normalizedCountyName\":\"Los Angeles\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Santa Monica, California, USA\",\"location\":\"US, CA, Santa Monica\",\"region\":\"CA\",\"buildingCodeList\":[\"LAX16\"],\"normalizedCityName\":\"Santa Monica\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Irvine\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Irvine\",\"coordinates\":\"33.6873,-117.82591\",\"normalizedCountyName\":\"Orange\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Irvine, California, USA\",\"location\":\"US, CA, Irvine\",\"region\":\"CA\",\"buildingCodeList\":[\"SNA20\"],\"normalizedCityName\":\"Irvine\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Francisco\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Francisco\",\"coordinates\":\"37.77712,-122.41966\",\"normalizedCountyName\":\"San Francisco\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Francisco, California, USA\",\"location\":\"US, CA, San Francisco\",\"region\":\"CA\",\"buildingCodeList\":[\"SFO28\"],\"normalizedCityName\":\"San Francisco\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Houston\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Houston\",\"coordinates\":\"29.76078,-95.36952\",\"normalizedCountyName\":\"Harris\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Houston, Texas, USA\",\"location\":\"US, TX, Houston\",\"region\":\"TX\",\"buildingCodeList\":[\"HOU14\"],\"normalizedCityName\":\"Houston\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Diego\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Diego\",\"coordinates\":\"32.71568,-117.16171\",\"normalizedCountyName\":\"San Diego\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Diego, California, USA\",\"location\":\"US, CA, San Diego\",\"region\":\"CA\",\"buildingCodeList\":[\"SAN13\"],\"normalizedCityName\":\"San Diego\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Dallas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Dallas\",\"coordinates\":\"32.77822,-96.79512\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Dallas, Texas, USA\",\"location\":\"US, TX, Dallas\",\"region\":\"TX\",\"buildingCodeList\":[\"DFW15\"],\"normalizedCityName\":\"Dallas\"}"],"normalized_location":"San Diego, California, USA","optional_search_labels":[],"posted_date":"January  8, 2026","preferred_qualifications":"- Experience with AWS technologies\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments, restricted stock units (RSUs), and sales incentives. Final compensation will be determined based on factors including experience, qualifications, and location. \u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eAmazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Irvine - 142,800.00 - 193,200.00 USD annually\u003cbr/\u003eUSA, CA, San Diego - 142,800.00 - 193,200.00 USD annually\u003cbr/\u003eUSA, CA, San Francisco - 157,100.00 - 212,600.00 USD annually\u003cbr/\u003eUSA, CA, Santa Monica - 142,800.00 - 193,200.00 USD annually\u003cbr/\u003eUSA, TX, Austin - 142,800.00 - 193,200.00 USD annually\u003cbr/\u003eUSA, TX, Dallas - 142,800.00 - 193,200.00 USD annually\u003cbr/\u003eUSA, TX, Houston - 142,800.00 - 193,200.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 142,800.00 - 193,200.00 USD annually","primary_search_label":"aws.team-sales-primary","source_system":"JobCreator","state":"CA","title":"AWS Sr. Account Manager, Enterprise Greenfield Scale","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3155694/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sales-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in English-language communication skills, both written and verbal\u003cbr/\u003e- Must have Bachelor's Degree or Master’s degree\u003cbr/\u003e- 0-10+ years’ experience in contact center, customer service, human resources or equivalent experience.\u003cbr/\u003e- Schedule flexibility (support a 24x7 operations).\u003cbr/\u003e- Internet connection before joining date with a speed range of 50-100 Mbps","business_category":"global-corporate","city":"Hyderabad","company_name":"Amazon Dev Center India - Hyderabad - A85","country_code":"IND","description":"At Amazon, we believe that every day is still Day One. We are striving to be Earth's Best Employer and to get there, we need exceptionally talented, bright, and driven people. Amazon’s MyHR Live Support team is seeking customer-focused professionals who thrive in a dynamic contact center environment.\u003cbr/\u003e\u003cbr/\u003eDo you excel at real-time communication, problem-solving, and delivering exceptional customer service? The MyHR Live Support Team operates a state-of-the-art contact center, caring for 1.5 million Amazonians worldwide by assisting them with their HR needs. Our organization delivers best-in-class HR support to Amazon employees, applicants, and candidates globally. We specialize in topics related to time-off, employee relocations, offboarding processes, employment verification, benefits, bereavement support, and comprehensive pay and compensation services.\u003cbr/\u003eAs an HR Contact Center Professional, you will be at the forefront of our customer service operations, primarily handling live phone calls and/or chats. You are someone who is skilled at building positive relationships with employees through empathetic and effective communication. You are approachable and able to handle sensitive situations with tact and diplomacy in real-time. You pride yourself on maintaining high ethical standards and confidentiality when dealing with sensitive employee information, conflicts of interest, and compliance issues.\u003cbr/\u003eYou thrive in a fast-paced contact center environment, using your critical thinking and fact-finding skills to resolve issues efficiently. You excel at managing multiple tasks, priorities, and deadlines while maintaining a high level of customer satisfaction. You are adaptable and open to change, quickly adjusting to new policies, technologies, and industry trends.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAmazon’s MyHR Live Support team is comprised of HR Contact Center Professionals supporting Amazon employees globally within multiple languages, with services 24 hours a day, 7 days a week in some countries. As a MyHR Live Support Advisor, your primary responsibilities will be:\u003cbr/\u003e• Handle a high volume of live contacts, primarily through phone calls and potentially chats, taking ownership in ensuring each interaction is resolved with a high degree of problem-solving and customer obsession. \u003cbr/\u003e• Resolve inquiries holistically by referring to available documentation such as frequently asked questions, knowledge base articles, and standard operating procedures – escalate when these cannot be resolved. \u003cbr/\u003e• Build customer trust through empathetic, personalized conversations by assessing and adjusting resolution plans to each employee's changing needs during live interactions.\u003cbr/\u003e• Respond promptly to employees' urgent issues, ensuring the right communication and documentation occurs, even when information is limited. \u003cbr/\u003e• Use high judgment, critical thinking, and rationale to balance process adherence with employees' needs, analyzing and deciding on resolutions for their requests in real-time. \u003cbr/\u003e• Consistently consult and collaborate with partner teams on process changes to resolve cross-functional issues and improve policies. \u003cbr/\u003e• Maintain high performance metrics in areas such as contact handling time, first-contact resolution, and customer satisfaction scores.\u003cbr/\u003e• Adhere to set schedules, including timed breaks and lunches, to ensure consistent coverage and support for our 24/7 contact center operations.\u003cbr/\u003e• Demonstrate flexibility in working various shifts, including evenings, weekends, and overnight shifts, to support our global workforce across different time zones.\u003cbr/\u003eThis role requires excellent multitasking abilities, strong verbal and written communication skills, and the ability to thrive in a fast-paced contact center environment. If you're passionate about delivering exceptional customer service through live interactions and are ready to make a difference in people's lives, we want to hear from you!","department_cost_center":null,"description_short":"At Amazon, we believe that every day is still Day One. We are striving to be Earth's Best Employer and to get there, we need exceptionally talented, bright, and driven people. Amazon’s MyHR Live Support","display_distance":null,"id":"a660ea5b-bb21-40a4-aa23-a574ff11bd5a","id_icims":"3147128","is_intern":null,"is_manager":null,"job_category":"Human Resources","job_family":"Human Resources","job_function_id":null,"job_path":"/en/jobs/3147128/myhr-live-support-advisor-s-mhls-advisor-s","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD11\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":[],"posted_date":"December 22, 2025","preferred_qualifications":"- 2+ years experience in contact center, customer service, human resources or equivalent experience.\u003cbr/\u003e- Basic US legislation Leave of Absence and Accommodations knowledge.\u003cbr/\u003e- Knowledge of US federal and state leave and disability laws.\u003cbr/\u003e- Experience in providing consultation and guidance on human resources, benefits, or complex employee matters.\u003cbr/\u003e- Experience dealing with customers and exceptional use of empathy skills.\u003cbr/\u003e- Proven ability to adjust to constantly changing workloads and manage customer contacts in a fast pace environment.\u003cbr/\u003e- Ability to manage confidential and sensitive employee information and adhere to strict data privacy standards.\u003cbr/\u003e- Detail oriented with ability to analyze, problem solve, organize and manage multiple priorities.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"global-corporate.team-hr-for-hr","source_system":"JobCreator","state":"TS","title":"MyHR Live Support Advisor [S], MHLS Advisor [S]","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3147128/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-hr-for-hr","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in a relevant field or equivalent work experience\u003cbr/\u003e- Experience communicating to senior management and customers verbally and in writing\u003cbr/\u003e- 3+ years of leading large-scale, technical or engineering programs with a proven record of thought leadership, business case development, realizing customer benefits, and successful program completion experience\u003cbr/\u003e- Experience in a direct or matrixed role leading technical and non-technical transformation project teams with a proven ability to work across broad functional teams\u003cbr/\u003e- Experience working with data and leveraging analytics to make decisions\u003cbr/\u003e- 3+ years of managing a technical team of solution architects, sales engineers or similar technical roles experience\u003cbr/\u003e- Experience navigating customer organizational structures, developing technology programs, defining milestones, success criteria, resource allocation and on-time delivery.","business_category":"retail","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"We are seeking an Onboarding Manager to lead the Technical Customer Solutions team (CSM-T), to join the MCCF team. As a Manager of CSM-Ts, you will have the exciting opportunity to help drive the growth, connect with customers, and shape the future of Buy With Prime (BwP) , MultiChannel Fulfillment (MCF) and other Amazon Supply Chain Services. This role will own building, managing, and scaling the team. The ideal candidate will possess a delivery background, with a passion for the customer, and experience leading technical and operational delivery teams. You will be adept at delivering desired outcomes through others, while staying abreast of the detail. You should also be a self-starter who is prepared to own, define, develop, and execute a strategy for onboarding programs within the defined region.\u003cbr/\u003e\u003cbr/\u003eIf you are entrepreneurial and want to build and own transformative technology-driven products, join us in making history!\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e  - Utilize leadership skills, technical depth and business experience to lead the onboarding team and demonstrate progress and value to C-suite and other key stakeholders\u003cbr/\u003e\u003cbr/\u003e   - Think strategically and execute on organization and team goals/initiatives and deliver results.\u003cbr/\u003e\u003cbr/\u003e   - Manage team to exceed goals, manage onboarding pipelines, and report progress across different business stakeholders.\u003cbr/\u003e\u003cbr/\u003e   - Develop customer solutions managers to think big, and deliver value to the customers and Amazon through innovation, continuous improvement and deliver value beyond onboarding programs. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- As a leader, you and your team will earn trust across the customer’s organization, identify strategic opportunities, establish roadmaps and actionable program plans, capture success criteria, and implement strong governance of your team's projects.\u003cbr/\u003e- You own and drive execution excellence for the end-to-end customer journey (e.g., technical, operational, organizational, and educational) that span tech teams, executives, and business units.\u003cbr/\u003e- You are a critical partner to our customers, shepherding them through their stages of MCF and BwP integration and adoption.\u003cbr/\u003e- You translate strategic initiatives in the account plan into executable actions, working backwards from our customers key milestones.\u003cbr/\u003e- You manage cadence by leading the reporting and tracking functions along the way.\u003cbr/\u003e- You own the execution of education plans, roadmap to business outcome alignments, Executive Briefing Sessions, and launch plans.\u003cbr/\u003e- You have a strong technical background, be detail driven, have excellent problem-solving abilities, and be exemplary communicators both at the executive and project team level. You will be a leader, have the ability to gain stakeholder buy-in, negotiate and lead various teams.\u003cbr/\u003e- You hire, on-board, train, and develop new Customer Solutions Managers from internal and external sources\u003cbr/\u003e- You have excellent customer engagement skills through all levels of an organization and develop long term relationships based on excellence\u003cbr/\u003e- You develop and utilize strong writing skills to partner with stakeholders and develop customer and business plans, and develop the team's writing skills","department_cost_center":null,"description_short":"We are seeking an Onboarding Manager to lead the Technical Customer Solutions team (CSM-T), to join the MCCF team. As a Manager of CSM-Ts, you will have the exciting opportunity to help drive the growth,","display_distance":null,"id":"935519be-bd02-4e96-9ba9-51b5499b408b","id_icims":"3130216","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"Tech, Customer Solutions Mgr","job_function_id":null,"job_path":"/en/jobs/3130216/merchant-onboarding-manager-buy-with-prime-bwp-multichannel-fulfillment-mcf","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA71\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"November 21, 2025","preferred_qualifications":"- MBA\u003cbr/\u003e- Experience mentoring, coaching, and influencing colleagues, collaborators, and stakeholders\u003cbr/\u003e- Experience prioritizing and handling multiple assignments at any given time while maintaining commitment to deadlines, or experience in a fast-paced, high-tech company\u003cbr/\u003e- Experience working with diverse or differing data sets including creating and compiling data into a final distribution for management consumption\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $152,100/year in our lowest geographic market up to $262,800/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"retail.team-buy-with-prime","source_system":"JobCreator","state":"WA","title":"Merchant Onboarding Manager, Buy with Prime (BwP) \u0026 MultiChannel Fulfillment (MCF)","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3130216/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-buy-with-prime","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- CPR/First Aid Certification, or willingness to obtain it within 3 weeks of start\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- 7+ years of increasing responsibilities in safety and/or environmental programs in manufacturing, production, service operations, or relevant experience applicable to the role\u003cbr/\u003e- 7+ years of increasing responsibilities in people and performance management\u003cbr/\u003e- CPR/First Aid Certification\u003cbr/\u003e- Experience implementing lean principles and process improvement in an operational environment.\u003cbr/\u003e- Ability to travel up to 50%\u003cbr/\u003e- Office within one of the designated region's sites. Must be willing to relocate if not currently within region\u003cbr/\u003e- Willingness to work a variety of shifts, including nights and weekends, as required to support direct reports and site needs.","business_category":"fulfillment-and-operations","city":"Carlstadt","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Application deadline: Feb 6, 2026\u003cbr/\u003e\u003cbr/\u003eAMZL Sr. Regional WHS Manager \u003cbr/\u003e \u003cbr/\u003e Global Specialty Fulfillment\u003cbr/\u003e  The Senior Regional Workplace Health \u0026 Safety (WHS) Manager is responsible for partnering with our regional AMZL (Amazon Logistics) delivery station (XLDS) operations team in AMZL to execute company WHS policies and ensure compliance to all applicable local and regional regulations. By leveraging lean principles and kaizens, this individual will lead continuous improvement initiatives to reduce conditional and ergonomic risk in our processes to ensure a safe and healthy working environment for our Associates.\u003cbr/\u003e  The Senior Regional WHS Manager must demonstrate the ability to build trust and confidence with the Operations Team and influence change through providing comprehensive risk assessments and safety data analysis.\u003cbr/\u003e  The Senior Regional WHS Manager must be an effective communicator and send clear, concise and consistent messages, both verbally and in writing. This individual must instruct and train Operations Leaders in company WHS policies and assist the regional teams in incorporating our WHS standards at their sites.\u003cbr/\u003e  The Senior Regional WHS Manager will be required to identify best practices and incorporate these best practices into our standards to continuously improve company WHS policies.\u003cbr/\u003e  The Senior Regional WHS Manager will be required to possess excellent WHS program and relevant safety, environmental and ergonomic knowledge and demonstrate this expertise when working with Operations.\u003cbr/\u003e  The Senior Regional WHS Manager will be responsible to lead a team of WHS Managers in their region. This individual must create and execute leadership development plans for their team of WHS Managers. They must communicate WHS team expectations and give frequent and appropriate feedback to their WHS teams and ensure they are executing to the core competencies of an Amazon WHS professional. This individual must also demonstrate the ability to judge and assess WHS talent and select appropriate bench strength to current and future business needs.\u003cbr/\u003e   \u003cbr/\u003eSenior Regional WHS Manager Responsibilities:\u003cbr/\u003e  • Possess a thorough understanding of local/regional regulations and company policy.\u003cbr/\u003e  • Provide guidance and oversight to ensure compliance to all applicable Amazon WHS Policies.\u003cbr/\u003e  • Measure the region’s and sites’ performance against published requirements in WHS policies. For all deficiencies, lead team in identifying plans for improvement throughout network.\u003cbr/\u003e  • Ensure WHS recordkeeping and data integrity and provide Operations with accurate reporting and metrics to support business WHS initiatives.\u003cbr/\u003e  • Deliver on-time and quality projects to Operations. \u003cbr/\u003e  • Analyze WHS metrics and review incident weekly and monthly incident trends to discover trends to justify the allocation of appropriate resources to areas where the safety risk is highest.\u003cbr/\u003e  • Analyze Global Safety Peer Review results and develop and implement solutions to eliminate exposure to these risks and prevent injury at other XLDS.\u003cbr/\u003e  • Audit recordkeeping practices and Global WHS Database entries to ensure compliance to global WHS standards and local regulations.\u003cbr/\u003e  • Audit the workplace organization and Associate behaviors to ensure that training, auditing and scoring methods are accurate and consistent.\u003cbr/\u003e  • Manage and mentor the Regional WHS Managers and Multi-Site WHS Managers on their team.\u003cbr/\u003e  • Spend time at delivery stations and seek input from WHS teams, Associates and leaders on WHS program improvement opportunities. Ensure open communication on status of progress and resolution against these suggestions.\u003cbr/\u003e  • Lead soft tissue injury reduction efforts by performing targeted Kaizens in partnership with the Operations teams based on the risks identified in each task (force, repetition, and awkward postures).\u003cbr/\u003e  • Ensure site leadership and Associates are trained and knowledgeable of their responsibilities under each policy. Audit the quality, delivery (including qualifications of the trainer), and effectiveness of all required WHS training.\u003cbr/\u003e  • Review for effectiveness the deployed WHS tools and revise to ensure continual improvement.\u003cbr/\u003e  • Partner with corporate and other regional field WHS personnel to leverage global WHS and environmental best practices into NA network standards.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements include:\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e    Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e\u003cbr/\u003e    Stand/walk for up to 12 hours during shifts\u003cbr/\u003e\u003cbr/\u003e    Work in an environment where the noise level varies\u003cbr/\u003e\u003cbr/\u003e    Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e\u003cbr/\u003e    Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e\u003cbr/\u003e    Maintain effective care delivery in emergencies and assist emergency response at the site\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eThose that do not have an adult First Aid, CPR, AED certification from the American Heart Association or American Red Cross must obtain within 3 weeks of start date.\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"AMZL Sr. Regional WHS Manager   Global Specialty Fulfillment  The Senior Regional Workplace Health \u0026 Safety (WHS) Manager is responsible for partnering with our regional AMZL (Amazon Logistics) delivery","display_distance":null,"id":"39d5fa33-b0d6-4a04-adaa-13cc4ff94bce","id_icims":"3145622","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3145622/sr-regional-ehs-manager-amzl","job_schedule_type":"full-time","location":"US, NJ, Carlstadt","locations":["{\"normalizedStateName\":\"New Jersey\",\"normalizedCountryCode\":\"USA\",\"city\":\"Carlstadt\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NJ, Carlstadt\",\"coordinates\":\"40.84144,-74.09439\",\"normalizedCountyName\":\"Bergen\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Carlstadt, New Jersey, USA\",\"location\":\"US, NJ, Carlstadt\",\"region\":\"NJ\",\"buildingCodeList\":[\"DJZ2\"],\"normalizedCityName\":\"Carlstadt\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DDE6\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"Illinois\",\"normalizedCountryCode\":\"USA\",\"city\":\"Chicago\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, IL, Chicago\",\"coordinates\":\"41.88425,-87.63245\",\"normalizedCountyName\":\"Cook\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Chicago, Illinois, USA\",\"location\":\"US, IL, Chicago\",\"region\":\"IL\",\"buildingCodeList\":[\"DHC7\"],\"normalizedCityName\":\"Chicago\"}"],"normalized_location":"Carlstadt, New Jersey, USA","optional_search_labels":[],"posted_date":"December 18, 2025","preferred_qualifications":"- Master’s degree preferred\u003cbr/\u003e- Certified Safety Professional preferred\u003cbr/\u003e- Experience in a fast-paced, dynamic organization\u003cbr/\u003e- Interest in long-term career development through assignments in multiple FCs across the nation\u003cbr/\u003e- Prior experience in a management development training program\u003cbr/\u003e- Track record of effectively managing a safety operation comprising both salaried and hourly staff\u003cbr/\u003e- Demonstrated experience in developing others into higher levels of responsibility in an organization\u003cbr/\u003e- Strong written and verbal communication skills, including comfort interfacing with Directors and VPs\u003cbr/\u003e- Strong analytical and problem-solving skills\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Denver - 140,800.00 - 246,400.00 USD annually\u003cbr/\u003eUSA, IL, Chicago - 140,800.00 - 246,400.00 USD annually\u003cbr/\u003eUSA, NJ, Carlstadt - 154,900.00 - 271,100.00 USD annually","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"NJ","title":"Sr. Regional EHS Manager , AMZL","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3145622/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of hardware design and validation of components, subsystems and systems experience\u003cbr/\u003e- Bachelor's degree in mechanical engineering, electrical engineering, material science, physics or equivalent","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is an initiative to launch a constellation of Low Earth Orbit satellites that will provide low latency, high-speed broadband connectivity to unserved and underserved communities around the world.\u003cbr/\u003e\u003cbr/\u003eCome work at Amazon!\u003cbr/\u003e\u003cbr/\u003eAs a Hardware Engineer, you will be a part of the team of experts working on the development of advanced Customer Terminal products. You will own or contribute to the following: \u003cbr/\u003e \u003cbr/\u003e - Design high-speed digital and/or RF circuits in collaboration with various teams\u003cbr/\u003e - Design and optimization of different blocks of electronics sub-systems\u003cbr/\u003e - Schematic capture and lead PCB layout design and reviews\u003cbr/\u003e - Design DC/DC power supplies and Point of Load\u003cbr/\u003e - Support flow-down requirement definitions and generate test plans/procedures\u003cbr/\u003e - Board bring-up and perform test campaigns of modules and subsystems \u003cbr/\u003e - Support design automated test systems, test fixtures and factory test\u003cbr/\u003e - Support the transition of the designs to mass production\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.","department_cost_center":null,"description_short":"Amazon Leo is an initiative to launch a constellation of Low Earth Orbit satellites that will provide low latency, high-speed broadband connectivity to unserved and underserved communities around the world.Come","display_distance":null,"id":"0ad6e452-6806-4ee5-b2ba-541ec196f2b1","id_icims":"3118101","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/3118101/hardware-development-engineer-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA111\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":[],"posted_date":"October 29, 2025","preferred_qualifications":"- Knowledge of engineering practices and patterns for the full software/hardware/networks development life cycle, including coding standards, code reviews, source control management, build processes, testing, certification, and livesite operations\u003cbr/\u003e- Experience with hardware/software integration and real-time systems\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $105,600/year in our lowest geographic market up to $185,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Hardware Development Engineer , Amazon Leo","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3118101/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team","business_category":"aws","city":"Seattle","company_name":"Amazon Development Center U.S., Inc.","country_code":"USA","description":"As part of the AWS Applied AI Solutions organization, we have a vision to provide business applications, leveraging Amazon’s unique experience and expertise, that are used by millions of companies worldwide to manage day-to-day operations. We will accomplish this by accelerating our customers’ businesses through delivery of intuitive and differentiated technology solutions that solve enduring business challenges. We blend vision with curiosity and Amazon’s real-world experience to build opinionated, turnkey solutions. Where customers prefer to buy over build, we become their trusted partner with solutions that are no-brainers to buy and easy to use. \u003cbr/\u003e\u003cbr/\u003eWe are looking for a Senior Software Engineer who will lead the technical vision and innovation in revolutionizing how Amazonians use AI. You will be part of the Amazon AI at Work (AIW) team building the next generation of AI agents that transform how business professionals operate and reshape the future of hybrid (AI + human) work.  \u003cbr/\u003e\u003cbr/\u003eAs a Senior Software Engineer, you are a recognized technical leader who drives the engineering strategy, mentors team members, and partners with cross-functional teams to deliver complex end-to-end AI solutions. Your work focuses on architecting and implementing robust systems in ambiguous problem areas where both the business problem and solution approach need to be defined. The problems you tackle require significant technical innovation at the product level. \u003cbr/\u003e\u003cbr/\u003eYou take ownership of the long-term technical vision, product roadmaps, and technologies, defining how they should evolve. You build consensus through thoughtful discussions with stakeholders, scientists, and engineering peers across multiple teams. You bring deep expertise to provide context for current and future technology choices, and make strategic recommendations on system architecture and implementation approaches to achieve transformative business outcomes and user experiences. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eABOUT AWS:\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. ","department_cost_center":null,"description_short":"As part of the AWS Applied AI Solutions organization, we have a vision to provide business applications, leveraging Amazon’s unique experience and expertise, that are used by millions of companies worldwide","display_distance":null,"id":"39b99577-6b8f-4916-9ffd-fad94664a5c8","id_icims":"3132625","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3132625/senior-software-engineer-amazon-ai-at-work","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA68\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["amazon.artificial-intelligence"],"posted_date":"November 25, 2025","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- Prior experience building AI services including Agentic AI and related.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 168,100.00 - 227,400.00 USD annually","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"WA","title":"Senior Software Engineer, Amazon AI at Work","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3132625/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}