{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Bachelor's degree in mechanical engineering or equivalent\u003cbr/\u003e- 3+ cumulative years of experience with industrial, municipal, or commercial engineering including but not limited to the following sectors: data centers, power generation, oil/gas facilities. (Experienced Engineer)\u003cbr/\u003e- Must have a valid US driver's license and reliable personal transportation by start date.","business_category":"aws","city":"Louisa","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eAs an Amazon Critical Infrastructure Engineer, you will provide full life-cycle support to AWS Data Centers from design inception through site improvement and maintenance. You will be the ‘go to’ engineering resource for your region when technical advice is needed, and will use your subject matter expertise and engage with diverse teams to:\u003cbr/\u003e\u003cbr/\u003e* Troubleshoot, conduct Root Cause Analysis (RCA) and create Corrective Action (CA) documentation for site/equipment failures.\u003cbr/\u003e\u003cbr/\u003e* Directly support operational issues with ad-hoc training, complex operating procedure reviews, including critical equipment, and event support.\u003cbr/\u003e\u003cbr/\u003e* Own the conceptual design for existing data center upgrades and design-solutions, which add capacity, improve availability, increase efficiency and sustainability.\u003cbr/\u003e\u003cbr/\u003e* Interface with internal data center operations team, data center design engineering team, server hardware team, environmental health and safety team to promote standards that maintain consistency and reliability in services delivered.\u003cbr/\u003e\u003cbr/\u003e* Develop innovative solutions for AWS’s data centers.\u003cbr/\u003e\u003cbr/\u003e* Work on concurrent projects, sometimes in multiple geographical regions.\u003cbr/\u003e\u003cbr/\u003e* Initiate and lead engineering audits including on-site visits within Amazon’s data centers. Produce reports outlining risks with recommended mitigations and remediations.\u003cbr/\u003e\u003cbr/\u003e* Act as resident engineer during new construction projects. Support construction, commissioning, and turnover.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAmazon's vision is to be the world's most customer-centric company, and this role is key to that vision. As an Amazon Critical Infrastructure Engineer, you will be leading projects to fit out our data centers to meet ever-evolving customer needs as we continue expanding our fleet to hyper-scale. As an ideal candidate you:\u003cbr/\u003e\u003cbr/\u003e* Possess Strong Engineering Judgement and are able to provide recommendations despite uncertainty/ambiguity.\u003cbr/\u003e\u003cbr/\u003e* Possess excellent communication and writing skills, attention to detail, maintain high quality standards Organized and have the ability to set priorities and meet deadlines and budget\u003cbr/\u003e\u003cbr/\u003e* Possess leadership and problem-solving skills\u003cbr/\u003e\u003cbr/\u003e* Are detail and data oriented\u003cbr/\u003e\u003cbr/\u003e* Have experience solving problems with engineered solutions.\u003cbr/\u003e\u003cbr/\u003e* Have experience managing engineering projects and consultants.\u003cbr/\u003e\u003cbr/\u003e* Build trust and relationships with different stakeholders (e.g., Operations, Controls, Construction, Design, Commissioning, Product Managers, Technical Program Managers, ).\u003cbr/\u003e\u003cbr/\u003e* Are adaptable and inclined to get into the field to see things up close.\u003cbr/\u003e\u003cbr/\u003e* Excited about a mix of office and field work.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eEach day you will interact with different teams responsible for all aspects of the data centers. You will prioritize your activities to support data center capacity availability and safety focusing on the actions that are most impactful. You will have the opportunity to work on projects locally and globally.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eIf you meet these qualifications, exude passion, and enjoy the challenge of innovative projects at hyper-scale, this job is for you!\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"d25877d7-9d31-4079-b2df-28e18902f63a","id_icims":"3180310","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Infrastructure Eng","job_function_id":null,"job_path":"/en/jobs/3180310/critical-infrastructure-mechanical-engineer-field-engineering","job_schedule_type":"full-time","location":"US, VA, Louisa","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Louisa\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Louisa\",\"coordinates\":\"38.02576,-78.00401\",\"normalizedCountyName\":\"Louisa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Louisa, Virginia, USA\",\"location\":\"US, VA, Louisa\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD550\"],\"normalizedCityName\":\"Louisa\"}"],"normalized_location":"Louisa, Virginia, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"February 12, 2026","preferred_qualifications":"- Experience with the design, construction, operation, or maintenance of mission critical facilities, especially data centers\u003cbr/\u003e- Experience as a resident engineer or hands-on design consultant\u003cbr/\u003e- Knowledge of the electrical and mechanical systems involved in critical data center operations including systems such as feeders, transformers, generators, switchgear, UPS systems, ATS units, PDU units, chillers, pumps, air handling units, and CRAC units\u003cbr/\u003e- Experience reading and interpreting, construction drawings, specifications, submittal documents, and applicable building codes.\u003cbr/\u003e- Ability to carry design concepts through exploration, development, and into deployment/mass production\u003cbr/\u003e- Possess data analytics skills, data querying skills/language, scripting, and comfort with working in vast amounts of data in new and evolving environments\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Louisa - 116,800.00 - 160,000.00 USD annually","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"VA","title":"Critical Infrastructure Mechanical Engineer, Field Engineering","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3180310/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent\u003cbr/\u003e- Experience in compliance program management, legal, governance, audit, risk/loss prevention, or equivalent\u003cbr/\u003e- Experience handling confidential information","business_category":"aws","city":"Zaragoza","company_name":"Amazon Data Services Spain, S.L.","country_code":"ESP","description":"Job summary\u003cbr/\u003eJoin the world class safety culture at Amazon Web Services (AWS) and be part of supporting the largest cloud computing infrastructure team as a Regional Safety Engineer. As the Regional Safety Engineer you will own the Health and Safety function of your respective area. You will be responsible for improving the health and safety of our data centers, advancing safety culture, and protecting our employees. Each day you will work with our data center engineers, the people who make the cloud go. They are working with electrical switching equipment, large scale air handling mechanical systems, and critical IT gear.\u003cbr/\u003e\u003cbr/\u003eYou will work closely with experts in security, construction, operations, logistics, compliance, corporate counsel, and human resources to further the global health safety program. You will partner with employees as well as contractors to achieve health and safety goals and improve our already strong safety culture. As AWS increases data capacity you will partner with construction managers to ensure risks are identified and mitigated prior to live operations. You will work in a fast-paced environment where our operations are rapidly changing, advocating safe changes in the face of new infrastructure, new tools, and new products/processes.\u003cbr/\u003e\u003cbr/\u003eThis role is for an experienced Safety Specialist or Safety Engineer. The role's prime responsibility will be to support the safety operations for Data Centers.\u003cbr/\u003eYou will be part of a regional and global team that works with internal and external partners to maintain and enhance the safety of operations. Close collaboration with onsite physical security, vendors, compliance officers, risk management, and fire/life safety systems is required. Additionally, you will work with employees and contractors to achieve specific safety objectives.\u003cbr/\u003e\u003cbr/\u003eYou must be an effective communicator, sending clear, concise and consistent messages verbally, in written form, and/or public speaking forums. You will advise, instruct and train company personnel on safety policies and procedures, as well as assist the teams in incorporating and improving our safety standards at their sites.\u003cbr/\u003e\u003cbr/\u003eYou will report to the Regional Safety Manager – EURI and be responsible for continuing to enhance the safety of operations and construction. Some domestic and international travel is required.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e   - Support implementation of health and safety standards, policies and practices including but not limited to; safety management systems, training, risk assessments, assist with industrial hygiene assessments, and applicable safety regulations.\u003cbr/\u003e    - Conduct health and safety audits of all Data Centers to ensure compliance with health and safety requirements as well as life safety requirements.\u003cbr/\u003e    - Ensure compliance and implementation of global health and safety programs that exceed regulatory requirements.\u003cbr/\u003e    - Develop health and safety plans for on-site emergencies, business continuity, and other unique events.\u003cbr/\u003e    - Maintain safety record keeping and data integrity.\u003cbr/\u003e    - Perform data trend reviews to present to cluster leadership to support business and safety initiatives.\u003cbr/\u003e    - Consult and partner with the AWS H\u0026S Program team and legal teams for interpretations and guidance.\u003cbr/\u003e    - Identify risks and partner with Operations to mitigate them\u003cbr/\u003e    - Daily interactions with our customers delivering health and safety guidance.","department_cost_center":null,"description_short":"Job summaryJoin the world class safety culture at Amazon Web Services (AWS) and be part of supporting the largest cloud computing infrastructure team as a Regional Safety Engineer. As the Regional Safety","display_distance":null,"id":"7b4370dd-1d7c-473d-9ecd-f710d8264127","id_icims":"3111894","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Risk Family","job_function_id":null,"job_path":"/en/jobs/3111894/health-and-safety-mgr-zaz-data-center-health-and-safety","job_schedule_type":"full-time","location":"ES, Zaragoza","locations":["{\"normalizedStateName\":\"Aragon\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Zaragoza\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, Zaragoza\",\"coordinates\":\"41.65184,-0.8811\",\"normalizedCountyName\":\"Zaragoza\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Zaragoza, Aragon, ESP\",\"location\":\"ES, Zaragoza\",\"region\":\"\",\"buildingCodeList\":[\"ZAZ60\"],\"normalizedCityName\":\"Zaragoza\"}"],"normalized_location":"Zaragoza, Aragon, ESP","optional_search_labels":[],"posted_date":"October 20, 2025","preferred_qualifications":"- Master's degree in Health and Safety or a related field\u003cbr/\u003e- Speak, write, and read fluently in Spanish\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-security-engineer-primary","source_system":"JobCreator","state":null,"title":"Health and Safety Mgr – ZAZ, Data Center Health and Safety","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3111894/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-security-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in mechanical engineering or equivalent\u003cbr/\u003e- 3+ cumulative years of experience with industrial, municipal, or commercial engineering including but not limited to the following sectors: data centers, power generation, oil/gas facilities. (Experienced Engineer)\u003cbr/\u003e- Must have a valid US driver's license and reliable personal transportation by start date.","business_category":"aws","city":"Covington","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAs an Amazon Critical Infrastructure Engineer, you will provide full life-cycle support to AWS Data Centers from design inception through site improvement and maintenance. You will be the ‘go to’ engineering resource for your region when technical advice is needed, and will use your subject matter expertise and engage with diverse teams to:\u003cbr/\u003e\u003cbr/\u003e* Troubleshoot, conduct Root Cause Analysis (RCA) and create Corrective Action (CA) documentation for site/equipment failures.\u003cbr/\u003e\u003cbr/\u003e* Directly support operational issues with ad-hoc training, complex operating procedure reviews, including critical equipment, and event support.\u003cbr/\u003e\u003cbr/\u003e* Own the conceptual design for existing data center upgrades and design-solutions, which add capacity, improve availability, increase efficiency and sustainability.\u003cbr/\u003e\u003cbr/\u003e* Interface with internal data center operations team, data center design engineering team, server hardware team, environmental health and safety team to promote standards that maintain consistency and reliability in services delivered.\u003cbr/\u003e\u003cbr/\u003e* Develop innovative solutions for AWS’s data centers.\u003cbr/\u003e\u003cbr/\u003e* Work on concurrent projects, sometimes in multiple geographical regions.\u003cbr/\u003e\u003cbr/\u003e* Initiate and lead engineering audits including on-site visits within Amazon’s data centers. Produce reports outlining risks with recommended mitigations and remediations.\u003cbr/\u003e\u003cbr/\u003e* Act as resident engineer during new construction projects. Support construction, commissioning, and turnover.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAmazon's vision is to be the world's most customer-centric company, and this role is key to that vision. As an Amazon Critical Infrastructure Engineer, you will be leading projects to fit out our data centers to meet ever-evolving customer needs as we continue expanding our fleet to hyper-scale. As an ideal candidate you:\u003cbr/\u003e\u003cbr/\u003e* Possess Strong Engineering Judgement and are able to provide recommendations despite uncertainty/ambiguity.\u003cbr/\u003e\u003cbr/\u003e* Possess excellent communication and writing skills, attention to detail, maintain high quality standards Organized and have the ability to set priorities and meet deadlines and budget\u003cbr/\u003e\u003cbr/\u003e* Possess leadership and problem-solving skills\u003cbr/\u003e\u003cbr/\u003e* Are detail and data oriented\u003cbr/\u003e\u003cbr/\u003e* Have experience solving problems with engineered solutions.\u003cbr/\u003e\u003cbr/\u003e* Have experience managing engineering projects and consultants.\u003cbr/\u003e\u003cbr/\u003e* Build trust and relationships with different stakeholders (e.g., Operations, Controls, Construction, Design, Commissioning, Product Managers, Technical Program Managers, ).\u003cbr/\u003e\u003cbr/\u003e* Are adaptable and inclined to get into the field to see things up close.\u003cbr/\u003e\u003cbr/\u003e* Excited about a mix of office and field work.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eEach day you will interact with different teams responsible for all aspects of the data centers. You will prioritize your activities to support data center capacity availability and safety focusing on the actions that are most impactful. You will have the opportunity to work on projects locally and globally.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eIf you meet these qualifications, exude passion, and enjoy the challenge of innovative projects at hyper-scale, this job is for you!\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"5e379958-a8c1-431a-9c4e-b648be2d3905","id_icims":"3180306","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Infrastructure Eng","job_function_id":null,"job_path":"/en/jobs/3180306/critical-infrastructure-mechanical-engineer-field-engineering","job_schedule_type":"full-time","location":"US, GA, Covington","locations":["{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Covington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Covington\",\"coordinates\":\"33.59684,-83.86164\",\"normalizedCountyName\":\"Newton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Covington, Georgia, USA\",\"location\":\"US, GA, Covington\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL89\"],\"normalizedCityName\":\"Covington\"}"],"normalized_location":"Covington, Georgia, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"February 12, 2026","preferred_qualifications":"- Direct experience with the design, construction, operation, or maintenance of mission critical facilities, especially data centers.\u003cbr/\u003e- Experience as resident engineer or hands-on (in the field) design consultant or owner’s engineer.\u003cbr/\u003e- Experience reading and interpreting, construction drawings, specifications, submittal documents, and applicable building codes.\u003cbr/\u003e- Ability to carry design concepts through exploration, development, and into deployment/mass production\u003cbr/\u003e- Basic understanding of both mechanical and/or electrical equipment/design related to data centers (Including but not limited to: uninterruptable power sources, diesel generators, electrical switchgear, power distribution units, variable frequency drives, automatic/static transfer switches, chillers [air-cooled and water-cooled], pumps, cooling towers, heat exchangers, CRAHs, fans, air economizers, water treatment, etc...)\u003cbr/\u003e- Possess data analytics skills, data querying skills/language, scripting, and comfort with working in vast amounts of data in new and evolving environments\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, GA, Covington - 116,800.00 - 160,000.00 USD annually","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"GA","title":"Critical Infrastructure Mechanical Engineer, Field Engineering","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3180306/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in mechanical engineering or equivalent\u003cbr/\u003e- 3+ cumulative years of experience with industrial, municipal, or commercial engineering including but not limited to the following sectors: data centers, power generation, oil/gas facilities. (Experienced Engineer)\u003cbr/\u003e- Must have a valid US driver's license and reliable personal transportation by start date","business_category":"aws","city":"Hamlet","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAs an Amazon Critical Infrastructure Engineer, you will provide full life-cycle support to AWS Data Centers from design inception through site improvement and maintenance. You will be the ‘go to’ engineering resource for your region when technical advice is needed, and will use your subject matter expertise and engage with diverse teams to:\u003cbr/\u003e\u003cbr/\u003e* Troubleshoot, conduct Root Cause Analysis (RCA) and create Corrective Action (CA) documentation for site/equipment failures.\u003cbr/\u003e\u003cbr/\u003e* Directly support operational issues with ad-hoc training, complex operating procedure reviews, including critical equipment, and event support.\u003cbr/\u003e\u003cbr/\u003e* Own the conceptual design for existing data center upgrades and design-solutions, which add capacity, improve availability, increase efficiency and sustainability.\u003cbr/\u003e\u003cbr/\u003e* Interface with internal data center operations team, data center design engineering team, server hardware team, environmental health and safety team to promote standards that maintain consistency and reliability in services delivered.\u003cbr/\u003e\u003cbr/\u003e* Develop innovative solutions for AWS’s data centers.\u003cbr/\u003e\u003cbr/\u003e* Work on concurrent projects, sometimes in multiple geographical regions.\u003cbr/\u003e\u003cbr/\u003e* Initiate and lead engineering audits including on-site visits within Amazon’s data centers. Produce reports outlining risks with recommended mitigations and remediations.\u003cbr/\u003e\u003cbr/\u003e* Act as resident engineer during new construction projects. Support construction, commissioning, and turnover\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAmazon's vision is to be the world's most customer-centric company, and this role is key to that vision. As an Amazon Critical Infrastructure Engineer, you will be leading projects to fit out our data centers to meet ever-evolving customer needs as we continue expanding our fleet to hyper-scale. As an ideal candidate you:\u003cbr/\u003e\u003cbr/\u003e* Possess Strong Engineering Judgement and are able to provide recommendations despite uncertainty/ambiguity.\u003cbr/\u003e\u003cbr/\u003e* Possess excellent communication and writing skills, attention to detail, maintain high quality standards Organized and have the ability to set priorities and meet deadlines and budget\u003cbr/\u003e\u003cbr/\u003e* Possess leadership and problem-solving skills\u003cbr/\u003e\u003cbr/\u003e* Are detail and data oriented\u003cbr/\u003e\u003cbr/\u003e* Have experience solving problems with engineered solutions.\u003cbr/\u003e\u003cbr/\u003e* Have experience managing engineering projects and consultants.\u003cbr/\u003e\u003cbr/\u003e* Build trust and relationships with different stakeholders (e.g., Operations, Controls, Construction, Design, Commissioning, Product Managers, Technical Program Managers, ).\u003cbr/\u003e\u003cbr/\u003e* Are adaptable and inclined to get into the field to see things up close.\u003cbr/\u003e\u003cbr/\u003e* Excited about a mix of office and field work.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eEach day you will interact with different teams responsible for all aspects of the data centers. You will prioritize your activities to support data center capacity availability and safety focusing on the actions that are most impactful. You will have the opportunity to work on projects locally and globally.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eIf you meet these qualifications, exude passion, and enjoy the challenge of innovative projects at hyper-scale, this job is for you!\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"b1a4db5a-7834-4745-acb0-8e92784aaf21","id_icims":"3180298","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Infrastructure Eng","job_function_id":null,"job_path":"/en/jobs/3180298/critical-infrastructure-mechanical-engineer-field-engineering","job_schedule_type":"full-time","location":"US, NC, Hamlet","locations":["{\"normalizedStateName\":\"North Carolina\",\"normalizedCountryCode\":\"USA\",\"city\":\"HAMLET\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NC, HAMLET\",\"coordinates\":\"34.8934,-79.70087\",\"normalizedCountyName\":\"Richmond\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Hamlet, North Carolina, USA\",\"location\":\"US, NC, HAMLET\",\"region\":\"NC\",\"buildingCodeList\":[\"CLT100\"],\"normalizedCityName\":\"Hamlet\"}","{\"normalizedStateName\":\"North Carolina\",\"normalizedCountryCode\":\"USA\",\"city\":\"Hamlet\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NC, Hamlet\",\"coordinates\":\"34.8934,-79.70087\",\"normalizedCountyName\":\"Richmond\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Hamlet, North Carolina, USA\",\"location\":\"US, NC, Hamlet\",\"region\":\"NC\",\"buildingCodeList\":[\"CLT100\"],\"normalizedCityName\":\"Hamlet\"}"],"normalized_location":"Hamlet, North Carolina, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"February 12, 2026","preferred_qualifications":"- Experience with the design, construction, operation, or maintenance of mission critical facilities, especially data centers\u003cbr/\u003e- Experience as resident engineer or hands-on (in the field) design consultant or owner’s engineer.\u003cbr/\u003e- Experience reading and interpreting, construction drawings, specifications, submittal documents, and applicable building codes.\u003cbr/\u003e- Ability to carry design concepts through exploration, development, and into deployment/mass production\u003cbr/\u003e- Basic understanding of both mechanical and/or electrical equipment/design related to data centers (Including but not limited to: uninterruptable power sources, diesel generators, electrical switchgear, power distribution units, variable frequency drives, automatic/static transfer switches, chillers [air-cooled and water-cooled], pumps, cooling towers, heat exchangers, CRAHs, fans, air economizers, water treatment, etc...)\u003cbr/\u003e- Possess data analytics skills, data querying skills/language, scripting, and comfort with working in vast amounts of data in new and evolving environments\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NC, HAMLET - 116,800.00 - 160,000.00 USD annually","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"NC","title":"Critical Infrastructure Mechanical Engineer, Field Engineering","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3180298/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in mechanical engineering or equivalent\u003cbr/\u003e- Valid and active driver's license\u003cbr/\u003e- 3+ cumulative years of experience with industrial, municipal, or commercial engineering including but not limited to the following sectors: data centers, power generation, oil/gas facilities. (Experienced Engineer)","business_category":"aws","city":"Berwick","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAs an Amazon Critical Infrastructure Engineer, you will provide full life-cycle support to AWS Data Centers from design inception through site improvement and maintenance. You will be the ‘go to’ engineering resource for your region when technical advice is needed, and will use your subject matter expertise and engage with diverse teams to:\u003cbr/\u003e\u003cbr/\u003e* Troubleshoot, conduct Root Cause Analysis (RCA) and create Corrective Action (CA) documentation for site/equipment failures.\u003cbr/\u003e\u003cbr/\u003e* Directly support operational issues with ad-hoc training, complex operating procedure reviews, including critical equipment, and event support.\u003cbr/\u003e\u003cbr/\u003e* Own the conceptual design for existing data center upgrades and design-solutions, which add capacity, improve availability, increase efficiency and sustainability.\u003cbr/\u003e\u003cbr/\u003e* Interface with internal data center operations team, data center design engineering team, server hardware team, environmental health and safety team to promote standards that maintain consistency and reliability in services delivered.\u003cbr/\u003e\u003cbr/\u003e* Develop innovative solutions for AWS’s data centers.\u003cbr/\u003e\u003cbr/\u003e* Work on concurrent projects, sometimes in multiple geographical regions.\u003cbr/\u003e\u003cbr/\u003e* Initiate and lead engineering audits including on-site visits within Amazon’s data centers. Produce reports outlining risks with recommended mitigations and remediations.\u003cbr/\u003e\u003cbr/\u003e* Act as resident engineer during new construction projects. Support construction, commissioning, and turnover.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAmazon's vision is to be the world's most customer-centric company, and this role is key to that vision. As an Amazon Critical Infrastructure Engineer, you will be leading projects to fit out our data centers to meet ever-evolving customer needs as we continue expanding our fleet to hyper-scale. As an ideal candidate you:\u003cbr/\u003e\u003cbr/\u003e* Possess Strong Engineering Judgement and are able to provide recommendations despite uncertainty/ambiguity.\u003cbr/\u003e\u003cbr/\u003e* Possess excellent communication and writing skills, attention to detail, maintain high quality standards Organized and have the ability to set priorities and meet deadlines and budget\u003cbr/\u003e\u003cbr/\u003e* Possess leadership and problem-solving skills\u003cbr/\u003e\u003cbr/\u003e* Are detail and data oriented\u003cbr/\u003e\u003cbr/\u003e* Have experience solving problems with engineered solutions.\u003cbr/\u003e\u003cbr/\u003e* Have experience managing engineering projects and consultants.\u003cbr/\u003e\u003cbr/\u003e* Build trust and relationships with different stakeholders (e.g., Operations, Controls, Construction, Design, Commissioning, Product Managers, Technical Program Managers, ).\u003cbr/\u003e\u003cbr/\u003e* Are adaptable and inclined to get into the field to see things up close.\u003cbr/\u003e\u003cbr/\u003e* Excited about a mix of office and field work.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eEach day you will interact with different teams responsible for all aspects of the data centers. You will prioritize your activities to support data center capacity availability and safety focusing on the actions that are most impactful. You will have the opportunity to work on projects locally and globally.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eIf you meet these qualifications, exude passion, and enjoy the challenge of innovative projects at hyper-scale, this job is for you!\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"10c7b578-80f5-4141-b768-b1823fe4d083","id_icims":"3186867","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Infrastructure Eng","job_function_id":null,"job_path":"/en/jobs/3186867/critical-infrastructure-mechanical-engineer-data-center-field-services-engineering","job_schedule_type":"full-time","location":"US, PA, Berwick","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Berwick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Berwick\",\"coordinates\":\"41.05089,-76.24352\",\"normalizedCountyName\":\"Columbia\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Berwick, Pennsylvania, USA\",\"location\":\"US, PA, Berwick\",\"region\":\"PA\",\"buildingCodeList\":[\"PHL100\"],\"normalizedCityName\":\"Berwick\"}"],"normalized_location":"Berwick, Pennsylvania, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"February 23, 2026","preferred_qualifications":"- Experience with the design, construction, operation, or maintenance of mission critical facilities, especially data centers\u003cbr/\u003e- Experience as a resident engineer or hands-on design consultant\u003cbr/\u003e- 3. Experience reading and interpreting, construction drawings, specifications, submittal documents, and applicable building codes.\u003cbr/\u003e- 4. Ability to carry design concepts through exploration, development, and into deployment/mass production\u003cbr/\u003e- 5. Basic understanding of both mechanical and/or electrical equipment/design related to data centers (Including but not limited to: uninterruptable power sources, diesel generators, electrical switchgear, power distribution units, variable frequency drives, automatic/static transfer switches, chillers [air-cooled and water-cooled], pumps, cooling towers, heat exchangers, CRAHs, fans, air economizers, water treatment, etc...)\u003cbr/\u003e- 6. Possess data analytics skills, data querying skills/language, scripting, and comfort with working in vast amounts of data in new and evolving environments\u003cbr/\u003e- 7. Possess experience/knowledge in water chemistry and conventional/membrane water treatment technologies for industrial applications\u003cbr/\u003e- 8. EPMS/SCADA/BMS Controls system experience (software and/or hardware)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, PA, Berwick - 116,800.00 - 160,000.00 USD annually","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"PA","title":"Critical Infrastructure Mechanical Engineer, Data Center Field Services Engineering","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3186867/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in mechanical engineering or equivalent\u003cbr/\u003e- Valid and active driver's license\u003cbr/\u003e- 3+ cumulative years of experience with industrial, municipal, or commercial engineering including but not limited to the following sectors: data centers, power generation, oil/gas facilities. (Experienced Engineer)","business_category":"aws","city":"Fairless Hills","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAs an Amazon Critical Infrastructure Engineer, you will provide full life-cycle support to AWS Data Centers from design inception through site improvement and maintenance. You will be the ‘go to’ engineering resource for your region when technical advice is needed, and will use your subject matter expertise and engage with diverse teams to:\u003cbr/\u003e\u003cbr/\u003e* Troubleshoot, conduct Root Cause Analysis (RCA) and create Corrective Action (CA) documentation for site/equipment failures.\u003cbr/\u003e\u003cbr/\u003e* Directly support operational issues with ad-hoc training, complex operating procedure reviews, including critical equipment, and event support.\u003cbr/\u003e\u003cbr/\u003e* Own the conceptual design for existing data center upgrades and design-solutions, which add capacity, improve availability, increase efficiency and sustainability.\u003cbr/\u003e\u003cbr/\u003e* Interface with internal data center operations team, data center design engineering team, server hardware team, environmental health and safety team to promote standards that maintain consistency and reliability in services delivered.\u003cbr/\u003e\u003cbr/\u003e* Develop innovative solutions for AWS’s data centers.\u003cbr/\u003e\u003cbr/\u003e* Work on concurrent projects, sometimes in multiple geographical regions.\u003cbr/\u003e\u003cbr/\u003e* Initiate and lead engineering audits including on-site visits within Amazon’s data centers. Produce reports outlining risks with recommended mitigations and remediations.\u003cbr/\u003e\u003cbr/\u003e* Act as resident engineer during new construction projects. Support construction, commissioning, and turnover.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAmazon's vision is to be the world's most customer-centric company, and this role is key to that vision. As an Amazon Critical Infrastructure Engineer, you will be leading projects to fit out our data centers to meet ever-evolving customer needs as we continue expanding our fleet to hyper-scale. As an ideal candidate you:\u003cbr/\u003e\u003cbr/\u003e* Possess Strong Engineering Judgement and are able to provide recommendations despite uncertainty/ambiguity.\u003cbr/\u003e\u003cbr/\u003e* Possess excellent communication and writing skills, attention to detail, maintain high quality standards Organized and have the ability to set priorities and meet deadlines and budget\u003cbr/\u003e\u003cbr/\u003e* Possess leadership and problem-solving skills\u003cbr/\u003e\u003cbr/\u003e* Are detail and data oriented\u003cbr/\u003e\u003cbr/\u003e* Have experience solving problems with engineered solutions.\u003cbr/\u003e\u003cbr/\u003e* Have experience managing engineering projects and consultants.\u003cbr/\u003e\u003cbr/\u003e* Build trust and relationships with different stakeholders (e.g., Operations, Controls, Construction, Design, Commissioning, Product Managers, Technical Program Managers, ).\u003cbr/\u003e\u003cbr/\u003e* Are adaptable and inclined to get into the field to see things up close.\u003cbr/\u003e\u003cbr/\u003e* Excited about a mix of office and field work.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eEach day you will interact with different teams responsible for all aspects of the data centers. You will prioritize your activities to support data center capacity availability and safety focusing on the actions that are most impactful. You will have the opportunity to work on projects locally and globally.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eIf you meet these qualifications, exude passion, and enjoy the challenge of innovative projects at hyper-scale, this job is for you!\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"20928a64-32db-47f6-ba5a-75d606c2429a","id_icims":"3180317","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Infrastructure Eng","job_function_id":null,"job_path":"/en/jobs/3180317/critical-infrastructure-mechanical-engineer-data-center-field-services-engineering","job_schedule_type":"full-time","location":"US, PA, Fairless Hills","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Fairless Hills\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Fairless Hills\",\"coordinates\":\"40.17334,-74.85369\",\"normalizedCountyName\":\"Bucks\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Fairless Hills, Pennsylvania, USA\",\"location\":\"US, PA, Fairless Hills\",\"region\":\"PA\",\"buildingCodeList\":[\"PNE100\"],\"normalizedCityName\":\"Fairless Hills\"}"],"normalized_location":"Fairless Hills, Pennsylvania, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"February 12, 2026","preferred_qualifications":"- 1. Direct experience with the design, construction, operation, or maintenance of mission critical facilities, especially data centers.\u003cbr/\u003e- 2. Experience as resident engineer or hands-on (in the field) design consultant or owner’s engineer.\u003cbr/\u003e- 3. Experience reading and interpreting, construction drawings, specifications, submittal documents, and applicable building codes.\u003cbr/\u003e- 4. Ability to carry design concepts through exploration, development, and into deployment/mass production\u003cbr/\u003e- 5. Basic understanding of both mechanical and/or electrical equipment/design related to data centers (Including but not limited to: uninterruptable power sources, diesel generators, electrical switchgear, power distribution units, variable frequency drives, automatic/static transfer switches, chillers [air-cooled and water-cooled], pumps, cooling towers, heat exchangers, CRAHs, fans, air economizers, water treatment, etc...)\u003cbr/\u003e- 6. Possess data analytics skills, data querying skills/language, scripting, and comfort with working in vast amounts of data in new and evolving environments\u003cbr/\u003e- 7. Possess experience/knowledge in water chemistry and conventional/membrane water treatment technologies for industrial applications\u003cbr/\u003e- 8. EPMS/SCADA/BMS Controls system experience (software and/or hardware)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, PA, FAIRLESS HILLS - 116,800.00 - 160,000.00 USD annually","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"PA","title":"Critical Infrastructure Mechanical Engineer, Data Center Field Services Engineering","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3180317/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Master's degree in engineering, statistics, computer science, mathematics, or a related quantitative field\u003cbr/\u003e- 2+ years of machine learning, statistical modeling, data mining, and analytics techniques experience\u003cbr/\u003e- 3+ years of programming in Java, C++, Python or related language experience\u003cbr/\u003e- 2+ years of building machine learning models or developing algorithms for business application experience","business_category":"amazon-artificial-general-intelligence","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"This is currently a 12 month temporary contract opportunity with the possibility to extend to 24 months based on business needs.\u003cbr/\u003e\u003cbr/\u003eThe Artificial General Intelligence (AGI) team is seeking a dedicated, skilled, and innovative Applied Scientist with a robust background in machine learning, statistics, quality assurance, auditing methodologies, and automated evaluation systems to ensure the highest standards of data quality, to build industry-leading technology with Large Language Models (LLMs) and multimodal systems.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs part of the AGI team, an Applied Scientist will collaborate closely with core scientist team developing Amazon Nova models. They will lead the development of comprehensive quality strategies and auditing frameworks that safeguard the integrity of data collection workflows. This includes designing auditing strategies with detailed SOPs, quality metrics, and sampling methodologies that help Nova improve performances on benchmarks. The Applied Scientist will perform expert-level manual audits, conduct meta-audits to evaluate auditor performance, and provide targeted coaching to uplift overall quality capabilities. A critical aspect of this role involves developing and maintaining LLM-as-a-Judge systems, including designing judge architectures, creating evaluation rubrics, and building machine learning models for automated quality assessment. The Applied Scientist will also set up the configuration of data collection workflows and communicate quality feedback to stakeholders. An Applied Scientist will also have a direct impact on enhancing customer experiences through high-quality training and evaluation data that powers state-of-the-art LLM products and services.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAn Applied Scientist with the AGI team will support quality solution design, conduct root cause analysis on data quality issues, research new auditing methodologies, and find innovative ways of optimizing data quality while setting examples for the team on quality assurance best practices and standards. Besides theoretical analysis and quality framework development, an Applied Scientist will also work closely with talented engineers, domain experts, and vendor teams to put quality strategies and automated judging systems into practice.","department_cost_center":null,"description_short":"This is currently a 12 month temporary contract opportunity with the possibility to extend to 24 months based on business needs.The Artificial General Intelligence (AGI) team is seeking a dedicated, skilled,","display_distance":null,"id":"2bf4132f-1f64-4329-9f83-2160480a3a73","id_icims":"3166402","is_intern":null,"is_manager":null,"job_category":"Data Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3166402/applied-scientist-contract-artificial-general-intelligence","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Boston\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Boston\",\"coordinates\":\"42.35866,-71.05674\",\"normalizedCountyName\":\"Suffolk\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Boston, Massachusetts, USA\",\"location\":\"US, MA, Boston\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS17\"],\"normalizedCityName\":\"Boston\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA106\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":["alexa-and-amazon-devices.team-hardware-development-job-family"],"posted_date":"January 26, 2026","preferred_qualifications":"- Ph.D. in engineering, technology, computer science, machine learning, robotics, operations research, statistics, mathematics or equivalent quantitative field\u003cbr/\u003e- Have publications at top-tier peer-reviewed conferences or journals\u003cbr/\u003e- 4+ years of solving business problems through machine learning, data mining and statistical algorithms experience\u003cbr/\u003e- Experience with Machine Learning and Large Language Model fundamentals, including architecture, training/inference lifecycles, and optimization of model execution, or experience debugging, profiling, and implementing best software engineering practices in large-scale systems\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MA, Boston - 136,000.00 - 184,000.00 USD annually\u003cbr/\u003eUSA, WA, BELLEVUE - 136,000.00 - 184,000.00 USD annually","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":"WA","title":"Applied Scientist (Contract), Artificial General Intelligence","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3166402/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Mechanical Engineering\u003cbr/\u003e- Valid and active driver's license","business_category":"aws","city":null,"company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"As an Amazon Critical Infrastructure Engineer, you will provide full life-cycle support to AWS Data Centers from design inception through site improvement and maintenance. You will be the ‘go to’ engineering resource for your region when technical advice is needed, and will use your subject matter expertise and engage with diverse teams to:\u003cbr/\u003e\u003cbr/\u003e* Troubleshoot, conduct Root Cause Analysis (RCA) and create Corrective Action (CA) documentation for site/equipment failures.\u003cbr/\u003e\u003cbr/\u003e* Directly support operational issues with ad-hoc training, complex operating procedure reviews, including critical equipment, and event support.\u003cbr/\u003e\u003cbr/\u003e* Own the conceptual design for existing data center upgrades and design-solutions, which add capacity, improve availability, increase efficiency and sustainability.\u003cbr/\u003e\u003cbr/\u003e* Interface with internal data center operations team, data center design engineering team, server hardware team, environmental health and safety team to promote standards that maintain consistency and reliability in services delivered.\u003cbr/\u003e\u003cbr/\u003e* Develop innovative solutions for AWS’s data centers.\u003cbr/\u003e\u003cbr/\u003e* Work on concurrent projects, sometimes in multiple geographical regions.\u003cbr/\u003e\u003cbr/\u003e* Initiate and lead engineering audits including on-site visits within Amazon’s data centers. Produce reports outlining risks with recommended mitigations and remediations.\u003cbr/\u003e\u003cbr/\u003e* Act as resident engineer during new construction projects. Support construction, commissioning, and turnover.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAmazon's vision is to be the world's most customer-centric company, and this role is key to that vision. As an Amazon Critical Infrastructure Engineer, you will be leading projects to fit out our data centers to\u003cbr/\u003emeet ever-evolving customer needs as we continue expanding our fleet to hyper-scale. As an ideal candidate you:\u003cbr/\u003e\u003cbr/\u003e* Possess Strong Engineering Judgement and are able to provide recommendations despite uncertainty/ambiguity.\u003cbr/\u003e\u003cbr/\u003e* Are detail and data oriented.\u003cbr/\u003e\u003cbr/\u003e* Have experience solving problems with engineered solutions.\u003cbr/\u003e\u003cbr/\u003e* Have experience managing engineering projects and consultants.\u003cbr/\u003e\u003cbr/\u003e* Build trust and relationships with different stakeholders (e.g., Operations, Controls, Construction, Design, Commissioning, Product Managers, Technical Program Managers, ).\u003cbr/\u003e\u003cbr/\u003e* Are adaptable and inclined to get into the field to see things up close.\u003cbr/\u003e\u003cbr/\u003e* Excited about a mix of office and field work.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eEach day you will interact with different teams responsible for all aspects of the data centers. You will prioritize your activities to support data center capacity availability and safety focusing on the actions that are most impactful. You will have the opportunity to work on projects locally and globally.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eIf you meet these qualifications, exude passion, and enjoy the challenge of innovative projects at hyper-scale, this job is for you!\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"As an Amazon Critical Infrastructure Engineer, you will provide full life-cycle support to AWS Data Centers from design inception through site improvement and maintenance. You will be the ‘go to’ engineering","display_distance":null,"id":"a840b103-16fa-43c3-95a9-e041453e4190","id_icims":"3180334","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Field Engineering","job_function_id":null,"job_path":"/en/jobs/3180334/critical-infrastructure-mechanical-engineer-field-engineering-jan-field-engineering","job_schedule_type":"full-time","location":"US, MS","locations":["{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS\",\"coordinates\":\"32.29896,-90.18045\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Mississippi, USA\",\"location\":\"US, MS\",\"region\":\"MS\",\"buildingCodeList\":[\"JAN105\"]}"],"normalized_location":"Mississippi, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"February 12, 2026","preferred_qualifications":"- Experience with mechanical systems\u003cbr/\u003e- Experience prioritizing and handling multiple assignments at any given time while maintaining commitment to deadlines\u003cbr/\u003e- Experience handling ambiguous or undefined challenges through strong problem solving abilities\u003cbr/\u003e- Experience that includes strong analytical skills, attention to detail, and effective communication abilities, or experience working with customers with a passion for delivering exceptional service\u003cbr/\u003e- 1+ years of data querying languages (e.g. SQL), scripting languages (e.g. Python) or statistical/mathematical software (e.g. R, SAS, Matlab, etc.) experience\u003cbr/\u003e- Experience using a variety of web based and other software tools for calculation and data processing.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MS,  - 49,500.00 - 86,600.00 USD annually","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"MS","title":"Critical Infrastructure Mechanical Engineer, Field Engineering, JAN Field Engineering","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3180334/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Master's degree in engineering, statistics, computer science, mathematics, or a related quantitative field\u003cbr/\u003e- 2+ years of machine learning, statistical modeling, data mining, and analytics techniques experience\u003cbr/\u003e- 3+ years of programming in Java, C++, Python or related language experience\u003cbr/\u003e- 2+ years of building machine learning models or developing algorithms for business application experience","business_category":"amazon-artificial-general-intelligence","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"This is currently a 12 month temporary contract opportunity with the possibility to extend to 24 months based on business needs.\u003cbr/\u003e\u003cbr/\u003eThe Artificial General Intelligence (AGI) team is seeking a dedicated, skilled, and innovative Applied Scientist with a robust background in machine learning, statistics, quality assurance, auditing methodologies, and automated evaluation systems to ensure the highest standards of data quality, to build industry-leading technology with Large Language Models (LLMs) and multimodal systems.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs part of the AGI team, an Applied Scientist will collaborate closely with core scientist team developing Amazon Nova models. They will lead the development of comprehensive quality strategies and auditing frameworks that safeguard the integrity of data collection workflows. This includes designing auditing strategies with detailed SOPs, quality metrics, and sampling methodologies that help Nova improve performances on benchmarks. The Applied Scientist will perform expert-level manual audits, conduct meta-audits to evaluate auditor performance, and provide targeted coaching to uplift overall quality capabilities. A critical aspect of this role involves developing and maintaining LLM-as-a-Judge systems, including designing judge architectures, creating evaluation rubrics, and building machine learning models for automated quality assessment. The Applied Scientist will also set up the configuration of data collection workflows and communicate quality feedback to stakeholders. An Applied Scientist will also have a direct impact on enhancing customer experiences through high-quality training and evaluation data that powers state-of-the-art LLM products and services.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAn Applied Scientist with the AGI team will support quality solution design, conduct root cause analysis on data quality issues, research new auditing methodologies, and find innovative ways of optimizing data quality while setting examples for the team on quality assurance best practices and standards. Besides theoretical analysis and quality framework development, an Applied Scientist will also work closely with talented engineers, domain experts, and vendor teams to put quality strategies and automated judging systems into practice.","department_cost_center":null,"description_short":"This is currently a 12 month temporary contract opportunity with the possibility to extend to 24 months based on business needs.The Artificial General Intelligence (AGI) team is seeking a dedicated, skilled,","display_distance":null,"id":"ee72c1b0-2c3d-42da-9e47-de8a2797ff24","id_icims":"3165531","is_intern":null,"is_manager":null,"job_category":"Data Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3165531/applied-scientist-contract-artificial-general-intelligence","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Boston\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Boston\",\"coordinates\":\"42.35866,-71.05674\",\"normalizedCountyName\":\"Suffolk\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Boston, Massachusetts, USA\",\"location\":\"US, MA, Boston\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS17\"],\"normalizedCityName\":\"Boston\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA106\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":["alexa-and-amazon-devices.team-hardware-development-job-family"],"posted_date":"January 23, 2026","preferred_qualifications":"- Ph.D. in engineering, technology, computer science, machine learning, robotics, operations research, statistics, mathematics or equivalent quantitative field\u003cbr/\u003e- Have publications at top-tier peer-reviewed conferences or journals\u003cbr/\u003e- 4+ years of solving business problems through machine learning, data mining and statistical algorithms experience\u003cbr/\u003e- Experience with Machine Learning and Large Language Model fundamentals, including architecture, training/inference lifecycles, and optimization of model execution, or experience debugging, profiling, and implementing best software engineering practices in large-scale systems\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MA, Boston - 136,000.00 - 184,000.00 USD annually\u003cbr/\u003eUSA, WA, BELLEVUE - 136,000.00 - 184,000.00 USD annually","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":"WA","title":"Applied Scientist (Contract), Artificial General Intelligence","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3165531/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of analyzing and interpreting data with Redshift, Oracle, NoSQL etc. experience\u003cbr/\u003e- Experience with data modeling, warehousing and building ETL pipelines\u003cbr/\u003e- Experience with data visualization using Tableau, Quicksight, or similar tools\u003cbr/\u003e- Experience writing complex SQL queries\u003cbr/\u003e- Experience in Statistical Analysis packages such as R, SAS and Matlab\u003cbr/\u003e- Experience using SQL to pull data from a database or data warehouse and scripting experience (Python) to process data for modeling","business_category":"operations","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"SCOT Optimal Inventory Health (OIH) team manages Retail inventory health WW. We own products that identify and remove overstock inventory through multiple disposition channels – Markdowns, Deals, Coupons, Vendor Returns, and Google Shopping Ads - across 20+ marketplaces. OIH Insights Team provides analytic horsepower to drive OIH strategy. We do so by :\u003cbr/\u003e\u003cbr/\u003e1) Transforming raw, complex datasets into intuitive, and actionable insights to inform business decision.\u003cbr/\u003e2) Building and maintaining modular, scalable data models that provide the generality, flexibility, and responsiveness required for seamless self-service insights.\u003cbr/\u003e3) Generating deeper insights through statistical modeling and machine learning.\u003cbr/\u003e\u003cbr/\u003eWe are looking for experienced, self-driven, and strategic Business Intelligence Engineer with superior analytical skills. This position is critical to build scalable BI solutions to support next-gen system transformation.\u003cbr/\u003e\u003cbr/\u003eYou will work partner closely with PMTs, Scientists, Economists, Engineers to contribute to each layer of data solution (build data pipeline for scalable BI solution, productionize self-service insights generation etc.) \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e1) Translating the business requirements to structured BI solutions.\u003cbr/\u003e2) Designing and implementing BI technical solutions with the appropriate analytics strategy and data set design.\u003cbr/\u003e3) Implementing data pipeline for insights generation.\u003cbr/\u003e4) Translating the raw data into meaningful insights through collaboration with Product Managers, Data scientists and Data engineers.\u003cbr/\u003e5) Structuring large scale, complex analysis and performing the analysis to generate insights.\u003cbr/\u003e6) Driving business actions through insights to accelerate the business and technical evolution.","department_cost_center":null,"description_short":"SCOT Optimal Inventory Health (OIH) team manages Retail inventory health WW. We own products that identify and remove overstock inventory through multiple disposition channels – Markdowns, Deals, Coupons,","display_distance":null,"id":"3eea030f-36a6-4d85-b2f4-fc5ef9f6c608","id_icims":"3189808","is_intern":null,"is_manager":null,"job_category":"Data Science","job_family":"Business Intel Engineer","job_function_id":null,"job_path":"/en/jobs/3189808/business-intelligence-engineer-ii-optimal-inventory-health","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA104\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":["operations.team-data-engineering"],"posted_date":"February 25, 2026","preferred_qualifications":"- Experience with AWS solutions such as EC2, DynamoDB, S3, and Redshift\u003cbr/\u003e- Experience in data mining, ETL, etc. and using databases in a business environment with large-scale, complex datasets\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Bellevue - 99,500.00 - 160,000.00 USD annually","primary_search_label":"operations.team-supply-chain-optimization","source_system":"JobCreator","state":"WA","title":"Business Intelligence Engineer II, Optimal Inventory Health","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3189808/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-supply-chain-optimization","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}