{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 3+ years of engineering team management experience\u003cbr/\u003e- 7+ years of working directly within engineering teams experience\u003cbr/\u003e- 3+ years of designing or architecting (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience partnering with product or program management teams","business_category":"aws","city":"Cupertino","company_name":"Annapurna Labs (U.S.) Inc.","country_code":"USA","description":"DESCRIPTION\u003cbr/\u003eAWS Utility Computing (UC) provides product innovations, from foundational services such as Amazon Elastic Compute Cloud (EC2), to new product innovations that continue to set AWS’s services and features apart in the industry.\u003cbr/\u003e\u003cbr/\u003eWe develop AWS Neuron, the complete software stack for Trainium, Amazon's custom cloud-scale\u003cbr/\u003emachine learning accelerators. Come optimize LLMs such as Llama and GPT-OSS to run really fast on Trainium.\u003cbr/\u003e\u003cbr/\u003eAs the SDM for the LLM Inference Model Enablement team, you will lead a team of expert AI/ML engineers to onboard and optimize state-of-the-art open-source and customer LLMs, both dense and MoE, for inference on Neuron and Trainium and Inferentia accelerators. You will also drive improvements in model enablement speed and experience, while advancing inference usability and quality through inference features, infrastructure optimization, tools, and automation.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will have a strong background in LLM model architectures, model performance optimizations, and inference techniques,  such as delivering high-performance models using distributed inference libraries. You should be capable of managing demanding, fast-changing priorities. You should have a strong technical ability to understand and deliver as part of a vertically integrated system stack consisting of the PyTorch inference library, Neuron compiler, runtime, and collectives.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou will work with your senior management and technical leaders to define the model enablement and performance optimization for the latest SOTA LLMs, build and deliver them to customers.\u003cbr/\u003e\u003cbr/\u003eMeanwhile, lead the team to continue improving the model onboarding experience, as well as enhancing inference usability and quality for Neuron-supported models.\u003cbr/\u003e\u003cbr/\u003eYou will manage changing priorities as new models and new technologies emerge, and you adapt your team’s work to manage them. You will dive deep to help your team solve technical challenges.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"DESCRIPTIONAWS Utility Computing (UC) provides product innovations, from foundational services such as Amazon Elastic Compute Cloud (EC2), to new product innovations that continue to set AWS’s services","display_distance":null,"id":"f16d5bdf-cd4f-4347-98db-db43181b8f26","id_icims":"3074104","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3074104/software-development-manager-llm-inference-model-enablement-neuron-sdk","job_schedule_type":"full-time","location":"US, CA, Cupertino","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Cupertino\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Cupertino\",\"coordinates\":\"37.31913,-122.02929\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Cupertino, California, USA\",\"location\":\"US, CA, Cupertino\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC29\"],\"normalizedCityName\":\"Cupertino\"}"],"normalized_location":"Cupertino, California, USA","optional_search_labels":["aws.team-annapurna-labs","aws.team-sde-sdm","aws.team-utility-computing"],"posted_date":"September  5, 2025","preferred_qualifications":"- Experience in communicating with users, other technical teams, and senior leadership to collect requirements, describe software product features, technical designs, and product strategy\u003cbr/\u003e- Experience in recruiting, hiring, mentoring/coaching and managing teams of Software Engineers to improve their skills, and make them more effective, product software engineers\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $166,400/year in our lowest geographic market up to $287,700/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"CA","title":"Software Development Manager, LLM Inference Model Enablement, Neuron SDK","university_job":null,"updated_time":"3 minutes","url_next_step":"https://account.amazon.com/jobs/3074104/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of engineering team management experience\u003cbr/\u003e- 7+ years of working directly within engineering teams experience\u003cbr/\u003e- 3+ years of designing or architecting (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience partnering with product or program management teams","business_category":"aws","city":"Seattle","company_name":"Annapurna Labs (U.S.) Inc.","country_code":"USA","description":"DESCRIPTION\u003cbr/\u003eAWS Utility Computing (UC) provides product innovations — from foundational services such as\u003cbr/\u003eAmazon Elastic Compute Cloud (EC2), to new product innovations that continue to set AWS’s\u003cbr/\u003eservices and features apart in the industry.\u003cbr/\u003e\u003cbr/\u003eWe develop AWS Neuron, the complete software stack for Trainium, Amazon's custom cloudscale\u003cbr/\u003emachine learning accelerators. Come optimize LLMs such as Llama and GPT OSS to run\u003cbr/\u003ereally fast on Trainium.\u003cbr/\u003e\u003cbr/\u003eAs the SDM for the Neuron Inference Technology building blocks team, you will guide your\u003cbr/\u003eexpert AI engineers to build fundamental inference technology building blocks and libraries to\u003cbr/\u003eenable AI developers to optimize model for inference on Trainium and Inferentia devices. We’re\u003cbr/\u003ecurrently focusing on MoE models such as GPT OSS for Trainium 2 and the upcoming\u003cbr/\u003eTrainium 3. You will develop and optimize blocks such as attention kernels and\u003cbr/\u003edeliver them in the Neuronx_Distributed Inference Libraries, enabling customers to optimize\u003cbr/\u003eLLMs, multimodal, and generative models.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will have an established background in optimizing LLMs, such as delivering\u003cbr/\u003ehigh-performance models using distributed inference libraries. You should be capable of\u003cbr/\u003emanaging demanding, fast-changing priorities. You should have a strong technical ability to\u003cbr/\u003eunderstand and deliver as part of a vertically integrated system stack consisting of the PyTorch\u003cbr/\u003einference library, Neuron compiler, runtime and collectives.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e\u003cbr/\u003eYou will work with your senior management and technical leaders to define the building blocks\u003cbr/\u003efor the latest LLMs, build and deliver them to customers. You will manage changing priorities as\u003cbr/\u003enew models and new technologies emerge, and you adapt your team’s work to manage them.\u003cbr/\u003eYou will dive deep to help your team solve technical challenges.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud\u003cbr/\u003eplatform. We pioneered cloud computing and never stopped innovating — that’s why\u003cbr/\u003ecustomers from the most successful startups to Global 500 companies trust our robust suite of\u003cbr/\u003eproducts and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed\u003cbr/\u003ein the job description, we encourage candidates to apply. If your career is just starting, hasn’t\u003cbr/\u003efollowed a traditional path, or includes alternative experiences, don’t let it stop you from\u003cbr/\u003eapplying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of\u003cbr/\u003esacrifices at home, which is why we strive for flexibility as part of our working culture. When we\u003cbr/\u003efeel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer.\u003cbr/\u003eThat’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing\u003cbr/\u003eresources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"DESCRIPTIONAWS Utility Computing (UC) provides product innovations — from foundational services such asAmazon Elastic Compute Cloud (EC2), to new product innovations that continue to set AWS’sservices","display_distance":null,"id":"6ad31e77-f321-454e-a0b6-d30489a75dcc","id_icims":"3059846","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3059846/software-development-manager-ai-inference-technology-neuron-sdk","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA42\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["aws.team-annapurna-labs"],"posted_date":"August 14, 2025","preferred_qualifications":"- Experience in communicating with users, other technical teams, and senior leadership to collect requirements, describe software product features, technical designs, and product strategy\u003cbr/\u003e- Experience in recruiting, hiring, mentoring/coaching and managing teams of Software Engineers to improve their skills, and make them more effective, product software engineers\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $166,400/year in our lowest geographic market up to $287,700/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"WA","title":"Software Development Manager, AI Inference Technology, Neuron SDK","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3059846/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team","business_category":"aws","city":"Seattle","company_name":"Annapurna Labs (U.S.) Inc.","country_code":"USA","description":"In this role you will be responsible for leading a technical team which is critical in providing profiling and optimization tools for the Neuron ML accelerators fleet. You will work closely with the hardware and software teams to ensure the right tools are available for performance profiling of large ML workloads, identifying bottlenecks and automatically providing improvement recommendations. Neuron Core Tools develops and maintains a family of profiling software and provides ability for performance engineers to develop and improve custom kernels that would impact efficiency of large workloads.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Provide technical leadership to the Neuron Core Tools team\u003cbr/\u003e* Work closely with the frameworks and compiler teams.\u003cbr/\u003e* Collect requirements from various other teams including training, inference and runtime.\u003cbr/\u003e* Collaborate with the compiler performance team to ensure timely release of the core performance tools.\u003cbr/\u003e* Anticipate future needs based on the product roadmap and develop necessary tools to increase efficiency in large scale compute.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge-sharing and mentorship. Our senior members enjoy one-on-one mentoring and thorough, but kind, code reviews. We care about your career growth and strive to assign projects that help our team members develop your engineering expertise so you feel empowered to take on more complex tasks in the future.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eAbout Amazon Annapurna Labs:\u003cbr/\u003eAmazon Annapurna Labs team (our organization within AWS UC) is  responsible for building innovation in silicon and software for our AWS customers. We are at the forefront of innovation by combining cloud scale with the world’s most talented engineers. Our team covers multiple disciplines including silicon engineering, hardware design, software and operations. Because of our teams breadth of talent, we have been able to improve AWS cloud infrastructure in high-performance machine learning with AWS Neuron, Inferentia and Trainium ML chips, in networking and security with products such as AWS Nitro, Enhanced Network Adapter (ENA), and Elastic Fabric Adapter (EFA), and in computing with AWS Graviton and F1 EC2 instances.\u003cbr/\u003e\u003cbr/\u003eAbout AWS Utility Computing (UC):\u003cbr/\u003eAWS Utility Computing (UC) provides product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for their cloud services. Additionally, this role may involve exposure to and experience with Amazon's growing suite of generative AI services and other cloud computing offerings across the AWS portfolio.\u003cbr/\u003e\u003cbr/\u003eAbout AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAbout AWS Neuron:\u003cbr/\u003eAWS Neuron is the software of Trainium and Inferentia, the AWS Machine Learning chips. Inferentia delivers best-in-class ML inference performance at the lowest cost in the cloud to our AWS customers. Trainium is designed to deliver the best-in-class ML training performance at the lowest training cost in the cloud, and it’s all being enabled by AWS Neuron. Neuron is a Software that include ML compiler and native integration into popular ML frameworks. Our products are being used at scale with external customers like Anthropic and Databricks as well as internal customers like Alexa, Amazon Bedrocks, Amazon Robotics, Amazon Ads, Amazon Rekognition and many more.","department_cost_center":null,"description_short":"In this role you will be responsible for leading a technical team which is critical in providing profiling and optimization tools for the Neuron ML accelerators fleet. You will work closely with the hardware","display_distance":null,"id":"9b6ee497-6b62-4e6f-b653-31959b5bbee0","id_icims":"3105124","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3105124/sr-software-development-engineer-annapurna-labs","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA42\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Cupertino\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Cupertino\",\"coordinates\":\"37.31913,-122.02929\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Cupertino, California, USA\",\"location\":\"US, CA, Cupertino\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC29\"],\"normalizedCityName\":\"Cupertino\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["aws.team-annapurna-labs","aws.team-utility-computing"],"posted_date":"October  9, 2025","preferred_qualifications":"- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $151,300/year in our lowest geographic market up to $261,500/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"WA","title":"Sr. Software Development Engineer, Annapurna Labs","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3105124/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"aws","city":"Seattle","company_name":"Annapurna Labs (U.S.) Inc.","country_code":"USA","description":"AWS Neuron is the complete software stack for the AWS Inferentia and Trainium cloud-scale machine learning accelerators and the Trn1 and Inf1 servers that use them.\u003cbr/\u003e\u003cbr/\u003eAs the Software Development Engineer for the Neuron Foundation Tools Team, you will be responsible for working alongside a team of engineers to develop and maintain high-performance monitoring and profiling tools for machine learning applications and AI accelerators. You will work on design, development, and deployment of the Neuron Profiler and other Neuron Tools. The profiler plays a crucial role to internal and external customers in optimizing AI workloads across hardware platforms such as Trainium and Inferentia devices, by providing deep insights into performance bottlenecks and system behavior. Improving performance of ML Kernels and ML Frameworks.\u003cbr/\u003e\u003cbr/\u003eIn this role, you will manage the full development life cycle of the Neuron Profiler/Tools toolchain, ensuring scalability, reliability, and usability. You will collaborate with cross-functional teams to ensure that the our C++ compiler and runtime generates key information so customers can understand and optimize the performance of our custom hardware. Additionally, you will drive innovations that allow the profiler to support multiple frameworks, such as PyTorch, JAX, and XLA.\u003cbr/\u003e\u003cbr/\u003eA successful candidate will have an established background in building AI/ML and performance analysis tools. Experience with ML-specific profiler tools (like PyTorch Profiler or TensorFlow Profiler) is highly desirable, along with direct customer-facing experience and a strong motivation to achieve results.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e day in the life\u003cbr/\u003e You will work with the executive leadership and other senior management and technical leaders to define product directions and deliver them to customers. We build massive-scale distributed training and inference solutions. This organization builds the full stack of software, servers and chips to accelerate at the highest scale.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003e\u003cbr/\u003eHere at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences. Amazon’s culture of inclusion is reinforced within our 16 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003e\u003cbr/\u003eOur team puts a high value on work-life balance. It isn’t about how many hours you spend at home or at work; it’s about the flow you establish that brings energy to both parts of your life. We believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfillment. We offer flexibility in working hours and encourage you to find your own balance between your work and personal lives.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003e\u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded professional and enable them to take on more complex tasks in the future.\u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Neuron is the complete software stack for the AWS Inferentia and Trainium cloud-scale machine learning accelerators and the Trn1 and Inf1 servers that use them.As the Software Development Engineer","display_distance":null,"id":"d4e5e5f8-80d1-4f19-a8d8-8f34f7f4d2bd","id_icims":"3128560","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3128560/software-development-engineer-neuron-foundation-tools","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA42\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Cupertino\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Cupertino\",\"coordinates\":\"37.31913,-122.02929\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Cupertino, California, USA\",\"location\":\"US, CA, Cupertino\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC29\"],\"normalizedCityName\":\"Cupertino\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["aws.team-annapurna-labs","aws.team-utility-computing","aws.team-sde-sdm"],"posted_date":"November 18, 2025","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $129,300/year in our lowest geographic market up to $223,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-aws-sdm","source_system":"JobCreator","state":"WA","title":"Software Development Engineer, Neuron Foundation Tools","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3128560/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-aws-sdm","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team","business_category":"aws","city":"Cupertino","company_name":"Annapurna Labs (U.S.) Inc.","country_code":"USA","description":"AWS Neuron is the complete software stack for the AWS Inferentia and Trainium cloud-scale machine\u003cbr/\u003elearning accelerators. As a part of the Neuron Frameworks team you'll develop and enhance support PyTorch and JAX for AWS Neuron, working with the open source ecosystem.\u003cbr/\u003e\u003cbr/\u003eYou will develop and extend support for the leading ML frameworks, delivering an outstanding user experience for PyTorch and JAX ML model development on the Trainium and Inferentia accelerators. You will work closely with teams across AWS Neuron including compiler, training and inference optimization to optimize frameworks for AWS's accelerator architectures, and engage closely with the PyTorch and JAX and other ML Framework communities to take advantage of their latest capabilities and improve performance and usability for ML model developers.\u003cbr/\u003e\u003cbr/\u003eA successful candidate will have a experience developing Machine Learning infrastructure and/or ML Frameworks, a demonstrated ability to work with open source communities to influence future community direction, a robust technical ability and a motivation to achieve results. Experience with technologies and tools such as XLA, vLLM or Hugging Face transformers is highly valued.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e*Utility Computing (UC)* \u003cbr/\u003eAWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for their cloud services.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eYou will work with the team to develop, improve and release JAX and PyTorch framework support for AWS Neuron.\u003cbr/\u003e\u003cbr/\u003eYou will understand current and future directions of ML framework development, with a focus on setting the direction for the AWS Neuron framework technology roadmap, shaping the future of framework support on accelerators, and enabling key features for AWS Neuron such as torch.compile().\u003cbr/\u003e\u003cbr/\u003eYou will work closely with the PyTorch and JAX community to actively drive the future directions to improve the experience of developing and optimizing ML models on accelerators.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003e**Why AWS\u003cbr/\u003e**Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003e**Diverse Experiences**\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003e**Work/Life Balance* *\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003e**Inclusive Team Culture* *\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003e**Mentorship and Career Growth**\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. ","department_cost_center":null,"description_short":"AWS Neuron is the complete software stack for the AWS Inferentia and Trainium cloud-scale machinelearning accelerators. As a part of the Neuron Frameworks team you'll develop and enhance support PyTorch","display_distance":null,"id":"9984e725-0244-4297-9473-2cc87342ca90","id_icims":"2977656","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/2977656/senior-software-development-engineer-aws-neuron-frameworks","job_schedule_type":"full-time","location":"US, CA, Cupertino","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Cupertino\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Cupertino\",\"coordinates\":\"37.31913,-122.02929\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Cupertino, California, USA\",\"location\":\"US, CA, Cupertino\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC29\"],\"normalizedCityName\":\"Cupertino\"}"],"normalized_location":"Cupertino, California, USA","optional_search_labels":["aws.team-utility-computing","aws.team-annapurna-labs"],"posted_date":"May  8, 2025","preferred_qualifications":"- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $151,300/year in our lowest geographic market up to $261,500/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"CA","title":"Senior Software Development Engineer, AWS Neuron Frameworks","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/2977656/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of program or project management experience\u003cbr/\u003e- 5+ years of defining and implementing process improvement initiatives using data and metrics experience\u003cbr/\u003e- Knowledge of Excel (Pivot Tables, VLookUps) at an advanced level and SQL\u003cbr/\u003e- Experience using data and metrics to determine and drive improvements\u003cbr/\u003e- Experience working cross functionally with tech and non-tech teams\u003cbr/\u003e- Bachelor's degree in supply chain, business, engineering, finance or related technical or quantitative field\u003cbr/\u003e- 3+ years of maintenance planner/scheduler in industrial maintenance, manufacturing, or distribution industries experience\u003cbr/\u003e- 4+ years of Computerized Maintenance Management System (CMMS) experience\u003cbr/\u003e- Experience managing inventory in warehousing, retail or distribution setting","business_category":"transportation-and-logistics","city":"Calgary","company_name":"Amazon Canada Fulfillment Services, ULC","country_code":"CAN","description":"  Amazon Worldwide Operations is looking for Program Managers to own strategic, tactical, cross-functional and technology projects and programs within Amazon Transportation Services. These roles require scoping and creating project plans, developing processes, coordinating and driving execution, and communicating to senior management on status, risks and process/product changes. Cross-team coordination, project management and executive presentation skills are essential. \u003cbr/\u003e\u003cbr/\u003e***This role can be based in any Canadian Amazon location***\u003cbr/\u003e\u003cbr/\u003e   \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Be a network level Subject Matter Expert (SME) on the CMMS (Computerized Maintenance Management System), train and assist the local Reliability Maintenance Engineering Planner and support network initiatives.\u003cbr/\u003e• Drive Global standards roll-out in cross-country initiatives and participate in Global led projects.\u003cbr/\u003e• Be a CMMS key user and drive programs to roll out new functionality, procedures, scheduling or reports. Monitor standards implementation through reporting and audits.\u003cbr/\u003e• Analyze and improve forecasting of preventative maintenance routines to make equipment maintenance less intrusive and more effective.\u003cbr/\u003e• Compile equipment information, performance metrics and machine histories and make recommendations for improvements based on their findings to the entire network.\u003cbr/\u003e• Work with the Global Reliability Maintenance Engineering network and initiatives on cost reduction and process improvement for spare parts management, equipment maintenance and maintenance routines.\u003cbr/\u003e• Ability to Travel up to 50%\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e• Working in a team where talent and potential have more value than paper-based qualifications\u003cbr/\u003e• Global opportunities to develop in role and choose long term career paths\u003cbr/\u003e• Working at the cusp of high-speed automated logistics technology\u003cbr/\u003e• Finding and conquering emerging challenges as the company grows and scales rapidly\u003cbr/\u003e• Working in data driven environment where accuracy and clarity is prized above personal opinion\u003cbr/\u003e\u003cbr/\u003eAmazon offers a full range of benefits for you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include:\u003cbr/\u003e1. Medical, Dental, and Vision Coverage\u003cbr/\u003e2. Maternity and Parental Leave Options\u003cbr/\u003e3. Paid Time Off (PTO)\u003cbr/\u003e4. 401(k) Plan\u003cbr/\u003e\u003cbr/\u003eIf you are not sure that every qualification on the list above describes you exactly, we'd still love to hear from you! At Amazon, we value people with unique backgrounds, experiences, and skillsets. If you’re passionate about this role and want to make an impact on a global scale, please apply!","department_cost_center":null,"description_short":"  Amazon Worldwide Operations is looking for Program Managers to own strategic, tactical, cross-functional and technology projects and programs within Amazon Transportation Services. These roles require","display_distance":null,"id":"2886ccee-f97d-4f13-907f-04b4278a2efb","id_icims":"3186542","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Program Management","job_function_id":null,"job_path":"/en/jobs/3186542/program-manager-senior-reliability-maintenance-and-engineering-rme-planner-global-planning-team-gpt","job_schedule_type":"full-time","location":"CA, AB, Calgary","locations":["{\"normalizedStateName\":\"Alberta\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Calgary\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, AB, Calgary\",\"coordinates\":\"51.04532,-114.06301\",\"normalizedCountyName\":\"Alberta\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Calgary, Alberta, CAN\",\"location\":\"CA, AB, Calgary\",\"region\":\"AB\",\"buildingCodeList\":[\"YYC062\",\"YYC50\",\"YYC4\",\"RLBC\",\"YYC1\",\"XCAB\",\"DAA1\",\"YYC51\",\"YYC3\",\"GCG1\",\"YYC250\",\"YYC6\",\"XYY3\",\"HYC2\",\"DCG1\",\"DCG4\",\"SAD1\",\"YYC52\",\"DCG3\",\"YYC11\",\"CYYC\",\"YYC251\"],\"normalizedCityName\":\"Calgary\"}","{\"normalizedStateName\":\"Ontario\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Mississauga\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, ON, Mississauga\",\"coordinates\":\"43.58726,-79.64494\",\"normalizedCountyName\":\"Peel\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Mississauga, Ontario, CAN\",\"location\":\"CA, ON, Mississauga\",\"region\":\"ON\",\"buildingCodeList\":[\"DTO4\",\"DOI6\",\"DTO2\",\"RLBE\",\"YYZ1\",\"DOI5\",\"YYZ251\",\"ZAO7\",\"DTR4\",\"LSQO\",\"DTY4\",\"KTO2\",\"KTO5\",\"YYZ23\"],\"normalizedCityName\":\"Mississauga\"}"],"normalized_location":"Calgary, Alberta, CAN","optional_search_labels":["ops.lander-emea-rme-reliability"],"posted_date":"February 22, 2026","preferred_qualifications":"- 3+ years of driving end to end delivery, and communicating results to senior leadership experience\u003cbr/\u003e- 3+ years of driving process improvements experience\u003cbr/\u003e- Experience in stakeholder management, dealing with multiple stakeholders at varied levels of the organization\u003cbr/\u003e- Experience building processes, project management, and schedules\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(34, 34, 34)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. As a total compensation company, Amazon's package may include other elements such as sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon offers comprehensive benefits including health insurance (medical, dental, vision, prescription, basic life \u0026amp; AD\u0026amp;D insurance), Registered Retirement Savings Plan (RRSP), Deferred Profit Sharing Plan (DPSP), paid time off, and other resources to improve health and well-being. We thank all applicants for their interest, however only those interviewed will be advised as to hiring status.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eCAN, AB, Calgary - 69,700.00 - 116,400.00 CAD annually\u003cbr/\u003eCAN, ON, Mississauga - 69,700.00 - 116,400.00 CAD annually","primary_search_label":"transportation-and-logistics.int-ops-global-ops-svcs","source_system":"JobCreator","state":"AB","title":"Program Manager- Senior Reliability, Maintenance, and Engineering (RME) Planner, Global Planning Team (GPT)","university_job":null,"updated_time":"39 minutes","url_next_step":"https://account.amazon.com/jobs/3186542/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"int-ops-global-ops-svcs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team\u003cbr/\u003e- Experience programming in Python","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon's low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon Leo will serve people and organizations operating in locations without reliable connectivity.\u003cbr/\u003e\t\u003cbr/\u003eExport Control Requirement: Due to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eInnovation is part of our DNA! Our goal is to be Earth's most customer centric company, and we are just getting started. We need people who want to join an ambitious program that continues to push the state of the art in space based systems design.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eYou should be comfortable with a high degree of ambiguity and relish the idea of solving problems that haven't been solved at scale before. Along the way, we guarantee that you will learn a lot, have fun and make a positive impact on tens of millions of people.\u003cbr/\u003e\u003cbr/\u003eIn this role, you will:\u003cbr/\u003e\t• Architect and build software to automate hardware test systems\u003cbr/\u003e\t• Develop software infrastructure to support test case execution\u003cbr/\u003e\t• Architect and build automation to support development (CI/CD)\u003cbr/\u003e\t• Align with various stakeholders on software requirements\u003cbr/\u003e\t• Document software requirements from users\u003cbr/\u003e\t• Support manufacturing as well as new product development\u003cbr/\u003e\t• Enable automated data collection, data analysis\u003cbr/\u003e\t• Deliver end-user documents\u003cbr/\u003e\t• Own and execute software quality and release process\u003cbr/\u003e\t• Work with electrical test equipment\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou will have the opportunity to write software to test exciting products and help us bring our idea to reality.  Your software will enable the team to validate our designs and ensure all our hardware is space-worthy.  You will make daily decision on how to best create and deliver these tools.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThis Software Development Engineer will have the opportunity to be a member of the Hardware Validation Team working within the wider Electrical Engineering Team.   This highly collaborative group of engineers has a diverse range of backgrounds and knowledge and looking for help to build a scalable and reliable test automation solution.  The team support both internal test needs as well as the needs of the manufacturing team.  They like to leverage and share work across the entire organization as well as utilize AWS resources and tools to accelerate their work.","department_cost_center":null,"description_short":"Amazon Leo is Amazon's low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to","display_distance":null,"id":"eb52c32c-1467-45c5-aab3-6da28537d850","id_icims":"3153885","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3153885/senior-software-dev-engineer-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA111\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":["kuiper-sde"],"posted_date":"January  6, 2026","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $151,300/year in our lowest geographic market up to $261,500/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Senior Software Dev Engineer, Amazon Leo","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3153885/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"alexa-and-amazon-devices","city":"Austin","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is an initiative to launch a constellation of Low Earth Orbit satellites that will provide low-latency, high-speed broadband connectivity to unserved and underserved communities around the world. As a Embedded Software Engineer you will be a part of the team participating in the definition and implementation of the communication software architecture of Amazon Leo’s broadband wireless modem. You will participate in all phases of physical layer software development, from architecture design, through requirements, implementation, test, and operational support. This is a unique opportunity to innovate and define novel wireless technology with few legacy constraints. The team develops the communication system of Leo and validates overall performance within key metrics such as throughput, latency, system availability, packet loss etc.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Develop embedded software in assembly, C, and C++ in a real-time operating system environment for broadband satellite communication modem systems.\u003cbr/\u003e- Work closely with ASIC, communication systems and software teams to support system bring-ups, end-to-end integration, and testing. \u003cbr/\u003e- Ability to adapt design and test activities based on current HW/SW capabilities delivered by the development teams.\u003cbr/\u003e- Support end-to-end testing using lab equipment such as Vector Signal Generators and Analyzers, Packet Generators, Channel Emulators. Contribute to development-test bring up procedures with Linux, Python, bash scripting etc.\u003cbr/\u003e- Support operations and maintenance using telemetry to validate link performance over key indicators such as throughput, latency, etc.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs part of our software engineering team, you will design and implement software to deploy on Leo satellites in R\u0026D and commercial operation. You will also develop tests and debug capabilities to validate implementations on ground and on orbit. You will work in a collaborative environment with teams in hardware development, software development and network operations. You need to be flexible and responsive to fast changing priorities and issues.","department_cost_center":null,"description_short":"Amazon Leo is an initiative to launch a constellation of Low Earth Orbit satellites that will provide low-latency, high-speed broadband connectivity to unserved and underserved communities around the world.","display_distance":null,"id":"8d7056e6-3a3a-45f9-886f-1a40a33e417f","id_icims":"3163715","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3163715/embedded-sw-engineer-wireless-systems","job_schedule_type":"full-time","location":"US, TX, Austin","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS13\"],\"normalizedCityName\":\"Austin\"}"],"normalized_location":"Austin, Texas, USA","optional_search_labels":[],"posted_date":"January 21, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Austin - 143,700.00 - 194,400.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"TX","title":"Embedded SW Engineer, Wireless Systems ","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3163715/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of analyzing and interpreting data with Redshift, Oracle, NoSQL etc. experience\u003cbr/\u003e- Experience with data visualization using Tableau, Quicksight, or similar tools\u003cbr/\u003e- Experience with one or more industry analytics visualization tools (e.g. Excel, Tableau, QuickSight, MicroStrategy, PowerBI) and statistical methods (e.g. t-test, Chi-squared)\u003cbr/\u003e- Experience with scripting language (e.g., Python, Java, or R)","business_category":"operations","city":"Toronto","company_name":"Amazon Development Centre Canada ULC","country_code":"CAN","description":"Amazon has the world’s most complex supply chain: we fulfill global demand for hundreds of millions of products at lightning fast delivery speeds. We need your skills to optimize our supply chain, with the end goal of delighting our customers. A core part of the supply chain operations is Demand and Inbound Forecasting: We forecast the demand and arrival of tens of millions of products. The forecasts are used to make many decisions, such as automatically order hundreds of millions worth of inventory, decide where to place that inventory, and establish labor plans for WW warehouses.\u003cbr/\u003e\u003cbr/\u003eWe are looking for a Business Intelligence Engineer to develop new tools and metrics to oversee the delivery of analytics solutions across the product development lifecycle, from entitlement through implementation and ongoing business operations. \u003cbr/\u003e\u003cbr/\u003eA successful candidate will be customer obsessed - the Forecasting org has 50+ unique customers. You will need to balance technical execution with customer needs. You will be comfortable navigating an dynamic environment, know how to confirm and reconfirm assumptions, and be able to communicate your point of view.","department_cost_center":null,"description_short":"Amazon has the world’s most complex supply chain: we fulfill global demand for hundreds of millions of products at lightning fast delivery speeds. We need your skills to optimize our supply chain, with","display_distance":null,"id":"a9618f48-2969-4652-8bd0-70baf5a15ab2","id_icims":"3183074","is_intern":null,"is_manager":null,"job_category":"Business Intelligence","job_family":"Business Intel Engineer","job_function_id":null,"job_path":"/en/jobs/3183074/business-intelligence-engineer-forecasting-labs-analytics","job_schedule_type":"full-time","location":"CA, ON, Toronto","locations":["{\"normalizedStateName\":\"Ontario\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Toronto\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, ON, Toronto\",\"coordinates\":\"43.64869,-79.38544\",\"normalizedCountyName\":\"Toronto\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Toronto, Ontario, CAN\",\"location\":\"CA, ON, Toronto\",\"region\":\"ON\",\"buildingCodeList\":[\"YYZ14\"],\"normalizedCityName\":\"Toronto\"}"],"normalized_location":"Toronto, Ontario, CAN","optional_search_labels":[],"posted_date":"February 17, 2026","preferred_qualifications":"- Master's degree, or Advanced technical degree\u003cbr/\u003e- Knowledge of data modeling and data pipeline design\u003cbr/\u003e- Experience with statistical analysis, co-relation analysis\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(34, 34, 34)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. As a total compensation company, Amazon's package may include other elements such as sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon offers comprehensive benefits including health insurance (medical, dental, vision, prescription, basic life \u0026amp; AD\u0026amp;D insurance), Registered Retirement Savings Plan (RRSP), Deferred Profit Sharing Plan (DPSP), paid time off, and other resources to improve health and well-being. We thank all applicants for their interest, however only those interviewed will be advised as to hiring status.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eCAN, ON, Toronto - 61,400.00 - 102,600.00 CAD annually","primary_search_label":"operations.team-supply-chain-optimization","source_system":"JobCreator","state":"ON","title":"Business Intelligence Engineer, Forecasting \u0026 Labs Analytics","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3183074/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-supply-chain-optimization","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of analyzing and interpreting data with Redshift, Oracle, NoSQL etc. experience\u003cbr/\u003e- Experience with data modeling, warehousing and building ETL pipelines\u003cbr/\u003e- Experience with data visualization using Tableau, Quicksight, or similar tools\u003cbr/\u003e- Experience writing complex SQL queries\u003cbr/\u003e- Experience in Statistical Analysis packages such as R, SAS and Matlab\u003cbr/\u003e- Experience using SQL to pull data from a database or data warehouse and scripting experience (Python) to process data for modeling","business_category":"operations","city":"Toronto","company_name":"Amazon Development Centre Canada ULC","country_code":"CAN","description":"The Supply Chain Optimization Technologies (SCOT) organization, has an immediate need for a creative business intelligence engineer (BIE) with a\u003cbr/\u003epassion for building systems that have a measurable impact. The right candidate will be innovative and\u003cbr/\u003etechnically versatile. You will have the opportunity to work with one of the largest and most complex\u003cbr/\u003ewarehouses in the world to gather insights using from across Amazon.\u003cbr/\u003e\u003cbr/\u003eAs a BIE, you should be an expert in the architecture of data warehouse solutions for the enterprise\u003cbr/\u003eusing multiple platforms. You should excel in the design, creation, management, and business use of\u003cbr/\u003eextremely large datasets. Excellent business and communication skills are required to work with\u003cbr/\u003ebusiness analysts and data engineers to understand how best to design reporting and analytics data\u003cbr/\u003esystems.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eApply mining, quantitative analysis, and statistical models to understand how our customers interact\u003cbr/\u003ewith us and identify ways to improve the customer experience and meet our goals\u003cbr/\u003e• Build scalable solutions and self-serve platforms that will provide insights to inform business decision\u003cbr/\u003emaking\u003cbr/\u003e• Optimizing the performance of business-critical queries and dealing with ETL job-related issues\u003cbr/\u003e• Gathering and understanding data requirements, working with the team to achieve high quality data\u003cbr/\u003eingestion and building systems that can process, transform, and store the data in various relational and non-relational stores\u003cbr/\u003e• Dive deeply into technical details (e.g., key dependencies, design choices, operability, etc.) with\u003cbr/\u003eengineering teams and drive constructive technical discussions. Extracting and combining data from\u003cbr/\u003evarious heterogeneous data sources\u003cbr/\u003e• Build and evaluate end-to-end designs for strengths and weaknesses (quality, scalability, latency,\u003cbr/\u003esecurity, performance, data integrity, etc.)\u003cbr/\u003e• Create interactive visual dashboards with Tableau and QuickSight\u003cbr/\u003e• Write clear documentation, architecture documents and create an engineering roadmap\u003cbr/\u003e• Exploring and learning the latest AWS technologies to provide new capabilities and increase efficiency.\u003cbr/\u003eMembers of this team will be challenged to innovate use the latest big data techniques. We are looking\u003cbr/\u003efor people who are motivated by thinking big, moving fast, and exploring business insights. If you love to implement solutions to complex problems while working hard, having fun, and making history, this may be the opportunity for you\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include:\u003cbr/\u003e1. Medical, Dental, and Vision Coverage\u003cbr/\u003e2. Maternity and Parental Leave Options\u003cbr/\u003e3. Paid Time Off (PTO)\u003cbr/\u003e4. RRSP","department_cost_center":null,"description_short":"The Supply Chain Optimization Technologies (SCOT) organization, has an immediate need for a creative business intelligence engineer (BIE) with apassion for building systems that have a measurable impact.","display_distance":null,"id":"8bb7da99-370f-4f18-8a0a-af522d632906","id_icims":"3173167","is_intern":null,"is_manager":null,"job_category":"Business Intelligence","job_family":"Business Intel Engineer","job_function_id":null,"job_path":"/en/jobs/3173167/business-intelligence-engineer-forecasting-labs-analytics","job_schedule_type":"full-time","location":"CA, ON, Toronto","locations":["{\"normalizedStateName\":\"Ontario\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Toronto\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, ON, Toronto\",\"coordinates\":\"43.64869,-79.38544\",\"normalizedCountyName\":\"Toronto\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Toronto, Ontario, CAN\",\"location\":\"CA, ON, Toronto\",\"region\":\"ON\",\"buildingCodeList\":[\"YYZ14\"],\"normalizedCityName\":\"Toronto\"}"],"normalized_location":"Toronto, Ontario, CAN","optional_search_labels":[],"posted_date":"February  3, 2026","preferred_qualifications":"- Experience with AWS solutions such as EC2, DynamoDB, S3, and Redshift\u003cbr/\u003e- Experience in data mining, ETL, etc. and using databases in a business environment with large-scale, complex datasets\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(34, 34, 34)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. As a total compensation company, Amazon's package may include other elements such as sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon offers comprehensive benefits including health insurance (medical, dental, vision, prescription, basic life \u0026amp; AD\u0026amp;D insurance), Registered Retirement Savings Plan (RRSP), Deferred Profit Sharing Plan (DPSP), paid time off, and other resources to improve health and well-being. We thank all applicants for their interest, however only those interviewed will be advised as to hiring status.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eCAN, ON, Toronto - 76,400.00 - 127,600.00 CAD annually","primary_search_label":"operations.team-supply-chain-optimization","source_system":"JobCreator","state":"ON","title":"Business Intelligence Engineer, Forecasting \u0026 Labs Analytics","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3173167/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-supply-chain-optimization","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}