{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Allgemeine Hochschulreife, Fachhochschulreife/ fachgebundene Hochschulreife\u003cbr/\u003e- Affinität für das Fach Mathematik\u003cbr/\u003e- Fließende Deutschkenntnisse in Wort und Schrift (C1-Niveau)\u003cbr/\u003e- Fortgeschrittene Englischkenntnisse in Wort und Schrift (B2-Niveau)\u003cbr/\u003e- Umgang mit MS-Office (insbesondere Kenntnisse in Excel, Word und Power Point)","business_category":"auta","city":"Horn-bad Meinberg","company_name":"Amazon Horn-Bad Meinberg GmbH - O88","country_code":"DEU","description":"Amazon ist seit über 20 Jahren in Deutschland aktiv. In mehr als 20 Logistikzentren sowie kleineren Verteil- und Sortierzentren kümmern wir uns um alles: ab dem Zeitpunkt, in dem Kund:innen auf „Jetzt kaufen“ klicken, bis zum Moment der Lieferung an die Haustür. \u003cbr/\u003eEs braucht engagierte Mitarbeiter:innen, viel Koordination und hochmoderne Technologien, um jederzeit schnell und zuverlässig liefern zu können. Rund 20.000 Mitarbeiter:innen sind daher in verschiedensten Bereichen der Logistik tätig: Arbeitssicherheit, Gesundheitsmanagement, IT, Personalwesen, Prozessoptimierung, Technik, Versand und vielen mehr. Mit der Einführung hochmoderner Transportroboter an vielen unserer Standorte entstehen neue Entwicklungs- und Karrieremöglichkeiten für all unsere Mitarbeiter:innen.\u003cbr/\u003eWir glauben, dass alle, die für uns arbeiten, das Potenzial haben, zu wachsen – unabhängig von der Herkunft oder wo man bei Amazon angefangen hat. Wir wissen, dass Talent viele Formen hat. Wenn Menschen gut sind in dem, was sie tun, und Neues erlernen möchten, wollen wir ihnen dabei helfen. Wir schreiben Geschichte. Und die gute Nachricht ist: Wir haben gerade erst angefangen. Dies ist deine Chance, gemeinsam mit uns Geschichte zu schreiben.\u003cbr/\u003e\u003cbr/\u003eBeginn: 01.08.2026 \u003cbr/\u003eDauer: 3,5 Jahre\u003cbr/\u003eStandort: Horn-Bad Meinberg \u003cbr/\u003eHochschule: IU Bielefeld (duales mystudium)\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eDeine Aufgaben:\u003cbr/\u003e\u003cbr/\u003e- Planung, Platzierung und Kontrolle von Gütern, Informationen \u0026 Technik\u003cbr/\u003e- Einsatzplanung \u0026 Mitarbeiterführung\u003cbr/\u003e- Eigenständige Durchführung von Projekten der Lager-, Beschaffungs-, Transport-, Entsorgungs-, Produktions- und Distributionslogistik","department_cost_center":null,"description_short":"Amazon ist seit über 20 Jahren in Deutschland aktiv. In mehr als 20 Logistikzentren sowie kleineren Verteil- und Sortierzentren kümmern wir uns um alles: ab dem Zeitpunkt, in dem Kund:innen auf „Jetzt","display_distance":null,"id":"720e6586-70df-4460-9a1f-afcdbdd31421","id_icims":"3104943","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Apprentice Job Family","job_function_id":null,"job_path":"/en/jobs/3104943/duales-studium-bwl-logistik-w-m-d","job_schedule_type":"full-time","location":"DE, NW, Horn-bad Meinberg","locations":["{\"normalizedStateName\":\"North-Rhine-Westphalia\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Horn-bad Meinberg\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, NW, Horn-bad Meinberg\",\"coordinates\":\"51.87319,8.94522\",\"normalizedCountyName\":\"Lippe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Horn-Bad Meinberg, North-Rhine-Westphalia, DEU\",\"location\":\"DE, NW, Horn-bad Meinberg\",\"region\":\"NW\",\"buildingCodeList\":[\"PAD2\"],\"normalizedCityName\":\"Horn-Bad Meinberg\"}"],"normalized_location":"Horn-Bad Meinberg, North-Rhine-Westphalia, DEU","optional_search_labels":[],"posted_date":"October  9, 2025","preferred_qualifications":"- Ausgeprägte Kommunikationsfähigkeit\u003cbr/\u003e- Eigeninitiative, Vorbildfunktion und „Hands-on-Mentalität“\u003cbr/\u003e- Interesse Führungsverantwortung zu tragen\u003cbr/\u003e- Bist du interessiert? Wir freuen uns darauf, von Dir zu hören! Bitte bewirb Dich mit deinen vollständigen Bewerbungsunterlagen auf Deutsch (Lebenslauf, Zeugniskopie – ein PDF mit 5 MB max.). Sollten die Bewerbungsunterlagen nicht vollständig sein, können wir deine Bewerbung leider nicht berücksichtigen! Bitte beachte, dass du im Rahmen des Einstellungsprozesses ein Videointerview über ein externes Tool durchführen musst. Bitte sende uns Deine Bewerbungsunterlagen in Deutsch. Mit der Übersendung Deines Lebenslaufs erklärst Du Dich mit der Speicherung Deiner Daten zum Zwecke der Feststellung der Eignung für dieses und zukünftige Stellenangebot/e in der weltweiten Amazon Konzernpersonaldatenbank, die derzeit in den USA geführt wird, einverstanden.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"auta.apprenticeships","source_system":"JobCreator","state":"NW","title":"Duales Studium- BWL/ Logistik (w/m/d)","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3104943/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"apprenticeships","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- We seek a strong, self-driven leader with demonstrated ability to motivate, drive, manage and grow a fast paced operations team. This person should possess strong people and performance management skills, and have at least three years’ experience in an operational people management role.\u003cbr/\u003e- They should also have strong business acumen and be able to create, communicate and achieve a vision.\u003cbr/\u003e- Substantial people management experience ideally within a fast paced, metric driven operations team.\u003cbr/\u003e- Must possess exceptional and demonstrable operational, managerial, analytical, communication and interpersonal skills.\u003cbr/\u003e- Advanced working knowledge of MS Office required (esp. MS Excel). Knowledge of SQL beneficial but not essential.\u003cbr/\u003e- Must be self-motivated with good attention to detail, commercial awareness with sound judgement and decision making skills.\u003cbr/\u003e- Have a proven ability to drive and motivate staff.\u003cbr/\u003e- Have experience managing AML and Compliance teams.","business_category":"selling-partner-services","city":"Ireland - Virtual","company_name":"Amazon Ireland Support Services Limited","country_code":"IRL","description":"Join one of the most important teams at Amazon and make a difference. The Verification and Risk Management Operations (VRMO) team is charged with safeguarding all Amazon marketplaces to ensure long-term buyer satisfaction with their experiences. We achieve this through a combination of automated and manual investigations of the buyers and sellers on our marketplace.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Supervise, coordinate, and direct the activities of VRMO staff.\u003cbr/\u003e• management and motivational ability - In charge of managing a team of Team Managers and taking appropriate actions based on processes, tools and high-judgement decisions to preserve the buyer and seller experience\u003cbr/\u003e• Provide leadership support to their team and manage them to achieve and constantly improve service levels based on forecast and capacity, by meeting / achieving targets, deliver process improvement, ensure road mapped project execution (and identify new ones), and focus on the people development of their team\u003cbr/\u003e• Recommending and implementing changes to process and work methods. Innovating and designing new or improved processes to support the business needs\u003cbr/\u003e• Create and monitor reports and metrics for tracking purposes for on-going monitoring as well as new products. Identifies trends in team performance and recommends/ implements change to constantly raise the Performance levels in the team\u003cbr/\u003e• Implement best-in-class processes and practices for maintaining and exceeding productivity, quality and service level agreements\u003cbr/\u003e• Provide focused feedback loops for managers based on crisp performance and quality data. Reward good performers and performance manage low performers.\u003cbr/\u003e• Analyze the key levers of the business to identify trends and proactively act to improve quality and efficiency. Recruit top-quality investigators\u003cbr/\u003e• People Development: by developing the career and skills of their Managers and Investigator teams through continuous closure of performance feedback loops. Is expected to setup governance mechanisms on people processes. The manager would be responsible for engaging people, identifying training needs within his teams and accordingly up-skill. Responsible for creation of a roadmap based on improvement areas and career aspirations and track adherence. Should work towards creating a succession plan within their team. ","department_cost_center":null,"description_short":"Join one of the most important teams at Amazon and make a difference. The Verification and Risk Management Operations (VRMO) team is charged with safeguarding all Amazon marketplaces to ensure long-term","display_distance":null,"id":"eaa6d05c-7975-4861-8e44-a2d0b5f72b67","id_icims":"3115894","is_intern":null,"is_manager":null,"job_category":"Investigation \u0026 Loss Prevention","job_family":"Investigation","job_function_id":null,"job_path":"/en/jobs/3115894/kyc-investigation-manager-vrmo","job_schedule_type":"full-time","location":"IE, Ireland - Virtual","locations":["{\"normalizedCountryCode\":\"IRL\",\"city\":\"Ireland - Virtual\",\"countryIso3a\":\"IRL\",\"countryIso2a\":\"IE\",\"locationNonStemming\":\"Ireland, Ireland - Virtual\",\"coordinates\":\"53.34807,-6.24828\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"Ireland\",\"normalizedLocation\":\"IRL\",\"location\":\"IE, Ireland - Virtual\",\"region\":\"\",\"buildingCodeList\":[\"VIR\"]}"],"normalized_location":"IRL","optional_search_labels":[],"posted_date":"October 27, 2025","preferred_qualifications":"- Experience working in risk, fraud or compliance organizations\u003cbr/\u003e- Bachelor's degree or above\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"selling-partner-services.team-selling-partner-risk","source_system":"JobCreator","state":null,"title":"KYC Investigation Manager, VRMO","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3115894/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-selling-partner-risk","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in professional, non-internship software development\u003cbr/\u003e- Experience programming with at least one modern language such as Java, C++, or C# including object-oriented design\u003cbr/\u003e- Experience contributing to the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- Experience working on production systems.\u003cbr/\u003e- Experience working with OO design/development principles.\u003cbr/\u003e- Experience working with RESTful architecture for web services.","business_category":"alexa-and-amazon-devices","city":"Madrid","company_name":"Amazon Spain Services, S.L.U.","country_code":"ESP","description":"Ring is looking for a Software Development Engineer who will help us create the next generation of apps and services. In this role, you will work as a part of the Ring backend team working closely with a cross-functional team of engineers, and product managers to design, test, learn, and iterate on solutions in a fast-paced environment.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe Ring backend team is responsible for the heart of what drives the experiences our Neighbors use to interact with our doorbells, cameras, and other devices. As an engineer with the Ring backend team, you will get to build low-latency systems with the required uptime of a security system. You will also get to work alongside a talented team, invested in making each other successful, as well as building revolutionary features for our products.\u003cbr/\u003e\u003cbr/\u003eResponsibilities\u003cbr/\u003e- Design and document distributed systems and microservices.\u003cbr/\u003e- Implement robust and maintainable code with clear and maintained documentation.\u003cbr/\u003e- Deliver customer value in iterative fashion while working towards longer term systems to solve roadmap goals with increasing efficiency.\u003cbr/\u003e- Communicate status and changes to the work they are responsible and accountable for, keep all stakeholders informed of changes and updates to original plan.\u003cbr/\u003e- Implement test automation on all code implemented through unit testing and integration testing.","department_cost_center":null,"description_short":"Ring is looking for a Software Development Engineer who will help us create the next generation of apps and services. In this role, you will work as a part of the Ring backend team working closely with","display_distance":null,"id":"c0ff20cb-0c83-4e18-a051-689065729dea","id_icims":"3136230","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3136230/software-development-engineer-ring-ventures","job_schedule_type":"full-time","location":"ES, M, Madrid","locations":["{\"normalizedStateName\":\"Community of Madrid\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Madrid\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, M, Madrid\",\"coordinates\":\"40.42024,-3.68755\",\"normalizedCountyName\":\"Madrid\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Madrid, Community of Madrid, ESP\",\"location\":\"ES, M, Madrid\",\"region\":\"M\",\"buildingCodeList\":[\"MAD12\"],\"normalizedCityName\":\"Madrid\"}"],"normalized_location":"Madrid, Community of Madrid, ESP","optional_search_labels":["alexa-and-amazon-devices.team-software-development-job-family"],"posted_date":"December  2, 2025","preferred_qualifications":"- Experience programming with at least one software programming language\u003cbr/\u003e- Master’s degree in Computer Science or related field.\u003cbr/\u003e- Full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience.\u003cbr/\u003e- Experience working with RESTful architecture for web services.\u003cbr/\u003e- Experience working with AWS services (CloudFormation, DynamoDB, CloudWatch).\u003cbr/\u003e- Experience working with cloud services and an understanding of design for scalability, performance and reliability.\u003cbr/\u003e- Strong communication and interpersonal skills.\u003cbr/\u003e- Knowledge on Agentic AI, such as Amazon Bedrock or Strands.\u003cbr/\u003e- Knowledge of professional software engineering practices \u0026 best practices for full software development life cycle, including coding standards, code reviews, source control management, continuous deployments, testing and operation.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"alexa-and-amazon-devices.team-ring-key-blink","source_system":"JobCreator","state":"M","title":"Software Development Engineer, Ring Ventures","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3136230/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-ring-key-blink","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- Experience with computer hardware troubleshooting and repair\u003cbr/\u003e- Experience in networking","business_category":"aws","city":"Zaragoza","company_name":"Amazon Data Services Spain, S.L.","country_code":"ESP","description":"\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eWe are looking for Data Center Technicians to join our expanding Infrastructure Operations team. Data Center Technicians are the primary resolver and troubleshoot and solve a range of datacenter infrastructure issues including, but not limited to: hardware, fiber, networking, and related problems. You will be part of the Data Center Operations (DCO) team, overseeing the operation and maintenance of the IT infrastructure and hardware for data centers in AWS Cloud regions. You will become the primary resolver for your support team, and gain troubleshooting skills on different hardware and software cases. \u003cbr/\u003eYou will be able to troubleshoot and solve most infrastructure issues and engage other appropriate solutions groups on more complex problems to drive solutions.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tSAFETY\u003cbr/\u003eFollow and maintain the highest safety standards and diligently encourage a world-class safety culture. Own the safety initiatives and projects to foster a strong safety culture.\u003cbr/\u003e\u003cbr/\u003e•\tDATA CENTER OPERATIONS (DCO)\u003cbr/\u003e\u003cbr/\u003eThis position involves: \u003cbr/\u003eo\tDiagnosing hardware and network problems followed by physical repairs\u003cbr/\u003eo\tTroubleshooting events within internal Service Level Agreements (SLAs)\u003cbr/\u003eo\tPerforming root cause analysis of equipment failures\u003cbr/\u003e\u003cbr/\u003e•\tManual handling and lifting of equipment may be required (weight limits in accordance with regulations)\u003cbr/\u003e•\tWorking rotating shifts (morning/late/night) as well as weekends to maintain the 24/7 data center environment \u003cbr/\u003e•\tOn-call rotation reaction to off-duty emergency calls \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"8c9bcecb-7766-426d-819b-3b314545550d","id_icims":"2840375","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/2840375/data-center-technician-zaragoza-data-center-operations","job_schedule_type":"full-time","location":"ES, Zaragoza","locations":["{\"normalizedStateName\":\"Aragon\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Zaragoza\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, Zaragoza\",\"coordinates\":\"41.65184,-0.8811\",\"normalizedCountyName\":\"Zaragoza\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Zaragoza, Aragon, ESP\",\"location\":\"ES, Zaragoza\",\"region\":\"\",\"buildingCodeList\":[\"ZAZ62\"],\"normalizedCityName\":\"Zaragoza\"}"],"normalized_location":"Zaragoza, Aragon, ESP","optional_search_labels":["aws.team-ais","aws.team-dc","amazon-web-services.data-center-spain"],"posted_date":"November 26, 2024","preferred_qualifications":"- Experience dealing effectively with customers during problem resolution and operating efficiently under pressure\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-it-services","source_system":"JobCreator","state":null,"title":"Data Center Technician (Zaragoza), Data Center Operations","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/2840375/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-it-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Knowledge of engineering practices and patterns for the full software/hardware/networks development life cycle, including coding standards, code reviews, source control management, build processes, testing, certification, and livesite operations\u003cbr/\u003e- Experience managing engineers\u003cbr/\u003e- Experience partnering with product and program management teams\u003cbr/\u003e- Experience delivering products against plan in a fast-paced, multi-disciplined, distributed-responsibility and often ambiguous environment\u003cbr/\u003e- Experience leading development of applications backed by AWS services or using other cloud based technologies and services experience\u003cbr/\u003e- Software Engineering experience as well as Team mgmt. experience.","business_category":"alexa-and-amazon-devices","city":"Madrid","company_name":"Amazon Spain Services, S.L.U.","country_code":"ESP","description":"As Manager of Software Engineering, Ring Subscriptions this role will lead the Ring Subscription team in Madrid. This is a visible \u0026 impactful role as the individual in this role will own growing the team to delivery features \u0026 customer innovation for the Ring Subscription products. \u003cbr/\u003e\u003cbr/\u003eThis role will work closely with both the engineering leadership \u0026 product team to delivery on the longer team vision. With a strong background in leading teams running highly scalable business critical systems and a keen focus on operational excellence \u0026 automation an individual in this role will own the delivery of a reliable end-to-end experience. The role will also be responsible for leaning in to guide the strategic technical direction of the subscription products.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Lead the engineering and operations roadmap for the team.\u003cbr/\u003e- Execute on the vision and strategy for Ring subscription software platform.\u003cbr/\u003e- Monitor, refine and manage key customer based metrics.\u003cbr/\u003e- Work with the subscription product teams to deliver on new features and products.\u003cbr/\u003e- Drive engineering best practices around security, privacy and reliability into the team day-to-day.","department_cost_center":null,"description_short":"As Manager of Software Engineering, Ring Subscriptions this role will lead the Ring Subscription team in Madrid. This is a visible \u0026 impactful role as the individual in this role will own growing the team","display_distance":null,"id":"bd8a4bc8-2aca-4adb-a494-f7fe966c0f12","id_icims":"3077032","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3077032/software-development-manager-ring-subscriptions","job_schedule_type":"full-time","location":"ES, M, Madrid","locations":["{\"normalizedStateName\":\"Community of Madrid\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Madrid\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, M, Madrid\",\"coordinates\":\"40.42024,-3.68755\",\"normalizedCountyName\":\"Madrid\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Madrid, Community of Madrid, ESP\",\"location\":\"ES, M, Madrid\",\"region\":\"M\",\"buildingCodeList\":[\"MAD12\"],\"normalizedCityName\":\"Madrid\"}"],"normalized_location":"Madrid, Community of Madrid, ESP","optional_search_labels":["alexa-and-amazon-devices.team-software-development-job-family"],"posted_date":"September  8, 2025","preferred_qualifications":"- Experience in communicating with users, other technical teams, and senior leadership to collect requirements, describe software product features, technical designs, and product strategy\u003cbr/\u003e- Experience in recruiting, hiring, mentoring/coaching and managing teams of Software Engineers to improve their skills, and make them more effective, product software engineers\u003cbr/\u003e- Experience managing a team of high calibre Software Engineers developing complex, world class, scalable software systems that have been successfully delivered to customers\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"alexa-and-amazon-devices.team-ring-key-blink","source_system":"JobCreator","state":"M","title":"Software Development Manager, Ring Subscriptions","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3077032/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-ring-key-blink","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Abgeschlossene technische Berufsausbildung, anerkannt durch die Industrie- und Handelskammer (IHK) oder Handwerkskammer (HWK) oder Nachweis eines erfolgreich abgeschlossen Hochschulstudium im Ingenieurwissenschaftlichen Bereich (Maschinenbau / Elektrotechnik oder artverwandt) einer deutschen Hochschule oder anerkannte ausländische Hochschulabschlüsse (BA, B. Sc., MA, M. Sc., Dipl.-Ing.)\u003cbr/\u003e- Mindestens zweijährige Berufserfahrung in dem entsprechenden Handwerk\u003cbr/\u003e- Erfahrung in der Instandhaltung von industriellen Produktionsanlagen\u003cbr/\u003e- Fortgeschrittene Deutschkenntnisse in Wort und Schrift","business_category":"fulfillment-ops","city":"Grolsheim","company_name":"Amazon Deutschland W19 Transport GmbH - J72","country_code":"DEU","description":"Das Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) ist für unseren Betrieb von fundamentaler Bedeutung – es sorgt dafür, dass unsere technischen Systeme und Anlagen laufend funktionieren. Als Instandhaltungstechniker:in bist Du für die Wartung und Instandhaltung unserer förder- und haustechnischen Anlagen sowie Produktionsanlagen zuständig. Du hilfst, die höchsten Sicherheitsstandards im Arbeitsschutz zu gewährleisten und Maschinenausfallzeiten zu verhindern. Unser technisches Team stellt eine hohe Verfügbarkeit der technischen Anlagen sicher und verbessert die Qualität unserer Geräte.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAusführung präventiver Wartungsmaßnahmen an einer breiten Vielfalt von Geräten an unseren Standorten\u003cbr/\u003eDurchführung von Reparaturen und Fehlerdiagnosen\u003cbr/\u003eVerwendung neuester Tools zur Maximierung der Geräteeffektivität\u003cbr/\u003eEinhaltung aller Arbeitsschutzrichtlinien und -praktiken \u003cbr/\u003eUnterstützung der Entwicklung und des beruflichen Fortschritts von Auszubildenden am Standort\u003cbr/\u003eArbeit an Projekten zur kontinuierlichen Verbesserung und Einführung von Best Practices an verschiedenen EU-Standorten\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAls Instandhaltungstechniker:in bist Du vor Ort in einem unserer Logistikzentren tätig, um schnell auf technische Störungen reagieren zu können. Du führst eine Reihe geplanter präventiver Wartungsmaßnahmen an Geräten durch, um für ihren sicheren Betrieb zu sorgen. Außerdem reagierst Du als Instandhaltungstechniker:in unverzüglich auf Störungen und Ausfälle. Du untersuchst die Ursachen, findest so schnell wie möglich Lösungen und wendest sie an.  Zudem machst Du Vorschläge für langfristige Verbesserungen.\u003cbr/\u003eIn Zusammenarbeit mit leitenden Kolleg:innen nimmst Du tägliche Wartungsaufgaben wahr und kommunizierst mit Dienstleistern, falls Du externe Expertise benötigst. Du arbeitest in rotierenden Schichten, damit wir rund um die Uhr unsere Standorte unterstützen – und dafür sorgen, dass Amazon weiterhin in dem Tempo liefern kann, für das wir bekannt sind. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Logistik (AMZL) ist für die Auslieferung von Millionen von Produkten unserer Kunden und Kundinnen direkt an die Haustür verantwortlich. Die „Last-Mile-Logistik“ liefert unsere Pakete in Partnerschaft mit Drittanbietern und realisiert zahlreiche Initiativen zur kontinuierlichen Verbesserung, um Millionen von Kunden zufrieden zu stellen.\u003cbr/\u003eUnser Ziel ist es, das Liefererlebnis für unsere Kund:innen so reibungslos wie möglich zu machen und globale Lieferlösungen für unsere neuesten Angebote einzuführen, darunter Amazon Fresh, Prime Now und Amazon Restaurants.\u003cbr/\u003eUnsere Arbeit lässt sich in zwei Sparten unterteilen. „Under the Roof“ betrifft alles was innerhalb unserer Logistikstandorte passiert und „On the Road“ alles was in den Liefergebieten auf der Straße stattfindet. Unsere Mitarbeitenden bereiten die Pakete in entsprechenden Schichten (Nacht, Früh, Spät) auf den täglichen Versand an unsere Lieferteams vor und kümmern sich um Retouren, die nicht ausgeliefert werden konnten.\u003cbr/\u003eJedes Jahr setzen wir neue Maßstäbe in puncto Kundenerlebnis und bieten neue, innovative Lieferdienste an. Wir suchen nach neuen Möglichkeiten, um branchenweite Logistikherausforderungen zu überwinden, sowie nach neuen Ideen, um unseren CO2-Fußabdruck zu reduzieren. Ein Fuhrpark innovativer Fahrzeuge (einschließlich E-Fahrzeugen) und modernste Technologie unterstützen uns dabei.","department_cost_center":null,"description_short":"Das Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) ist für unseren Betrieb von fundamentaler Bedeutung – es sorgt dafür, dass unsere technischen Systeme und","display_distance":null,"id":"0ba0a82a-79c8-4b1f-a88b-2613ebff1a4e","id_icims":"3143865","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3143865/instandhaltungstechniker-in","job_schedule_type":"full-time","location":"DE, RP, Grolsheim","locations":["{\"normalizedStateName\":\"Rhineland-Palatinate\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Grolsheim\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, RP, Grolsheim\",\"coordinates\":\"49.90667,7.91685\",\"normalizedCountyName\":\"Mainz-Bingen\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Grolsheim, Rhineland-Palatinate, DEU\",\"location\":\"DE, RP, Grolsheim\",\"region\":\"RP\",\"buildingCodeList\":[\"DRP4\"],\"normalizedCityName\":\"Grolsheim\"}"],"normalized_location":"Grolsheim, Rhineland-Palatinate, DEU","optional_search_labels":["jdv.operations.rmetechnician","hourly","ops.rme-technician"],"posted_date":"February  2, 2026","preferred_qualifications":"- Erfahrung mit zustandsorientierter Überwachung\u003cbr/\u003e- Erfahrung in der Arbeit mit Druck- und Applikationsmaschinen\u003cbr/\u003e- Erfahrung in der Störungssuche und Wartung von Förder- oder Automationssystemen\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":"RP","title":"Instandhaltungstechniker :in","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3143865/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of account management, project or program management or buying experience\u003cbr/\u003e- Bachelor's degree, or 5+ years of professional or military experience\u003cbr/\u003e- Experience using data to influence business decisions\u003cbr/\u003e- Experience driving internal cross-team collaboration\u003cbr/\u003e- Experience with business analysis and P\u0026L management","business_category":"amazongo","city":"Riyadh","company_name":"Afaq Q Tech General Trading","country_code":"SAU","description":"Interested in working on an innovative and high-impact business that is changing the way customers think about grocery? The MENA Grocery team (UFG) is offering a role to own building new business from ground Zero. We are seeking a self-starter who can quickly familiarize themselves with this fast-paced environment, build relationships/trust with cross-functional teams, and assume ownership within the program which will require understanding of complex business/Tech/Ops processes at Amazon and our partners and devising an optimal engagement model. You must be able to thrive and succeed in an entrepreneurial environment, and not be hindered by ambiguity or competing priorities. High judgment, analytical talent and good document writing skills with concise communication are essential to success in this role.\u003cbr/\u003e\u003cbr/\u003eIn this role, You will influence internal and external stakeholders and leadership to buy in to your strategic direction, build a buying and sourcing strategy for a new category while ensuring flawless execution and continuously analyzing key metrics to drive improvements for your business.\u003cbr/\u003e\u003cbr/\u003eThe SVM will be responsible for building relationships with vendors, adding selection, managing category profitability, optimizing pricing, and developing their team. The best candidate will have a broad skill set including leadership development, analytical horsepower, excellent business judgment, strong vendor management and negotiations skills, deep curiosity about how things work, and a passion for creating a world class shopping experience for our customers. The position requires a leader who can work autonomously in a fast paced, highly demanding and ambiguous environment.\u003cbr/\u003e\u003cbr/\u003eThe successful candidate would possess great business judgment, with a track record of strong project delivery, commercial negotiations and relationship management along with deep analytical acumen. Additionally, this position involves working with multiple stakeholders (marketing, marketplace, legal, supply chain, operations among others).\u003cbr/\u003e\u003cbr/\u003eThe position requires a leader who can work autonomously in a fast paced, highly demanding and ambiguous environment. The successful candidate would possess great business judgment, with a track record of strong project delivery, commercial negotiations and relationship management along with deep analytical acumen. Additionally, this position involves working with multiple stakeholders (marketing, marketplace, legal, supply chain, operations among others).\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eSupport Category leader to drive new strategic initiatives and business opportunities for the organization\u003cbr/\u003eNegotiations- Build strategic partnership, align and close aend to end vendor relationship and terms of trade, operating model contracts from long shelf-life Fresh \u0026 Frozen vendors (F\u0026V, Dairy, Poultry, Ice-cream etc.)\u003cbr/\u003eBuild the annual seasonal portfolio to drive continuous traffic and engagement to the store-front\u003cbr/\u003eEngage with global partner teams to bring best practices across globe to AE UFG channels\u003cbr/\u003eIdentify automation opportunities to offer scalable solutions, improve all key inputs metrics such as Selection, profitability, Pricing, Availability\u003cbr/\u003ePost launches, Own the P\u0026L for hitting top and bottom-line targets and drive projects to improve profitability with critical stakeholders (Vendor, Ops, Advertising)\u003cbr/\u003eDefine selection assortment, continuously refine the mix at dark store level to reduce shrinkages \u0026 improve CX\u003cbr/\u003eSource deals during Tier 1 \u0026 Tier 2 events to ensure we continue to offer value to our Prime Customers\u003cbr/\u003eEnsure content quality is best in class to improve conversion\u003cbr/\u003eNegotiate marketing funds from vendors for category visibility during BAU/Events.\u003cbr/\u003ePrepare, Pitch \u0026 close Annual JBP with vendors.\u003cbr/\u003eMBR / QBR with vendors on performance \u0026 improvement\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis is a startup role and require you to deal with high level of ambiguity.","department_cost_center":null,"description_short":"Interested in working on an innovative and high-impact business that is changing the way customers think about grocery? The MENA Grocery team (UFG) is offering a role to own building new business from","display_distance":null,"id":"ec40b4b8-6a30-40a6-aab4-cc1f6b500afb","id_icims":"3167616","is_intern":null,"is_manager":null,"job_category":"Buying, Planning, \u0026 Instock Management","job_family":"Buying/Planning","job_function_id":null,"job_path":"/en/jobs/3167616/senior-category-manager-amazon-now-sa","job_schedule_type":"full-time","location":"SA, Riyadh","locations":["{\"normalizedCountryCode\":\"SAU\",\"city\":\"Riyadh\",\"countryIso3a\":\"SAU\",\"countryIso2a\":\"SA\",\"locationNonStemming\":\"Saudi Arabia, Riyadh\",\"coordinates\":\"24.68208,46.68723\",\"normalizedCountyName\":\"Riyadh\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Saudi Arabia\",\"normalizedLocation\":\"Riyadh, SAU\",\"location\":\"SA, Riyadh\",\"region\":\"\",\"buildingCodeList\":[\"RUH14\"],\"normalizedCityName\":\"Riyadh\"}"],"normalized_location":"Riyadh, SAU","optional_search_labels":["ops.lander-saudization"],"posted_date":"January 27, 2026","preferred_qualifications":"- Experience driving direction and alignment with cross-functional teams\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazongo.no-team-listed","source_system":"JobCreator","state":null,"title":"Senior Category Manager, Amazon Now SA","university_job":null,"updated_time":"19 minutes","url_next_step":"https://account.amazon.com/jobs/3167616/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Master's degree in Electrical/Computer Engineering or related field  \u003cbr/\u003e-  7+ years of RTL development experience with a record of taping out production silicon\u003cbr/\u003e-  Experience with design development using Verilog/SystemVerilog\u003cbr/\u003e-   Experience in defining micro-architecture from architecture guideline and model analysis.\u003cbr/\u003e- Experience in performance/power/area analysis and trade-offs\u003cbr/\u003e-   Proficient in design methodologies and EDA tools\u003cbr/\u003e -    Experience working with Synthesis, timing closure, and design constraints\u003cbr/\u003e-  Excellent problem-solving and debugging skills\u003cbr/\u003e-  Ability to work collaboratively in a team environment and communicate technical ideas effectively","business_category":"alexa-and-amazon-devices","city":"Bengaluru","company_name":"ADCI - BLR 14 SEZ","country_code":"IND","description":"Amazon Lab126 is an inventive research and development company that designs and engineers high-profile consumer electronics. Lab126 began in 2004 as a subsidiary of Amazon.com, Inc., originally creating the best-selling Kindle family of products. Since then, we have produced groundbreaking devices like Fire tablets, Fire TV and Amazon Echo. What will you help us create?\u003cbr/\u003e   \u003cbr/\u003eThe Role: \u003cbr/\u003eAs a Senior RTL Design Engineer, you will be part of an advanced architecture team that is exploring new hardware designs to improve our devices.  In this role, you will be responsible for defining the micro-architecture and implementing the corresponding RTL for advanced functional blocks. You will participate in the design verification and bring-up of such blocks by writing relevant assertions, debugging code, test benches, test harnesses, and otherwise interacting with the extended team. You will participate in the lab bring-up of these blocks either in an FPGA or silicon by potentially writing test scripts, analyzing lab data, proposing experiments, etc.\u003cbr/\u003e   \u003cbr/\u003eYou will work closely with multi-disciplinary groups including Product Design, Audio Technology, Computer Vision, Hardware Engineering, and Software Engineering, to architect and implement complex functional block that enable development of world-class hardware devices. In this role, you will: \u003cbr/\u003e   \u003cbr/\u003e-  Design world class hardware and software\u003cbr/\u003e-  Communicate and work with team members across multiple disciplines\u003cbr/\u003e- Develop detailed design specifications and documentation\u003cbr/\u003e- Perform RTL coding and synthesis\u003cbr/\u003e- Work with Partners/Supplier to optimize and customize their products\u003cbr/\u003e- Run industry standard code quality tools and fix issues found by them\u003cbr/\u003e- Participate in test plan and coverage reviews\u003cbr/\u003e   \u003cbr/\u003eThe ideal candidate should have experience with RTL development environments, fluency in modern hardware description languages. They should have developed complex IP blocks from scratch that have successfully been integrated in SOCs or other such silicon that have been productized in consumer devices.  They should be familiar with modern SoC architectures, various interconnect topologies such as AMBA AXI, APB, AHB, and implementations. Experience with I/O interfaces such as SPI, I2C, I2S, PDM, and MIPI CSI/DSI/Slimbus/Soundwire is \u003cbr/\u003epreferred. Experience with memory instantiation and memory compilers is also preferred. We are looking for a self-driven individual who can work with architects, HW and SW developers and can quickly resolve blocking issues. \u003cbr/\u003e   \u003cbr/\u003eIf you have the required skills and experience, we encourage you to apply for this exciting opportunity to join our growing hardware design team.","department_cost_center":null,"description_short":"Amazon Lab126 is an inventive research and development company that designs and engineers high-profile consumer electronics. Lab126 began in 2004 as a subsidiary of Amazon.com, Inc., originally creating","display_distance":null,"id":"4c758e8a-ee50-4500-ae30-12b772d1cdc8","id_icims":"3082253","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"ASIC","job_function_id":null,"job_path":"/en/jobs/3082253/senior-rtl-design-engineer-hardware-compute-group","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR14\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":["alexa-and-amazon-devices.team-hardware-development-job-family"],"posted_date":"September 12, 2025","preferred_qualifications":" - PhD in Computer Science, Electrical Engineering, or related field\u003cbr/\u003e - Experience with design of video/graphics pipeline and image processing algorithms \u003cbr/\u003e - Familiarity with display panel and display driver IC technologies\u003cbr/\u003e - Experience with ARM and various DSP ISA\u003cbr/\u003e - Experience debugging system-level issues\u003cbr/\u003e - Experience in entire design flow from architecture to final silicon.\u003cbr/\u003e - Good programming skills in C/C++ and scripting skills in Python, Tcl, and/or Perl\u003cbr/\u003e - 10 years or more of practical experience\u003cbr/\u003e - Experience with wide variety of low power design techniques\u003cbr/\u003e - Working experience with high performance industry standard buses like AMBA AXI4\u003cbr/\u003e - Experience in integrating third party IP blocks, building top level modules, defining clock domains and power domains\u003cbr/\u003e - Large breadth of knowledge from architecture through physical design\u003cbr/\u003e - Knowledge of FPGA and emulation platforms\u003cbr/\u003e - Knowledge of SoC architecture\u003cbr/\u003e - Excellent verbal and written communication skills\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"alexa-and-amazon-devices.team-hardware-and-eero","source_system":"JobCreator","state":"KA","title":"Senior RTL Design Engineer, Hardware Compute Group","university_job":null,"updated_time":"22 minutes","url_next_step":"https://account.amazon.com/jobs/3082253/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-hardware-and-eero","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of sales experience","business_category":"operations","city":"Gurugram","company_name":"ASSPL - Haryana - C77","country_code":"IND","description":"We're seeking a dynamic Sales Specialist to join our Amazon Shipping team in Gurgaon. The role focuses on driving business growth through new customer acquisition and relationship management in the enterprise segment.\u003cbr/\u003e\u003cbr/\u003eKey Responsibilities:\u003cbr/\u003e• Lead end-to-end sales cycles for large and enterprise customers in the assigned territory\u003cbr/\u003e• Develop and execute strategic account plans to achieve revenue targets\u003cbr/\u003e• Own and maintain P\u0026L responsibilities for the assigned portfolio\u003cbr/\u003e• Identify and onboard high-potential customers through consultative selling approach\u003cbr/\u003e• Analyze market trends and competitor activities to develop effective sales strategies\u003cbr/\u003e• Collaborate with cross-functional teams to ensure smooth customer onboarding\u003cbr/\u003e• Monitor key performance metrics and prepare regular business reports\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eDeliver positive experience to assigned and onboarded shipper accounts and win volume (#Shipments and Revenue) and hygiene parameters\u003cbr/\u003e• Develop your individual account management strategy at a shipper-level\u003cbr/\u003e• Understanding and reinforcing the value proposition and creating joint business plans with shippers\u003cbr/\u003e• Action proactive and reactive measures on key business parameters like operations, claims, and receivables\u003cbr/\u003e• Follow the standard operating processes to scale the working of the function.\u003cbr/\u003e• Help refine the business value proposition using local knowledge, secondary research and past data","department_cost_center":null,"description_short":"We're seeking a dynamic Sales Specialist to join our Amazon Shipping team in Gurgaon. The role focuses on driving business growth through new customer acquisition and relationship management in the enterprise","display_distance":null,"id":"057b8543-4ad3-46e5-9415-888fd8e297ff","id_icims":"3167406","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Sales/Account Management","job_function_id":null,"job_path":"/en/jobs/3167406/sales-specialist-amazon-shipping","job_schedule_type":"full-time","location":"IN, HR, Gurugram","locations":["{\"normalizedStateName\":\"Haryana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Gurugram\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, HR, Gurugram\",\"coordinates\":\"28.47716,77.06847\",\"normalizedCountyName\":\"Gurugram\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Gurugram, Haryana, IND\",\"location\":\"IN, HR, Gurugram\",\"region\":\"HR\",\"buildingCodeList\":[\"HDX1\",\"SDEG\",\"TSE1\",\"SHDZ\",\"TSE7\",\"PNGX\",\"PHSJ\",\"DEL19\",\"PDLV\",\"PHSC\",\"IRDH\",\"UHSE\",\"FDL9\",\"HBX1\",\"DEL73\",\"PHSI\",\"KELH\",\"TSH3\",\"SDEW\",\"DEL8\",\"SDEY\",\"DEL94\",\"UHSI\",\"SDEB\",\"HNDJ\",\"TSB3\",\"QNZZ\",\"SDLD\",\"PDLG\",\"SDEP\",\"HDLC\",\"KSZ2\",\"HNDI\",\"DEL24\",\"DED4\",\"HDO2\",\"UDEV\",\"KNDA\",\"UHSD\",\"PNGZ\",\"HDO3\",\"FDL6\",\"DED5\",\"PHSE\",\"UHSJ\",\"ZNJS\",\"YZZ4\",\"TDK9\",\"XNAB\"],\"normalizedCityName\":\"Gurugram\"}"],"normalized_location":"Gurugram, Haryana, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"January 27, 2026","preferred_qualifications":"- Bachelor's degree\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"operations.team-last-mile-org","source_system":"JobCreator","state":"HR","title":"Sales Specialist , AMAZON SHIPPING","university_job":null,"updated_time":"24 minutes","url_next_step":"https://account.amazon.com/jobs/3167406/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-org","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 6+ years of sales experience","business_category":"fulfillment-ops","city":"Mumbai","company_name":"ASSPL - Karnataka - B56","country_code":"IND","description":"Sr. Enterprise Sales Manager for Externalization clients to help build SWA business\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Sr. Enterprise Sales Manager for Externalization clients to help build SWA business","display_distance":null,"id":"2be02d78-79c0-446d-bb53-23464df52cdc","id_icims":"3169597","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Sales/Account Management","job_function_id":null,"job_path":"/en/jobs/3169597/sr-enterprise-sales-manager-externalization-in","job_schedule_type":"full-time","location":"IN, MH, Mumbai","locations":["{\"normalizedStateName\":\"Maharashtra\",\"normalizedCountryCode\":\"IND\",\"city\":\"Mumbai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, MH, Mumbai\",\"coordinates\":\"18.94018,72.83484\",\"normalizedCountyName\":\"Mumbai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Mumbai, Maharashtra, IND\",\"location\":\"IN, MH, Mumbai\",\"region\":\"MH\",\"buildingCodeList\":[\"BOM61\",\"BOM920\",\"UBMD\",\"BOM89\",\"UBOA\",\"IRDM\",\"CBO1\",\"QWNS\",\"FBOK\",\"ISK1\",\"YWCS\",\"BOM44\",\"SBOG\",\"BOM148\",\"TMF5\",\"XWAA\",\"KWC7\",\"PBO8\",\"YWCH\",\"YWTH\",\"BOM73\",\"BOM119\",\"FMPA\",\"XBLM\",\"QWUW\",\"UBO2\",\"YWCD\",\"TME3\",\"BOM107\",\"QWVN\",\"QWAI\",\"TMA5\",\"BOM56\",\"YEYB\",\"TML3\",\"BOM82\",\"TMF9\",\"BOM85\",\"TMH2\",\"YWSX\",\"TMK1\",\"BOM136\",\"FBO5\",\"BOM120\",\"BOM262\",\"KWBD\",\"TMM9\",\"TMO2\",\"UB093\",\"YWTA\",\"HMH9\",\"TME6\",\"QWAE\",\"TMN8\",\"BOM112\",\"TMJ3\",\"YZZ7\",\"BOM157\",\"HMH8\",\"YWTL\",\"TMG3\",\"TMK8\",\"YWT5\",\"BOM40\",\"SBON\",\"TMJ2\",\"PBO4\",\"TMB7\",\"FBOD\",\"TMK9\",\"YEVV\",\"TMH9\",\"BOM65\",\"RWRP\",\"BOM132\",\"LBO1\",\"YWW4\",\"YEYC\",\"FBOC\",\"BOM263\",\"BOM64\",\"QWND\",\"BOM254\",\"BOM141\",\"HMH1\",\"PBO5\",\"TMM1\",\"IRDU\",\"MUM86\",\"TMN7\",\"BOM74\",\"QWUS\",\"BOM128\",\"TMG4\",\"YWTG\",\"BOM135\",\"TNA49\",\"TMK2\",\"FBO4\",\"UBOX\",\"TMN3\",\"REBZ\",\"KWDR\",\"BOM45\",\"YWCG\",\"BOT2\",\"VABC\",\"PBO7\",\"YWCE\",\"BOM253\",\"YEX8\",\"TMA6\",\"YWT1\",\"KWC8\",\"BOM76\",\"UBMC\",\"TMF4\",\"YWSY\",\"BOM78\",\"TME9\",\"XWKK\",\"TME4\",\"YWTI\",\"BOM123\",\"HBM5\",\"KWDI\",\"TMN5\",\"BOM41\",\"TMJ7\",\"FBON\",\"MUM88\",\"FWMU\",\"TMH5\",\"BOM66\",\"YWT3\",\"YWT6\",\"FBO2\",\"PBO9\",\"KWBA\",\"UBO5\",\"TMH7\",\"RWVS\",\"BOM53\",\"TMM5\",\"FBOE\",\"TME7\",\"IRXU\",\"TMJ5\",\"TMB4\",\"UBOH\",\"BOM68\",\"FBOG\",\"YEYA\",\"YWTK\",\"BOM2\",\"HBO3\",\"SBO3\",\"RWVQ\",\"BOM258\",\"IABB\",\"BOM81\",\"MULC\",\"TMG2\",\"IRDQ\",\"BOM143\",\"BOLT1\",\"BOM51\",\"QWAH\",\"BWN40\",\"YWT8\",\"YWTD\",\"UBOC\",\"BOM115\",\"YEW5\",\"SBOP\",\"TMB9\",\"TMO3\",\"QWUV\",\"UBO7\",\"BOM86\",\"QWAM\",\"TMF2\",\"TMK5\",\"SBOD\",\"BOM96\",\"TME2\",\"TMG7\",\"IRDX\",\"BOM71\",\"TML5\",\"FBOL\",\"QWQL\",\"TMA4\",\"MUM83\",\"HMH3\",\"VABB\",\"YWSZ\",\"BBG401\",\"TMG9\",\"YWCF\",\"BOM92\",\"IRDZ\",\"BOM13\",\"TME1\",\"RWS6\",\"KELR\",\"TMN2\",\"QWAV\",\"MUM85\",\"RWVZ\",\"BOM30\",\"BOM75\",\"TMJ8\",\"FBOM\",\"TMK3\",\"FBO3\",\"QWUN\",\"FBOB\",\"YWTF\",\"MBOA\",\"TMF7\",\"QWUU\",\"IRYP\",\"CVP1\",\"ISK3\",\"BOM146\",\"HBM4\",\"BOM110\",\"TMJ1\",\"UBOJ\",\"LMH6\",\"BOM129\",\"HDE7\",\"KWDU\",\"TMN6\",\"BOM256\",\"BOM117\",\"TMF3\",\"BOM259\",\"UBMB\",\"BOM63\",\"YWT0\",\"PBO6\",\"TMK7\",\"TMB2\",\"UPN7\",\"BOX2\",\"HBA4\",\"BOM1\",\"HBO4\",\"BCT40\",\"TMB6\",\"TMS6\",\"UBOG\",\"BOM130\",\"TMJ4\",\"BOM83\",\"YWTB\",\"YWCB\",\"YWT4\",\"MMC94\",\"HMH7\",\"RWJZ\",\"BOM79\",\"TMG5\",\"UPN3\",\"BOM255\",\"BOM84\",\"TML1\",\"BOM54\",\"BOM108\",\"TMH4\",\"BOM138\",\"RWS2\",\"HMU1\",\"KWBB\",\"YWCI\",\"YEY1\",\"TMM8\",\"BOM55\",\"HMU2\",\"YWCC\",\"QWVM\",\"BOM264\",\"UBO40\",\"QWQI\",\"BOM122\",\"BOM131\",\"TME5\",\"TML2\",\"BOM109\",\"MMC41\",\"QWAD\",\"BOM147\",\"TMJ9\",\"BOM99\",\"TMA7\",\"TMH1\",\"KWCC\",\"MUM84\",\"BOM149\",\"TMA8\",\"FMPB\",\"BOM60\",\"BOM118\",\"FBOA\",\"IRDY\",\"BOM14\",\"BOM59\",\"YZZ2\",\"UBOB\",\"MUM41\",\"UBO3\",\"BOMD\",\"HMH4\",\"TML4\",\"XWAB\",\"MMC86\",\"RWS7\",\"QWUZ\",\"TMH3\",\"TMG8\",\"BOM62\",\"BOM72\",\"TMG6\",\"TNA40\",\"BOM50\",\"RWVW\",\"IRDP\",\"UBOD\",\"ISK2\",\"RWS3\",\"FBOH\",\"YWTE\",\"RWW1\",\"UBOZ\",\"UNDI\",\"BOM111\",\"BOM142\",\"BOM114\",\"BOM139\",\"QWAL\",\"TMF6\",\"YWWA\",\"BOM69\",\"TMK4\",\"MMC93\",\"MUM94\",\"TMM6\",\"YWC8\",\"TMB5\",\"BOM22\",\"YWCA\",\"BOM260\",\"KWBE\",\"HMU5\",\"RWS0\",\"TMN9\",\"KWDL\",\"BOM52\",\"TMH8\",\"TMM4\",\"GUS9\",\"KWB9\",\"BOM49\",\"YWCK\",\"TMK6\",\"RWRY\",\"UBO1\",\"BOM70\",\"QWQK\",\"VANM\",\"YWTC\",\"YWT7\",\"YWW7\",\"TMS7\",\"TMH6\",\"BOM124\",\"TMO4\",\"YEVZ\",\"TMJ6\",\"TMF1\",\"UBOI\",\"BOM87\",\"BOM42\",\"BOM3\",\"TMF8\",\"TMB3\",\"YWT2\",\"QWAS\",\"IRDR\",\"TMN4\",\"BOM106\",\"TMG1\",\"QWUP\",\"QWAG\",\"TME8\",\"BOM144\",\"KES0\",\"RWSA\",\"YWTJ\",\"RWIX\",\"FBOF\"],\"normalizedCityName\":\"Mumbai\"}"],"normalized_location":"Mumbai, Maharashtra, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"January 29, 2026","preferred_qualifications":"- 8+ years of digital sales, account management, business development, or partner management experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"MH","title":"Sr. Enterprise Sales Manager, Externalization, IN","university_job":null,"updated_time":"24 minutes","url_next_step":"https://account.amazon.com/jobs/3169597/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}