{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team\u003cbr/\u003e- Experience contributing to the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems\u003cbr/\u003e- Knowledge of professional software engineering \u0026 best practices for full software development life cycle, including coding standards, software architectures, code reviews, source control management, continuous deployments, testing, and operational excellence\u003cbr/\u003e- Bachelor's degree in computer science or equivalent","business_category":"finance","city":"Hyderabad","company_name":"Amazon Dev Center India - Hyderabad","country_code":"IND","description":"Are you passionate about simplifying complex problems? Do you like finding patterns and inventing new ways to push the boundaries of the current possibilities? Interested in building high-performance, globally scalable systems that support Amazon's current and future growth? If so, Amazon Finance Technology (FinTech) is for you!\u003cbr/\u003e \u003cbr/\u003e Amazon FinTech is an organization where people, technology and innovation come together to build products and solve problems for Amazon. Technology solution and services we build enables Amazon’s new business growth, provide operational efficiency through automation, compliance with law and analysis of our financial data. Through our products, we aim to provide Amazon competitive advantage for running its business and insights for our customers using state of the art technologies.\u003cbr/\u003e\u003cbr/\u003eWe are looking for a Software Development Engineer for the Entity onboarding Acceleration and experience team. Our team is responsible for automating complex onboarding processes currently requiring hundreds of manual hours. We innovate in applying modern technologies to provide self-service capabilities to our customers to perform automatons. We build controls and auditing capabilities for our users to perform their tasks with a high degree of confidence and efficiency. Our aim is to build reusable back-end and front-end components as a single integrated platform for all of our users’s expansion need. This is your opportunity to make your mark in the design and build of the new system.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAs a Software Development Engineer, you will play a role in the design, implementation and deployment of large-scale and complex software systems. You will get to deliver innovative solutions to challenging problems. You will communicate your ideas effectively to achieve the right outcome for your team and customer. You enjoy collaborating with others to increase the effectiveness of the overall team.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Define high level and low level design for software solutions using the latest AWS technology in a large distributed environment.\u003cbr/\u003e- Take the lead on defining and implementing engineering best practices and using data to define and improve operational best practices.\u003cbr/\u003e- Help drive the architecture and technology choices for FinTech accounting products.\u003cbr/\u003e- Design, develop and deploy medium to large software solutions for Amazon accounting needs.\u003cbr/\u003e- Raise the bar on code quality, including security, readability, consistency, maintainability.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eFintech builds high-performance, globally scalable Financial systems that drive Amazon's current and future growth. We drive innovation leveraging the scalability with Amazon's AWS cloud services.","department_cost_center":null,"description_short":"Are you passionate about simplifying complex problems? Do you like finding patterns and inventing new ways to push the boundaries of the current possibilities? Interested in building high-performance,","display_distance":null,"id":"85c74826-cad5-414c-a49b-be03fcee262e","id_icims":"3171731","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3171731/software-development-engineer-iii-fintech","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD13\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":[],"posted_date":"February  2, 2026","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Knowledge of system performance, memory management, and parallel computing principles\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-fintech","source_system":"JobCreator","state":"TS","title":"Software Development Engineer III, FinTech","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3171731/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fintech","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Abgeschlossene technische Berufsausbildung, anerkannt durch die Industrie- und Handelskammer (IHK) oder Handwerkskammer (HWK) oder Nachweis eines erfolgreich abgeschlossen Hochschulstudium im Ingenieurwissenschaftlichen Bereich (Maschinenbau / Elektrotechnik oder artverwandt) einer deutschen Hochschule oder anerkannte ausländische Hochschulabschlüsse (BA, B. Sc., MA, M. Sc., Dipl.-Ing.)\u003cbr/\u003e- Zusätzlich, eine abgeschlossene Qualifikation als Industriemeister, Handwerksmeister oder Staatlich Geprüfter/Anerkannter Techniker oder mehrjährige einschlägige Berufserfahrung\u003cbr/\u003e- Praktische Erfahrung im Führen von Teams\u003cbr/\u003e- Erfahrung in der Automatisierung und Instandhaltung von Förderanlagen\u003cbr/\u003e- Fortgeschrittene Deutschkenntnisse in Wort und Schrift sowie Grundsprachkenntnisse in Englisch","business_category":"fulfillment-ops","city":"Lahntal","company_name":"Amazon Deutschland W4 Transport GmbH - I74","country_code":"DEU","description":"Unser Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) ist der Kern von Amazons Engagement für Innovation. Amazon entwickelt sich weiter und dieses Team sorgt dafür, dass dies auch die von uns verwendeten Technologien und Tools tun. Als Senior RME Technician hilfst Du uns, der Entwicklung einen Schritt voraus zu bleiben. Du setzt die neuesten Technologien ein und identifizierst neue, effiziente Arbeitsmethoden. In dieser Rolle achtest Du genau auf unsere Prozesse und trägst dazu bei, dass wir unsere höchsten Sicherheitsstandards befolgen und weiter erhöhen. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Best Practice und Unterstützen im Bedienen von Geräten und Anlagen mit den höchsten Sicherheitsstandards\u003cbr/\u003e- Verfolgen der Geräteleistung durch visuelle Prüfungen, zustandsorientierte Überwachung und vorbeugende Wartungsmaßnahmen und Einplanen zusätzlicher Wartung je nach Bedarf\u003cbr/\u003e- Verantwortung für das technische Team während seiner Schicht und dessen Unterstützung und Weiterentwicklung\u003cbr/\u003e- Lösung von Problemen an Anlagen, um Betriebsausfallzeiten zu reduzieren und die schnellstmögliche Abfertigung von Paketen zu ermöglichen\u003cbr/\u003e- Unterstützung bei der kontinuierlichen Verbesserung von Systemen und Standardisierung von Prozessen im ganzen EU-Netzwerk\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eDu betreust ein Instandhaltungsteam innerhalb einer Schicht und sorgst dafür, dass alle Mitarbeitenden die erforderlichen Werkzeuge zur Verfügung haben und diese einwandfrei funktionieren. Das beinhaltet die Überwachung von Prozessen, damit Vorschriften und Richtlinien befolgt werden, ebenso wie die Gewährleistung der Durchführung vorbeugender Wartungsmaßnahmen, um die Betriebszeit unserer Anlagen zu maximieren.\u003cbr/\u003eDurch Deine Beobachtungen während der Schichtarbeit machst Du Verbesserungsvorschläge, um unsere Systeme noch effizienter und produktiver zu gestalten, und setzt diese Verbesserungen EU-weit um. Außerdem nutzt Du Tools wie SCADA zur Überwachung von Prozessen, um deren Leistungsfähigkeit zu gewährleisten, und unterstützt administrative Aufgaben in enger Zusammenarbeit mit Deinen Führungskräften.\u003cbr/\u003eDu arbeitest vor Ort in einem unserer Logistikzentren. Du arbeitest in Schichtmodellen, die Nächte und Wochenenden umfassen können. Mit den Kenntnissen und Erfahrungen, die Du sammelst, wirst Du Dich zu weiteren Führungspositionen weiterentwickeln. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eUnser Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) sorgt dafür, dass unsere Geräte und Ausstattung jederzeit optimal funktionieren. Wir sind ein Team von Techniker:innen und Ingenieur:innen, das aus hervorragenden Teamplayern besteht und von erfahrenen Führungskräften geleitet wird. Wir arbeiten gemeinsam daran, die Geräte in unserem gesamten globalen Netzwerk von Fulfillment-Centern zu warten, zu reparieren und ihre Fehler zu beheben. Einige unserer Mitarbeiter:innen sind Führungskräfte, die das Team bei der Arbeit an spannender, innovativer Technologie beaufsichtigen – die es teilweise nur bei Amazon gibt.\u003cbr/\u003eVon der Installation automatisierter Verpackungssysteme bis hin zur Beaufsichtigung der allgemeinen Wartungsarbeiten eines Standorts sowie der Reparatur von für den Vertrieb wesentlichen Geräten wickelt unser Team einen Großteil der technischen Aufgaben bei Amazon ab. Unter anderem sorgt es auch dafür, dass Gebäude weiterhin den rechtlichen Auflagen entsprechen, damit alle sicher bleiben und unsere Standorte mit maximaler Effizienz betrieben werden. Es gibt zahlreiche Aufstiegschancen im RME-Team selbst ebenso wie im gesamten Amazon-Unternehmen.\u003cbr/\u003eAlle unsere Aktivitäten sind darauf ausgerichtet, die Ausfallzeiten an Amazons wichtigsten Betriebsstandorten zu reduzieren, damit Kund:innen ihre Bestellungen rechtzeitig erhalten. Oft arbeiten wir früh morgens, spät abends oder in der Nachtschicht, um Wartungsarbeiten mit den geringstmöglichen Störungen vorzunehmen. Falls wir eine bessere Möglichkeit finden, eine bestimmte Aufgabe zu erledigen, verfügen wir über die Fertigkeiten und Gelegenheiten, vollständig neue Prozesse oder bahnbrechende Technologie wie Amazon Robotics oder unseren Complex Item Sorter einzuführen.","department_cost_center":null,"description_short":"Unser Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) ist der Kern von Amazons Engagement für Innovation. Amazon entwickelt sich weiter und dieses Team sorgt","display_distance":null,"id":"3df630c5-abdf-4d46-99f5-51e78d818545","id_icims":"3178965","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3178965/senior-instandhaltungstechniker-in","job_schedule_type":"full-time","location":"DE, Lahntal","locations":["{\"normalizedStateName\":\"Hesse\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Lahntal\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, Lahntal\",\"coordinates\":\"50.8625,8.70569\",\"normalizedCountyName\":\"Marburg-Biedenkopf\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Lahntal, Hesse, DEU\",\"location\":\"DE, Lahntal\",\"region\":\"\",\"buildingCodeList\":[\"DHF4\"],\"normalizedCityName\":\"Lahntal\"}"],"normalized_location":"Lahntal, Hesse, DEU","optional_search_labels":["jdv.operations.seniorrmetechnician"],"posted_date":"February 11, 2026","preferred_qualifications":"- Erfahrung in der Betreuung von Fremdfirmen\u003cbr/\u003e- Verständnis von SPS-basierten Steuersystemen und gesetzlichen Compliance-Anforderungen\u003cbr/\u003e- Erfahrung im Gebrauch von computergesteuerten Wartungsmanagementsystemen, um proaktive Wartungsmaßnahmen zu planen und reaktive Maßnahmen aufzuzeichnen\u003cbr/\u003e- Studienabschluss, vorzugsweise in einem technischen Fachgebiet oder in Betriebswirtschaft\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":null,"title":"Senior Instandhaltungstechniker:in","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3178965/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of Microsoft Office products and applications experience\u003cbr/\u003e- High school or equivalent\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- Can lift up to 49 pounds, stand/walk during shifts lasting up to 12 hours, and be able to frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Work 40 hours/week, and overtime as required","business_category":"fulfillment-ops-team","city":"Manhattan","company_name":"Amazon.com Services LLC","country_code":"USA","description":"This full-time position requires in-role training at an operating site which will be 5+ weeks in duration.\u003cbr/\u003e\u003cbr/\u003eThis training will be located 50+ miles away from the home site location. All travel accommodations for training will be booked and paid for by Amazon.\u003cbr/\u003e\u003cbr/\u003eAmazon Process Assistant (Full-time)\u003cbr/\u003e\u003cbr/\u003eSince opening our virtual doors in 1995, we’ve been pushing the boundaries of ‘possible’ further and further. Our entire business works hard to delight our customers – from the second an order is placed online to the seamless coordination of that order behind the scenes, we strive to stay agile, fluid and intentional. That can be described in one of our core Leadership Principles, which is Bias for Action. This means that our teams band together, roll up their sleeves, and aren’t content with just standing still. We’re aiming to become the most customer-centric company on Earth. \u003cbr/\u003e\u003cbr/\u003eRural Super Rural (RSR) is an exciting organization within Amazon dedicated to ensuring our customers receive their deliveries and are satisfied with their service, even in our most remote area. We are a combination of operations and support teams aligned to continually strive to innovate the last mile delivery process while bringing smiles to our customer’s faces. \u003cbr/\u003e\u003cbr/\u003eProcess Assistants are part of the Last Mile operations in RSR and play a crucial role in this rapidly growing team. Process Assistants are responsible for daily management of department duties including: allocating labor, leading meetings, assigning job duties, providing work direction and communicating with internal and external suppliers.\u003cbr/\u003e\u003cbr/\u003eResponsibilities: \u003cbr/\u003e•\tTrack and report ATS/labor hours \u003cbr/\u003e•\tOccasionally assist with production duties, train associates and verify SOP (standard operating procedure) compliance \u003cbr/\u003e•\tEnsure successful area performance through tracking and reporting metrics\u003cbr/\u003e•\tIndependently assess all aspects of associate work performance and provide timely and detailed feedback \u003cbr/\u003e•\tParticipate in Operational Excellence initiatives \u003cbr/\u003e•\tMaintain a full understanding of workflow and daily production goals \u003cbr/\u003e•\tReview and update SOP’s as required \u003cbr/\u003e•\tEnsure work areas remain clean and are properly equipped \u003cbr/\u003e•\tIdentify and address safety hazards within the work area, and participate in safety initiatives \u003cbr/\u003e•\tCoach associates on ways to work safely at all times \u003cbr/\u003e•\tEnsure all job injuries are reported timely in accordance with established policies and procedures\u003cbr/\u003e•\tProvide vacation coverage for Area Managers \u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"This full-time position requires in-role training at an operating site which will be 5+ weeks in duration.This training will be located 50+ miles away from the home site location. All travel accommodations","display_distance":null,"id":"aaca710a-8f46-4fff-9189-e7fe57d55234","id_icims":"3171753","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3171753/process-assistant-rsr","job_schedule_type":"full-time","location":"US, KS, Manhattan","locations":["{\"normalizedStateName\":\"Kansas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Manhattan\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, KS, Manhattan\",\"coordinates\":\"39.17907,-96.56183\",\"normalizedCountyName\":\"Riley\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Manhattan, Kansas, USA\",\"location\":\"US, KS, Manhattan\",\"region\":\"KS\",\"buildingCodeList\":[\"WKS2\"],\"normalizedCityName\":\"Manhattan\"}"],"normalized_location":"Manhattan, Kansas, USA","optional_search_labels":[],"posted_date":"February  2, 2026","preferred_qualifications":"- Associate’s or Bachelor’s Degree, and/or prior Amazon experience\u003cbr/\u003e- Awareness and willingness to use OPEX tools and techniques\u003cbr/\u003e- Demonstrates problem solving and analytical skills\u003cbr/\u003e- Ability to communicate effectively (written and verbal) across various levels of an organization\u003cbr/\u003e- History of meeting/exceeding departmental goals\u003cbr/\u003e- Experience leading teams\u003cbr/\u003e- Capable of providing direction to team members using independent judgment\u003cbr/\u003e- Organization and time management skills\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below including the base pay rate plus the highest available shift differential which applies depending on the shift you select. As a total compensation company, you are eligible for additional earnings including overtime pay and performance bonuses. Final pay will be based on factors including shift selection and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, KS, Manhattan - 22.00 - 22.00 USD hourly","primary_search_label":"fulfillment-ops-team.fulfillment-associates","source_system":"JobCreator","state":"KS","title":"Process Assistant, RSR","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3171753/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"fulfillment-associates","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of Microsoft Office products and applications experience\u003cbr/\u003e- High school or equivalent\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- Can lift up to 49 pounds, stand/walk during shifts lasting up to 12 hours, and be able to frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Work 40 hours/week, and overtime as required\u003cbr/\u003e- Valid and active driver's license\u003cbr/\u003e- Are 21 years of age or older\u003cbr/\u003e- Eligible to drive in accordance with DOT requirements\u003cbr/\u003e- Must be able to obtain and maintain a Driver Qualification File\u003cbr/\u003e- Authorized to work in the United States","business_category":"fulfillment-ops-team","city":"Manhattan","company_name":"Amazon.com Services LLC","country_code":"USA","description":"This full-time position requires in-role training at an operating site which will be 5+ weeks in duration.\u003cbr/\u003e\u003cbr/\u003eThis training will be located 50+ miles away from the home site location. All travel accommodations for training will be booked and paid for by Amazon.\u003cbr/\u003e\u003cbr/\u003eSince opening our 'virtual' doors in 1995, we’ve been pushing the boundaries of ‘possible’ further and further. Our entire business works hard to delight our customers – from the second an order is placed online to the seamless coordination of that order behind the scenes, we strive to stay agile, fluid and intentional. That can be described in one of our core Leadership Principles, which is Bias for Action. This means that our teams band together, roll up their sleeves, and aren’t content with just standing still. We’re aiming to become the most customer-centric company on Earth. \u003cbr/\u003e\u003cbr/\u003eRural Super Rural (RSR) is an exciting organization within Amazon dedicated to ensuring our customers receive their deliveries and are satisfied with their service, even in our most remote area. We are a combination of operations and support teams aligned to continually strive to innovate the last mile delivery process while bringing smiles to our customer’s faces. \u003cbr/\u003e\u003cbr/\u003eAmazon is seeking self-motivated Driver Trainers to join our team and help build a network of customer-centric Delivery Associates in the communities where we operate. As a Driver Trainer, you have a passion for mentoring others; you are comfortable teaching and guiding conversations in large groups; and you believe in hands-on training and conducting drive-alongs with Delivery Associates to instill safe practices.\u003cbr/\u003e\u003cbr/\u003eAs a Driver Trainer, you are responsible for establishing the right driver training culture in your delivery station, setting up the training experience, and independently instructing training sessions. You educate Delivery Associates on the foundational safety, quality, and productivity aspects that are an important part of the Delivery Associate daily routine. You enable the success of Delivery Associates by adapting to different learning styles and taking a hands-on training approach to demonstrate what good looks like. You exhibit Learn and Be Curious by answering all Delivery Associates’ questions and finding the answers if you are not sure of the correct response.\u003cbr/\u003e\u003cbr/\u003eAs a Driver Trainer, you are expected to lead by example and demonstrate the Amazon Leadership Principles at all times. In this position you will play a key role in keeping our commitment to exceed customer expectations by ensuring Delivery Associates are set up for success to deliver customer orders, large or small, on time at the right place.\u003cbr/\u003e\u003cbr/\u003eDue to interstate operating authority commerce regulations, candidates must be at least 21 years or older. Candidate must hold a valid state-appropriate driver’s license, be able to obtain and maintain their Driver Qualification File (DQF), and be eligible to drive in accordance with Department of Transportation (DOT) requirements.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•Facilitate daily training classes for up to 30 people, including in-station classes and drive-alongs \u003cbr/\u003e• Partner with Delivery Service Partners (DSPs), Operations Managers, Area Managers, and Learning Teams to coordinate, facilitate, and measure training related activities. \u003cbr/\u003e• Have a detailed understanding of processes, expectations, and training requirements for all drivers across the various driver programs in operation. \u003cbr/\u003e• Provide timely and accurate reporting on the completion of trainings, compliance, safety, and maintenance duties. \u003cbr/\u003e• Execute to the standard, always working to ensure that the content and experience complement the safety, quality, and legal procedures as defined. \u003cbr/\u003e• Educate and audit driver safety and compliance standards such as: driver vehicle inspection reports, hours of service, trip planning and safe road driving practices. \u003cbr/\u003e• Track and monitor performance including on road ride behinds to measure on-road quality, adherence to standards, and identify re-training and process improvement opportunities. \u003cbr/\u003e• Drive, maneuver, and load/unload a truck as scheduled using approved equipment (dolly, etc.), with or without reasonable accommodation. \u003cbr/\u003e• Lift up to 49 pounds, stand and walk during shifts lasting up to 12 hours, and frequently push, pull, squat, bend, and reach, with or without reasonable accommodation. \u003cbr/\u003e• Work outside and drive different motor vehicles over the road. \u003cbr/\u003e• Drive in accordance with DOT requirements. \u003cbr/\u003e• Stay connected to the operation by participating in on-road processes on a regular basis \u003cbr/\u003e• Be a resource to the delivery station for driver training-related questions \u003cbr/\u003e• Work as a peer trainer on an as needed basis to support the business. \u003cbr/\u003e• Motivate, coach, and provide feedback to Delivery Associates during Training \u003cbr/\u003e• Travel to multiple sites within 50 miles of the home station and have reliable transportation \u003cbr/\u003e• Operate and navigate a 26,000 pounds or less vehicle \u003cbr/\u003e• Track performance and provide identified retraining and process improvement opportunities to further develop non-CDL driver, DOT regulated training. \u003cbr/\u003e• Effectively operate a GPS \u003cbr/\u003e• Associate may be required to gain DOT Regulation Qualification as a condition of the role \u003cbr/\u003e• Work 40 hours/week, and overtime as required\u003cbr/\u003e","department_cost_center":null,"description_short":"This full-time position requires in-role training at an operating site which will be 5+ weeks in duration.This training will be located 50+ miles away from the home site location. All travel accommodations","display_distance":null,"id":"f4e93097-75a6-4e0b-a707-f2bee753bb73","id_icims":"3171743","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3171743/driver-trainer-rsr","job_schedule_type":"full-time","location":"US, KS, Manhattan","locations":["{\"normalizedStateName\":\"Kansas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Manhattan\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, KS, Manhattan\",\"coordinates\":\"39.17907,-96.56183\",\"normalizedCountyName\":\"Riley\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Manhattan, Kansas, USA\",\"location\":\"US, KS, Manhattan\",\"region\":\"KS\",\"buildingCodeList\":[\"WKS2\"],\"normalizedCityName\":\"Manhattan\"}"],"normalized_location":"Manhattan, Kansas, USA","optional_search_labels":[],"posted_date":"February  2, 2026","preferred_qualifications":"- Associate’s or Bachelor’s Degree, and/or prior Amazon experience\u003cbr/\u003e- Demonstrates problem solving and analytical skills\u003cbr/\u003e- Ability to communicate effectively (written and verbal) across various levels of an organization\u003cbr/\u003e- History of meeting/exceeding departmental goals\u003cbr/\u003e- Experience leading teams\u003cbr/\u003e- Capable of providing direction to team members using independent judgment\u003cbr/\u003e- Organization and time management skills\u003cbr/\u003e- Experience delivering training both to individuals and groups\u003cbr/\u003e- 2+ years of professional driving experience\u003cbr/\u003e- Bachelor’s Degree or 2+ years Amazon experience\u003cbr/\u003e- Knowledge of instructional theories: adult learning, on the job learning, knowledge management theories, virtual and classroom instruction\u003cbr/\u003e- Strong organizational, interpersonal, and communication skills\u003cbr/\u003e- Proven ability to deal with ambiguity and competing priorities Amazon is committed to a diverse and inclusive workplace.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below including the base pay rate plus the highest available shift differential which applies depending on the shift you select. As a total compensation company, you are eligible for additional earnings including overtime pay and performance bonuses. Final pay will be based on factors including shift selection and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, KS, Manhattan - 22.00 - 22.00 USD hourly","primary_search_label":"fulfillment-ops-team.fulfillment-associates","source_system":"JobCreator","state":"KS","title":"Driver Trainer, RSR","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3171743/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"fulfillment-associates","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of data-driven business operations processes experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Speak, write, and read fluently in English\u003cbr/\u003e- Experience with Microsoft Office products and applications\u003cbr/\u003e- Experience with Excel","business_category":"seller-services","city":"Bengaluru","company_name":"ASSPL - Karnataka","country_code":"IND","description":"Are you customer obsessed, flexible, smart and analytical, strategic yet execution focused, hungry and passionate about e-commerce? Are you an experienced and entrepreneurial leader with a strong work ethic? If yes, this opportunity will appeal to you. The ideal candidate will be enthusiastic about managing challenging, lengthy projects across multiple teams and locations. We are looking for an Operations Specialist who shares Amazon's passion for the customer—someone who understands the importance of compelling delivery programs in creating an overall customer (seller and buyer) experience.\u003cbr/\u003e\u003cbr/\u003eIn this role, you will be responsible for working closely with sellers, seller support, customer service, sales, and 3P carriers to identify delivery and fulfillment issues faced by sellers and work with them to alleviate their acute/short-term issues. You will also partner with product management teams to identify long-term delivery and fulfillment features and programs to improve the seller and customer experience on the Amazon platform.\u003cbr/\u003e\u003cbr/\u003eRole and Responsibilities:\u003cbr/\u003e• Monitor operations performance and work with other teams (3P Carriers, Customer Service, Seller Support, Product, Operations) to address performance issues and ensure metrics are within goals\u003cbr/\u003e• Work with operational teams to solve seller-reported issues \u003cbr/\u003e• Monitor and drive seller-impacting operational tickets to resolution\u003cbr/\u003e• Gather and analyze seller contacts and seller feedback to develop seller experience improvement suggestions and work with Product Managers for solutions\u003cbr/\u003e• Must be open to working on Saturday and Sunday, with any other 2 days of the week as off","department_cost_center":null,"description_short":"Are you customer obsessed, flexible, smart and analytical, strategic yet execution focused, hungry and passionate about e-commerce? Are you an experienced and entrepreneurial leader with a strong work","display_distance":null,"id":"8a4def19-6f24-4898-ae20-002c63d76640","id_icims":"3177030","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Risk Family","job_function_id":null,"job_path":"/en/jobs/3177030/product-compliance-associate-local-shops","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR37\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":["seller-services.team-amazon-business-marketplace"],"posted_date":"February  9, 2026","preferred_qualifications":"- Knowledge of consumer product compliance processes and regulations\u003cbr/\u003e- Experience in regulatory compliance management with government agencies\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"seller-services.no-team-listed","source_system":"JobCreator","state":"KA","title":"Product Compliance Associate, Local Shops","university_job":null,"updated_time":"19 minutes","url_next_step":"https://account.amazon.com/jobs/3177030/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team\u003cbr/\u003e- Bachelor's degree in computer science or equivalent","business_category":"no-business-category","city":"Gurugram","company_name":"ADCI - Haryana","country_code":"IND","description":"Transform the future of transportation logistics by developing cutting-edge technological solutions that optimize fleet management and operational efficiency. You'll be at the forefront of creating intelligent systems that support Amazon's global transportation network, leveraging advanced technologies to solve complex challenges and drive innovation in asset management.\u003cbr/\u003e\u003cbr/\u003eYour day will be a dynamic blend of strategic planning, cross-functional collaboration, and technological innovation. You'll work closely with engineering teams to design and implement solutions that track, manage, and optimize transportation assets across our global network. Expect to dive into data-driven decision-making, prototype new technologies, and develop products that directly impact the efficiency and safety of our transportation ecosystem.\u003cbr/\u003e\u003cbr/\u003eWe are a passionate group of technologists and problem-solvers dedicated to reinventing transportation logistics. Our team sits at the intersection of technology and operational excellence, working to create intelligent systems that support drivers, carriers, and associates. We embrace collaborative innovation and are committed to developing solutions that make a tangible difference in how transportation networks operate.\u003cbr/\u003e","department_cost_center":null,"description_short":"Transform the future of transportation logistics by developing cutting-edge technological solutions that optimize fleet management and operational efficiency. You'll be at the forefront of creating intelligent","display_distance":null,"id":"a6b99164-6539-4ece-ab6b-882f4e5fee20","id_icims":"3168416","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3168416/software-development-engineer-relay-fleet-tech-tts","job_schedule_type":"full-time","location":"IN, HR, Gurugram","locations":["{\"normalizedStateName\":\"Haryana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Gurugram\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, HR, Gurugram\",\"coordinates\":\"28.47716,77.06847\",\"normalizedCountyName\":\"Gurugram\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Gurugram, Haryana, IND\",\"location\":\"IN, HR, Gurugram\",\"region\":\"HR\",\"buildingCodeList\":[\"DEL24\"],\"normalizedCityName\":\"Gurugram\"}"],"normalized_location":"Gurugram, Haryana, IND","optional_search_labels":[],"posted_date":"January 28, 2026","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"HR","title":"Software Development Engineer, Relay Fleet Tech (TTS)","university_job":null,"updated_time":"24 minutes","url_next_step":"https://account.amazon.com/jobs/3168416/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team\u003cbr/\u003e- Bachelor's degree in computer science or equivalent","business_category":"finance","city":"Hyderabad","company_name":"ADCI HYD 13 SEZ","country_code":"IND","description":"Are you interested in contributing to the next generation of financial systems that manage large-scale transactions? Are you curious about building scalable systems that leverage Amazon’s cloud technologies?\u003cbr/\u003e\u003cbr/\u003eOur team works with significant data volumes and complex business rules in a distributed, service-oriented architecture. We focus on developing software systems that accurately capture, process, and report the large volume of financial transactions generated as customers make purchases\u003cbr/\u003e\u003cbr/\u003eWe are looking for candidates who bring solid analytical and problem-solving skills, experience in software development, and an interest in building maintainable and reliable applications . Team members collaborate with internal stakeholders and partner teams across Amazon to develop applications that meet high operational standards for availability and reliability. In the workflow management space, engineers often work on new problem areas and have opportunities to build reusable components that support broader engineering needs.\u003cbr/\u003e\u003cbr/\u003eWe are looking for engineers who communicate clearly, work independently or collaboratively, adapt to changing requirements, and contribute positively to team culture. This role may include participating in design reviews and supporting the development of other engineers.\u003cbr/\u003e\u003cbr/\u003eIn this role, you will help build new software products and features from the ground up. You will work with a range of technologies, programming languages, and systems, and stay engaged with evolving industry trends.\u003cbr/\u003e\u003cbr/\u003eYour responsibilities will span the full software development lifecycle, with opportunities to share ideas and see your work deliver value across Amazon. The Finance Automation team is seeking a software development engineer to contribute to large, complex initiatives that support our global operations.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e6+ years of non-internship professional software development experience\u003cbr/\u003e5+ years of programming with at least one software programming language experience\u003cbr/\u003e5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003eExperience as a mentor, tech lead or leading an engineering team\u003cbr/\u003eBachelor's degree in computer science or equivalent","department_cost_center":null,"description_short":"Are you interested in contributing to the next generation of financial systems that manage large-scale transactions? Are you curious about building scalable systems that leverage Amazon’s cloud technologies?Our","display_distance":null,"id":"ce4e8959-4484-4556-8271-d98086a2b8af","id_icims":"3162297","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3162297/senior-software-dev-engineer-finauto-fdm","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD13\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":[],"posted_date":"January 20, 2026","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-finauto","source_system":"JobCreator","state":"TS","title":"Senior Software Dev Engineer, FinAuto FDM","university_job":null,"updated_time":"25 minutes","url_next_step":"https://account.amazon.com/jobs/3162297/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-finauto","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team\u003cbr/\u003e- Bachelor's degree in computer science or equivalent","business_category":"no-business-category","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"Are you a senior technical leader interested in owning business-critical, highly scalable systems and contributing to innovation? Do you have experience attracting, developing, and supporting engineering talent for complex challenges? Are you comfortable leading cross-functional initiatives that involve both technical and business stakeholders?\u003cbr/\u003e\u003cbr/\u003eThe Inventory Movement, Accuracy, and Controllership team—part of Amazon Fulfillment Technologies—owns key components of Amazon’s global supply chain. We manage the movement of hundreds of millions of units from vendors and sellers through our inbound platforms, ensuring inventory is accurately received, accounted for, and ready to serve customers worldwide. Our systems operate within Amazon’s large-scale service-oriented architecture, where reliability and adaptability are essential.\u003cbr/\u003e\u003cbr/\u003eWe are seeking a Software Development Engineer who is interested in leading engineering teams, solving complex problems, and supporting the operation of mission-critical systems at scale.\u003cbr/\u003e\u003cbr/\u003eIn this role, you will contribute to the evolution of inventory architecture, own core services, and support Operational Excellence across those services. You will be part of a team responsible for a broad suite of receive services that form the foundational layer enabling inbound fulfillment at Amazon.\u003cbr/\u003e\u003cbr/\u003eThe successful candidate will demonstrate technical leadership and the ability to deliver through others, with experience across the software development lifecycle—including design, development, documentation, testing, deployment, and operations. Strong written and verbal communication skills, a sense of ownership, and the ability to work effectively in a fast-paced environment are important for this role.","department_cost_center":null,"description_short":"Are you a senior technical leader interested in owning business-critical, highly scalable systems and contributing to innovation? Do you have experience attracting, developing, and supporting engineering","display_distance":null,"id":"0323878d-96cc-47e4-b5ec-48a14bf3942a","id_icims":"3167882","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3167882/sdeiii-aft-inventory","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR18\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"January 27, 2026","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"KA","title":"SDEIII, AFT Inventory","university_job":null,"updated_time":"27 minutes","url_next_step":"https://account.amazon.com/jobs/3167882/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Abgeschlossene technische Berufsausbildung, anerkannt durch die Industrie- und Handelskammer (IHK) oder Handwerkskammer (HWK) oder Nachweis eines erfolgreich abgeschlossen Hochschulstudium im Ingenieurwissenschaftlichen Bereich (Maschinenbau / Elektrotechnik oder artverwandt) einer deutschen Hochschule oder anerkannte ausländische Hochschulabschlüsse (BA, B. Sc., MA, M. Sc., Dipl.-Ing.)\u003cbr/\u003e- Mindestens zweijährige Berufserfahrung in dem entsprechenden Handwerk\u003cbr/\u003e- Erfahrung in der Instandhaltung von industriellen Produktionsanlagen\u003cbr/\u003e- Fortgeschrittene Deutschkenntnisse in Wort und Schrift","business_category":"fulfillment-ops","city":"Raunheim","company_name":"Amazon Deutschland S8 Transport GmbH - J70","country_code":"DEU","description":"Das Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) ist für unseren Betrieb von fundamentaler Bedeutung – es sorgt dafür, dass unsere technischen Systeme und Anlagen laufend funktionieren. Als Instandhaltungstechniker:in bist Du für die Wartung und Instandhaltung unserer förder- und haustechnischen Anlagen sowie Produktionsanlagen zuständig. Du hilfst, die höchsten Sicherheitsstandards im Arbeitsschutz zu gewährleisten und Maschinenausfallzeiten zu verhindern. Unser technisches Team stellt eine hohe Verfügbarkeit der technischen Anlagen sicher und verbessert die Qualität unserer Geräte.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAusführung präventiver Wartungsmaßnahmen an einer breiten Vielfalt von Geräten an unseren Standorten\u003cbr/\u003eDurchführung von Reparaturen und Fehlerdiagnosen\u003cbr/\u003eVerwendung neuester Tools zur Maximierung der Geräteeffektivität\u003cbr/\u003eEinhaltung aller Arbeitsschutzrichtlinien und -praktiken \u003cbr/\u003eUnterstützung der Entwicklung und des beruflichen Fortschritts von Auszubildenden am Standort\u003cbr/\u003eArbeit an Projekten zur kontinuierlichen Verbesserung und Einführung von Best Practices an verschiedenen EU-Standorten\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAls Instandhaltungstechniker:in bist Du vor Ort in einem unserer Logistikzentren tätig, um schnell auf technische Störungen reagieren zu können. Du führst eine Reihe geplanter präventiver Wartungsmaßnahmen an Geräten durch, um für ihren sicheren Betrieb zu sorgen. Außerdem reagierst Du als Instandhaltungstechniker:in unverzüglich auf Störungen und Ausfälle. Du untersuchst die Ursachen, findest so schnell wie möglich Lösungen und wendest sie an.  Zudem machst Du Vorschläge für langfristige Verbesserungen.\u003cbr/\u003eIn Zusammenarbeit mit leitenden Kolleg:innen nimmst Du tägliche Wartungsaufgaben wahr und kommunizierst mit Dienstleistern, falls Du externe Expertise benötigst. Du arbeitest in rotierenden Schichten, damit wir rund um die Uhr unsere Standorte unterstützen – und dafür sorgen, dass Amazon weiterhin in dem Tempo liefern kann, für das wir bekannt sind. ","department_cost_center":null,"description_short":"Das Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) ist für unseren Betrieb von fundamentaler Bedeutung – es sorgt dafür, dass unsere technischen Systeme und","display_distance":null,"id":"ceebe719-2a94-4a03-94af-d8236c219831","id_icims":"3174811","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3174811/instandhaltungstechniker-in","job_schedule_type":"full-time","location":"DE, HE, Raunheim","locations":["{\"normalizedStateName\":\"Hesse\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Raunheim\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, HE, Raunheim\",\"coordinates\":\"50.01534,8.45329\",\"normalizedCountyName\":\"Groß-Gerau\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Raunheim, Hesse, DEU\",\"location\":\"DE, HE, Raunheim\",\"region\":\"HE\",\"buildingCodeList\":[\"HHE1\",\"DHE1\"],\"normalizedCityName\":\"Raunheim\"}"],"normalized_location":"Raunheim, Hesse, DEU","optional_search_labels":["jdv.operations.rmetechnician","hourly","ops.rme-technician"],"posted_date":"February  5, 2026","preferred_qualifications":"- Erfahrung mit zustandsorientierter Überwachung\u003cbr/\u003e- Erfahrung in der Arbeit mit Druck- und Applikationsmaschinen\u003cbr/\u003e- Erfahrung in der Störungssuche und Wartung von Förder- oder Automationssystemen\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":"HE","title":"Instandhaltungstechniker :in","university_job":null,"updated_time":"27 minutes","url_next_step":"https://account.amazon.com/jobs/3174811/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team\u003cbr/\u003e- Bachelor's degree in computer science or equivalent","business_category":"no-business-category","city":"Hyderabad","company_name":"ADCI - Delhi","country_code":"IND","description":"Are you an experienced engineer driven to solve complex technical problems that impact hundreds of developers at scale?\u003cbr/\u003e\u003cbr/\u003eDo you aspire to architect and build platforms that fundamentally transform how engineering teams design, build, and deliver software?\u003cbr/\u003e\u003cbr/\u003eThe Developer Experience Engineering team is looking for a Senior Software Development Engineer to lead high-impact technical initiatives that remove developer friction, streamline workflows, and deliver measurable gains in productivity, efficiency, and operational excellence..\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eTechnical Leadership \u0026 Architecture\u003cbr/\u003e\u003cbr/\u003e- Design and architect scalable systems for developer productivity tools, dashboards, and automation platforms used by hundreds of engineers\u003cbr/\u003e- Lead the technical direction for major features and products within the developer experience portfolio\u003cbr/\u003e- Drive technical decisions and establish best practices for your team's codebase and infrastructure\u003cbr/\u003e- Mentor SDE 1s and SDE 2s, conducting design reviews and providing technical guidance\u003cbr/\u003e- Partner with Principal Engineers to solve complex technical challenges and align on architectural approaches\u003cbr/\u003e\u003cbr/\u003eBuild High-Impact Products\u003cbr/\u003e- Create automation solutions that measurably reduce toil and improve developer workflows\u003cbr/\u003e- Design APIs and frameworks that other teams can leverage to build their own productivity solutions\u003cbr/\u003e- Ensure your solutions are scalable, maintainable, and operationally excellent\u003cbr/\u003e\u003cbr/\u003eCross-Functional Collaboration\u003cbr/\u003e- Partner with development teams across the organization to deeply understand their pain points and requirements\u003cbr/\u003e- Work with Principal Engineers to validate technical approaches and incorporate feedback\u003cbr/\u003e- Collaborate with your manager and other senior engineers to define roadmaps and prioritize initiatives\u003cbr/\u003e- Influence technical decisions across partner teams to drive adoption of best practices\u003cbr/\u003e- Present technical designs and results to leadership and stakeholders\u003cbr/\u003e","department_cost_center":null,"description_short":"Are you an experienced engineer driven to solve complex technical problems that impact hundreds of developers at scale?Do you aspire to architect and build platforms that fundamentally transform how engineering","display_distance":null,"id":"792e6307-5ab6-451e-ac6a-23c0a6cdf3c0","id_icims":"3172886","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3172886/sr-sde-realm","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD13\"],\"normalizedCityName\":\"Hyderabad\"}","{\"normalizedStateName\":\"Haryana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Gurugram\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, HR, Gurugram\",\"coordinates\":\"28.47716,77.06847\",\"normalizedCountyName\":\"Gurugram\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Gurugram, Haryana, IND\",\"location\":\"IN, HR, Gurugram\",\"region\":\"HR\",\"buildingCodeList\":[\"DEL24\"],\"normalizedCityName\":\"Gurugram\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":[],"posted_date":"February  3, 2026","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"TS","title":"Sr. SDE, REALM","university_job":null,"updated_time":"28 minutes","url_next_step":"https://account.amazon.com/jobs/3172886/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}