{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- - Experience working and communicating with multiple stakeholders, C-level executives and cross functional teams or equivalent\u003cbr/\u003e- - Knowledge of Excel (Pivot Tables, VLookUps) at an advanced level and SQL\u003cbr/\u003e- - Experience working with fast-moving, high-performance teams and driving innovative solutions tailored to unique business environments\u003cbr/\u003e- - - 10+ 2 degree","business_category":"transportation-and-logistics","city":"Hyderabad - Virtual","company_name":"Amazon Dev Center India - Hyderabad - A85","country_code":"IND","description":"TOC (Transportation Operation Center) is the central command and control center for ‘Transportation Execution’ across the Amazon Supply Chain network supporting multiple geographies like NA, India and EU. It    ensures hassle free, timely pick-up and delivery of freight from   vendors  to Amazon fulfillment centers (FC) and from Amazon FCs to   carrier hubs.  In case of any exceptions, TOC steps in to resolve the   issue and keeps  all the stakeholders informed on the proceedings. Along   with this  tactical problem solving TOC is also charged with   understanding trends  in network exceptions and then automating   processes or proposing process  changes to streamline operations. This   second aspect involves network  monitoring and significant analysis of   network data.\r\u003cbr/\u003e  Overall, TOC  plays a critical role in ensuring the   smooth functioning of Amazon  transportation and thereby has a direct   impact on Amazon’s ability to  serve its customers on time.\r\u003cbr/\u003e  Purview of a Trans Ops Specialist\r\u003cbr/\u003e     A Trans Ops Specialist at TOC facilitates flow of information  between   different stakeholders (Trans Carriers/Hubs/Warehouses) and  resolves  any  potential issues that impacts customer experience and  business   continuity. Trans Ops Specialist at TOC works across two verticals – Inbound and Outbound operations. \r\u003cbr/\u003e     Inbound Operations deals with Vendor/Carrier/FC relationship,   ensuring  that the freight is picked-up on time and is delivered at FC   as per the  given appointment. Trans Ops Specialist on Inbound addresses   any  potential issues occurring during the lifecycle of pick-up to   delivery.\r\u003cbr/\u003e   Outbound Operations deals with FC/Carrier/Carrier Hub   relationship,  ensuring that the truck leaves the FC in order to   delivery customer  orders as per promise. Trans Ops Specialist    on Outbound addresses any potential issues occurring during the    lifecycle of freight leaving the FC and reaching customer premises.\r\u003cbr/\u003e\r\u003cbr/\u003e  A Trans Ops Specialist    provides timely resolution to the issue in hand by researching and    querying internal tools and by taking real-time decisions. An ideal    candidate should be able to understand the requirements/be able to    analyze data and notice trends and be able to drive Customer Experience    without compromising on time. The candidate should have the basic    understanding of Logistics and should be able to communicate clearly in    the written and oral form. Trans Ops Specialist should be able to   ideate  process improvements and should have the zeal to drive them to    conclusion. \r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003eResponsibilities include, but are not limited to:\r\u003cbr/\u003e   \r\u003cbr/\u003e     ·         Communication with external customers (Carriers,    Vendors/Suppliers) and internal customers (Retail, Finance, Software    Support, Fulfillment Centers)\r\u003cbr/\u003e  ·         Ability to pull data from    numerous databases (using Excel, Access, SQL and/or other data    management systems) and to perform ad hoc reporting and analysis as    needed is a plus.\r\u003cbr/\u003e  ·         Develop and/or understand performance metrics to assist with driving business results.\r\u003cbr/\u003e     ·         Ability to scope out business and functional requirements    for the Amazon technology teams who create and enhance the software    systems and tools are used by TOC.\r\u003cbr/\u003e  ·         Must be able to    quickly understand the business impact of the trends and make decisions    that make sense based on available data.\r\u003cbr/\u003e  ·         Must be able  to   systematically escalate problems or variance in the information and   data  to the relevant owners and teams and follow through on the   resolutions  to ensure they are delivered.\r\u003cbr/\u003e  ·         Work within   various time  constraints to meet critical business needs, while   measuring and  identifying activities performed.\r\u003cbr/\u003e  ·           Excellent  communication, both verbal and written as one may be required   to create a  narrative outlining weekly findings and the variances to   goals, and  present these finding in a review forum.\r\u003cbr/\u003e - Providing real-time customer experience by working in 24*7      operating environment.\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003eA day in the life\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003eAbout the hiring group\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003eJob responsibilities\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003eA day in the life\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003eAbout the hiring group\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003eJob responsibilities\r\u003cbr/\u003e\r\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e Communication with external customers (Carriers, Vendors/Suppliers) and internal customers (Retail, Finance, Software Support, Fulfillment Centers)\u003cbr/\u003e· Ability to pull data from numerous databases (using Excel, Access, SQL and/or other data management systems) and to perform ad hoc reporting and analysis as needed is a plus.\u003cbr/\u003e· Develop and/or understand performance metrics to assist with driving business results.\u003cbr/\u003e· Ability to scope out business and functional requirements for the Amazon technology teams who create and enhance the software systems and tools are used by TOC.\u003cbr/\u003e· Must be able to quickly understand the business impact of the trends and make decisions that make sense based on available data.\u003cbr/\u003e· Must be able to systematically escalate problems or variance in the information and data to the relevant owners and teams and follow through on the resolutions to ensure they are delivered.\u003cbr/\u003e· Work within various time constraints to meet critical business needs, while measuring and identifying activities performed.\u003cbr/\u003e· Excellent communication, both verbal and written as one may be required to create a narrative outlining weekly findings and the variances to goals, and present these finding in a review forum.\u003cbr/\u003e\u003cbr/\u003eProviding real-time customer experience by working in 24*7 operating environment.","department_cost_center":null,"description_short":"TOC (Transportation Operation Center) is the central command and control center for ‘Transportation Execution’ across the Amazon Supply Chain network supporting multiple geographies like NA, India and","display_distance":null,"id":"9bbb12c9-72c4-441b-9666-79d48655630b","id_icims":"3180666","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Cust. Experience Qualit Ops","job_function_id":null,"job_path":"/en/jobs/3180666/transportation-representative-av","job_schedule_type":"full-time","location":"IN, TS, Hyderabad - Virtual","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad - Virtual\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad - Virtual\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad - Virtual\",\"region\":\"TS\",\"buildingCodeList\":[\"VCCTSIND\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"February 13, 2026","preferred_qualifications":"- Knowledge of Six Sigma, Lean manufacturing efforts, transportation and logistics, or fulfillment and distribution centers\u003cbr/\u003e- - Knowledge of and proficiency in Excel and SQL\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-fulfillment-transportation","source_system":"JobCreator","state":"TS","title":"Transportation Representative, AV","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3180666/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-transportation","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 10+ years of law enforcement or security-related experience\u003cbr/\u003e- Experience in law enforcement or a security-related profession","business_category":"fulfillment-and-operations","city":"Kolkata","company_name":"ASSPL - West Bengal - D36","country_code":"IND","description":"Amazon India Security and Loss Prevention (INSLP) team is seeking highly skilled, motivated and passionate security professional who could partner in developing and implementing a world class security program for India operations network. Amazon is one of the most recognizable brand names and we fulfill millions of products each year to our loyal customers. We look forward to hire the brightest minds by offering them an environment in which they can relentlessly improve the shopping experience for our customers by creating innovative secure supply chain solutions.\u003cbr/\u003e\u003cbr/\u003eThe primary objective of the Loss Prevention Expert is to ensure the protection of people \u0026 assets of amazon sites in accordance with GSO guidelines and Policies. The role is a key member of the Amazon INSLP team and reports to Cluster Loss Prevention Manager (CLPM). The role is cross-functional requiring deep collaboration and influencing ability with stakeholders from business and corporate functions. He/she assist CLPM in day to day activities such as investigations, risk assessments, data analysis, implementation of security policies, drive compliance amongst stakeholders and vendors. Contribute to reduce business losses on security incidents and related claims by identifying and understanding vulnerabilities, MO’s, and implementation of the appropriate means and measures to protect transported assets in operational environment. Direct involvement in complex investigations at a high level. If required also act as the lead interface for wholesalers and third-party providers. Implement strategies and programs which prevent theft, diversion and losses from the supply chain in partnership with internal and external stakeholders.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Perform risk assessment and frame mitigation measures.\u003cbr/\u003e• Drive physical security performance and compliance in AoR.\u003cbr/\u003e• Ensure optimum functioning of electronic surveillance devices in accordance with Global Security Operation (GSO) policies.\u003cbr/\u003e• Posses ability to work on various tools \u0026 perform trend analysis using data mining and analytical skills.\u003cbr/\u003e• Ability to conduct detailed investigation within the policy framework, identify root cause \u0026 document management action plan for process formulation/ compliance/ improvement\u003cbr/\u003e• Engage effectively in people experience and performance.\u003cbr/\u003e• Ability to respond \u0026 implement crisis management plan to support business continuity\u003cbr/\u003e• Implement key liaison contacts in industry, law enforcement, government and regulatory agencies to maintain awareness of and provide tactical response to upcoming legislation, industry trends, external risks and new technologies related to operations.\u003cbr/\u003e• Report incidents to GSOC as per agreed escalation matrix.\u003cbr/\u003e• Possess the ability to deliver under ambiguous and strenuous situations.\u003cbr/\u003e• Deliver on projects or continuous improvement initiatives using Agile or lean methodologies.\u003cbr/\u003e• Possess complete understanding of surveillance, access control systems, etc.","department_cost_center":null,"description_short":"Amazon India Security and Loss Prevention (INSLP) team is seeking highly skilled, motivated and passionate security professional who could partner in developing and implementing a world class security","display_distance":null,"id":"74bc7f27-c6dd-450c-89f5-ce05eab9dee6","id_icims":"3181608","is_intern":null,"is_manager":null,"job_category":"Investigation \u0026 Loss Prevention","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3181608/slp-expert-intl-investigation-loss-prevention","job_schedule_type":"full-time","location":"IN, WB, Kolkata","locations":["{\"normalizedStateName\":\"West Bengal\",\"normalizedCountryCode\":\"IND\",\"city\":\"Kolkata\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, WB, Kolkata\",\"coordinates\":\"22.5706,88.37132\",\"normalizedCountyName\":\"Kolkata\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Kolkata, West Bengal, IND\",\"location\":\"IN, WB, Kolkata\",\"region\":\"WB\",\"buildingCodeList\":[\"KOL41\"],\"normalizedCityName\":\"Kolkata\"}"],"normalized_location":"Kolkata, West Bengal, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"February 16, 2026","preferred_qualifications":"- Experience in investigation or loss prevention\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-global-fulfillment-loss-prevention-and-security","source_system":"JobCreator","state":"WB","title":"SLP Expert, INTL , Investigation \u0026 Loss Prevention","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3181608/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-fulfillment-loss-prevention-and-security","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in electrical or mechanical engineering, engineering technology or equivalent\u003cbr/\u003e- Experience developing and implementing training programs\u003cbr/\u003e- Experience in data center engineering or operations\u003cbr/\u003e- Experience giving skills and communicating complex concepts clearly and effectively to diverse audiences across different functions","business_category":"aws","city":"Västerås","company_name":"Amazon Data Services Sweden AB","country_code":"SWE","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, and we’re looking for talented people who want to help. You’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eBased in Vasteras, Sweden and reporting to the Manager of Customer Success for APMEA and EURI, Customer Success Engineer's (CSE) help clusters to become and remain self-sufficient in executing their own training programs to include planning and conducting of training activities. CSEs collaborate with Training Coordinators on the Data Center Learning team as well as managers and administrators in their clusters, to ensure training is planned, assigned, and scheduled properly. CSEs facilitate the Train-the-Trainer program in their clusters to ensure each cluster has the right number and type of Certified Instructors to conduct their training locally.\u003cbr/\u003e\u003cbr/\u003eAs a CSE you will track key metrics for your clusters, ensure data accuracy, assist in the reporting of these metrics as required, and within Data Center Learning you are the owner of training metrics for your clusters. Each CSE is both the front-line, day-to-day face of Data Center Learning in their clusters, and is also the front-line voice of the customer in representing their needs across Data Center Learning.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Manage projects and deliver critical solutions, improvements, and mechanisms, which require you to work independently across teams.\u003cbr/\u003e\u003cbr/\u003e- Engage with our customers to identify what is hindering growth, develop solutions, and test before scaling to benefit all customers.\u003cbr/\u003e\u003cbr/\u003e- Organize, understand, and share customer feedback with other teams to ensure Data Center Learning’s decisions always consider the voice of the customer. You understand customer sentiment about Data Center Learning products and services.\u003cbr/\u003e\u003cbr/\u003e- Transform raw thoughts into clear, consistent, and accurate documentation and/or direction. You own training strategies, training plans, and project status communication.\u003cbr/\u003e\u003cbr/\u003e- Build constructive working relationships with customers, stakeholders, managers, and peers. You recognize discordant views and take part in constructive dialogue to resolve them.\u003cbr/\u003e\u003cbr/\u003e- Support new cluster launches by engaging with cluster leadership early and helping them build their training program as the cluster prepares to launch.\u003cbr/\u003e\u003cbr/\u003e- Collect data across multiple initiatives, are able to ensure data accuracy, and can communicate actionable insights from this data.\u003cbr/\u003e\u003cbr/\u003e- Audit cluster training plans and completion metrics, to identify areas for support or intervention.\u003cbr/\u003e\u003cbr/\u003e- Manage the rollout, maintenance, and auditing of the Train-the-Trainer program in your clusters to ensure they have the right number and type of Certified Instructors.\u003cbr/\u003e\u003cbr/\u003e- Highly skilled in the Data Center Learning’s learning management systems (LMS), KNet \u0026 Learn.\u003cbr/\u003e\u003cbr/\u003e- Able to create and close sessions, identify missed automated assignments, deep dive root causes, and escalate when required to resolve issues and minimize broader impact.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"cb3c83a1-463f-4203-b01d-bea683167f92","id_icims":"3179828","is_intern":null,"is_manager":null,"job_category":"Leadership Development \u0026 Training","job_family":"Technical Training","job_function_id":null,"job_path":"/en/jobs/3179828/customer-success-engineer-data-center-learning","job_schedule_type":"full-time","location":"SE, Västerås","locations":["{\"normalizedStateName\":\"Vastmanland County\",\"normalizedCountryCode\":\"SWE\",\"city\":\"Västerås\",\"countryIso3a\":\"SWE\",\"countryIso2a\":\"SE\",\"locationNonStemming\":\"Sweden, Västerås\",\"coordinates\":\"59.60959,16.54538\",\"normalizedCountyName\":\"Vasteras\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Sweden\",\"normalizedLocation\":\"Vasteras, Vastmanland County, SWE\",\"location\":\"SE, Västerås\",\"region\":\"\",\"buildingCodeList\":[\"ARN52\"],\"normalizedCityName\":\"Vasteras\"}"],"normalized_location":"Vasteras, Vastmanland County, SWE","optional_search_labels":["aws.team-dc"],"posted_date":"February 12, 2026","preferred_qualifications":"- Experience with adult learning instructional design methods and best practices\u003cbr/\u003e- Strong quantitative and analytical skills, with the ability to use data and metrics to understand and report on programs/projects, and to drive necessary actions.\u003cbr/\u003e- Experience with educational technology, learning platforms and developing talent pipelines and career pathways\u003cbr/\u003e- Basic knowledge of the Data Center Learning’s learning management systems (LMS) \u0026 Learn.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-support","source_system":"JobCreator","state":null,"title":"Customer Success Engineer, Data Center Learning","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3179828/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of analyzing and interpreting data with Redshift, Oracle, NoSQL etc. experience\u003cbr/\u003e- Experience with data visualization using Tableau, Quicksight, or similar tools\u003cbr/\u003e- Experience with one or more industry analytics visualization tools (e.g. Excel, Tableau, QuickSight, MicroStrategy, PowerBI) and statistical methods (e.g. t-test, Chi-squared)\u003cbr/\u003e- Experience with scripting language (e.g., Python, Java, or R)","business_category":"no-business-category","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"The EU International Technology (EU INTech) charter for Partner Growth and Experiences (PGX) is established to deliver coherent and personalized experiences for Selling Partners (SP) and Amazon teams, enabling them to manage their business growth across Amazon WW stores as a single-store experience, benefiting Amazon customers by accelerating Amazon flywheel. Our mission is to delight Customers and enable long-term success of Selling Partners by building the most trusted shopping experiences and a suite of services, tools and experiences that drive efficiency, growth and transparency for both, our Selling Partners and internal Retail teams, throughout their selling journey and across regions.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs an Amazon Business Intelligence Engineer you will be working in one of the world's largest and most complex data warehouse environments. You should have deep experience in the design, creation, management, and business use of large datasets. You should have excellent business and communication skills to be able to work with business owners to develop and define key business questions, and to build data sets that answer those questions. You should be good at designing, implementing, and operating stable, scalable, low cost solutions to flow data from production systems into the data warehouse and into end-user facing applications. You should be able to work with business customers in understanding the business requirements and implementing reporting solutions.\u003cbr/\u003eThe person will need to effectively communicate across all levels and be self-motivated to raise the bar on deriving insights from analytics and identify opportunities to delight the customers. Above all you should be passionate about bringing large datasets together to answer business questions and drive change.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis person will own the production and delivery of suite of analytics reports and dashboards used by the organization to make key business decisions. This will involve:\u003cbr/\u003e1) Delivery of standardized performance metrics for global customers and stakeholders.\u003cbr/\u003e2) Partner with existing Product Managers, Business Leaders in executing defined roadmap of projects.\u003cbr/\u003e3) Provide ad-hoc support to EU INTech finance and business services for SQL report creation, modification and optimization.\u003cbr/\u003e4) Debug report issues, unblock workflows and communicate with other teams and stakeholders by providing regular status updates.","department_cost_center":null,"description_short":"The EU International Technology (EU INTech) charter for Partner Growth and Experiences (PGX) is established to deliver coherent and personalized experiences for Selling Partners (SP) and Amazon teams,","display_distance":null,"id":"140f42f4-e268-4f4d-b573-1b83d149954f","id_icims":"3181607","is_intern":null,"is_manager":null,"job_category":"Business Intelligence","job_family":"Business Intel Engineer","job_function_id":null,"job_path":"/en/jobs/3181607/business-intelligence-engineer-bie-pgx-eu-intech","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR18\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"February 16, 2026","preferred_qualifications":"- Master's degree, or Advanced technical degree\u003cbr/\u003e- Knowledge of data modeling and data pipeline design\u003cbr/\u003e- Experience with statistical analysis, co-relation analysis\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"KA","title":"Business Intelligence Engineer (BIE), PGX, EU INTech","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3181607/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree","business_category":"studentprograms","city":"Madrid","company_name":"Amazon Spain Services, S.L.U.","country_code":"ESP","description":"As a Sales \u0026 Operations Planning (S\u0026OP) Analyst at Amazon, you’ll be an expert in deep diving into our business data and presenting it in a clear, useful way. You’ll use it to help teams across our logistics function make lasting improvements and remain ambitious and inventive. This role will give you plenty of opportunities to learn, grow and use your expertise to drive efficiency across Amazon.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAnalyse data around KPIs to generate forward looking plans to present to senior stakeholders in the Operations business\u003cbr/\u003eBuild visualisation tools and dashboards to analyse and create reports for your team to drive action around KPIs\u003cbr/\u003eLook at the root cause of customer feedback and help your team make data-backed plans on how to avoid related issues\u003cbr/\u003eCreate or improve internal dashboards that give your colleagues better visibility of task-related data \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eEvery day is a little different in this role. Using your data analysis skills, you’ll explore and translate data into simple, visual forms to help your team and the wider business cut costs and address customer concerns.\u003cbr/\u003eAs an S\u0026OP Analyst, you’ll use your business acumen and analytic skills to help your team achieve their objectives. You’ll use data to illustrate problems and share your opinion and ideas to help find solutions. The pace of change is quick here, and this means that you keep learning every day in an environment where curiosity is always welcomed. Your opinion always counts and there’s no such thing as a silly question at Amazon.","department_cost_center":null,"description_short":"As a Sales \u0026 Operations Planning (S\u0026OP) Analyst at Amazon, you’ll be an expert in deep diving into our business data and presenting it in a clear, useful way. You’ll use it to help teams across our logistics","display_distance":null,"id":"1903d08f-97b2-485f-9d9b-01d25ec6fa2a","id_icims":"3179537","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Sales Operations Job Family","job_function_id":null,"job_path":"/en/jobs/3179537/graduate-partner-integrator-manager","job_schedule_type":"full-time","location":"ES, M, Madrid","locations":["{\"normalizedStateName\":\"Community of Madrid\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Madrid\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, M, Madrid\",\"coordinates\":\"40.42024,-3.68755\",\"normalizedCountyName\":\"Madrid\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Madrid, Community of Madrid, ESP\",\"location\":\"ES, M, Madrid\",\"region\":\"M\",\"buildingCodeList\":[\"MAD15\"],\"normalizedCityName\":\"Madrid\"}"],"normalized_location":"Madrid, Community of Madrid, ESP","optional_search_labels":["auta-ugnt"],"posted_date":"February 12, 2026","preferred_qualifications":"- Experience in project management\u003cbr/\u003e- Bachelor's degree or above in Computer Science, Engineering, or related fields\u003cbr/\u003e- Knowledge of a modern programming language (Ruby, Java, Python, or C#)\u003cbr/\u003e- Experience in external enterprise customer-facing role as a technical lead, with strong oral and written communication skills, presenting to both large and small audiences\u003cbr/\u003e- Experience communicating complex ideas to technical and non-technical audiences\u003cbr/\u003e- Experience working with Data \u0026 AI related technologies, including, but not limited to, AI/ML, GenAI, Analytics, Database, and/or Storage\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"studentprograms.team-jobs-for-grads","source_system":"JobCreator","state":"M","title":"Graduate Partner Integrator Manager","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3179537/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-jobs-for-grads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience designing or architecting (design patterns, reliability and scaling) of new and existing systems\u003cbr/\u003e- Knowledge of professional software engineering \u0026 best practices for full software development life cycle, including coding standards, software architectures, code reviews, source control management, continuous deployments, testing, and operational excellence\u003cbr/\u003e- Experience programming with at least one modern language such as Java, C++, or C# including object-oriented design","business_category":"retail","city":"Madrid","company_name":"Amazon Spain Services, S.L.U.","country_code":"ESP","description":"Are you seeking an environment where you can drive innovation and solve real world problems? Do you want to pave the future of Amazon Retail and global e-commerce?\u003cbr/\u003e\u003cbr/\u003eAmazon’s INTech (International Technology) organization is seeking talented Software Development Engineers to join our growing team. As a member our team, you will have the chance to significantly impact our systems, our business, and most importantly, our customers.\u003cbr/\u003e\u003cbr/\u003eWe’re a looking for an experienced Software Development Engineer to join the EUIC team and help us delighting Amazon customers worldwide.\u003cbr/\u003e\u003cbr/\u003eThis position is based in Madrid, the capital of Spain. A modern metropolitan city and an economical and industrial center of Spain.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs a Software Development Engineer, you will contribute to all aspects of an agile software development life cycle including design, architecture, development, documentation, testing and operations. You will push your design and architecture limits by owning all aspects of solutions end-to-end, through full stack software development.\u003cbr/\u003e\u003cbr/\u003e• You will be in charge of the complete software development life-cycle; defining, prioritising, designing, building, and testing new features.\u003cbr/\u003e• You will operate with globally distributed servers and customers. You will get the opportunity to work closely with a great team of software developers who will help you grow (and also learn things from you).\u003cbr/\u003e• You will understand what it takes to grow and operate Amazon business at our scale.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur team's vision is that every customer should be confident to visit Amazon to find an inspiring, delightful and trusted destination that resembles their physical and branded showroom experience for high-end shopping.\u003cbr/\u003e\u003cbr/\u003eWe have a highly collaborative and self-organized team culture, in which we tackle all projects and day-to-day responsibilities truly as a team. We work in 2 week sprints and continuously try to improve and get better at what we do and how we work together, having some fun while we're at it of course. Our projects usually combine frontend and backend work as well as frequent collaboration with partner teams.","department_cost_center":null,"description_short":"Are you seeking an environment where you can drive innovation and solve real world problems? Do you want to pave the future of Amazon Retail and global e-commerce?Amazon’s INTech (International Technology)","display_distance":null,"id":"f6768ae4-d94f-4f84-a94b-49576ca907b4","id_icims":"3181215","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3181215/software-development-engineer-eu-intech-consumer-selection-discovery","job_schedule_type":"full-time","location":"ES, M, Madrid","locations":["{\"normalizedStateName\":\"Community of Madrid\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Madrid\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, M, Madrid\",\"coordinates\":\"40.42024,-3.68755\",\"normalizedCountyName\":\"Madrid\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Madrid, Community of Madrid, ESP\",\"location\":\"ES, M, Madrid\",\"region\":\"M\",\"buildingCodeList\":[\"MAD15\"],\"normalizedCityName\":\"Madrid\"}"],"normalized_location":"Madrid, Community of Madrid, ESP","optional_search_labels":[],"posted_date":"February 13, 2026","preferred_qualifications":"- Master's degree in computer science or equivalent\u003cbr/\u003e- Experience in machine learning, data mining, information retrieval, statistics or natural language processing\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"retail.team-intech","source_system":"JobCreator","state":"M","title":"Software Development Engineer, EU InTech Consumer Selection Discovery","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3181215/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-intech","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Compétences techniques : Maîtrise démontrée des équipements informatiques et des logiciels, notamment la suite Microsoft Office et les systèmes d'exploitation Windows, dans un contexte professionnel IT\u003cbr/\u003e- Expérience en support : Expérience confirmée dans un environnement de support technique informatique ou dans la gestion et l'approvisionnement d'actifs IT\u003cbr/\u003e- Aptitudes relationnelles : Capacité avérée à communiquer efficacement avec différents niveaux d'interlocuteurs, des collègues aux cadres dirigeants\u003cbr/\u003e- Mobilité : Possession d'un permis de conduire valide\u003cbr/\u003e- Compétences linguistiques : Excellente maîtrise de la langue locale, tant à l'oral qu'à l'écrit","business_category":"operations","city":"Satolas-et-bonce","company_name":"Amazon France Logistique SAS","country_code":"FRA","description":"Chez Amazon, nous nous efforçons d'être l'entreprise la plus centrée sur le client au monde, où les gens peuvent trouver et découvrir tout ce qu'ils veulent acheter en ligne. Nous recrutons les esprits les plus brillants du monde et leur offrons un environnement dans lequel ils peuvent sans relâche améliorer l'expérience des clients. L'innovation et la créativité sont intégrées dans l'ADN de l'entreprise et sont encouragées à tous les niveaux de postes. Chaque jour, nous résolvons des problèmes techniques et commerciaux complexes avec ingéniosité et simplicité. Nous écrivons l'Histoire et la bonne nouvelle, c'est que nous venons seulement de commencer.\u003cbr/\u003eC'est votre chance d'écrire l'Histoire. \u003cbr/\u003e\u003cbr/\u003eEn tant que technicien(ne) informatique, vous rendrez compte au responsable informatique de votre site principal et aurez la responsabilité de travailler en étroite collaboration avec les utilisateurs, vos collègues et les équipes de support à distance afin de mettre en œuvre et de maintenir les éléments d'infrastructure. Vous représenterez le « visage de l'informatique » au sein de l'entreprise et vous réussirez à offrir un service de classe mondiale à nos clients. \u003cbr/\u003e \u003cbr/\u003eVous serez un élément clé d'une équipe multinationale diversifiée, vous réussirez à fournir des résultats de haute qualité et vous serez toujours à la recherche d'améliorations.\u003cbr/\u003eDomaine d'activité : Opérations — Centre de distribution et logistique\u003cbr/\u003e\u003cbr/\u003eL'équipe des Opérations Informatiques prend en charge l'infrastructure et les terminaux informatique de chacun des sites Amazon et fournit un support informatique à nos clients internes.\u003cbr/\u003e\u003cbr/\u003eQu'est-ce qui fait de cette équipe un endroit idéal pour travailler ?\u003cbr/\u003e -   Opportunités dès le premier jour — Vous rejoindrez une équipe responsable de ce qui se passe après que le client clique sur « acheter ».  \u003cbr/\u003e -   Possibilités de croissance - Vous aurez la possibilité d'influencer et de façonner l'orientation de nos services.\u003cbr/\u003e -   Vous participerez à des projets passionnants avec la chance de concentrer votre expertise et de la développer dans des domaines qui vous intéressent.\u003cbr/\u003eCe que nous recherchons :\u003cbr/\u003eEn accordant la priorité aux clients, vous offrirez un service de support de qualité qui garantit que tous les équipements et infrastructures informatiques fonctionnent de façon optimale et que tous les indicateurs clés de performance (KPI) et les accords de niveau de service (SLA) du service sont respectés sur votre site principal, ainsi que sur tous les sites distants soutenus par vous et votre équipe.  \u003cbr/\u003e   \u003cbr/\u003eL'étendue de vos responsabilités comprendra, sans toutefois s'y limiter : \u003cbr/\u003e   \u003cbr/\u003e -   Santé et sécurité : Capacité de prise de décision et de responsabilité, en veillant à ce que le travail soit effectué à un niveau élevé et conforme à l’ensemble des politiques et directives d'Amazon.\u003cbr/\u003e -   Installation, maintenance et support du matériel informatique \u003cbr/\u003e -   Gestion  du parc informatique et des stocks.\u003cbr/\u003e -   Assurer la liaison avec des fournisseurs et des prestataires tiers pour garantir une gestion efficace du parc informatique.\u003cbr/\u003e -   Assurer la liaison avec les fournisseurs externesetcommuniquer clairement les problèmes techniques ainsi que les normes Amazon.\u003cbr/\u003e -   Optimiser la disponibilité de tous les équipements et infrastructures informatiques grâce à une amélioration continue et à une maintenance proactive et préventive. \u003cbr/\u003e -   Fournir un soutien/une contribution technique aux projets et initiatives du site et de l'équipe.\u003cbr/\u003e -   Réaliser des essais et des tests sur les équipements utilisateur.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eSupport technique aux utilisateurs : Assurer l'installation, la maintenance et la résolution des incidents liés à l'infrastructure informatique, aux équipements et aux applications des utilisateurs finaux\u003cbr/\u003e\u003cbr/\u003eGestion des demandes : Traiter et suivre les tickets d'assistance jusqu'à leur résolution complète\u003cbr/\u003e\u003cbr/\u003eMaintenance préventive : Effectuer une maintenance proactive afin de garantir la disponibilité maximale de l'ensemble des équipements informatiques\u003cbr/\u003e\u003cbr/\u003eGestion des actifs : Administrer l'inventaire du matériel informatique et des pièces de rechange\u003cbr/\u003e\u003cbr/\u003eParticipation aux projets : Contribuer à la mise en œuvre de projets informatiques et proposer des solutions innovantes en collaboration avec les autres membres de l'équipe IT\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eDès votre arrivée, vous contribuerez activement au développement de nos capacités technologiques en déployant les solutions les plus récentes et en accompagnant vos collègues pour optimiser l'utilisation de leurs outils informatiques.\u003cbr/\u003e\u003cbr/\u003eDans cet environnement dynamique et stimulant, vous aurez l'opportunité de proposer des améliorations continues de nos systèmes et de travailler en étroite collaboration avec différentes équipes pour enrichir la qualité du service offert à nos clients internes.","department_cost_center":null,"description_short":"Chez Amazon, nous nous efforçons d'être l'entreprise la plus centrée sur le client au monde, où les gens peuvent trouver et découvrir tout ce qu'ils veulent acheter en ligne. Nous recrutons les esprits","display_distance":null,"id":"96d6aef9-a0cb-4dd7-b7cd-552796095e71","id_icims":"3180627","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Technical Services","job_function_id":null,"job_path":"/en/jobs/3180627/technicien-ne-systemes-et-reseaux","job_schedule_type":"full-time","location":"FR, Satolas-et-bonce","locations":["{\"normalizedStateName\":\"Auvergne-Rhone-Alpes\",\"normalizedCountryCode\":\"FRA\",\"city\":\"Satolas-et-bonce\",\"countryIso3a\":\"FRA\",\"countryIso2a\":\"FR\",\"locationNonStemming\":\"France, Satolas-et-bonce\",\"coordinates\":\"45.69358,5.12729\",\"normalizedCountyName\":\"Isère\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"France\",\"normalizedLocation\":\"Satolas-et-Bonce, Auvergne-Rhone-Alpes, FRA\",\"location\":\"FR, Satolas-et-bonce\",\"region\":\"\",\"buildingCodeList\":[\"LYS8\",\"LYS4\",\"XLY2\",\"XOR2\"],\"normalizedCityName\":\"Satolas-et-Bonce\"}"],"normalized_location":"Satolas-et-Bonce, Auvergne-Rhone-Alpes, FRA","optional_search_labels":[],"posted_date":"February 13, 2026","preferred_qualifications":"- Les qualifications préférées ne sont pas obligatoires pour postuler chez Amazon. Si vous possédez l'ensemble des qualifications de base mentionnées ci-dessus, nous serions ravis de recevoir votre candidature.\u003cbr/\u003e- Formation académique : Diplôme en informatique ou dans un domaine technique connexe\u003cbr/\u003e- Expertise réseau : Expérience dans la gestion d'infrastructures réseau\u003cbr/\u003e- Amélioration continue : Expérience démontrée dans l'optimisation de processus et de procédures existants\u003cbr/\u003e- Documentation technique : Capacité à élaborer une documentation claire, concise et structurée\u003cbr/\u003e\u003cbr/\u003eAmazon est un employeur engagé pour l'égalité des chances. Nous sommes convaincus qu'une main d'oeuvre diversifée est essentielle à notre réussite. Nous prenons nos décisions de recrutement en fonction de votre expérience et de vos compétences. Nous apprécions votre envie de découvrir, d'inventer, de simplifier et de construire. La protection de votre vie privée et la sécurité de vos données constituent depuis longtemps une priorité absolue pour Amazon. Veuillez consulter notre Politique de Confidentialité pour en savoir plus sur la façon dont nous collectons, utilisons et traitons les données personnelles de nos candidats.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"operations.team-ops-it","source_system":"JobCreator","state":null,"title":"Technicien(ne) Systèmes et Réseaux","university_job":null,"updated_time":"25 minutes","url_next_step":"https://account.amazon.com/jobs/3180627/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-ops-it","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 4+ years of Accounts Receivable or Account Payable experience\u003cbr/\u003e- 4+ years of applying key financial performance indicators (KPIs) to analyses experience\u003cbr/\u003e- 4+ years of creating process improvements with automation and analysis experience\u003cbr/\u003e- 4+ years of identifying, leading, and executing opportunities to improve, automate, standardize or simplify finance or business tools and processes experience\u003cbr/\u003e- CA with 4-8 years of post-qualification experience in Month end closing of Books of accounts/working on various sub-ledgers/Accounting Knowledge/Balance Sheet Reconciliation and Reporting activities","business_category":"finance","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"Amazon is a US-based multinational electronic commerce company headquartered in Seattle, Washington. Amazon.com started as an online bookstore, but soon diversified into many other categories, with a vision to be earth's most customer-centric company \u0026 to build a place where people can come to find and discover anything they might want to buy online. Amazon's Finance Operations, Accounting \u0026 Analysis (FOAA) team is a fast-paced, team-focused, dynamic environment and delivering great experiences for our customers is top priority. FOAA is seeking a Finance Analyst to support our Finance Operations -Cash, AR, AP, Payroll and Central Accounting functions such as Digital, Transportation, Fixed Assets, Leases, OPEX and Taxes\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e1. Perform/Support the month end activities which include closing of sub ledgers, general ledger account reconciliations, reporting and balance sheet account analysis. \u003cbr/\u003e2. Prepare month end Flux analysis for all P\u0026L and Balance sheet accounts and share with Stakeholders along with the analysis on the reasons for the changes. \u003cbr/\u003e3. Demonstrate a proficient level of professional skill and knowledge in accounting and apply this in-depth knowledge, principles and systems design to recognize complex and unique issues and develop resolution and/or consistently consult with leadership in order to achieve resolution \u003cbr/\u003e4. Ensure appropriate financial policies, procedures and internal controls are in place, documented and also work on process improvements. \u003cbr/\u003e5. Responsible for Preparing Balance sheet reconciliations and highlighting and taking necessary action upon the issues appropriately. \u003cbr/\u003e6. Interact and working closely with the auditors on audit related queries and ensure smooth completion of the audits. \u003cbr/\u003e7. Responsible for GRC compliance, internal control and get the alignment of improvements/changes with the Stakeholder. \u003cbr/\u003e8. Perform and support new business/system launches including UAT of the accounting entries and financial reporting.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon's Finance Operations, Accounting \u0026 Analysis (FOAA) team is a fast-paced, team-focused, dynamic environment and delivering great experiences for our customers is top priority. FOAA is seeking a Finance Analyst to support our Finance Operations -Cash, AR, AP, Payroll and Central Accounting functions such as Digital, Transportation, Fixed Assets, Leases, OPEX and Taxes","department_cost_center":null,"description_short":"Amazon is a US-based multinational electronic commerce company headquartered in Seattle, Washington. Amazon.com started as an online bookstore, but soon diversified into many other categories, with a vision","display_distance":null,"id":"e4774463-0b3a-41c7-8ffc-ef23a2681f51","id_icims":"3105302","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/Planning","job_function_id":null,"job_path":"/en/jobs/3105302/financial-analyst-ii-foaa-cash","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR13\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"October  9, 2025","preferred_qualifications":"- 4+ years of participating in continuous improvement projects in your team to scale and improve controllership with measurable results experience\u003cbr/\u003e- MBA, or CPA\u003cbr/\u003e- Experience working with large-scale data mining and reporting tools (examples: SQL, MS Access, Essbase, Cognos) and other financial systems (examples: Oracle, SAP, Lawson, JD Edwards)\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-accounting","source_system":"JobCreator","state":"KA","title":"Financial Analyst II, FOAA Cash","university_job":null,"updated_time":"26 minutes","url_next_step":"https://account.amazon.com/jobs/3105302/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-accounting","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of sales experience\u003cbr/\u003e- Bachelor's degree","business_category":"retail","city":"Bengaluru","company_name":"ASSPL - Karnataka","country_code":"IND","description":"We are seeking a talented, dedicated, and highly analytical Instock Account Specialist to drive selection and in-stock for Amazon. This is a unique opportunity to play a key role on an important initiative at Amazon. This position requires a candidate with proven analytical skills with experience driving process improvement, thought leadership, and delivering results.\u003cbr/\u003e\u003cbr/\u003eThe  Instock Account Specialist will be responsible for executing inventory strategies to optimize customer experience, sales, margin and turns. They will be relentlessly focused on delivering high in-stock rates in order to meet the needs of our customers. They will dive deep core drivers of in-stock performance, and proactively identify opportunities to improve tools and work flows. This role interacts closely with retail and operations business partners across Amazon, and is pivotal to the growth of this strategic initiative.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eResponsibilities\u003cbr/\u003e1. Maintain excellent in-stock rates for owned category and/or region\u003cbr/\u003e2. Execute inventory strategies to optimize sales, turns, and inventory health\u003cbr/\u003e3. Monitor, analyze and own key performance indicators such as in-stock rate, procurement lead time (PLT), fill rate, forecast accuracy and days of cover (DOC).\u003cbr/\u003e4. Forecast and manage efficient inbound and outbound inventory flows and health, including forecasting, purchasing, and removing unproductive inventory\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e-\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003e-","department_cost_center":null,"description_short":"We are seeking a talented, dedicated, and highly analytical Instock Account Specialist to drive selection and in-stock for Amazon. This is a unique opportunity to play a key role on an important initiative","display_distance":null,"id":"614bd9a2-8f4d-47b9-8547-a49641a1bc13","id_icims":"3173583","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Sales/Account Management","job_function_id":null,"job_path":"/en/jobs/3173583/instock-account-specialist-amazon-now-quick-commerce","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR37\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"February  4, 2026","preferred_qualifications":"- Experience with Excel\u003cbr/\u003e- Excel\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"retail.team-icb-in","source_system":"JobCreator","state":"KA","title":"Instock Account Specialist, Amazon Now (Quick Commerce)","university_job":null,"updated_time":"28 minutes","url_next_step":"https://account.amazon.com/jobs/3173583/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-icb-in","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Electrical Engineering, Mechanical Engineering, or a related field\u003cbr/\u003e- Experience carrying new design concepts through exploration, development, and into deployment or mass production\u003cbr/\u003e- Experience in MS Excel, Word, and Windows Operating Systems\u003cbr/\u003e- Experience with power management and power monitoring systems","business_category":"aws","city":"Seattle","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon’s Data Centers are industry leading examples of innovation in the areas of security, safety, space utilization, efficiency, and cost effectiveness. We are the global team responsible for the construction of the Amazon owned sites. Our Construction Managers are on the forefront of creating and delivering the most innovative products to our customers; and are known for changing the face of cloud computing. \u003cbr/\u003e\u003cbr/\u003eThis Regional Construction Program Manager, will help implement solutions focused on improving processes, streamlining workflows and creating tools used by the field execution teams to deliver capacity more efficiently. They will work closely with internal and external partner (General Contractors) teams to ensure industry best practices, and innovative ideas, are being considered when new programs are being adopted by the Construction team. The Regional Construction Program Manager will assist Sr. leadership on determining what key metrics, reports and goals are necessary for new and existing programs to achieve business objectives. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Lead cross-functional teams and manage programs and processes simultaneously.\u003cbr/\u003e• Engage with technical experts and key stakeholders to initiate new programs, including developing new processes and program documentation.\u003cbr/\u003e• Identify process and communications gaps, while developing and driving solutions.\u003cbr/\u003e• Develop and maintain lessons learned and establish mechanisms to share this with teams.\u003cbr/\u003e• Work closely with stakeholders on key program initiatives to develop and implement procedures and systems that continually improve and streamline the program.\u003cbr/\u003e• Drive simplification and automation to evolve processes, services, and solutions, to increase agility and efficiencies and lower costs.\u003cbr/\u003e• Establish a metrics-driven, programmatic approach to strategic initiatives to develop improvements and efficiencies.\u003cbr/\u003e• Gather, define, refine, and drive requirements for program process, standards, and system Implementation requirements needed to monitor \u0026 report on construction programs across multiple geographic regions with little or no direction from management.\u003cbr/\u003e• Define \u0026 evaluate KPIs derived from program milestone, estimate, spend forecast, and cost/resource loaded schedule performance.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003e**Why AWS**\u003cbr/\u003e Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003e*Diverse Experiences*\u003cbr/\u003e Amazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003e*Work/Life Balance*\u003cbr/\u003e We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003e*Inclusive Team Culture*\u003cbr/\u003e Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003e*Mentorship and Career Growth*\u003cbr/\u003e We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"89a6c5cc-e3ab-45c8-83da-18ce0dd70814","id_icims":"3123267","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3123267/amer-regional-program-manager-construction-program-management","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA84\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["aws.team-ais"],"posted_date":"November  7, 2025","preferred_qualifications":"- 5+ years of project management in data centers or comparable critical infrastructure experience\u003cbr/\u003e- Knowledge of critical data center equipment\u003cbr/\u003e- Knowledge of engineering documentation, electrical diagrams and standard operating procedures\u003cbr/\u003e- Knowledge of building codes and regulations including Life Safety, BOCA, NFPA, NEC, or OSHA\u003cbr/\u003e- Experience in project management in data centers or comparable critical infrastructure\u003cbr/\u003e- Experience in Data Center Engineering Operations, with a deep understanding of electrical and mechanical data center infrastructure\u003cbr/\u003e- Experience reading and interpreting construction specifications and drawings for all domains\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 109,700.00 - 183,300.00 USD annually","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"WA","title":"AMER Regional Program Manager, Construction Program Management","university_job":null,"updated_time":"36 minutes","url_next_step":"https://account.amazon.com/jobs/3123267/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}