{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 2+ years of overseeing security operations and working with security vendors/contractors experience\u003cbr/\u003e- PSIRA Grade A Certification.\u003cbr/\u003e- Experience in training, recruitment and development of CGF personnel.\u003cbr/\u003e- Operational experience with surveillance systems, access control and PIDS monitoring.","business_category":"amazon-security","city":"Cape Town","company_name":"Amazon Data Services South Africa (Pty) Ltd","country_code":"ZAF","description":"Amazon Web Services (AWS) seeks a Data Center Security Manager (DSM) for our CPT located data centers. This role leads physical security operations across multiple sites, reporting directly to the Cluster Security Manager. \u003cbr/\u003e\u003cbr/\u003eKey aspects of the role include:\u003cbr/\u003e•\tManaging day-to-day physical security operations\u003cbr/\u003e•\tMaintaining site security posture\u003cbr/\u003e•\tOverseeing security guard force vendors\u003cbr/\u003e•\tEnsuring compliance with AWS security standards\u003cbr/\u003e\u003cbr/\u003eWe maintain the foundation of AWS cloud services, ensuring continuous availability of computing resources for our customers worldwide.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will combine security operations expertise with strong leadership abilities. We offer comprehensive professional development opportunities and the chance to shape the security of one of the world's largest cloud providers.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eSecurity Operations Management\u003cbr/\u003e•\tManage on-site physical security operations for Data Centers\u003cbr/\u003e•\tOversee access control systems, guard force operations, and vendor contracts\u003cbr/\u003e•\tConduct risk assessments, security audits, and incident reporting\u003cbr/\u003e•\tGenerate and analyze security metrics\u003cbr/\u003e•\tImplement and maintain CCTV monitoring systems and media security protocols\u003cbr/\u003e•\tEnsure protection of customer data through robust security measures\u003cbr/\u003e\u003cbr/\u003eProcess and Policy Management\u003cbr/\u003e•\tImplement new security processes while maintaining compliance with Amazon policies\u003cbr/\u003e•\tDevelop and execute security plans for special events\u003cbr/\u003e•\tCreate evacuation procedures and emergency response protocols\u003cbr/\u003e•\tEstablish benchmarks for security performance\u003cbr/\u003e•\tDesign customized policies to meet internal and external regulations\u003cbr/\u003e\u003cbr/\u003eRelationship Management\u003cbr/\u003e•\tBuild and maintain partnerships with internal teams (DC Engineering, DC Operations)\u003cbr/\u003e•\tCoordinate with external partners (Vendors, Emergency Services)\u003cbr/\u003e•\tSupervise security contractors and monitor their performance\u003cbr/\u003e•\tCollaborate with global security teams\u003cbr/\u003e\u003cbr/\u003eProject Management\u003cbr/\u003e•\tDeliver security projects within specified timelines and budgets\u003cbr/\u003e•\tProvide regular status updates to stakeholders\u003cbr/\u003e•\tIdentify and address safety and security deficiencies\u003cbr/\u003e•\tConduct data analysis to support risk assessments\u003cbr/\u003e•\tTravel to other geographic regions as required\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Web Services (AWS) seeks a Data Center Security Manager (DSM) for our CPT located data centers. This role leads physical security operations across multiple sites, reporting directly to the Cluster","display_distance":null,"id":"d93557d2-6f62-4afe-ae4f-90e0c313c691","id_icims":"3156780","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"Data Center Security","job_function_id":null,"job_path":"/en/jobs/3156780/data-center-security-manager-cpt-dc-security","job_schedule_type":"full-time","location":"ZA, Cape Town","locations":["{\"normalizedStateName\":\"Western Cape\",\"normalizedCountryCode\":\"ZAF\",\"city\":\"Cape Town\",\"countryIso3a\":\"ZAF\",\"countryIso2a\":\"ZA\",\"locationNonStemming\":\"South Africa, Cape Town\",\"coordinates\":\"-33.91909,18.42198\",\"normalizedCountyName\":\"Cape Town\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"South Africa\",\"normalizedLocation\":\"Cape Town, Western Cape, ZAF\",\"location\":\"ZA, Cape Town\",\"region\":\"\",\"buildingCodeList\":[\"CPT61\"],\"normalizedCityName\":\"Cape Town\"}"],"normalized_location":"Cape Town, Western Cape, ZAF","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"January 11, 2026","preferred_qualifications":"- Experience overseeing security operations and working with security vendors/contractors\u003cbr/\u003e- CASP+ (CompTIA Advanced Security Practitioner) or CCSP (Certified Cloud Security Professional) or Cloud+ or CSSLP (Certified Secure Software Lifecycle Professional), or Bachelor's degree\u003cbr/\u003e- Experience in security management in a Data Centre environment.\u003cbr/\u003e- Experience writing and publishing security standards Technical Knowledge.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer, and we value your passion to discover, invent, simplify and build. We welcome applications from all members of society irrespective of age, sex, disability, sexual orientation, race, religion or belief. Amazon is strongly committed to diversity within its community and especially welcomes applications from South African citizens who are members of designated groups who may contribute to Employment Equity within the workplace and the further diversification of ideas. In this regard, the relevant laws and principles associated with Employment Equity will be considered when appointing potential candidates. We are required by law to verify your ability to work lawfully in South Africa. Amazon requires that you submit a copy of either your identity document or your passport and any applicable work permit if you are a foreign national, along with an updated curriculum vitae.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-security.team-aws-security","source_system":"JobCreator","state":null,"title":"Data Center Security Manager, CPT DC Security","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3156780/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-aws-security","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree","business_category":"amazon-business","city":"Chennai - Virtual","company_name":"ADCI - Tamil Nadu - A83","country_code":"IND","description":"This team enables automation at Amazon Robotics Fulfillment centers. This team serves Amazon Internal Fulfillment Technologies \u0026 Robotics teams by enabling automation, which includes real-time \u0026 offline (image/video) data auditing services. One of the key contributions of this team is supporting the fulfillment centers in maintaining inventory accuracy.\u003cbr/\u003e \u003cbr/\u003eAn Associate in this role is required to watch the video of the stowing action at a fulfillment center, understand it thoroughly and make best use of human judgement in combination with the tools and resources to indicate the activity captured in the video. They are expected to verify or mark the location of product through a tool while maintaining highest level of accuracy. This process helps in maintaining the fulfillment center's stow quality. This is an operational role. Under general supervision, the Associate performs precise and thorough video/image audits with high degree of accuracy and speed, thus aiding defect reduction.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe Associate has to watch several hundred videos in a shift and provide responses by following goals on accuracy (quality), speed (productivity) and right / acceptable practices. Associates are required to take breaks at the pre-defined slots and ensure 6.8 to 7 hours’ time per day is spent to answer the videos. Associates who are hired to work from home should maintain (1) dedicated workspace i.e., table, chair \u0026 sufficient lighting (2) workspace / work related data shouldn’t be accessed by anyone other than employee\u003cbr/\u003e\u003cbr/\u003eThe candidate is expected to demonstrate:\u003cbr/\u003e• Willingness to work in Non-tech role for contract duration of 6 months\u003cbr/\u003e• Ability to audit image/video/text based Jobs\u003cbr/\u003e• Ability to identify details from blurry, less sharp videos and provide correct response. Requires high level of attention \u0026 focus on screen\u003cbr/\u003e• Willingness to work on incremental targets/goals on quality \u0026 productivity\u003cbr/\u003e• Fast Pace of implementation \u0026 consistent performance\u003cbr/\u003e• Ability to work in rotational shifts (including night shifts), remote teams and exceptionally good team player\u003cbr/\u003e• Readiness to come to office for few days (when required, applicable for associates working from home)\u003cbr/\u003e• Willing to switch ON laptop camera while on virtual meetings.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAssociates work in 24x7 environment with rotational shifts. Associates would be working in a 9 hour shift, including pre-scheduled breaks. The shift timings would be subject to change every 3-4 months or as per business requirement. In case associate is working in night shift, night shift allowance will be provided as per applicable Amazon’s work policy.\u003cbr/\u003e\u003cbr/\u003eWeekly Offs: Rotational two-consecutive day off (it is a 5-day working week with 2 consecutive days off, not necessarily Saturday and Sunday) or as per business discretion.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eData Auditing Operations team provides human support to Amazon Fulfillment facilities with goal of enabling hands-free active stowing through visual audits on videos/images. Videos with brief duration (typically between 15 and 20seconds) are sent to Operations Team for humans to audit them with information on products being stored at fulfilment centers. For business use, these videos must be thoroughly reviewed and audited using best human judgement. The effectiveness of automated process will be increased by using videos that Associates have audited. This process helps maintaining stow quality at fulfillment center and Associate will be further evaluated for performance improvements/coaching.","department_cost_center":null,"description_short":"This team enables automation at Amazon Robotics Fulfillment centers. This team serves Amazon Internal Fulfillment Technologies \u0026 Robotics teams by enabling automation, which includes real-time \u0026 offline","display_distance":null,"id":"8dab1335-be88-4f9f-8089-ddd01b70640e","id_icims":"3183522","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Machine Learning Data Operatio","job_function_id":null,"job_path":"/en/jobs/3183522/associate-ml-data-operations-go-ai-operations","job_schedule_type":"full-time","location":"IN, TN, Chennai - Virtual","locations":["{\"normalizedStateName\":\"Tamil Nadu\",\"normalizedCountryCode\":\"IND\",\"city\":\"Chennai - Virtual\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TN, Chennai - Virtual\",\"coordinates\":\"13.08404,80.28274\",\"normalizedCountyName\":\"Chennai\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Chennai, Tamil Nadu, IND\",\"location\":\"IN, TN, Chennai - Virtual\",\"region\":\"TN\",\"buildingCodeList\":[\"VCCTN1IN\"],\"normalizedCityName\":\"Chennai\"}"],"normalized_location":"Chennai, Tamil Nadu, IND","optional_search_labels":[],"posted_date":"February 18, 2026","preferred_qualifications":"- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-business.no-team-listed","source_system":"JobCreator","state":"TN","title":"Associate, ML Data Operations, GO-AI Operations","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3183522/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Formation et expérience : Bac Pro, BTS, BUT ou équivalent (Bac+2 minimum) en maintenance industrielle, électrotechnique ou mécanique, avec expérience en maintenance électrique et mécanique ou une expérience sur un poste similaire pour une durée d'au moins de deux ans.\u003cbr/\u003e- Maintenance préventive et GMAO : Expérience prouvée avec les systèmes de maintenance préventive planifiée et maîtrise des plateformes GMAO\u003cbr/\u003e- Dépannage et diagnostic : Capacités avancées de dépannage sur équipements de manutention et systèmes d'automatisation, avec maîtrise de la lecture des plans mécaniques et électriques\u003cbr/\u003e- Compétences techniques : Expérience pratique avec systèmes de convoyeurs, contrôleurs moteur, variateurs de fréquence et technologies de capteurs\u003cbr/\u003e- Compétences opérationnelles : Connaissance des normes de santé et sécurité, fortes compétences organisationnelles et excellentes capacités de communication","business_category":"fulfillment-ops","city":"Orleans","company_name":"Amazon France Transport SAS","country_code":"FRA","description":"En assurant le fonctionnement continu des machines essentielles à nos activités, l’équipe RME (Reliability Maintenance Engineering) d’Amazon joue un rôle fondamental pour nos opérations. En tant que technicien RME, vous assurerez la maintenance d’un large éventail d’équipements et d’espaces de travail tout en respectant les meilleures pratiques en matière de santé et de sécurité. Vous contribuerez à la sécurité de vos collègues et à la prévention des temps d’arrêt des machines. Nos techniciens RME améliorent la disponibilité et la qualité de nos équipements et travaillent pour optimiser notre environnement opérationnel.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eGarantir la sécurité et la conformité\u003cbr/\u003e\t• Promouvoir les meilleures pratiques de santé et sécurité dans toutes les activités de maintenance, en assurant la conformité totale aux normes et réglementations\u003cbr/\u003e\t• Effectuer des évaluations de risques et mettre en place des protocoles de sécurité pour les travaux de maintenance\u003cbr/\u003eAssurer l'excellence en maintenance préventive\u003cbr/\u003e\t• Exécuter des programmes complets de maintenance préventive planifiée sur des équipements automatisés diversifiés : convoyeurs, robots, systèmes de tri et d'emballage\u003cbr/\u003e\t• Utiliser les systèmes informatisés de gestion de la maintenance (GMAO) pour suivre, programmer et documenter les activités de maintenance\u003cbr/\u003e\t• Collaborer avec les fabricants d'équipements et prestataires externes pour optimiser les procédures de maintenance\u003cbr/\u003eIntervenir rapidement et résoudre les problèmes complexes\u003cbr/\u003e\t• Fournir une réponse rapide aux pannes d'équipement avec communication claire aux équipes opérationnelles\u003cbr/\u003e\t• Effectuer un dépannage avancé sur les systèmes électriques, mécaniques et d'automatisation complexes\u003cbr/\u003e\t• Utiliser les outils de diagnostic et documentation technique pour identifier efficacement les causes racines\u003cbr/\u003eMaîtriser les technologies d'automatisation\u003cbr/\u003e\t• Maintenir et configurer des systèmes d'automatisation sophistiqués incluant les contrôleurs logiques programmables (API) et réseaux de terrain\u003cbr/\u003e\t• Entretenir et calibrer les scanners de codes-barres, systèmes d'impression-application et équipements de tri\u003cbr/\u003eContribuer à l'amélioration continue\u003cbr/\u003e\t• Analyser les données de performance des équipements pour identifier les opportunités d'amélioration\u003cbr/\u003e\t• Développer et mettre en œuvre des initiatives de réduction des coûts par l'optimisation des équipements\u003cbr/\u003e\t• Partager les connaissances techniques et encadrer les techniciens juniors\u003cbr/\u003eHoraires de travail : Ce poste fonctionne dans un environnement 24h/24 et 7j/7 nécessitant une flexibilité avec des horaires variables, incluant nuits, week-ends et jours fériés.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eChaque jour, des millions de clients comptent sur Amazon pour recevoir leurs commandes à temps. Derrière cette promesse se cache un réseau d'automatisation sophistiqué où chaque seconde compte. En tant que Technicien/ne RME, vous serez au cœur de cette mécanique de précision, gardien des technologies qui permettent à nos centres de distribution de fonctionner 24h/24 et 7j/7.\u003cbr/\u003eCe qui rend ce rôle unique ? Vous travaillerez sur des équipements à la pointe de la technologie, parfois conçus en interne, dans un environnement où l'innovation rencontre l'excellence opérationnelle. Votre expertise technique aura un impact direct et mesurable : chaque intervention réussie, c'est des milliers de colis qui arrivent à destination comme prévu.\u003cbr/\u003eSi vous adorez les challenges techniques, que vous vous épanouissez dans des environnements dynamiques et que vous voulez voir l'impact concret de votre travail à l'échelle mondiale, ce poste est fait pour vous.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon ne pourrait pas livrer au rythme effréné qui est le sien sans l’équipe du service de transport d’Amazon (ATS). Vous serez accueilli·e au sein d’une équipe diversifiée, qui joue un rôle essentiel dans notre réussite. Grâce aux transports aériens, maritimes et routiers, ainsi qu’aux centres de tri équipés des dernières technologies, vous contribuerez à l’efficacité maximale des transports d’Amazon. Notre équipe collecte des données et les utilise pour prendre les décisions qui contribuent à faire d’Amazon une entreprise toujours plus novatrice et efficace.\u003cbr/\u003eNos collaborateurs·trices sont notre priorité. C’est pourquoi nous plaçons la sécurité au premier plan. Enfin, nous mettons à profit l’expertise de nos collaborateurs·trices pour acheminer les colis jusqu’à leur destination finale de manière rapide, pratique et respectueuse de l’environnement.","department_cost_center":null,"description_short":"En assurant le fonctionnement continu des machines essentielles à nos activités, l’équipe RME (Reliability Maintenance Engineering) d’Amazon joue un rôle fondamental pour nos opérations. En tant que technicien","display_distance":null,"id":"3ac39a2c-bc5a-41b0-8c11-e9ac241ba628","id_icims":"3191363","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3191363/technicien-de-maintenance-rme-amzl","job_schedule_type":"full-time","location":"FR, Orleans","locations":["{\"normalizedStateName\":\"Centre-Val de Loire\",\"normalizedCountryCode\":\"FRA\",\"city\":\"Orleans\",\"countryIso3a\":\"FRA\",\"countryIso2a\":\"FR\",\"locationNonStemming\":\"France, Orleans\",\"coordinates\":\"47.90143,1.90498\",\"normalizedCountyName\":\"Loiret\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"France\",\"normalizedLocation\":\"Orleans, Centre-Val de Loire, FRA\",\"location\":\"FR, Orleans\",\"region\":\"\",\"buildingCodeList\":[\"ORY8\"],\"normalizedCityName\":\"Orleans\"}"],"normalized_location":"Orleans, Centre-Val de Loire, FRA","optional_search_labels":[],"posted_date":"February 27, 2026","preferred_qualifications":"- Certifications électriques : Habilitations électriques avec expérience en travaux d'ordre électrique et maintenance des contrôleurs moteur/variateurs\u003cbr/\u003e- Expertise en automatisation : Expérience avec systèmes Siemens (API), réseaux de terrain, robotique et systèmes automatisés de stockage/récupération\u003cbr/\u003e- Technologies de traçabilité : Expertise en configuration et maintenance de scanners de codes-barres et systèmes d'impression-application\u003cbr/\u003e- Technologie de maintenance 4.0: Utilisation et/ou exploitation des différentes technologies liées à la maintenance 4.0\u003cbr/\u003e- Leadership technique : Expérience d'encadrement de techniciens juniors avec compétences en rédaction technique pour la documentation\u003cbr/\u003e- Gestion de projets : Expérience en gestion de projet d'installations d'équipements et capacités multilingues (un atout)\u003cbr/\u003e- Machine de conditionnement: Entretien et mise au point de machine de conditionnement automatique.\u003cbr/\u003e\u003cbr/\u003eAmazon est un employeur engagé pour l'égalité des chances. Nous sommes convaincus qu'une main d'oeuvre diversifée est essentielle à notre réussite. Nous prenons nos décisions de recrutement en fonction de votre expérience et de vos compétences. Nous apprécions votre envie de découvrir, d'inventer, de simplifier et de construire. La protection de votre vie privée et la sécurité de vos données constituent depuis longtemps une priorité absolue pour Amazon. Veuillez consulter notre Politique de Confidentialité pour en savoir plus sur la façon dont nous collectons, utilisons et traitons les données personnelles de nos candidats.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":null,"title":"Technicien de Maintenance, RME AMZL","university_job":null,"updated_time":"25 minutes","url_next_step":"https://account.amazon.com/jobs/3191363/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- - 2年以上の社会人経験\u003cbr/\u003e- - パソコンスキル（Windows Officeが一通り使える）\u003cbr/\u003e- - ビジネスレベルの日本語力","business_category":"fulfillment-and-operations","city":"Fujidera","company_name":"Amazon Japan G.K.","country_code":"JPN","description":"※本ポジションの勤務地は、大阪府藤井寺市です。\u003cbr/\u003e\u003cbr/\u003eアマゾンの物流拠点であるフルフィルメントセンター（以下FC）にて、安全推進管理者（Workplace Health and Safety Manager）のサポートのもと、以下の業務を行って頂きます。\u003cbr/\u003e\u003cbr/\u003e１）FC構内の安全管理・推進業務\u003cbr/\u003e- 構内安全パトロールの実施、5S活動の推進\u003cbr/\u003e- 構内の安全確保のための物理的対応と関連部署との調整\u003cbr/\u003e- 事故の調査と分析、是正・改善活動\u003cbr/\u003e- 業務手順や作業環境における安全レビュー・チェック\u003cbr/\u003e- 社内安全活動、教育、啓蒙の実施（安全トレーニング、安全キャンペーン、ポスター作成・掲示、安全に関するコミュニケーションツールの活用）\u003cbr/\u003e- 安全衛生委員会の運営管理（各種調整、資料・議事録作成）\u003cbr/\u003e- 各種法規の順守、監査対応サポート\u003cbr/\u003e\u003cbr/\u003e２）防災関連業務\u003cbr/\u003e- 防火、防災計画の立案と実施\u003cbr/\u003e- 被災時対応訓練（避難訓練・救命講習・消火訓練）、実施後サーベイならびにブラッシュアップ\u003cbr/\u003e\u003cbr/\u003e３）安全備品発注・管理業務\u003cbr/\u003e- Safety備品の購買を担当する。また、備品整理を行い、在庫の適正化を行う。\u003cbr/\u003e\u003cbr/\u003e\u0026lt仕事のやりがい、魅力\u0026gt\u003cbr/\u003e- 安全活動を通じて倉庫内での入出荷、在庫管理、物流の仕組みやマネージメントを学べます。\u003cbr/\u003e- WHS Managerなどへのキャリアアップのチャンスもあります（実績多数）。\u003cbr/\u003e- 未経験の方も歓迎致します。\u003cbr/\u003e\u003cbr/\u003e\u0026lt勤務について\u0026gt\u003cbr/\u003e- 本ポジションは月10日間公休のシフト制勤務となります。\u003cbr/\u003e- 金曜・土曜休みor日曜・月曜休み（応相談）\u003cbr/\u003e- 勤務時間は基本的に9:00-18:00ですが、1～2時間程度の時差勤務の可能性があります。\u003cbr/\u003e- 繁忙期や夜勤の避難訓練など期間限定で年間通じて計1週間程度の夜勤の可能性もあります。\u003cbr/\u003e- 本ポジションは、将来的な転勤の可能性があるポジションです。\u003cbr/\u003e\u003cbr/\u003e\u0026lt関連情報\u0026gt\u003cbr/\u003e- 勤務地: \u003ca href=\"https://www.amazon.co.jp/b?ie=UTF8\u0026node=5651332051\"\u003e 藤井寺フィルフィメントセンター\u003c/a\u003e\u003cbr/\u003e- 所属部門: \u003ca href=\"https://www.amazon.co.jp/b/?_encoding=UTF8\u0026node=5557905051\u0026ref_=cct_cg_OPS_008_2c1\u0026pf_rd_p=09a1d565-6fd6-4576-9ff3-b301993c9d29\u0026pf_rd_r=7PDVB3CAYQHQCS3M3RQK\"\u003eフルフィルメントセンター (FC)\u003c/a\u003e\u003cbr/\u003e- 職種: \u003ca href=\"https://www.amazon.co.jp/b/?_encoding=UTF8\u0026node=5557906051\u0026ref_=cct_cg_OPS_008_2d1\u0026pf_rd_p=3c29c7dc-c28d-4ee3-bfcb-35ac5e7f9d95\u0026pf_rd_r=AN176BMDYN58YX113X621\"\u003eセーフティ/セキュリティ/ファシリティ\u003c/a\u003e\u003cbr/\u003e- 社員インタビュー:  \u003ca href=\"https://www.amazon.co.jp/b?node=8495999051\"\u003e セーフティ職の社員Y.F.さん\u003c/a\u003e\t\u003cbr/\u003e\u003cbr/\u003eAmazon は多様かつインクルーシブな職場づくりを目指しています。Amazonは男女雇用機会均等法を順守しています。人種、  出身国、性別、性的指向、障がい、年齢、その他の属性によって差別することなく、平等に採用選考の機会を提供しています。障がいをお持ちの方は、以下をご覧ください。\u003ca href=\"https://www.amazon.jobs/disability/jp\"\u003e https://www.amazon.jobs/disability/jp\u003c/a\u003e","department_cost_center":null,"description_short":"※本ポジションの勤務地は、大阪府藤井寺市です。アマゾンの物流拠点であるフルフィルメントセンター（以下FC）にて、安全推進管理者（Workplace Health and Safety Manager）のサポートのもと、以下の業務を行って頂きます。１）FC構内の安全管理・推進業務- 構内安全パトロールの実施、5S活動の推進- 構内の安全確保のための物理的対応と関連部署との調整- 事故の調査と分析、是正・改善活動-","display_distance":null,"id":"50454276-d3c3-425c-a7d6-7f65ed8083a5","id_icims":"3113140","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3113140/site-workplace-health-and-safety-whs-coordinator-whs-whs-field","job_schedule_type":"full-time","location":"JP, 27, Fujidera","locations":["{\"normalizedStateName\":\"Osaka\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Fujidera\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, 27, Fujidera\",\"coordinates\":\"34.57427,135.59743\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Fujiidera-shi, Osaka, JPN\",\"location\":\"JP, 27, Fujidera\",\"region\":\"27\",\"buildingCodeList\":[\"KIX4\"],\"normalizedCityName\":\"Fujiidera-shi\"}"],"normalized_location":"Fujiidera-shi, Osaka, JPN","optional_search_labels":[],"posted_date":"October 22, 2025","preferred_qualifications":"- - インクルーシブなカルチャーへの貢献や多様性に富んだグループで働くことに対して前向きであること\u003cbr/\u003e- - チームワークを重視し、チームプレーのための気配りができる方\u003cbr/\u003e- - 向上心があり、今よりも成長したいという熱意がある方\u003cbr/\u003e- - 臨機応変に行動し、理論的に物事の判断ができる方\u003cbr/\u003e- - 物流または製造業での経験があれば尚可\u003cbr/\u003e- - 安全及び衛生に関する基礎的な知識、経験があれば尚可\u003cbr/\u003e- - 主体的でスピード感をもった方\u003cbr/\u003e- - パソコンスキル（Windows Office/マクロが組めれば尚可）\u003cbr/\u003e- - 第一種衛生管理者、危険物乙４取扱い者、甲種防火管理者があれば尚可\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"27","title":"Site Workplace Health and Safety (WHS) Coordinator / サイトWHSコーディネーター , WHS Field ","university_job":null,"updated_time":"25 minutes","url_next_step":"https://account.amazon.com/jobs/3113140/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2年以上の社会人経験\u003cbr/\u003e- パソコンスキル（Windows Officeが一通り使える）\u003cbr/\u003e- ビジネスレベルの日本語力\u003cbr/\u003e  \u003cbr/\u003e","business_category":"fulfillment-and-operations","city":"Tajimi","company_name":"Amazon Japan G.K.","country_code":"JPN","description":"※本ポジションの勤務地は、岐阜県多治見市です。\u003cbr/\u003e\u003cbr/\u003eアマゾンの物流拠点であるフルフィルメントセンター（以下FC）にて、安全推進管理者（Workplace Health and Safety Manager）のサポートのもと、以下の業務を行って頂きます。\u003cbr/\u003e\u003cbr/\u003e１）FC構内の安全管理・推進業務\u003cbr/\u003e- 構内安全パトロールの実施、5S活動の推進\u003cbr/\u003e- 構内の安全確保のための物理的対応と関連部署との調整\u003cbr/\u003e- 事故の調査と分析、是正・改善活動\u003cbr/\u003e- 業務手順や作業環境における安全レビュー・チェック\u003cbr/\u003e- 社内安全活動、教育、啓蒙の実施（安全トレーニング、安全キャンペーン、ポスター作成・掲示、安全に関するコミュニケーションツールの活用）\u003cbr/\u003e- 安全衛生委員会の運営管理（各種調整、資料・議事録作成）\u003cbr/\u003e- 各種法規の順守、監査対応サポート\u003cbr/\u003e\u003cbr/\u003e２）防災関連業務\u003cbr/\u003e- 防火、防災計画の立案と実施\u003cbr/\u003e- 被災時対応訓練（避難訓練・救命講習・消火訓練）、実施後サーベイならびにブラッシュアップ\u003cbr/\u003e\u003cbr/\u003e３）安全備品発注・管理業務\u003cbr/\u003e- Safety備品の購買を担当する。また、備品整理を行い、在庫の適正化を行う。\u003cbr/\u003e\u003cbr/\u003e\u0026lt仕事のやりがい、魅力\u0026gt\u003cbr/\u003e- 安全活動を通じて倉庫内での入出荷、在庫管理、物流の仕組みやマネージメントを学べます。\u003cbr/\u003e- WHS Managerなどへのキャリアアップのチャンスもあります（実績多数）。\u003cbr/\u003e- 未経験の方も歓迎致します。\u003cbr/\u003e\u003cbr/\u003e\u0026lt勤務について\u0026gt\u003cbr/\u003e- 本ポジションは月10日間公休のシフト制勤務となります。\u003cbr/\u003e- 金曜・土曜休みor日曜・月曜休み（応相談）\u003cbr/\u003e- 勤務時間は基本的に9:00-18:00ですが、1～2時間程度の時差勤務の可能性があります。\u003cbr/\u003e- 繁忙期や夜勤の避難訓練など期間限定で年間通じて計1週間程度の夜勤の可能性もあります。\u003cbr/\u003e- 本ポジションは、将来的な転勤の可能性があるポジションです。\u003cbr/\u003e\u003cbr/\u003e\u0026lt関連情報\u0026gt\u003cbr/\u003e- 勤務地: \u003ca href=\"https://www.amazon.co.jp/b?node=5651330051\"\u003e 多治見フィルフィメントセンター\u003c/a\u003e\u003cbr/\u003e- 所属部門: \u003ca href=\"https://www.amazon.co.jp/b?node=5637337051\"\u003eフルフィルメントセンター (FC)\u003c/a\u003e\u003cbr/\u003e- 職種: \u003ca href=\"https://www.amazon.co.jp/b?node=5609901051\"\u003eセーフティ/セキュリティ/ファシリティ\u003c/a\u003e\u003cbr/\u003e- 社員インタビュー:  \u003ca href=\"https://www.amazon.co.jp/b?node=8495999051\"\u003e セーフティ職の社員Y.F.さん\u003c/a\u003e\t\u003cbr/\u003e\u003cbr/\u003eAmazon は多様かつインクルーシブな職場づくりを目指しています。Amazonは男女雇用機会均等法を順守しています。人種、  出身国、性別、性的指向、障がい、年齢、その他の属性によって差別することなく、平等に採用選考の機会を提供しています。障がいをお持ちの方は、以下をご覧ください。\u003ca href=\"https://www.amazon.jobs/disability/jp\"\u003e https://www.amazon.jobs/disability/jp\u003c/a\u003e","department_cost_center":null,"description_short":"※本ポジションの勤務地は、岐阜県多治見市です。アマゾンの物流拠点であるフルフィルメントセンター（以下FC）にて、安全推進管理者（Workplace Health and Safety Manager）のサポートのもと、以下の業務を行って頂きます。１）FC構内の安全管理・推進業務- 構内安全パトロールの実施、5S活動の推進- 構内の安全確保のための物理的対応と関連部署との調整- 事故の調査と分析、是正・改善活動-","display_distance":null,"id":"d4816db4-6797-4abe-bffb-1c05539a8031","id_icims":"3093638","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3093638/site-workplace-health-and-safety-whs-coordinator-whs-whs-field","job_schedule_type":"full-time","location":"JP, 21, Tajimi","locations":["{\"normalizedStateName\":\"Gifu\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Tajimi\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, 21, Tajimi\",\"coordinates\":\"35.3328,137.1321\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Tajimi-shi, Gifu, JPN\",\"location\":\"JP, 21, Tajimi\",\"region\":\"21\",\"buildingCodeList\":[\"NGO2\"],\"normalizedCityName\":\"Tajimi-shi\"}"],"normalized_location":"Tajimi-shi, Gifu, JPN","optional_search_labels":[],"posted_date":"September 26, 2025","preferred_qualifications":"- インクルーシブなカルチャーへの貢献や多様性に富んだグループで働くことに対して前向きであること\u003cbr/\u003e- チームワークを重視し、チームプレーのための気配りができる方\u003cbr/\u003e- 向上心があり、今よりも成長したいという熱意がある方\u003cbr/\u003e- 臨機応変に行動し、理論的に物事の判断ができる方\u003cbr/\u003e- 物流または製造業での経験があれば尚可\u003cbr/\u003e- 安全及び衛生に関する基礎的な知識、経験があれば尚可\u003cbr/\u003e- 主体的でスピード感をもった方\u003cbr/\u003e- パソコンスキル（Windows Office/マクロが組めれば尚可）\u003cbr/\u003e- 第一種衛生管理者、危険物乙４取扱い者、甲種防火管理者があれば尚可\u003cbr/\u003e- 読み書きレベルの英語力があれば尚可\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"21","title":"Site Workplace Health and Safety (WHS) Coordinator / サイトWHSコーディネーター , WHS Field ","university_job":null,"updated_time":"26 minutes","url_next_step":"https://account.amazon.com/jobs/3093638/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2年以上の社会人経験\u003cbr/\u003e- パソコンスキル（Windows Officeが一通り使える）\u003cbr/\u003e- ビジネスレベルの日本語力","business_category":"fulfillment-and-operations","city":"Amagasaki-shi","company_name":"Amazon Japan G.K.","country_code":"JPN","description":"※本ポジションの勤務地は、兵庫県尼崎市です。\u003cbr/\u003e\u003cbr/\u003eアマゾンの物流拠点であるフルフィルメントセンター（以下FC）にて、安全推進管理者（Workplace Health and Safety Manager）のサポートのもと、以下の業務を行って頂きます。\u003cbr/\u003e\u003cbr/\u003e１）FC構内の安全管理・推進業務\u003cbr/\u003e\u003cbr/\u003e    構内安全パトロールの実施、5S活動の推進\u003cbr/\u003e    構内の安全確保のための物理的対応と関連部署との調整\u003cbr/\u003e    事故の調査と分析、是正・改善活動\u003cbr/\u003e    業務手順や作業環境における安全レビュー・チェック\u003cbr/\u003e    社内安全活動、教育、啓蒙の実施（安全トレーニング、安全キャンペーン、ポスター作成・掲示、安全に関するコミュニケーションツールの活用）\u003cbr/\u003e    安全衛生委員会の運営管理（各種調整、資料・議事録作成）\u003cbr/\u003e    各種法規の順守、監査対応サポート\u003cbr/\u003e\u003cbr/\u003e２）防災関連業務\u003cbr/\u003e\u003cbr/\u003e    防火、防災計画の立案と実施\u003cbr/\u003e    被災時対応訓練（避難訓練・救命講習・消火訓練）、実施後サーベイならびにブラッシュアップ\u003cbr/\u003e\u003cbr/\u003e３）安全備品発注・管理業務\u003cbr/\u003e\u003cbr/\u003e    Safety備品の購買を担当する。また、備品整理を行い、在庫の適正化を行う。\u003cbr/\u003e\u003cbr/\u003e\u0026lt仕事のやりがい、魅力\u0026gt\u003cbr/\u003e    安全活動を通じて倉庫内での入出荷、在庫管理、物流の仕組みやマネージメントを学べます。\u003cbr/\u003e    WHS Managerなどへのキャリアアップのチャンスもあります（実績多数）。\u003cbr/\u003e    未経験の方も歓迎致します。\u003cbr/\u003e\u003cbr/\u003e\u0026lt勤務について\u0026gt\u003cbr/\u003e    本ポジションは月10日間公休のシフト制勤務となります。\u003cbr/\u003e    金曜・土曜休みor日曜・月曜休み（応相談）\u003cbr/\u003e    勤務時間は基本的に9:00-18:00ですが、1～2時間程度の時差勤務の可能性があります。\u003cbr/\u003e    主に繁忙期などは13:00-22:00や夜勤の可能性もあります。\u003cbr/\u003e    繁忙期や夜勤の避難訓練など期間限定で年間通じて計1週間程度の夜勤の可能性もあります。\u003cbr/\u003e    本ポジションは、将来的な転勤の可能性があるポジションです。\u003cbr/\u003e\u003cbr/\u003e\u0026lt関連情報\u0026gt\u003cbr/\u003e    所属部門: \u003ca href=\"https://www.amazon.co.jp/b?node=5637337051\"\u003eフルフィルメントセンター (FC)\u003c/a\u003e\u003cbr/\u003e    職種: \u003ca href=\"https://www.amazon.co.jp/b?node=5609901051\"\u003eセーフティ/セキュリティ/ファシリティ\u003c/a\u003e\u003cbr/\u003e    社員インタビュー: \u003ca href=\"https://www.amazon.co.jp/b?node=8495999051\"\u003e セーフティ職の社員Y.F.さん\u003c/a\u003e \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAmazon は多様かつインクルーシブな職場づくりを目指しています。Amazonは男女雇用機会均等法を順守しています。人種、 出身国、性別、性的指向、障がい、年齢、その他の属性によって差別することなく、平等に採用選考の機会を提供しています。障がいをお持ちの方は、以下をご覧ください。\u003ca href=\"https://www.amazon.jobs/disability/jp\"\u003e https://www.amazon.jobs/disability/jp\u003c/a\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWorkplace Health and Safety (WHS) Teamは、アマゾンの物流拠点であるFCで働くあらゆる立場の方が安全で安心した業務を行う為の環境を提供し、ルールを整備し、関係部署と連携することによって、FCの安全をLeadする部署です。\u003cbr/\u003e","department_cost_center":null,"description_short":"※本ポジションの勤務地は、兵庫県尼崎市です。アマゾンの物流拠点であるフルフィルメントセンター（以下FC）にて、安全推進管理者（Workplace Health and Safety Manager）のサポートのもと、以下の業務を行って頂きます。１）FC構内の安全管理・推進業務    構内安全パトロールの実施、5S活動の推進    構内の安全確保のための物理的対応と関連部署との調整    事故の調査と分析、是正・改善活動","display_distance":null,"id":"65d2ef36-74ad-4227-9016-cf459488fda6","id_icims":"3167448","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3167448/site-whs-coordinator-whs-workplace-health-and-safety-whs","job_schedule_type":"full-time","location":"JP, Amagasaki-shi","locations":["{\"normalizedStateName\":\"Hyogo\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Amagasaki-shi\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, Amagasaki-shi\",\"coordinates\":\"34.73377,135.40636\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Amagasaki-shi, Hyogo, JPN\",\"location\":\"JP, Amagasaki-shi\",\"region\":\"\",\"buildingCodeList\":[\"KIX7\"],\"normalizedCityName\":\"Amagasaki-shi\"}"],"normalized_location":"Amagasaki-shi, Hyogo, JPN","optional_search_labels":[],"posted_date":"January 27, 2026","preferred_qualifications":"- インクルーシブなカルチャーへの貢献や多様性に富んだグループで働くことに対して前向きであること\u003cbr/\u003e- チームワークを重視し、チームプレーのための気配りができる方\u003cbr/\u003e- 向上心があり、今よりも成長したいという熱意がある方\u003cbr/\u003e- 臨機応変に行動し、理論的に物事の判断ができる方\u003cbr/\u003e- 物流または製造業での経験があれば尚可\u003cbr/\u003e- 安全及び衛生に関する基礎的な知識、経験があれば尚可\u003cbr/\u003e- 主体的でスピード感をもった方\u003cbr/\u003e- パソコンスキル（Windows Office/マクロが組めれば尚可）\u003cbr/\u003e- 第一種衛生管理者、危険物乙４取扱い者、甲種防火管理者があれば尚可\u003cbr/\u003e- 読み書きレベルの英語力があれば尚可\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-jp-fulfillment-center-management","source_system":"JobCreator","state":null,"title":"Site WHS Coordinator / サイトWHSコーディネーター , Workplace Health and Safety (WHS)","university_job":null,"updated_time":"26 minutes","url_next_step":"https://account.amazon.com/jobs/3167448/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-jp-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 7+ years of consulting, design and implementation of serverless distributed solutions experience\u003cbr/\u003e- Bachelor's degree in business administration, finance, economics, computer science, data science, engineering, or other related field, or 7+ years of professional or military experience\u003cbr/\u003e- 3+ years of software development experience\u003cbr/\u003e- Experience leading the design, development and deployment of business software at scale or recent hands-on technology infrastructure, network, compute, storage, and virtualization experience\u003cbr/\u003e- Current, active US  Government Security Clearance of Secret or above","business_category":"aws","city":"Arlington","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Application deadline: Mar 4, 2026\u003cbr/\u003e\u003cbr/\u003eThis position requires that the candidate selected be a US Citizen and currently possess and maintain an active Secret security clearance.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eThe Amazon Web Services Professional Services (ProServe) team is seeking a skilled Delivery Consultant to join our team at Amazon Web Services (AWS). In this role, you'll work closely with customers to design, implement, and manage AWS solutions that meet their technical requirements and business objectives. You'll be a key player in driving customer success through their cloud journey, providing technical expertise and best practices throughout the project lifecycle. Possessing a deep understanding of AWS products and services, as a Delivery Consultant you will be proficient in architecting complex, scalable, and secure solutions tailored to meet the specific needs of each customer. You’ll work closely with stakeholders to gather requirements, assess current infrastructure, and propose effective migration strategies to AWS. As trusted advisors to our customers, providing guidance on industry trends, emerging technologies, and innovative solutions, you will be responsible for leading the implementation process, ensuring adherence to best practices, optimizing performance, and managing risks throughout the project.\u003cbr/\u003e\u003cbr/\u003eThe AWS Professional Services organization is a global team of experts that help customers realize their desired business outcomes when using the AWS Cloud. We work together with customer teams and the AWS Partner Network (APN) to execute enterprise cloud computing initiatives. Our team provides assistance through a collection of offerings which help customers achieve specific outcomes related to enterprise cloud adoption. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs an experienced technology professional, you will be responsible for:\u003cbr/\u003e\u003cbr/\u003eDesigning and implementing complex, scalable, and secure AWS solutions tailored to customer needs\u003cbr/\u003eProviding technical guidance and troubleshooting support throughout project delivery\u003cbr/\u003eCollaborating with stakeholders to gather requirements and propose effective migration strategies\u003cbr/\u003eActing as a trusted advisor to customers on industry trends and emerging technologies\u003cbr/\u003eSharing knowledge within the organization through mentoring, training, and creating reusable artifacts\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences: AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job below, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture - Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth - We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance - We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. ","department_cost_center":null,"description_short":"This position requires that the candidate selected be a US Citizen and currently possess and maintain an active Secret security clearance.The Amazon Web Services Professional Services (ProServe) team is","display_distance":null,"id":"b297032d-d6d7-44b9-a226-90cd0b154656","id_icims":"3171970","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Professional Services","job_function_id":null,"job_path":"/en/jobs/3171970/sr-delivery-consultant-ai-ml-wwps-fedciv","job_schedule_type":"full-time","location":"US, VA, Arlington","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS17\"],\"normalizedCityName\":\"Arlington\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD28\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Arlington, Virginia, USA","optional_search_labels":["aws-team-global-services-optional"],"posted_date":"February  2, 2026","preferred_qualifications":"- 7+ years experience in infrastructure architecture, database architecture and networking\u003cbr/\u003e- Experience in technology/software sales consulting or equivalent skills\u003cbr/\u003e- Professional experience architecting/deploying/operating solutions built on AWS\u003cbr/\u003e- Experience working within software development or internet-related industries\u003cbr/\u003e- Experience migrating or transforming legacy customer solutions to the cloud\u003cbr/\u003e- Experience managing highly available data center operations with responsibility for infrastructure robustness, including networking, server hardware and storage\u003cbr/\u003e- Understanding of Federal Government application, server, and network security requirements such as ICD 503, FISMA and FedRAMP\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Denver - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, VA, Arlington - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, VA, Herndon - 153,600.00 - 207,800.00 USD annually","primary_search_label":"aws.team-us-security-clearance-jobs-primary","source_system":"JobCreator","state":"VA","title":"Sr Delivery Consultant-AI/ML, WWPS FedCiv","university_job":null,"updated_time":"26 minutes","url_next_step":"https://account.amazon.com/jobs/3171970/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-us-security-clearance-jobs-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent\u003cbr/\u003e- 8+ years of business development, or account management with a proven ability to deliver results experience","business_category":"aws","city":"Atlanta","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Application deadline: Mar 4, 2026\u003cbr/\u003e\u003cbr/\u003eAs AWS continues to innovate and grow, we seek an experienced and talented Account Manager to own, operate and help define GTM strategy for a territory of Enterprise Automotive \u0026 Manufacturing customers. These accounts will have complex infrastructure requirements and you will be selling into multiple lines of business within the account. Your responsibilities will include driving the relationship strategy, executive engagement, new technology adoption, and revenue growth in our largest and fastest growing accounts.\u003cbr/\u003e\u003cbr/\u003eIn this role you will influence the customer to build, shape and accelerate their innovation priorities using AWS technologies and resources. This is an exciting and dynamic opportunity to be part of a fast growing and entrepreneurial organization, bringing innovation and fresh perspectives to customers and prospects.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Lead a Customer Obsessed business that delights our customers\u003cbr/\u003e- Accelerate customer adoption through a comprehensive GTM Strategy to achieve Customer Outcomes\u003cbr/\u003e- Drive market share while achieving/exceeding revenue and non-revenue goals\u003cbr/\u003e- Demonstrate a history of executing complex deals\u003cbr/\u003e- Create and articulate compelling value propositions around AWS Services\u003cbr/\u003e- Leverage relationships with internal stakeholders to further adoption of AWS services in your customer base\u003cbr/\u003e- Develop and work with partners to extend reach and drive adoption\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003e- Foster and nurture strategic relationships with manufacturing industry clients\u003cbr/\u003e- Guide clients through their cloud transformation journey\u003cbr/\u003e- Develop comprehensive account strategies to drive mutual growth\u003cbr/\u003e- Collaborate with technical teams to create innovative solutions\u003cbr/\u003e - Build and maintain a healthy sales pipeline\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou'll connect with industry executives to understand their business challenges, collaborate with solution architects to design transformative solutions, and work alongside partners to deliver value to clients. Your day might include strategic planning sessions, client presentations, and team collaborations to ensure customer success.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. ","department_cost_center":null,"description_short":"As AWS continues to innovate and grow, we seek an experienced and talented Account Manager to own, operate and help define GTM strategy for a territory of Enterprise Automotive \u0026 Manufacturing customers.","display_distance":null,"id":"9f24d931-37fb-44a6-b630-8ffd3a8a2c69","id_icims":"3168798","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Tech Sales","job_function_id":null,"job_path":"/en/jobs/3168798/sr-enterprise-account-manager-aws-automotive-manufacturing","job_schedule_type":"full-time","location":"US, GA, Atlanta","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Boston\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Boston\",\"coordinates\":\"42.35866,-71.05674\",\"normalizedCountyName\":\"Suffolk\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Boston, Massachusetts, USA\",\"location\":\"US, MA, Boston\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS21\"],\"normalizedCityName\":\"Boston\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA44\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Santa Monica\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Santa Monica\",\"coordinates\":\"34.01158,-118.49227\",\"normalizedCountyName\":\"Los Angeles\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Santa Monica, California, USA\",\"location\":\"US, CA, Santa Monica\",\"region\":\"CA\",\"buildingCodeList\":[\"LAX16\"],\"normalizedCityName\":\"Santa Monica\"}","{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Atlanta\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Atlanta\",\"coordinates\":\"33.74831,-84.39111\",\"normalizedCountyName\":\"Fulton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Atlanta, Georgia, USA\",\"location\":\"US, GA, Atlanta\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL11\"],\"normalizedCityName\":\"Atlanta\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN16\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Dallas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Dallas\",\"coordinates\":\"32.77823,-96.7951\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Dallas, Texas, USA\",\"location\":\"US, TX, Dallas\",\"region\":\"TX\",\"buildingCodeList\":[\"DFW15\"],\"normalizedCityName\":\"Dallas\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Cupertino\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Cupertino\",\"coordinates\":\"37.31913,-122.02929\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Cupertino, California, USA\",\"location\":\"US, CA, Cupertino\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC3\"],\"normalizedCityName\":\"Cupertino\"}"],"normalized_location":"Atlanta, Georgia, USA","optional_search_labels":[],"posted_date":"January 28, 2026","preferred_qualifications":"- Experience across at least one industry vertical (manufacturing, energy, oil \u0026 gas, etc.)\u003cbr/\u003e- Experience in manufacturing, process, or industrial engineering\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments, restricted stock units (RSUs), and sales incentives. Final compensation will be determined based on factors including experience, qualifications, and location. \u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eAmazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Cupertino - 157,100.00 - 212,600.00 USD annually\u003cbr/\u003eUSA, CA, Santa Monica - 142,800.00 - 193,200.00 USD annually\u003cbr/\u003eUSA, CO, Denver - 142,800.00 - 193,200.00 USD annually\u003cbr/\u003eUSA, GA, Atlanta - 142,800.00 - 193,200.00 USD annually\u003cbr/\u003eUSA, MA, Boston - 142,800.00 - 193,200.00 USD annually\u003cbr/\u003eUSA, TX, Dallas - 142,800.00 - 193,200.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 142,800.00 - 193,200.00 USD annually","primary_search_label":"aws.team-sales-primary","source_system":"JobCreator","state":"GA","title":"Sr. Enterprise Account Manager, AWS Automotive \u0026 Manufacturing","university_job":null,"updated_time":"26 minutes","url_next_step":"https://account.amazon.com/jobs/3168798/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sales-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in project/program management, Inventory Control, Quality Assurance, or Lean Six Sigma\u003cbr/\u003e- Experience building strategic relationships with stakeholders, including communicating and collaborating across teams and functions\u003cbr/\u003e- Experience creating reports, interpreting metrics and driving overall insights or analysis\u003cbr/\u003e- Bachelor's degree in Construction Management, Electrical, Mechanical, Civil Engineering, or a similar technical discipline\u003cbr/\u003e- Knowledge of Microsoft Office Suite (Excel, Word, SharePoint, and PowerPoint)","business_category":"aws","city":"Denver","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Application deadline: Mar 4, 2026\u003cbr/\u003e\u003cbr/\u003eThe Global Quality Tech Manager plays an essential role in AWS Data Center Capacity Delivery's (DCCD) Global Build Quality (GBQ) Program. This position is responsible for overseeing quality assurance and control (QAQC) processes through governance and programmatic control throughout the lifecycle of data center design, development, construction and retrofit, ensuring that all work meets AWS's high standards for quality, safety, and performance.\u003cbr/\u003eAs part of the GBQ Program, this role supports the drive toward global standardization, unified measurement frameworks, and systematic quality improvements across the Data Center Capacity Delivery ecosystem. The Global Quality Tech Manager will help address critical challenges including construction rework and commissioning delays by implementing consistent quality control mechanisms and leveraging collective learnings and best practices at scale. This position provides comprehensive quality oversight and governance from design through operations handoff, with initial focus on construction and commissioning phases and planned expansion through post-completion support periods.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eDevelop, publish, and maintain global quality assurance and control standards, policies, frameworks, and procedures that govern data center construction projects across all AWS regions.\u003cbr/\u003eEstablish and enforce global quality control plan templates, inspection checklists for manufacturing and on-site work, acceptance criteria, and standardized documentation requirements.\u003cbr/\u003eDefine global quality metrics and Key Performance Indicators (KPIs) to measure and benchmark quality performance across all regions and projects.\u003cbr/\u003eCreate and maintain a global quality management system (QMS) that ensures consistency and compliance across all project phases—from design through operations handoff and post-completion support periods.\u003cbr/\u003eDevelop standardized design review criteria focused on ease of construction, long-term maintenance, and quality assurance measures applicable to all global projects.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.","department_cost_center":null,"description_short":"The Global Quality Tech Manager plays an essential role in AWS Data Center Capacity Delivery's (DCCD) Global Build Quality (GBQ) Program. This position is responsible for overseeing quality assurance and","display_distance":null,"id":"bca4ef5c-5d72-4e87-8807-d9d79dedc9c3","id_icims":"3179896","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Infrastructure Eng","job_function_id":null,"job_path":"/en/jobs/3179896/global-quality-tech-manager-global-build-quality-program","job_schedule_type":"full-time","location":"US, CO, Denver","locations":["{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Dallas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Dallas\",\"coordinates\":\"32.77823,-96.7951\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Dallas, Texas, USA\",\"location\":\"US, TX, Dallas\",\"region\":\"TX\",\"buildingCodeList\":[\"DFW11\"],\"normalizedCityName\":\"Dallas\"}"],"normalized_location":"Denver, Colorado, USA","optional_search_labels":["aws.team-ais"],"posted_date":"February 12, 2026","preferred_qualifications":"- Knowledge of databases (querying and analyzing) such as SQL, MYSQL, and ETL Manager and working with large data sets\u003cbr/\u003e- Experience in auditing, risk management, compliance, program management, or quality management systems\u003cbr/\u003e- Six Sigma Green Belt, or Six Sigma Black Belt certification\u003cbr/\u003e- Project Management Professional (PMP) or equivalent certification\u003cbr/\u003e- Experience in project management in data centers or comparable critical infrastructure\u003cbr/\u003e- ASQ certification (Certified Quality Manager or Certified Quality Engineer).\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Denver - 116,800.00 - 160,000.00 USD annually\u003cbr/\u003eUSA, TX, Dallas - 116,800.00 - 160,000.00 USD annually","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"CO","title":"Global Quality Tech Manager, Global Build Quality Program","university_job":null,"updated_time":"26 minutes","url_next_step":"https://account.amazon.com/jobs/3179896/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of cloud architecture and solution implementation experience\u003cbr/\u003e- Current, active TS/SCI US Government Security Clearance\u003cbr/\u003e- Knowledge of the primary aws services (ec2, elb, rds, route53 \u0026 s3)\u003cbr/\u003e- Experience implementing AWS services in a variety of distributed computing environments","business_category":"aws","city":"Arlington","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Application deadline: Mar 4, 2026\u003cbr/\u003e\u003cbr/\u003eThis position requires that the candidate selected be a US Citizen and obtain and maintain an active TS/SCI security clearance.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eThe Amazon Web Services Professional Services (ProServe) team is seeking a skilled Delivery Consultant to join our team at Amazon Web Services (AWS). In this role, you'll work closely with customers to design, implement, and manage AWS solutions that meet their technical requirements and business objectives. You'll be a key player in driving customer success through their cloud journey, providing technical expertise and best practices throughout the project lifecycle. Possessing a deep understanding of AWS products and services, as a Delivery Consultant you will be proficient in architecting complex, scalable, and secure solutions tailored to meet the specific needs of each customer. You’ll work closely with stakeholders to gather requirements, assess current infrastructure, and propose effective migration strategies to AWS. As trusted advisors to our customers, providing guidance on industry trends, emerging technologies, and innovative solutions, you will be responsible for leading the implementation process, ensuring adherence to best practices, optimizing performance, and managing risks throughout the project.\u003cbr/\u003e\u003cbr/\u003eThe AWS Professional Services organization is a global team of experts that help customers realize their desired business outcomes when using the AWS Cloud. We work together with customer teams and the AWS Partner Network (APN) to execute enterprise cloud computing initiatives. Our team provides assistance through a collection of offerings which help customers achieve specific outcomes related to enterprise cloud adoption. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries.\u003cbr/\u003e\u003cbr/\u003eIt is expected to work from one of the above locations (or customer sites) at least 1+ days in a week. This is not a remote position. You are expected to be in the office or with customers as needed.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences - AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job below, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS? - Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture - Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth - We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance - We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud","department_cost_center":null,"description_short":"This position requires that the candidate selected be a US Citizen and obtain and maintain an active TS/SCI security clearance.The Amazon Web Services Professional Services (ProServe) team is seeking a","display_distance":null,"id":"fe3cdce6-8791-41ad-b5f9-1524e58275c1","id_icims":"3171985","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Professional Services","job_function_id":null,"job_path":"/en/jobs/3171985/delivery-consultant-wwps-professional-services","job_schedule_type":"full-time","location":"US, VA, Arlington","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS17\"],\"normalizedCityName\":\"Arlington\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA33\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD21\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Arlington, Virginia, USA","optional_search_labels":[],"posted_date":"February  2, 2026","preferred_qualifications":"- 5+ years of IT implementation experience\u003cbr/\u003e- degree in advanced technology, or AWS Professional level certification\u003cbr/\u003e- Knowledge of AWS services including compute, storage, networking, security, databases, machine learning, and serverless technologies\u003cbr/\u003e- Knowledge of security and compliance standards including HIPAA and GDPR\u003cbr/\u003e- Experience and technical expertise (design and implementation) in cloud computing technologies\u003cbr/\u003e- Experience leading the design, development and deployment of business software at scale or recent hands-on technology infrastructure, network, compute, storage, and virtualization experience\u003cbr/\u003e- Experience in performance optimization and cost management for cloud environments\u003cbr/\u003e- Experience presenting technical solutions to diverse audiences in pre-sales environments\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Denver - 131,300.00 - 177,600.00 USD annually\u003cbr/\u003eUSA, VA, Arlington - 131,300.00 - 177,600.00 USD annually\u003cbr/\u003eUSA, VA, Herndon - 131,300.00 - 177,600.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 131,300.00 - 177,600.00 USD annually","primary_search_label":"aws.team-us-security-clearance-jobs-primary","source_system":"JobCreator","state":"VA","title":"Delivery Consultant, WWPS Professional Services","university_job":null,"updated_time":"26 minutes","url_next_step":"https://account.amazon.com/jobs/3171985/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-us-security-clearance-jobs-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}