{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 1+ years of designing and developing large-scale, multi-tiered, multi-threaded, embedded or distributed software applications, tools, systems, and services using: C#, C++, Java, or Perl experience\u003cbr/\u003e- Bachelor's degree or foreign equivalent in Computer Science, Engineering, Mathematics, or a related field\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"aws","city":"Seattle","company_name":"Amazon Development Center U.S., Inc.","country_code":"USA","description":"The EC2 Nitro platform powers the world’s largest, fastest-growing, and most feature-rich cloud computing environment. Designed by AWS from the ground up, Nitro leverages a fully customized stack of hardware, firmware, and software to deliver unparalleled virtualization at a global scale. Within the EC2 Nitro organization, the MLS team is tasked with developing the next generation of EC2 Supercomputers, optimized for high-performance training and inference workloads.\u003cbr/\u003e\u003cbr/\u003eWe are looking for an experienced software engineer to drive development for new EC2 machine learning platforms. In this role, the engineer will work with a broad and deep group of technical teams that develop hardware, firmware, systems and application software etc.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate is expected to have solid understanding of computer science fundamentals, and expertise in C/C++ or Rust development in a Linux environment. Experience with Linux package management, version control systems, automated build processes, and software unit testing are required. In-depth knowledge of ML frameworks and cluster management is highly preferred.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"The EC2 Nitro platform powers the world’s largest, fastest-growing, and most feature-rich cloud computing environment. Designed by AWS from the ground up, Nitro leverages a fully customized stack of hardware,","display_distance":null,"id":"4427b4ce-8db9-4368-9d1f-a9543825c72e","id_icims":"3181315","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3181315/software-dev-engineer-ec2-nitro","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA42\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["aws.team-sde-sdm","aws.team-utility-computing"],"posted_date":"February 13, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- Knowledge of computer architecture, operating systems, and parallel computing\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 143,700.00 - 194,400.00 USD annually","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"WA","title":"Software Dev Engineer, EC2 Nitro","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3181315/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school diploma\u003cbr/\u003e- Work a rotating, flexible schedule, including nights, overnights, weekends and holidays. Able to work 40 hours/week, and overtime as required\u003cbr/\u003e- 1+ years of leadership experience in a retail, distribution or similar environment experience","business_category":"transportation-and-logistics","city":"León","company_name":"Servicios Comerciales Amazon Mexico S. de R.L. de C.V.","country_code":"MEX","description":"Delivery Station Manager Jr is the support for the completely last mile operations within a delivery station. The role is responsible for managing a +20 hourly team, safety metrics, attrition, payroll, shifts, vacations, overtime and the AMZL OPS metrics; delivery efficiency, number of routes, cost per shipment. In addition, this role gives support in purchasing tools, services and consumables for the station.\u003cbr/\u003eThe impacts of this position are:\u003cbr/\u003eOperational KPIs and cost goals in the strategic plan. The overriding goal is to maximize customer satisfaction and through this long term shareholder value.\u003cbr/\u003eDelivery Shift Manager Jr should coach and mentor the PA team (hourly) to ensure that performance objectives are met and building positive employee relations and bench strength for the organization. The successful candidate will continuously improve the efficiency of delivery processes and instill a culture of customer obsession, safety, and best-practice sharing. This role also serves as a thought partner with other internal teams like project team to launch new stations and design new delivery models.\u003cbr/\u003e\u003cbr/\u003eJob Specifics:\u003cbr/\u003e\u003cbr/\u003eThis role is fully onsite and requires flexibility to work and rotate shifts: weekends, holidays, and/or overnight shifts, and Ability to work overtime both in peak season and as needed.\u003cbr/\u003e\u003cbr/\u003e#AmazonMexico\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Create balance between “Work hard” and “Have fun” with associates under scope\u003cbr/\u003e- Ensure the team execution to accomplish the business goals\u003cbr/\u003e- Support process improvement activities associated with process inefficiencies and/or new functions currently not performed in day-to-day operations\u003cbr/\u003e- Processes Mapping activities.\u003cbr/\u003e- Assist in the development, documentation, deployment and monitoring the key business processes which support all internal processes of AMZL Mexico.\u003cbr/\u003e- Follow up the KPIs of operations within the delivery station.\u003cbr/\u003e- Actively supports and promotes organization change.\u003cbr/\u003e- Dive deep analysis of KPIs\u003cbr/\u003e- Support the ACES team, customer service or other upcoming goals.\u003cbr/\u003e- Measure drivers’ performance, discipline and customer experience service\u003cbr/\u003e- Internal audits execution.\u003cbr/\u003e- Support and participate in the quality initiatives, process change initiatives and assist the business to achieve year on year improvements within its operating plan.\u003cbr/\u003e- Implement change and/or develop new processes as required to provide ability to better service Amazon customers, focus on reducing cost.\u003cbr/\u003e- Implement and develop the delivery stations workflow and metrics according to the standard work and book of processes\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eA day in life can include activities such as:\u003cbr/\u003e1.- Gemba walk and audit the plan\u003cbr/\u003e2.- Shift start up \u003cbr/\u003e3.- Execution of safety audits, walks, stand up meeting.\u003cbr/\u003e4.- Verify daily ops plan, volume, staff assistance, routes planning.\u003cbr/\u003e5.- Conduct engages with associates, hourly gemba walk, performance audits, quality inspections.\u003cbr/\u003e6.- Complete reporting (Daily Ops plan, Shift Recap Board, End of shift report). Bridge any misses in reporting tool.\u003cbr/\u003e7.- Hold end of shift meeting with leadership team to review performance opportunities and necessary actions moving forward.\u003cbr/\u003e8.- Conduct End Of Shift (EOS) hand-off to incoming Shift manager (in person or email) and create next day plan.\u003cbr/\u003e","department_cost_center":null,"description_short":"Delivery Station Manager Jr is the support for the completely last mile operations within a delivery station. The role is responsible for managing a +20 hourly team, safety metrics, attrition, payroll,","display_distance":null,"id":"6d5556cc-2b98-4904-9319-e1c180b64695","id_icims":"3164578","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3164578/otr-manager-jr-last-mile-operations","job_schedule_type":"full-time","location":"MX, GUA, León","locations":["{\"normalizedStateName\":\"Guanajuato\",\"normalizedCountryCode\":\"MEX\",\"city\":\"León\",\"countryIso3a\":\"MEX\",\"countryIso2a\":\"MX\",\"locationNonStemming\":\"Mexico, GUA, León\",\"coordinates\":\"21.12377,-101.68213\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Mexico\",\"normalizedLocation\":\"León, Guanajuato, MEX\",\"location\":\"MX, GUA, León\",\"region\":\"GUA\",\"buildingCodeList\":[\"DBJ2\"],\"normalizedCityName\":\"León\"}"],"normalized_location":"León, Guanajuato, MEX","optional_search_labels":["ops.lander-mexico","hourly"],"posted_date":"January 22, 2026","preferred_qualifications":"- Speak, write, and read fluently in English\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-last-mile-delivery","source_system":"JobCreator","state":"GUA","title":"OTR Manager Jr., Last Mile Operations","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3164578/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-delivery","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Electrical Engineering, Mechanical Engineering, or a related field\u003cbr/\u003e- Experience directly related to the design or construction of data centers or critical infrastructure or large-scale mechanical and electrical plants\u003cbr/\u003e- Experience in MS Excel, Word, and Windows Operating Systems\u003cbr/\u003e- Experience with power management and power monitoring systems\u003cbr/\u003e- Experience in construction management of large, complex projects involving large-scale mechanical, electrical and plumbing (MEP) plants","business_category":"aws","city":"Herndon","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eThe AWS AMER Cost Control team is seeking a passionate and motivated construction cost engineer to support a portfolio of Data Center Construction projects in North and South America. The ideal candidate is innovative, analytical and knowledgeable of the global construction market, the core systems integral to the construction of data centers, and their associated costs. You should have a bias toward automation and a track record of creating benchmarks and metrics to support efficient and effective cost controls. You pay attention to detail and solve problems at their root. You have experience working with remote teams and ability to communicate effectively with both construction and non-construction professionals. At Amazon we leverage unique opportunities presented to us and are diverse, creative, team oriented professionals working on a daily basis to develop data centers that are changing the face of data facilities.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eSuccess as a Construction Cost Engineer is measured by: \u003cbr/\u003e\u003cbr/\u003e- Utilizing tools and templates for bid analysis and cost management \u003cbr/\u003e- Engaging and managing third party Quantity Surveyor vendors Working seamlessly with multi-disciplinary teams, both internal and external on a global scale \u003cbr/\u003e- Communicating cost control goals to all stakeholders effectively \u003cbr/\u003e- Identify Value Engineering opportunities in the design and quantify the savings \u003cbr/\u003e- Identify project risks and the financial cost impacts associated and communicate to the broader team \u003cbr/\u003e- Updating repository for historical data \u003cbr/\u003e- Defining and tracking cost performance metrics \u003cbr/\u003e- Analyzing and providing timely feedback of Construction vendor proposals using AWS benchmark data \u003cbr/\u003e- Creating accurate bid leveling documents \u003cbr/\u003e- Providing cost analysis of schedule and design variations \u003cbr/\u003e- Validating the final award amount and scope based on contract documents including schedule \u003cbr/\u003e- Implementing, maintaining and executing all cost control, change management, progress and performance reporting\u003cbr/\u003e- Validating change cost impacts \u003cbr/\u003e- Ensuring vendor invoices are accurate and timely \u003cbr/\u003e- Supporting the construction team with project close-out and final payments \u003cbr/\u003e- Delivering results for multiple projects with competing priorities on a consistent basis \u003cbr/\u003e\u003cbr/\u003eTravel may be required up to 30%, including international travel. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"e82b3a03-5ae5-4029-aacf-f8f14fa8d130","id_icims":"3179890","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3179890/construction-cost-engineer-amer-cost-control","job_schedule_type":"full-time","location":"US, VA, Herndon","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD31\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Herndon, Virginia, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"February 12, 2026","preferred_qualifications":"- 5+ years of project management in data centers or comparable critical infrastructure experience\u003cbr/\u003e- Knowledge of critical data center equipment\u003cbr/\u003e- Knowledge of engineering documentation, electrical diagrams and standard operating procedures\u003cbr/\u003e- Knowledge of building codes and regulations including Life Safety, BOCA, NFPA, NEC, or OSHA\u003cbr/\u003e- Experience in project management in data centers or comparable critical infrastructure\u003cbr/\u003e- Experience in Data Center Engineering Operations, with a deep understanding of electrical and mechanical data center infrastructure\u003cbr/\u003e- Experience reading and interpreting construction specifications and drawings for all domains\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Herndon - 111,300.00 - 186,100.00 USD annually","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"VA","title":"Construction Cost Engineer, AMER Cost Control","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3179890/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Technical (Military/Trade School) training or 2+ years’ of equivalent experience in a relevant industry (for example: electrical or mechanical)\u003cbr/\u003e- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products (including Excel, Word and PowerPoint)","business_category":"aws","city":"Berwick","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support  the operations of some of the world’s most powerful data centers. Our Data Center Engineering Operations team maintain and operate our  critical infrastructure systems so that they are prepared to stand up  against any situation.  \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAWS has the world’s largest cloud computing portfolio. As an  Amazonian you will work in some of the most sophisticated, safe, and  secure data centers in the world. Our Engineering Operations Technicians  I (EOT’s) help keep them that way by working with the brightest minds  from around the globe to help test and implement the newest technology  and work practices to meet the demands of a changing market. \u003cbr/\u003e\u003cbr/\u003eWe have a passion for learning and evolving, it’s how we have helped  define ourselves as leaders in the industry.  Let’s work hard, have  fun, and make history! \u003cbr/\u003e   \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003e - Tasked with driving innovation while reducing operational costs in the facilities. \u003cbr/\u003e - Drive projects with moderate complexity.\u003cbr/\u003e - Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA).\u003cbr/\u003e - Perform rack installs, rack decommissioning, operational readings and facility management.\u003cbr/\u003e - Provide key performance indicators to senior engineers. \u003cbr/\u003e - Responsible for the on-site management of contractors,  sub-contractors and vendors, ensuring that all work performed is in  accordance with established practices, procedures \u0026 local  legislation. \u003cbr/\u003e - Performance and oversight of maintenance and operations on all  electrical, mechanical, and fire/life safety equipment within the data  center.\u003cbr/\u003e - Ensure all safety procedures are adhered to while performing work.\u003cbr/\u003e - Perform basic support concepts such as ticketing systems, root  cause analysis, change management creation, writing procedures and  building management systems.\u003cbr/\u003e - Work schedule changes depending on specific site needs. Shifts  can be up to 12-hours and may rotate on a predefined schedule. Some  locations have on-call rotations.\u003cbr/\u003e - Maintain data center critical infrastructure equipment ensuring  99.999% up-time of the world's largest cloud computing portfolio.\u003cbr/\u003e - Role may support more than one location/site. \u003cbr/\u003e - Walk job sites in uneven terrain. Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e - Regularly lift and/or move up to 39 pounds unassisted and participate in group lifts for 40+ pounds\u003cbr/\u003e - Regularly walk, use hands and fingers, handle or feel, reach  with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist,  bend, work above shoulders, grasp, carry, push and pull\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e \u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e","department_cost_center":null,"description_short":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support  the operations of some of the world’s most powerful data centers.","display_distance":null,"id":"53426385-8bb3-4382-883a-d6fc474bebf7","id_icims":"3095370","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3095370/engineering-operations-technician-data-center-engg-ops","job_schedule_type":"full-time","location":"US, PA, Berwick","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Berwick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Berwick\",\"coordinates\":\"41.05089,-76.24352\",\"normalizedCountyName\":\"Columbia\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Berwick, Pennsylvania, USA\",\"location\":\"US, PA, Berwick\",\"region\":\"PA\",\"buildingCodeList\":[\"PHL101\"],\"normalizedCityName\":\"Berwick\"}"],"normalized_location":"Berwick, Pennsylvania, USA","optional_search_labels":[],"posted_date":"October  7, 2025","preferred_qualifications":"- 2+ years of Data Center Engineering experience\u003cbr/\u003e- Associates or Bachelor’s Degree\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, PA, Berwick - 32.00 - 57.00 USD hourly","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"PA","title":"Engineering Operations Technician ,  Data Center Engg Ops","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3095370/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Electrical Engineering, Mechanical Engineering, or a related field\u003cbr/\u003e- Experience directly related to the design or construction of data centers or critical infrastructure or large-scale mechanical and electrical plants\u003cbr/\u003e- Experience in MS Excel, Word, and Windows Operating Systems\u003cbr/\u003e- Experience with power management and power monitoring systems\u003cbr/\u003e- Experience in construction management of large, complex projects involving large-scale mechanical, electrical and plumbing (MEP) plants","business_category":"aws","city":"Berwick","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eThe AWS AMER Cost Control team is seeking a passionate and motivated construction cost engineer to support a portfolio of Data Center Construction projects in North and South America. The ideal candidate is innovative, analytical and knowledgeable of the global construction market, the core systems integral to the construction of data centers, and their associated costs. You should have a bias toward automation and a track record of creating benchmarks and metrics to support efficient and effective cost controls. You pay attention to detail and solve problems at their root. You have experience working with remote teams and ability to communicate effectively with both construction and non-construction professionals. At Amazon we leverage unique opportunities presented to us and are diverse, creative, team oriented professionals working on a daily basis to develop data centers that are changing the face of data facilities.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eSuccess as a Construction Cost Engineer is measured by: \u003cbr/\u003e\u003cbr/\u003e- Utilizing tools and templates for bid analysis and cost management \u003cbr/\u003e- Engaging and managing third party Quantity Surveyor vendors Working seamlessly with multi-disciplinary teams, both internal and external on a global scale \u003cbr/\u003e- Communicating cost control goals to all stakeholders effectively \u003cbr/\u003e- Identify Value Engineering opportunities in the design and quantify the savings \u003cbr/\u003e- Identify project risks and the financial cost impacts associated and communicate to the broader team \u003cbr/\u003e- Updating repository for historical data \u003cbr/\u003e- Defining and tracking cost performance metrics \u003cbr/\u003e- Analyzing and providing timely feedback of Construction vendor proposals using AWS benchmark data \u003cbr/\u003e- Creating accurate bid leveling documents \u003cbr/\u003e- Providing cost analysis of schedule and design variations \u003cbr/\u003e- Validating the final award amount and scope based on contract documents including schedule \u003cbr/\u003e- Implementing, maintaining and executing all cost control, change management, progress and performance reporting\u003cbr/\u003e- Validating change cost impacts \u003cbr/\u003e- Ensuring vendor invoices are accurate and timely \u003cbr/\u003e- Supporting the construction team with project close-out and final payments \u003cbr/\u003e- Delivering results for multiple projects with competing priorities on a consistent basis \u003cbr/\u003e\u003cbr/\u003eTravel may be required up to 30%, including international travel. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"dcc33c29-c0d8-4c2c-b8c5-ba049a725382","id_icims":"3127117","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3127117/construction-cost-engineer-amer-cost-control","job_schedule_type":"full-time","location":"US, PA, Berwick","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Berwick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Berwick\",\"coordinates\":\"41.05089,-76.24352\",\"normalizedCountyName\":\"Columbia\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Berwick, Pennsylvania, USA\",\"location\":\"US, PA, Berwick\",\"region\":\"PA\",\"buildingCodeList\":[\"PHL100\"],\"normalizedCityName\":\"Berwick\"}"],"normalized_location":"Berwick, Pennsylvania, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"November 14, 2025","preferred_qualifications":"- 5+ years of project management in data centers or comparable critical infrastructure experience\u003cbr/\u003e- Knowledge of critical data center equipment\u003cbr/\u003e- Knowledge of engineering documentation, electrical diagrams and standard operating procedures\u003cbr/\u003e- Knowledge of building codes and regulations including Life Safety, BOCA, NFPA, NEC, or OSHA\u003cbr/\u003e- Experience in project management in data centers or comparable critical infrastructure\u003cbr/\u003e- Experience in Data Center Engineering Operations, with a deep understanding of electrical and mechanical data center infrastructure\u003cbr/\u003e- Experience reading and interpreting construction specifications and drawings for all domains\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, PA, Berwick - 111,300.00 - 186,100.00 USD annually","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"PA","title":"Construction Cost Engineer, AMER Cost Control","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/3127117/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- 1+ years of computer/server hardware troubleshooting or related IT experience\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Hermiston","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring seamless data center operations that power millions of businesses and services worldwide. \u003cbr/\u003e \u003cbr/\u003eData Center Technicians should be willing to work both independently and with a team. Work prioritization, organizational skills, effective communication, and the ability to react quickly are critical to success. In addition to hardware and network repair, candidates will install equipment, create documentation, innovate solutions, and fix problems within the data center space. This team works in an environment that operates 24/7. Traveling within and outside of the regional work area is required. \u003cbr/\u003e \u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003ePerforming server rack installations, hardware break-fix on various components, troubleshooting network issues, and responding to operational incidents that impact service availability, escalating to senior technicians and management as needed/required \u003cbr/\u003e\u003cbr/\u003eServing as a primary contact point for both internal and external stakeholders, including engineers, software developers, vendors, and contractors \u003cbr/\u003e\u003cbr/\u003ePerforming on-call duties and participating in scheduled maintenance and change management activities \u003cbr/\u003e\u003cbr/\u003eContributing to documentation and process improvement initiatives based on your analysis of operational issues \u003cbr/\u003e\u003cbr/\u003eHelping to train and onboard new team members \u003cbr/\u003e\u003cbr/\u003ePhysical requirements: \u003cbr/\u003e\u003cbr/\u003eRegularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds \u003cbr/\u003e\u003cbr/\u003eWorking in cramped and/or elevated locations \u003cbr/\u003e\u003cbr/\u003eBending, lifting, stretching, and reaching \u003cbr/\u003e\u003cbr/\u003eStanding and walking for up to 8+ hours a day \u003cbr/\u003e\u003cbr/\u003eAscending and descending ladders, stairs, and gangways safely and without limitation \u003cbr/\u003e\u003cbr/\u003eWork in a noisy environment \u003cbr/\u003e\u003cbr/\u003eWork shifts longer than 8 hours to support 24/7 operations (covering both night and day shifts). \u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003eAbility to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003eWillingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003eTravel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Data Center Technician professional, you have industry-leading technical abilities and demonstrate a breadth of knowledge while you: \u003cbr/\u003e\u003cbr/\u003eTake ownership of technical issues brought by their customer base, engaging other teams when needed to drive resolution \u003cbr/\u003e\u003cbr/\u003eSolve problems at their root and step back to understand the broader context \u003cbr/\u003e\u003cbr/\u003eMaintain service level agreements through the implementation of proactive issue detection and reporting \u003cbr/\u003e\u003cbr/\u003eYou will be required to work shift work that will include days/nights/weekends/holidays. Traveling within and outside of the regional work area is required. You will be responsible for having a reliable personal vehicle and valid driver's license to travel within the regional work area, as company transportation will not be provided. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003e\tWhy AWS\u003cbr/\u003e\tAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\t \u003cbr/\u003e\tDiverse Experiences\u003cbr/\u003e\tAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\t \u003cbr/\u003e\t \u003cbr/\u003e\tInclusive Team Culture\u003cbr/\u003e\tAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\t \u003cbr/\u003e\tMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring","display_distance":null,"id":"264e6351-f4b7-4d22-89a2-43e2abad10cd","id_icims":"3175566","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3175566/data-center-technician-dcc-communities","job_schedule_type":"full-time","location":"US, OR, Hermiston","locations":["{\"normalizedStateName\":\"Oregon\",\"normalizedCountryCode\":\"USA\",\"city\":\"Hermiston\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OR, Hermiston\",\"coordinates\":\"45.84051,-119.28947\",\"normalizedCountyName\":\"Umatilla\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Hermiston, Oregon, USA\",\"location\":\"US, OR, Hermiston\",\"region\":\"OR\",\"buildingCodeList\":[\"PDX65\",\"PDX76\",\"PDX141\",\"PDX150\",\"PDX152\",\"PDX144\",\"PDX139\",\"PDX147\",\"PDX142\",\"PDX145\",\"PDX67\",\"PDX81\",\"PDX153\",\"PDX87\",\"PDX98\",\"PDX148\",\"LCK60\",\"PDX83\",\"PDX151\",\"PDX89\",\"PDX80\",\"PDX149\",\"PDX75\",\"PDT67\",\"PDX94\",\"PDX86\",\"PDX138\",\"PDX88\",\"PDX146\",\"PDX63\",\"PDX69\",\"PDX140\",\"PDX143\",\"PDX82\",\"PDX119\",\"PDX74\"],\"normalizedCityName\":\"Hermiston\"}"],"normalized_location":"Hermiston, Oregon, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"February  6, 2026","preferred_qualifications":"- Experience managing work and priorities through a ticketing system\u003cbr/\u003e- Experience working in a Data Center environment\u003cbr/\u003e- An Associate’s degree, technical certification, or equivalent professional or military experience in a relevant field (e.g., computer science, networking engineering, etc.)\u003cbr/\u003e- Understanding of network design, protocols and layer 1/2 troubleshooting\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, OR, Hermiston - 27.00 - 48.00 USD hourly","primary_search_label":"aws.team-administrative-support-primary","source_system":"JobCreator","state":"OR","title":"Data Center Technician, DCC Communities ","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3175566/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-administrative-support-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent\u003cbr/\u003e- 5+ years of Go-To-Market, Business Development, Sales, or Consulting experience\u003cbr/\u003e- Experience with brand strategy\u003cbr/\u003e- 3+ years working with C-suite and VP-level stakeholders, using data to solve complex business problems","business_category":"ats","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Shipping is building a high-growth business designed to transform how the world thinks about logistics. We’re rapidly expanding our shipping and delivery services to brands and merchants across the U.S., and we’re looking for entrepreneurial Business Development leaders who can help customers meet rising end-customer expectations in an increasingly competitive landscape.\u003cbr/\u003e\u003cbr/\u003eAs a Sr. Business Development Lead, you will shape how customers think about fulfillment and shipping. You will leverage data and industry insights to teach customers something new about their business, tailor Amazon’s solutions to their unique goals, and guide them through complex decision cycles. You’ll work cross-functionally with Product, Tech, and Operations to translate customer needs into scalable solutions and help define the future of Amazon Shipping.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Drive revenue, adoption, and market share for Amazon Shipping by leading insight-driven engagements that teach customers new ways to meet rising end-customer expectations and challenge the limitations of their current shipping strategy.\u003cbr/\u003e• Work backwards from customer needs, earning trust by diving deep into financial, operational, and customer-experience data to design tailored Amazon Shipping solutions that reframe how brands think about speed, reliability, and fulfillment.\u003cbr/\u003e• Deliver perspective and influence decisions by introducing data-backed insights, clarifying the costs of the status quo, and guiding customers through complex decision cycles toward measurable business outcomes.\u003cbr/\u003e• Serve as the voice of the customer, translating market signals and customer feedback into clear inputs for Product, Tech, Operations, and other Amazon teams to improve features, performance, and scalability.\u003cbr/\u003e• Define and own program goals and metrics, track progress rigorously, remove obstacles, and manage through ambiguity to deliver long-term customer value and sustained business impact.\u003cbr/\u003e• Think big and innovate, identifying emerging segments, new use cases, and differentiated delivery models that help customers win—and accelerate the growth of Amazon Shipping.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou are a strategic, insight-driven Business Development lead who thrives on helping customers re-imagine what’s possible. You lead with a point of view—grounded in data, industry trends, and operational realities—and use it to challenge assumptions and illuminate better paths forward. You excel in ambiguous, fast-scaling environments, influence senior stakeholders with clarity and confidence, and consistently drive deals toward measurable outcomes.\u003cbr/\u003e\u003cbr/\u003eYou quickly understand complex businesses, uncover the true drivers behind customer decisions, and translate those insights into clear recommendations. You build trust through expertise and preparation, communicate with precision, and operate with the ownership required to support a rapidly growing business.\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Shipping is building a high-growth business designed to transform how the world thinks about logistics. We’re rapidly expanding our shipping and delivery services to brands and merchants across","display_distance":null,"id":"284f2340-4bcd-43a6-9bee-c3b6797d42e0","id_icims":"3185064","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Business/merchant Development","job_function_id":null,"job_path":"/en/jobs/3185064/sr-business-development-lead-amazon-shipping","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Boston\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Boston\",\"coordinates\":\"42.35866,-71.05674\",\"normalizedCountyName\":\"Suffolk\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Boston, Massachusetts, USA\",\"location\":\"US, MA, Boston\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS21\"],\"normalizedCityName\":\"Boston\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS20\"],\"normalizedCityName\":\"Austin\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA112\"],\"normalizedCityName\":\"Bellevue\"}","{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Atlanta\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Atlanta\",\"coordinates\":\"33.74831,-84.39111\",\"normalizedCountyName\":\"Fulton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Atlanta, Georgia, USA\",\"location\":\"US, GA, Atlanta\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL22\"],\"normalizedCityName\":\"Atlanta\"}","{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK27\"],\"normalizedCityName\":\"New York\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Santa Monica\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Santa Monica\",\"coordinates\":\"34.01158,-118.49227\",\"normalizedCountyName\":\"Los Angeles\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Santa Monica, California, USA\",\"location\":\"US, CA, Santa Monica\",\"region\":\"CA\",\"buildingCodeList\":[\"LAX78\"],\"normalizedCityName\":\"Santa Monica\"}","{\"normalizedStateName\":\"Illinois\",\"normalizedCountryCode\":\"USA\",\"city\":\"Chicago\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, IL, Chicago\",\"coordinates\":\"41.88425,-87.63245\",\"normalizedCountyName\":\"Cook\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Chicago, Illinois, USA\",\"location\":\"US, IL, Chicago\",\"region\":\"IL\",\"buildingCodeList\":[\"ORD10\"],\"normalizedCityName\":\"Chicago\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Diego\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Diego\",\"coordinates\":\"32.71568,-117.16171\",\"normalizedCountyName\":\"San Diego\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Diego, California, USA\",\"location\":\"US, CA, San Diego\",\"region\":\"CA\",\"buildingCodeList\":[\"SAN17\",\"DSD9\",\"PAR8\",\"SAN200\",\"HSD2\",\"VAN3\",\"ONM138\",\"ZSD5\",\"SAN400\",\"SAN50\",\"JSA1\",\"SAN1\",\"SAN5\",\"ICA1\",\"SCA4\",\"SAN33\",\"ZSD6\",\"SAN201\",\"DIB9\",\"SAN18\",\"DJT7\",\"UCA6\",\"VXAN\",\"SAN26\",\"SAN23\",\"XSD2\",\"DJT1\",\"SAN12\",\"SAN15\",\"WFM799\",\"SDU2\",\"PSD4\",\"SAN6\",\"ONM137\",\"SAN3\",\"DSD6\",\"SCA7\",\"KSAN\",\"SAN250\",\"ZSD2\",\"SDM4\",\"SAN251\",\"SAN22\",\"LCA6\",\"WFM072\",\"ZSD3\",\"SAN401\",\"USD1\",\"WFM883\",\"SDS1\",\"HSD1\",\"LHIL\",\"SDU1\",\"ZSD1\",\"LZAC6\",\"ZSD4\",\"SAN13\",\"SAN21\",\"LCMN\",\"ZCA7\",\"DSD1\",\"DJT5\",\"RTAD54\",\"LDTS\",\"DJT8\",\"ZCA4\",\"LSD5\",\"DSD4\"],\"normalizedCityName\":\"San Diego\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"February 19, 2026","preferred_qualifications":"- Experience working in e-commerce / retail / supply chain / financial services business\u003cbr/\u003e- 1+ years of logistics experience\u003cbr/\u003e- Experience working in a customer-facing environment\u003cbr/\u003e- Experience driving new business segment or services launches\u003cbr/\u003e- Experience in a new unit business or a startup\u003cbr/\u003e- Experience defining roadmap strategy and prioritizing deliverables for your team products\u003cbr/\u003e- Excellent written and verbal communication skills, with the ability to thrive in ambiguity and at a fast pace\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, SAN DIEGO - 147,900.00 - 200,100.00 USD annually\u003cbr/\u003eUSA, CA, San Diego - 147,900.00 - 200,100.00 USD annually\u003cbr/\u003eUSA, CA, Santa Monica - 147,900.00 - 200,100.00 USD annually\u003cbr/\u003eUSA, GA, Atlanta - 147,900.00 - 200,100.00 USD annually\u003cbr/\u003eUSA, IL, Chicago - 147,900.00 - 200,100.00 USD annually\u003cbr/\u003eUSA, MA, Boston - 147,900.00 - 200,100.00 USD annually\u003cbr/\u003eUSA, NY, New York - 162,700.00 - 220,200.00 USD annually\u003cbr/\u003eUSA, TX, Austin - 147,900.00 - 200,100.00 USD annually\u003cbr/\u003eUSA, WA, Bellevue - 147,900.00 - 200,100.00 USD annually","primary_search_label":"ats.team-middle-mile-tech","source_system":"JobCreator","state":"WA","title":"Sr. Business Development Lead , Amazon Shipping","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3185064/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-middle-mile-tech","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Electrical Engineering, Mechanical Engineering, or a related field\u003cbr/\u003e- Experience carrying new design concepts through exploration, development, and into deployment or mass production\u003cbr/\u003e- Experience in MS Excel, Word, and Windows Operating Systems\u003cbr/\u003e- Experience with power management and power monitoring systems","business_category":"aws","city":"Dallas","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Amazon Web Services (AWS) Infrastructure Services designs, plans, delivers, and operates all AWS global infrastructure. We keep the cloud running by supporting all AWS data centers, servers, storage, networking, power, and cooling equipment. This ensures our customers have continuous access to innovation. We tackle the most challenging problems in supply chain management and seek talented individuals to join our efforts.\u003cbr/\u003eYou'll collaborate with a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, and operations managers. Working across AWS, you'll help us deliver the highest standards for safety and security while providing extensive capacity at the lowest possible cost for our customers. Our inclusive culture welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eThe AWS Americas (AMER) Cost Control team seeks a passionate and motivated construction cost engineer to support our Data Center Construction projects. The ideal candidate possesses:\u003cbr/\u003e•\tInnovation and analytical skills\u003cbr/\u003e•\tKnowledge of global construction markets and data center systems\u003cbr/\u003e•\tExperience in creating benchmarks and metrics for cost controls\u003cbr/\u003e•\tAttention to detail and problem-solving abilities\u003cbr/\u003e•\tSkills in working with remote teams\u003cbr/\u003e•\tEffective communication with diverse professionals\u003cbr/\u003eAt Amazon, we leverage unique opportunities and work as diverse, creative, team-oriented professionals to develop data centers that are transforming the industry.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tUtilize tools and templates for bid analysis and cost management\u003cbr/\u003e•\tEngage and manage third-party Quantity Surveyor vendors\u003cbr/\u003e•\tWork seamlessly with multi-disciplinary teams globally\u003cbr/\u003e•\tCommunicate cost control goals effectively to all stakeholders\u003cbr/\u003e•\tIdentify and quantify Value Engineering opportunities in design\u003cbr/\u003e•\tAssess project risks and their financial impacts\u003cbr/\u003e•\tUpdate historical data repository\u003cbr/\u003e•\tDefine and track cost performance metrics\u003cbr/\u003e•\tAnalyze Construction vendor proposals using AWS benchmark data\u003cbr/\u003e•\tCreate accurate bid leveling documents\u003cbr/\u003e•\tProvide cost analysis of schedule and design variations\u003cbr/\u003e•\tValidate final award value, schedule and scope based on contract documents\u003cbr/\u003e•\tImplement, maintain and execute cost control, change management, and performance reporting\u003cbr/\u003e•\tValidate change cost impacts\u003cbr/\u003e•\tEnsure accurate and timely vendor invoices\u003cbr/\u003e•\tSupport project close-out and final payments\u003cbr/\u003e•\tDeliver results for multiple projects with competing priorities\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Web Services (AWS) Infrastructure Services designs, plans, delivers, and operates all AWS global infrastructure. We keep the cloud running by supporting all AWS data centers, servers, storage, networking,","display_distance":null,"id":"5d0036ce-d43a-4b95-83db-c719641d1fbb","id_icims":"3123291","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3123291/construction-cost-engineer-north-and-south-america-cost-control","job_schedule_type":"full-time","location":"US, TX, Dallas","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Dallas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Dallas\",\"coordinates\":\"32.77823,-96.7951\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Dallas, Texas, USA\",\"location\":\"US, TX, Dallas\",\"region\":\"TX\",\"buildingCodeList\":[\"DFW11\"],\"normalizedCityName\":\"Dallas\"}"],"normalized_location":"Dallas, Texas, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"November  8, 2025","preferred_qualifications":"- 5+ years of project management in data centers or comparable critical infrastructure experience\u003cbr/\u003e- Knowledge of critical data center equipment\u003cbr/\u003e- Knowledge of engineering documentation, electrical diagrams and standard operating procedures\u003cbr/\u003e- Knowledge of building codes and regulations including Life Safety, BOCA, NFPA, NEC, or OSHA\u003cbr/\u003e- Experience in project management in data centers or comparable critical infrastructure\u003cbr/\u003e- Experience in Data Center Engineering Operations, with a deep understanding of electrical and mechanical data center infrastructure\u003cbr/\u003e- Experience reading and interpreting construction specifications and drawings for all domains\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Dallas - 111,300.00 - 186,100.00 USD annually","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"TX","title":"Construction Cost Engineer, North and South America Cost Control","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3123291/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"aws","city":"Boston","company_name":"Annapurna Labs (U.S.) Inc.","country_code":"USA","description":"The AWS Neuron Compiler team is actively seeking skilled compiler engineers to join our efforts in developing a state-of-the-art deep learning compiler stack. This stack is designed to optimize application models across diverse domains, including Large Language and Vision, originating from leading frameworks such as PyTorch, TensorFlow, and JAX. Your role will involve working closely with our custom-built Machine Learning accelerators, including Inferentia/Trainium, which represent the forefront of AWS innovation for advanced ML capabilities, powering solutions like Generative AI.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003eAs a ML Compiler Engineer II on the Neuron Compiler Automated Reasoning Group, you will develop and maintain tooling for best-in-class technology for raising the bar of the Neuron Compiler's accuracy and reliability. You will help lead the efforts building fuzzers and specification synthesis tooling for our LLVM-based compiler. You will work in a team with a science focus, and strive to push what we do to the edge of what is known, to best deliver our customers.\u003cbr/\u003e\u003cbr/\u003eStrong software development skills using C++/Python are critical to this role.\u003cbr/\u003e\u003cbr/\u003eA science background in compiler development is strongly preferred. A background in Machine Learning and AI accelerators is preferred, but not required.\u003cbr/\u003e\u003cbr/\u003eIn order to be considered for this role, candidates must be currently located or willing to relocate to  Seattle (Preferred), Cupertino, Austin, or Toronto. ","department_cost_center":null,"description_short":"The AWS Neuron Compiler team is actively seeking skilled compiler engineers to join our efforts in developing a state-of-the-art deep learning compiler stack. This stack is designed to optimize application","display_distance":null,"id":"8ed28583-203c-4590-b274-c5e32ca01ff0","id_icims":"3184349","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3184349/ml-compiler-engineer-ii-neuron-kernel-interface-annapurna-labs","job_schedule_type":"full-time","location":"US, MA, Boston","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Boston\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Boston\",\"coordinates\":\"42.35866,-71.05674\",\"normalizedCountyName\":\"Suffolk\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Boston, Massachusetts, USA\",\"location\":\"US, MA, Boston\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS21\"],\"normalizedCityName\":\"Boston\"}"],"normalized_location":"Boston, Massachusetts, USA","optional_search_labels":["aws.team-utility-computing"],"posted_date":"February 18, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MA, Boston - 143,700.00 - 194,400.00 USD annually","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"MA","title":"ML Compiler Engineer II - Neuron Kernel Interface , Annapurna Labs","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3184349/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 1+ years of building large-scale machine-learning infrastructure for online recommendation, ads ranking, personalization or search experience\u003cbr/\u003e- Bachelor's degree or foreign equivalent in Computer Science, Engineering, Mathematics, or a related field\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"aws","city":"Seattle","company_name":"Amazon Development Center U.S., Inc.","country_code":"USA","description":"The EC2 Nitro platform powers the world’s largest, fastest-growing, and most feature-rich cloud computing environment. Designed by AWS from the ground up, Nitro leverages a fully customized stack of hardware, firmware, and software to deliver unparalleled virtualization at a global scale. Within the EC2 Nitro organization, the MLS team is tasked with developing the next generation of EC2 Supercomputers, optimized for high-performance training and inference workloads.\u003cbr/\u003e\u003cbr/\u003eWe are looking for an experienced software engineer to drive development for new EC2 machine learning platforms. In this role, the engineer will work with a broad and deep group of technical teams that develop hardware, firmware, systems and application software etc.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate is expected to have solid understanding of computer science fundamentals, and expertise in C/C++ or Rust development in a Linux environment. Experience with Linux package management, version control systems, automated build processes, and software unit testing are required. In-depth knowledge of ML frameworks and cluster management is highly preferred.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"The EC2 Nitro platform powers the world’s largest, fastest-growing, and most feature-rich cloud computing environment. Designed by AWS from the ground up, Nitro leverages a fully customized stack of hardware,","display_distance":null,"id":"e003cd36-3ef6-4bd0-8361-f0080e54a09d","id_icims":"3181325","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3181325/software-dev-engineer-ec2-nitro-ec2-nitro","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA42\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["aws.team-sde-sdm","aws.team-utility-computing"],"posted_date":"February 13, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- Knowledge of computer architecture, operating systems, and parallel computing\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 143,700.00 - 194,400.00 USD annually","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"WA","title":"Software Dev Engineer, EC2 Nitro, EC2 Nitro","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3181325/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}