{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- Experience with computer hardware troubleshooting and repair\u003cbr/\u003e- Experience in networking","business_category":"aws","city":"Didcot","company_name":"Amazon Data Services UK Limited","country_code":"GBR","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eA unique opportunity to join AWS as a Data Centre Technician. You will  become the primary resolver for your support team, and gain troubleshooting skills on one or more operating systems. You will be able to troubleshoot and solve all but the most complex infrastructure issues. Issues are escalated to the appropriate resolver groups when necessary. You create and maintain documentation on technologies you support and are able to convey Standard Operation Procedures (SOPs) to junior staff. You understand all aspects of the equipment you support. You know how to innovate and make decisions on his/her own, but also know how to take direction when it is given, paying attention to all details involved.\u003cbr/\u003e\u003cbr/\u003eYou are able to execute small projects on your own and work with your manager in planning and executing larger local projects. You act as an escalation point for junior technicians. You understand all aspects of the equipment you support.\u003cbr/\u003e\u003cbr/\u003e24/7 shift coverage is required and may include 12 hour shifts, rotating shifts, 3, 4, or 5 day work weeks, and may change based on the needs of the business. Travel may be required up to 10% of the time.\u003cbr/\u003e\u003cbr/\u003eResponsibilities:\u003cbr/\u003e - Troubleshooting of facility and rack-level events within internal Service-Level Agreements (SLAs)\u003cbr/\u003e - Perform root cause analysis of equipment failures\u003cbr/\u003e - Ensure all safety procedures are adhered to while performing work\u003cbr/\u003e - Respond to off hour emergency calls per on call rotation for any one of the region’s sites\u003cbr/\u003e - Fully comply with all physical security procedures and policies.\u003cbr/\u003e- Must be commutable to the Thames Valley Region. \u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eYou will need to be a UK national and able to obtain and maintain a UK Government Security Clearance. Further details found here: https://www.gov.uk/government/publications/united-kingdom-security-vetting-clearance-levels","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"b29eb0ee-c6f6-40c2-81f4-246fa43e03e0","id_icims":"3183706","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3183706/data-centre-technician-data-center-operations","job_schedule_type":"full-time","location":"GB, Didcot","locations":["{\"normalizedStateName\":\"England\",\"normalizedCountryCode\":\"GBR\",\"city\":\"Didcot\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, Didcot\",\"coordinates\":\"51.60237,-1.23211\",\"normalizedCountyName\":\"Oxfordshire\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"Didcot, England, GBR\",\"location\":\"GB, Didcot\",\"region\":\"\",\"buildingCodeList\":[\"LHR097\"],\"normalizedCityName\":\"Didcot\"}"],"normalized_location":"Didcot, England, GBR","optional_search_labels":["aws.team-uk-launches-optional","amazon-cleared-jobs"],"posted_date":"February 18, 2026","preferred_qualifications":"- Experience dealing effectively with customers during problem resolution and operating efficiently under pressure\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-no-matching-primary-label-listed","source_system":"JobCreator","state":null,"title":"Data Centre Technician , Data Center Operations","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3183706/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-no-matching-primary-label-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Abgeschlossene technische Berufsausbildung, anerkannt durch die Industrie- und Handelskammer (IHK) oder Handwerkskammer (HWK) oder Nachweis eines erfolgreich abgeschlossen Hochschulstudium im Ingenieurwissenschaftlichen Bereich (Maschinenbau / Elektrotechnik oder artverwandt) einer deutschen Hochschule oder anerkannte ausländische Hochschulabschlüsse (BA, B. Sc., MA, M. Sc., Dipl.-Ing.)\u003cbr/\u003e- Zusätzlich, eine abgeschlossene Qualifikation als Industriemeister, Handwerksmeister oder Staatlich Geprüfter/Anerkannter Techniker oder mehrjährige einschlägige Berufserfahrung\u003cbr/\u003e- Praktische Erfahrung im Führen von Teams\u003cbr/\u003e- Erfahrung in der Automatisierung und Instandhaltung von Förderanlagen\u003cbr/\u003e- Fortgeschrittene Deutschkenntnisse in Wort und Schrift sowie Grundsprachkenntnisse in Englisch","business_category":"fulfillment-ops","city":"Grolsheim","company_name":"Amazon Deutschland W19 Transport GmbH - J72","country_code":"DEU","description":"Unser Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) ist der Kern von Amazons Engagement für Innovation. Amazon entwickelt sich weiter und dieses Team sorgt dafür, dass dies auch die von uns verwendeten Technologien und Tools tun. Als Senior RME Technician hilfst Du uns, der Entwicklung einen Schritt voraus zu bleiben. Du setzt die neuesten Technologien ein und identifizierst neue, effiziente Arbeitsmethoden. In dieser Rolle achtest Du genau auf unsere Prozesse und trägst dazu bei, dass wir unsere höchsten Sicherheitsstandards befolgen und weiter erhöhen. \u003cbr/\u003e\u003cbr/\u003eDie Stelle beinhaltet die Arbeit in einem rotierenden Dreischichtsystem, welches Samstage, Nachtschichten sowie Rufbereitschaft umfassen kann. Zudem besteht das Logistiknetzwerk in der Region aus mehreren Standorten, welche im Notfall eine Mitbetreuung voraussetzen. Lokale Flexibilität und eine gewisse Reisebereitschaft (innerhalb der Region) sollte dementsprechend gegeben sein. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Best Practice und Unterstützen im Bedienen von Geräten und Anlagen mit den höchsten Sicherheitsstandards\u003cbr/\u003e- Verfolgen der Geräteleistung durch visuelle Prüfungen, zustandsorientierte Überwachung und vorbeugende Wartungsmaßnahmen und Einplanen zusätzlicher Wartung je nach Bedarf\u003cbr/\u003e- Verantwortung für das technische Team während seiner Schicht und dessen Unterstützung und Weiterentwicklung\u003cbr/\u003e- Lösung von Problemen an Anlagen, um Betriebsausfallzeiten zu reduzieren und die schnellstmögliche Abfertigung von Paketen zu ermöglichen\u003cbr/\u003e- Unterstützung bei der kontinuierlichen Verbesserung von Systemen und Standardisierung von Prozessen im ganzen EU-Netzwerk\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eDu betreust ein Instandhaltungsteam innerhalb einer Schicht und sorgst dafür, dass alle Mitarbeitenden die erforderlichen Werkzeuge zur Verfügung haben und diese einwandfrei funktionieren. Das beinhaltet die Überwachung von Prozessen, damit Vorschriften und Richtlinien befolgt werden, ebenso wie die Gewährleistung der Durchführung vorbeugender Wartungsmaßnahmen, um die Betriebszeit unserer Anlagen zu maximieren.\u003cbr/\u003eDurch Deine Beobachtungen während der Schichtarbeit machst Du Verbesserungsvorschläge, um unsere Systeme noch effizienter und produktiver zu gestalten, und setzt diese Verbesserungen EU-weit um. Außerdem nutzt Du Tools wie SCADA zur Überwachung von Prozessen, um deren Leistungsfähigkeit zu gewährleisten, und unterstützt administrative Aufgaben in enger Zusammenarbeit mit Deinen Führungskräften.\u003cbr/\u003eDu arbeitest vor Ort in einem unserer Logistikzentren. Du arbeitest in Schichtmodellen, die Nächte und Wochenenden umfassen können. Mit den Kenntnissen und Erfahrungen, die Du sammelst, wirst Du Dich zu weiteren Führungspositionen weiterentwickeln.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDie Logistikabteilung bei Amazon (AMZL) ist für die „Last-Mile-Logistik“ zuständig – also die Auslieferung unserer Pakete in Partnerschaft mit Drittanbietern. Wir denken kreativ und realisieren Initiativen zur kontinuierlichen Verbesserung, um Millionen von physischen Produkten an unsere Kund:innen zu liefern. Unser Ziel ist es, das Liefererlebnis für unsere Kund:innen so reibungslos wie möglich zu machen und globale Lieferlösungen für unsere neuesten Angebote einzuführen, darunter Amazon Fresh, Prime Now und Amazon Restaurants.\u003cbr/\u003eDiese Tätigkeiten werden von zwei Mitarbeitergruppen ausgeführt. Unsere „internen“ Mitarbeitenden bereiten Millionen von Produkten auf den Versand an unsere Lieferteams vor. Unser Team ist menschenorientiert und hilfsbereit. Das ist besonders wichtig, weil viele unserer Mitarbeitenden in Nachtschichten arbeiten. Unser Fokus liegt vorwiegend auf dem operativen Betrieb. An den meisten unserer Standorte wird rund um die Uhr gearbeitet.\u003cbr/\u003eUnsere „Außendienst“-Mitarbeitenden arbeiten währenddessen mit Amazon Flex – einem Auftragnehmer-Netzwerk für die Lieferung. Jedes Jahr setzen wir neue Maßstäbe in puncto Kundenerlebnis und bieten neue, innovative Lieferdienste an. Wir suchen nach neuen Möglichkeiten, um branchenweite Logistikherausforderungen zu überwinden, sowie nach neuen Ideen, um unseren CO2-Fußabdruck zu reduzieren. Ein Fuhrpark innovativer Fahrzeuge (einschließlich E-Fahrzeugen) und modernste Technologie unterstützen uns dabei.","department_cost_center":null,"description_short":"Unser Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) ist der Kern von Amazons Engagement für Innovation. Amazon entwickelt sich weiter und dieses Team sorgt","display_distance":null,"id":"fe0b7af3-21a2-4db2-b6ed-a61a597a059c","id_icims":"3113414","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/facilities","job_function_id":null,"job_path":"/en/jobs/3113414/teamleiter-in-instandhaltung","job_schedule_type":"full-time","location":"DE, RP, Grolsheim","locations":["{\"normalizedStateName\":\"Rhineland-Palatinate\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Grolsheim\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, RP, Grolsheim\",\"coordinates\":\"49.90667,7.91685\",\"normalizedCountyName\":\"Mainz-Bingen\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Grolsheim, Rhineland-Palatinate, DEU\",\"location\":\"DE, RP, Grolsheim\",\"region\":\"RP\",\"buildingCodeList\":[\"DRP4\"],\"normalizedCityName\":\"Grolsheim\"}"],"normalized_location":"Grolsheim, Rhineland-Palatinate, DEU","optional_search_labels":["ops.lander-emea-rme-technician","ops.rme-technician"],"posted_date":"October 22, 2025","preferred_qualifications":"- Erfahrung in der Betreuung von Fremdfirmen\u003cbr/\u003e- Verständnis von SPS-basierten Steuersystemen und gesetzlichen Compliance-Anforderungen\u003cbr/\u003e- Erfahrung im Gebrauch von computergesteuerten Wartungsmanagementsystemen, um proaktive Wartungsmaßnahmen zu planen und reaktive Maßnahmen aufzuzeichnen\u003cbr/\u003e- Studienabschluss, vorzugsweise in einem technischen Fachgebiet oder in Betriebswirtschaft\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":"RP","title":"Teamleiter:in Instandhaltung","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3113414/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Graduation from a recognized university with 1 year of work experience. Excellent communication skills (written and verbal) in English language. Ability to communicate correctly and understand the issues. Ability to concentrate – follow up on issues without distraction to resolution. Work successfully in a team environment as well as independently. Familiarity with Windows, Microsoft Outlook, Microsoft Word, internet browser and Excellent typing skills. Demonstrates an ability to successfully navigate websites.","business_category":"transportation-and-logistics","city":"Virtual","company_name":"ASSPL - Karnataka","country_code":"IND","description":"ROW IB team is seeking a highly motivated Investigation Specialist to help manage daily operational activities centrally across INFCs. Our teams' objective is to provide the accurate resolution to all the sellers and fulfillment centres. This is a chance to work in an innovative team, participating in operational excellence, system support, process and design that span the entire company. Come help build a world class services with Amazon.in's customer centric focus applied to the Seller experience. The Investigation Specialist will support Sellers, Associates, and Management while ensuring program standards for individual and team performance are met. An Investigation Representative at ROW IB is responsible for flow of information between different stakeholders and resolves the issues created by sellers accurately in a timely manner.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAn Investigation Representative provides timely resolution to the issue in hand by researching, querying internal tools and by taking real-time decisions. An ideal candidate should be able to understand the requirements/be able to analyze data and notice trends and be able to drive seller experience without compromising on time. The candidate should have the basic understanding of inbounding and should be able to communicate clearly in english in the written and verbal form. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAn Investigation Representative is responsible for conducting assigned investigations in a timely manner within an ambiguous environment using data analysis and other tools. This requires high level of ownership throughout investigation life cycle by facilitating flow of information, reporting progress and identifying blockers \u0026 providing resolutions. An Investigation Representative will insist on high standards by effective deep dive to summarize findings and proposing solutions by identifying gaps and risks in current mechanisms.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAn Investigation Representative provides timely resolution to the issue in hand by researching, querying internal tools and by taking real-time decisions. An ideal candidate should be able to understand the requirements/be able to analyze data and notice trends and be able to drive seller experience without compromising on time. The candidate should have the basic understanding of inbounding and should be able to communicate clearly in english in the written and verbal form. ","department_cost_center":null,"description_short":"ROW IB team is seeking a highly motivated Investigation Specialist to help manage daily operational activities centrally across INFCs. Our teams' objective is to provide the accurate resolution to all","display_distance":null,"id":"1041da29-f0f2-48ad-9fef-41aca272bfe9","id_icims":"3185769","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Cust. Experience Qualit Ops","job_function_id":null,"job_path":"/en/jobs/3185769/investigation-representative-row-ib","job_schedule_type":"full-time","location":"IN, KA, Virtual","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Virtual\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Virtual\",\"coordinates\":\"12.96646,77.58723\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Karnataka, IND\",\"location\":\"IN, KA, Virtual\",\"region\":\"KA\",\"buildingCodeList\":[\"VCC16\"]}"],"normalized_location":"Karnataka, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"February 20, 2026","preferred_qualifications":"- 1 - Excellent communication skills (written and verbal) in English language. 2 - Good Working knowledge of MS office.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-supply-chain","source_system":"JobCreator","state":"KA","title":"Investigation Representative, ROW IB","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3185769/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-supply-chain","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- In pursuit of or obtained Bachelor’s Degree within a relevant field such as mechanical/electrical engineering OR\u003cbr/\u003e- In pursuit of or obtained certification from a Technical/Trade school program (HVAC, electrician, facilities maintenance, or similar)\u003cbr/\u003e- English language Level B2\u003cbr/\u003e- Ability to work well with others in a team environment, displaying strong time management skills\u003cbr/\u003e- Must have access to own transport","business_category":"studentprograms","city":"Frankfurt","company_name":"Amazon Data Services European Sovereign Cloud GmbH - J95","country_code":"DEU","description":"At Amazon Web Services (AWS), we are working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is continually evolving and is a place where motivated employees thrive and also where employee ownership and accountability lead to meaningful results. \u003cbr/\u003e\u003cbr/\u003eAre you ready to embrace the challenge? Come build the future with us. \u003cbr/\u003e\u003cbr/\u003eData Center Engineering Operations Intern\u003cbr/\u003eThe Data Center Engineering Operations (DCEO) Team is the backbone of AWS, supporting the rapid growth of AWS business and customers 24x7. We commit to maintain the physical critical facility infrastructure of AWS and ensure the standards for operational performance in the areas of safety, security, availability, productivity, capacity, efficiency and cost.\u003cbr/\u003e\u003cbr/\u003eInterns will work in an Amazon Data Center and will provide technical support, including risk management and mitigation, corrective and preventative maintenance of critical facility infrastructure, vendor management and metrics reporting.\u003cbr/\u003eThis role is due to start in May to September 2026 and you MUST have access to your own transport as there is no public transportation to our Data Centers.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eDuties include:\u003cbr/\u003e· Maintain mechanical and electrical equipment\u003cbr/\u003e· Assist root cause analysis of equipment failures\u003cbr/\u003e· Assist in troubleshooting of facility and rack-level events within internal SLA\u003cbr/\u003e· Take daily operational readings of all mechanical and electrical equipment\u003cbr/\u003e· Utilize internal CMMS to manage building workflows\u003cbr/\u003e· Interact with third party vendors \u0026 contractors who are working on site\u003cbr/\u003e\u003cbr/\u003eAmazon internships are full-time (40 hours/week) for 12 consecutive weeks. Candidates must be able to provide an internship agreement from their university. Intern schedules are typically day schedules, Monday-Friday. A full time position could involve day, evening, or weekend shifts and on-call rotations. \u003cbr/\u003e\u003cbr/\u003eAmazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNote: Applications are reviewed on a rolling basis. For an update on your status, or to confirm your application was submitted successfully, please login to your candidate portal. Please note that we are reviewing a high volume of applications and appreciate your patience. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth \u003cbr/\u003eOur team is dedicated to supporting new team members in an environment that celebrates knowledge sharing and mentorship. Projects and tasks are assigned in a way that leverages your strengths and helps you further develop your skillset. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eHere at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences. \u003cbr/\u003e\u003cbr/\u003eWork/Life Harmony \u003cbr/\u003eOur team puts a high value on work-life harmony. It isn’t about how many hours you spend at home or at work; it’s about the flow you establish that brings energy to both parts of your life. We believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfillment. We offer flexibility and encourage you to find your own balance between your work and personal lives. \u003cbr/\u003e\u003cbr/\u003eEMEA Student Programs Team\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eCore technical knowledge that you will need:\u003cbr/\u003e Power Distribution \u0026 Main / backup powerflow\u003cbr/\u003e •          Power redundancy\u003cbr/\u003e •          Basic UPS system knowledge\u003cbr/\u003eHVAC / Cooling\u003cbr/\u003e •           Cooling\u003cbr/\u003e •          hot / cold aisle\u003cbr/\u003e •          PUE\u003cbr/\u003eFire Suppression\u003cbr/\u003eGenerator\u003cbr/\u003eA few daily tasks;\u003cbr/\u003e·      Maintain mechanical and electrical equipment\u003cbr/\u003e·      Assist root cause analysis of equipment failures\u003cbr/\u003e·      Assist in troubleshooting of facility and rack-level events within internal SLA\u003cbr/\u003e·      Power up newly deployed racks\u003cbr/\u003e·      Ensure all safety procedures are adhered to while performing work\u003cbr/\u003e·      Take daily operational readings of all mechanical and electrical equipment\u003cbr/\u003e·      Take daily operational readings of all mechanical and electrical equipment\u003cbr/\u003e·      Plan maintenance works and Write / review procedures\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003ehttps://www.youtube.com/watch?v=LTgCHTdRed0\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Engineering Operations team is Amazon’s front-line responders for hands-on electrical and mechanical equipment troubleshooting and operations. You will work with equipment that supports mission-critical servers and must maintain better than 99.999% uptime. This equipment includes, but is not limited to, stand-by diesel generators, switchgear, UPS’s, PDU’s, AHU’s, chillers, cooling towers, chemical treatment systems, pumps, motors, VFD’s, and building automation systems.","department_cost_center":null,"description_short":"At Amazon Web Services (AWS), we are working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is continually evolving and","display_distance":null,"id":"b2ebbeab-3909-4ca7-a962-ee7936889e2f","id_icims":"3125319","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3125319/2026-engineering-operations-intern-data-center-engineering-operations","job_schedule_type":"full-time","location":"DE, HE, Frankfurt","locations":["{\"normalizedStateName\":\"Hesse\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Frankfurt\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, HE, Frankfurt\",\"coordinates\":\"50.11208,8.68341\",\"normalizedCountyName\":\"Frankfurt\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Frankfurt, Hesse, DEU\",\"location\":\"DE, HE, Frankfurt\",\"region\":\"HE\",\"buildingCodeList\":[\"FRA79\",\"FRA601\",\"FRA51\",\"FRA033\",\"FRA56\",\"FRA82\",\"FRA90\",\"FRA025\",\"FRA50\",\"FRA95\",\"FRA96\",\"FRA81\",\"FRA57\",\"FRA064\",\"FRA034\",\"FRA80\",\"FRA13\",\"FRA042\",\"FRA026\",\"FRA32\",\"FRA61\",\"FRA099\",\"FRA59\",\"DMQ9\",\"FRA75\",\"FRA096\",\"FRA78\",\"FRA62\",\"FRA06\",\"FRA036\",\"FRA044\",\"FRA53\",\"MHG6\",\"FRA045\",\"FRA54\",\"FRA58\",\"FRA134\",\"FRA52\",\"FRA600\",\"FRA63\",\"FRA4\",\"FRA74\",\"FRA602\",\"FRA043\",\"FRA71\",\"FRA021\",\"FRA024\",\"FRA60\",\"FRA035\"],\"normalizedCityName\":\"Frankfurt\"}"],"normalized_location":"Frankfurt, Hesse, DEU","optional_search_labels":["auta-techeng","auta-ugnt","aws.team-infrastructure-planning-optional"],"posted_date":"November 12, 2025","preferred_qualifications":"- Experience in program or project management\u003cbr/\u003e- Knowledge of mechanical systems (Mechanical, HVAC systems, Controls)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"studentprograms.team-jobs-for-grads","source_system":"JobCreator","state":"HE","title":"2026 Engineering Operations Intern, Data Center Engineering Operations","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3125319/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-jobs-for-grads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- In pursuit of or obtained Bachelor’s Degree within a relevant field such as mechanical/electrical engineering OR\u003cbr/\u003e- In pursuit of or obtained certification from a Technical/Trade school program (HVAC, electrician, facilities maintenance, or similar)\u003cbr/\u003e- English language Level B2\u003cbr/\u003e- Ability to work well with others in a team environment, displaying strong time management skills\u003cbr/\u003e- Must have access to own transport","business_category":"studentprograms","city":"Dublin","company_name":"Amazon Data Services Ireland Limited - A65","country_code":"IRL","description":"At Amazon Web Services (AWS), we are working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is continually evolving and is a place where motivated employees thrive and also where employee ownership and accountability lead to meaningful results. \u003cbr/\u003e\u003cbr/\u003eAre you ready to embrace the challenge? Come build the future with us. \u003cbr/\u003e\u003cbr/\u003eData Center Engineering Operations Intern\u003cbr/\u003eThe Data Center Engineering Operations (DCEO) Team is the backbone of AWS, supporting the rapid growth of AWS business and customers 24x7. We commit to maintain the physical critical facility infrastructure of AWS and ensure the standards for operational performance in the areas of safety, security, availability, productivity, capacity, efficiency and cost.\u003cbr/\u003e\u003cbr/\u003eInterns will work in an Amazon Data Center and will provide technical support, including risk management and mitigation, corrective and preventative maintenance of critical facility infrastructure, vendor management and metrics reporting.\u003cbr/\u003eThis role is due to start in early June 2026. We recommend having access to your own transport, as public transportation availability varies by data center location. Some sites have public transport access, while others have limited or no options.\u003cbr/\u003e\u003cbr/\u003eDuties include:\u003cbr/\u003e· Maintain mechanical and electrical equipment\u003cbr/\u003e· Assist root cause analysis of equipment failures\u003cbr/\u003e· Assist in troubleshooting of facility and rack-level events within internal SLA\u003cbr/\u003e· Take daily operational readings of all mechanical and electrical equipment\u003cbr/\u003e· Utilize internal CMMS to manage building workflows\u003cbr/\u003e· Interact with third party vendors \u0026 contractors who are working on site\u003cbr/\u003e\u003cbr/\u003eAmazon internships are full-time (40 hours/week) for 12 consecutive weeks. Candidates must be able to provide an internship agreement from their university. Intern schedules are typically day schedules, Monday-Friday. A full time position could involve day, evening, or weekend shifts and on-call rotations. \u003cbr/\u003e\u003cbr/\u003eAmazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNote: Applications are reviewed on a rolling basis. For an update on your status, or to confirm your application was submitted successfully, please login to your candidate portal. Please note that we are reviewing a high volume of applications and appreciate your patience. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth \u003cbr/\u003eOur team is dedicated to supporting new team members in an environment that celebrates knowledge sharing and mentorship. Projects and tasks are assigned in a way that leverages your strengths and helps you further develop your skillset. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eHere at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences. \u003cbr/\u003e\u003cbr/\u003eWork/Life Harmony \u003cbr/\u003eOur team puts a high value on work-life harmony. It isn’t about how many hours you spend at home or at work; it’s about the flow you establish that brings energy to both parts of your life. We believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfillment. We offer flexibility and encourage you to find your own balance between your work and personal lives. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eCore technical knowledge that you will need:\u003cbr/\u003e Power Distribution \u0026 Main / backup powerflow\u003cbr/\u003e •          Power redundancy\u003cbr/\u003e •          Basic UPS system knowledge\u003cbr/\u003eHVAC / Cooling\u003cbr/\u003e •           Cooling\u003cbr/\u003e •          hot / cold aisle\u003cbr/\u003e •          PUE\u003cbr/\u003eFire Suppression\u003cbr/\u003eGenerator\u003cbr/\u003eA few daily tasks;\u003cbr/\u003e·      Maintain mechanical and electrical equipment\u003cbr/\u003e·      Assist root cause analysis of equipment failures\u003cbr/\u003e·      Assist in troubleshooting of facility and rack-level events within internal SLA\u003cbr/\u003e·      Power up newly deployed racks\u003cbr/\u003e·      Ensure all safety procedures are adhered to while performing work\u003cbr/\u003e·      Take daily operational readings of all mechanical and electrical equipment\u003cbr/\u003e·      Take daily operational readings of all mechanical and electrical equipment\u003cbr/\u003e·      Plan maintenance works and Write / review procedures\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003ehttps://www.youtube.com/watch?v=LTgCHTdRed0\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Engineering Operations team is Amazon’s front-line responders for hands-on electrical and mechanical equipment troubleshooting and operations. You will work with equipment that supports mission-critical servers and must maintain better than 99.999% uptime. This equipment includes, but is not limited to, stand-by diesel generators, switchgear, UPS’s, PDU’s, AHU’s, chillers, cooling towers, chemical treatment systems, pumps, motors, VFD’s, and building automation systems.","department_cost_center":null,"description_short":"At Amazon Web Services (AWS), we are working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is continually evolving and","display_distance":null,"id":"819c320d-07a4-48a4-910e-2b2d9606358d","id_icims":"3183016","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3183016/mechanical-electrical-engineering-internship-2026-dublin-ireland-data-center-engineering-operations","job_schedule_type":"full-time","location":"IE, Dublin","locations":["{\"normalizedCountryCode\":\"IRL\",\"city\":\"Dublin\",\"countryIso3a\":\"IRL\",\"countryIso2a\":\"IE\",\"locationNonStemming\":\"Ireland, Dublin\",\"coordinates\":\"53.34807,-6.24827\",\"normalizedCountyName\":\"County Dublin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Ireland\",\"normalizedLocation\":\"Dublin, IRL\",\"location\":\"IE, Dublin\",\"region\":\"\",\"buildingCodeList\":[\"DUB99\"],\"normalizedCityName\":\"Dublin\"}"],"normalized_location":"Dublin, IRL","optional_search_labels":["auta-techeng","auta-ugnt","aws.team-infrastructure-planning-optional"],"posted_date":"February 17, 2026","preferred_qualifications":"- Experience in program or project management\u003cbr/\u003e- Knowledge of mechanical systems (Mechanical, HVAC systems, Controls)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"studentprograms.team-jobs-for-grads","source_system":"JobCreator","state":null,"title":"Mechanical/Electrical Engineering Internship (2026), Dublin - Ireland, Data Center Engineering Operations","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3183016/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-jobs-for-grads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- Travel up to 50% of the time\u003cbr/\u003e- Knowledge of Six Sigma tools, Lean techniques, PMP or similar standards preferred\u003cbr/\u003e- Experience in project/program management, Inventory Control, Quality Assurance, or Lean Six Sigma\u003cbr/\u003e- Experience using data and metrics to drive improvements\u003cbr/\u003e- Experience in operational logistics/supply chain, manufacturing, transportation, general management or an engineering role\u003cbr/\u003e- Experience in employee and performance management","business_category":"fulfillment-and-operations","city":"Cajamar","company_name":"Amazon Servicos de Varejo do Brasil Ltda.","country_code":"BRA","description":"Operations is at the heart of the Amazon customer experience. Each action we undertake is done on behalf of our customers, as meeting their expectations makes us feel good.\u003cbr/\u003e\u003cbr/\u003eControl Tower Manager is focused on supporting 3PL FCs improvements made on behalf of Amazon customers, to drive into standardization efforts, drive loss identification and reduction, act as liaisons with other departments, provide process skills to the 3PL FCs, supporting productivity, Kaizen Events in their areas of expertise, and to run and coordinate cross-functional projects for successful implementation across the 3PL FCs.\u003cbr/\u003e\u003cbr/\u003eThe process owner’s mission is to help our BR organization succeed in scaling operations whilst meeting performance commitments through working hard and smart to strengthen standardization, by developing process improvement leaders with dive-deep process skills, by running and coordinating the top business efforts/projects and by supporting mechanisms generating a daily Kaizen culture of continuous root cause elimination, such as implementing improvements resulting from abnormalities identified in standard work initiatives.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe Control Tower manager will be supporting all 3PL FCs in Brazil.\u003cbr/\u003eThey will be working with cross functional team and site leadership to:\u003cbr/\u003e· Deploy the Operational Benchmarking processes which have been adapted for Amazon WW to train ops leaders and establish sustainable mechanism in operations.\u003cbr/\u003e· Use the PDCA methodology to drive small scale improvements in processes\u003cbr/\u003e· Use the Kaizen methodology to drive large scale process improvements or reduction in costs.\u003cbr/\u003e· Sustain roll out of CI essentials and Kaizen essentials training to managers.\u003cbr/\u003e· Align our Logistics Partners with WW Best Practices and Standards aligning their methods with our best knowledge to deliver the same service to customers while driving cost effectiveness and flexibility to adapt with new requirements. \u003cbr/\u003e· Develop robust systems and train operators to drive the value we expect Area Organization and Area Readiness","department_cost_center":null,"description_short":"Operations is at the heart of the Amazon customer experience. Each action we undertake is done on behalf of our customers, as meeting their expectations makes us feel good.Control Tower Manager is focused","display_distance":null,"id":"d1a99500-8854-4cb7-b2e8-d340611a09da","id_icims":"3191482","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3191482/ops-manager-3pl-control-tower-3pl-fcs-manager","job_schedule_type":"full-time","location":"BR, SP, Cajamar","locations":["{\"normalizedStateName\":\"Sao Paulo\",\"normalizedCountryCode\":\"BRA\",\"city\":\"Cajamar\",\"countryIso3a\":\"BRA\",\"countryIso2a\":\"BR\",\"locationNonStemming\":\"Brazil, SP, Cajamar\",\"coordinates\":\"-23.35635,-46.87702\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Brazil\",\"normalizedLocation\":\"Cajamar, Sao Paulo, BRA\",\"location\":\"BR, SP, Cajamar\",\"region\":\"SP\",\"buildingCodeList\":[\"XCV9\"],\"normalizedCityName\":\"Cajamar\"}"],"normalized_location":"Cajamar, Sao Paulo, BRA","optional_search_labels":[],"posted_date":"February 27, 2026","preferred_qualifications":"- Experience with performance metrics and process improvement and Lean techniques\u003cbr/\u003e- Experience in English-language communication skills, both written and verbal\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.no-team-listed","source_system":"JobCreator","state":"SP","title":"Ops Manager, 3PL Control Tower, 3PL FCs Manager","university_job":null,"updated_time":"19 minutes","url_next_step":"https://account.amazon.com/jobs/3191482/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of team management experience\u003cbr/\u003e- 4+ years of Accounts Payable (AP) experience\u003cbr/\u003e- Experience using data to influence business decisions","business_category":"finance","city":"Bengaluru","company_name":"ADCI - BLR 14 SEZ - F07","country_code":"IND","description":"Job Title: Manager, Finance (FinOps – Accounts Payable/Receivable)\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eCompany: Amazon Digital Services Private Limited\u003cbr/\u003eLocation: BLR13 – COTaurs, Bengaluru, Karnataka, India\u003cbr/\u003eJob Class: Manager I, Finance (Level 4)\u003cbr/\u003eSchedule: Full-Time | Regular (Blue Badge)\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eBasic Qualifications\u003cbr/\u003e\u003cbr/\u003e1.\t8–9+ years of experience in Accounts Payable (AP) within Shared Services, Corporate Finance, or Global Operations.\u003cbr/\u003e2.\t2+ years of team management experience, overseeing teams of at least 8–10 members.\u003cbr/\u003e3.\tDemonstrated ability to use data, metrics, and deep dives to influence process and business decisions.\u003cbr/\u003e4.\tKnowledge of Lean/Six Sigma or other defect reduction/CI methodologies.\u003cbr/\u003e5.\tStrong communication skills with experience representing operations in leadership discussions.\u003cbr/\u003e6.\tProven ability to operate autonomously in ambiguous, high-growth environments.\u003cbr/\u003e7.\tExperience managing operational escalations, complex cases, and cross-team dependencies.\u003cbr/\u003e\u003cbr/\u003ePreferred Qualifications\u003cbr/\u003e\u003cbr/\u003e1.\t2+ years leading measurable continuous improvement initiatives.\u003cbr/\u003e2.\tBackground in AP systems, automation, and workflow tools.\u003cbr/\u003e3.\tExperience working with global multi-functional teams across tech, product, and finance.\u003cbr/\u003e4.\tTrack record of talent development, succession planning, and building high-performing teams.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the Role\u003cbr/\u003e\u003cbr/\u003eAmazon’s Finance Operations (FinOps) organization is one of the fastest-growing and most strategic components of our global operations. As a Manager, Finance (FinOps – AP), you will lead the delivery of Accounts Payable services for a designated geography, ensuring high operational performance, strong controllership, and long-term scalability.\u003cbr/\u003e\u003cbr/\u003eThis role requires a strong people leader with deep experience in Accounts Payable, a proven ability to navigate ambiguity, and a passion for continuous improvement. You will manage a team of 8–10 AP operations specialists (expanding to ~15 total resources), drive operational performance, partner with multiple cross-functional teams, and represent the AP function in leadership forums.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey Responsibilities\u003cbr/\u003e\u003cbr/\u003eOperational Leadership\u003cbr/\u003e\u003cbr/\u003e1.\tOversee end-to-end Accounts Payable operations, managing a team of 8–10 AP specialists (total org size ~15).\u003cbr/\u003e2.\tDrive daily operational execution to meet or exceed accuracy, timeliness, and compliance SLAs.\u003cbr/\u003e3.\tConduct deep dives to identify root causes, eliminate recurring issues, and drive process improvements and automation opportunities.\u003cbr/\u003e4.\tMonitor operational metrics and escalate risks proactively while developing mitigation strategies.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003ePeople \u0026 Team Management\u003cbr/\u003e\u003cbr/\u003e1.\tLead and mentor team members, ensuring capability building, skill development, and career progression.\u003cbr/\u003e2.\tManage team workload, balance priorities, and create high-performing and collaborative team culture.\u003cbr/\u003e3.\tParticipate in recruitment and talent selection to continually raise the talent bar.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eCross-Functional Collaboration\u003cbr/\u003e\u003cbr/\u003e1.\tPartner with Tech, Product, Finance, and Business Partnering teams to troubleshoot issues, launch enhancements, and enable new business requirements.\u003cbr/\u003e2.\tRepresent AP operations in leadership reviews and business stakeholder calls, providing updates on performance, risks, and improvement actions.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eEscalation \u0026 Issue Management\u003cbr/\u003e\u003cbr/\u003e1.\tServe as the primary escalation point for complex operational challenges involving internal teams, vendors, and external partners.\u003cbr/\u003e2.\tEnsure timely investigation and resolution of defects, payment issues, and process deviations with strong documentation and follow-through.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eContinuous Improvement \u0026 Strategic Contributions\u003cbr/\u003e\u003cbr/\u003e1.\tLead and contribute to Lean/Six Sigma–based initiatives aimed at improving controllership, reducing defects, and scaling operations.\u003cbr/\u003e2.\tEstablish and enhance SOPs and policies aligned with global FinOps best practices.\u003cbr/\u003e3.\tSupport long-term roadmap development and execution to ensure the AP function evolves with business growth.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Job Title: Manager, Finance (FinOps – Accounts Payable/Receivable)Company: Amazon Digital Services Private LimitedLocation: BLR13 – COTaurs, Bengaluru, Karnataka, IndiaJob Class: Manager I, Finance (Level","display_distance":null,"id":"617e6089-c56b-4cc7-8fab-3b947cc1d7cc","id_icims":"3172549","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/planning","job_function_id":null,"job_path":"/en/jobs/3172549/manager-finance-finops","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR13\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"February  3, 2026","preferred_qualifications":"- Knowledge of Six Sigma defect reduction techniques (Lean, etc.)\u003cbr/\u003e- Experience of Oracle/Oracle Payables/Oracle Receivables\u003cbr/\u003e- Experience in accounts payable, accounts receivable or procurement\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-finops","source_system":"JobCreator","state":"KA","title":"Manager Finance, Finops","university_job":null,"updated_time":"25 minutes","url_next_step":"https://account.amazon.com/jobs/3172549/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-finops","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- UAE National with family book\u003cbr/\u003e- Recently graduated, with a Bachelor’s Degree in a relevant field (e.g., Mechanical or Electrical Engineering) Or\u003cbr/\u003e- Recently graduated from, a Technical/Trade school programme (HVAC, electrician, facilities maintenance, or similar).","business_category":"aws","city":"Abu Dhabi","company_name":"Amazon Data Services Emirates LLC - K53","country_code":"ARE","description":"AWS have an exciting Electrical \u0026 Mechanical Engineering Operations Traineeship opportunity in Abu Dhabi available for a UAE national with family book. AWS is committed to contributing towards the UAE’s goal of employing 75,000 Emiratis in the private sector and Ministerial Resolution No.279.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is growing rapidly, and we are looking for Engineering Operations Technician Trainees to join our expanding Data Center team in Abu Dhabi.\u003cbr/\u003e\u003cbr/\u003eProgram Details:\u003cbr/\u003e\u003cbr/\u003eDuration \u0026 Schedule:\u003cbr/\u003e\u003cbr/\u003e- 6-month full-time training program (40 hours/week, Monday–Friday, standard daytime hours). Upon successful completion of the program, the trainee will potentially be converted to a full-time Data Center Facility Engineer, depending on performance. \u003cbr/\u003e\u003cbr/\u003eObjective:\u003cbr/\u003e- Gain comprehensive skills and hands-on experience to prepare for a full-time Data Center Engineering Operations Engineer role\u003cbr/\u003e\u003cbr/\u003eCareer Path\u003cbr/\u003e- Full-time positions require flexible scheduling, including shift work, weekends, and on-call rotations\u003cbr/\u003e\u003cbr/\u003eNote: Applications are reviewed on a rolling basis. For an update on your status, or to confirm your application was submitted successfully, please login to your candidate portal. Please note that we are reviewing a high volume of applications and appreciate your patience.\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services (AIS)\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe Engineering Operations team are AWS’s front-line responders for hands-on troubleshooting and operations of critical infrastructure. As a Trainee, you will:\u003cbr/\u003e- Assist in maintaining and operating mechanical and electrical equipment.\u003cbr/\u003e- Support root cause analysis of equipment failures.\u003cbr/\u003e- Help troubleshoot facility and rack-level events within internal SLAs.\u003cbr/\u003e- Take daily operational readings of mechanical and electrical equipment.\u003cbr/\u003e- Use our internal CMMS (Computerized Maintenance Management System) to manage workflows.\u003cbr/\u003e- Work alongside third-party vendors and contractors onsite.\u003cbr/\u003e- You will work with equipment that supports mission-critical servers, including but not limited to: diesel generators, switchgear, UPSs, PDUs, air handling units, chillers, cooling towers, pumps, motors, VFDs, and building automation systems.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e- Working at heights and from ladders.\u003cbr/\u003e- Regularly lifting/moving up to 22kg (49lbs) unassisted, and participating in group lifts for heavier loads.\u003cbr/\u003e- Using hands to handle and manipulate small tools, wires, and objects.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003e\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"AWS have an exciting Electrical \u0026 Mechanical Engineering Operations Traineeship opportunity in Abu Dhabi available for a UAE national with family book. AWS is committed to contributing towards the UAE’s","display_distance":null,"id":"882b8862-fa5e-413f-ac0c-b33c64901637","id_icims":"3188013","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3188013/electrical-mechanical-engineering-operations-trainee-aws-data-centers-uae-national-only-6-month-contract-leading-to-full-time-employment","job_schedule_type":"full-time","location":"AE, Abu Dhabi","locations":["{\"normalizedCountryCode\":\"ARE\",\"city\":\"Abu Dhabi\",\"countryIso3a\":\"ARE\",\"countryIso2a\":\"AE\",\"locationNonStemming\":\"United Arab Emirates, Abu Dhabi\",\"coordinates\":\"24.46918,54.37173\",\"normalizedCountyName\":\"Abu Dhabi\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Arab Emirates\",\"normalizedLocation\":\"Abu Dhabi, ARE\",\"location\":\"AE, Abu Dhabi\",\"region\":\"\",\"buildingCodeList\":[\"DXB61\"],\"normalizedCityName\":\"Abu Dhabi\"}"],"normalized_location":"Abu Dhabi, ARE","optional_search_labels":["aws.team-mena","aws.team-ais","aws.team-dc","aws.team-adc-infra-optional"],"posted_date":"February 24, 2026","preferred_qualifications":"- Strong written and verbal communication skills\u003cbr/\u003e- Ability to work effectively in a team environment\u003cbr/\u003e- Good time management and organizational skills\u003cbr/\u003e- Interest working in a data center environment\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-support","source_system":"JobCreator","state":null,"title":"Electrical \u0026 Mechanical Engineering Operations Trainee, AWS Data Centers (UAE National Only) [6-month contract leading to full-time employment]","university_job":null,"updated_time":"34 minutes","url_next_step":"https://account.amazon.com/jobs/3188013/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- UAE National with family book\u003cbr/\u003e- Recently graduated or enrolled in the final semester, with a Bachelor’s Degree in a relevant field (e.g., Mechanical or Electrical Engineering) Or\u003cbr/\u003e- Recently graduated from, a Technical/Trade school program (HVAC, electrician, facilities maintenance, or similar).","business_category":"aws","city":"Dubai","company_name":"Amazon Data Services Emirates LLC DWC-Branch [Dubai South FZ Branch] - K94","country_code":"ARE","description":"AWS have an exciting Electrical \u0026 Mechanical Engineering Operations Traineeship opportunity in Dubai available for a UAE national with family book. AWS are committed to contributing towards the UAE’s goal of employing 75,000 Emiratis in the private sector and Ministerial Resolution No.279.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is growing rapidly, and we are looking for Engineering Operations Technician Trainees to join our expanding Data Center team in Dubai.\u003cbr/\u003e\u003cbr/\u003eProgram Details\u003cbr/\u003e- Duration: 6 months, full-time (40 hours/week), with a view to become permanent at the end of the traineeship, depending on performance and business needs.\u003cbr/\u003e- Schedule: Standard Monday–Friday day schedule.\u003cbr/\u003e- The program provides exposure to the skills required for a future full-time Data Center Engineering Operations Technician role. Please note a full-time role may involve shifts, weekends, and on-call rotations.\u003cbr/\u003e- Note: Applications are reviewed on a rolling basis. For an update on your status, or to confirm your application was submitted successfully, please login to your candidate portal. Please note that we are reviewing a high volume of applications and appreciate your patience.\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services (AIS)\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe Engineering Operations team are AWS’s front-line responders for hands-on troubleshooting and operations of critical infrastructure. As a Trainee, you will:\u003cbr/\u003e- Assist in maintaining and operating mechanical and electrical equipment.\u003cbr/\u003e- Support root cause analysis of equipment failures.\u003cbr/\u003e- Help troubleshoot facility and rack-level events within internal SLAs.\u003cbr/\u003e- Take daily operational readings of mechanical and electrical equipment.\u003cbr/\u003e- Use our internal CMMS (Computerized Maintenance Management System) to manage workflows.\u003cbr/\u003e- Work alongside third-party vendors and contractors onsite.\u003cbr/\u003e- You will work with equipment that supports mission-critical servers, including but not limited to: diesel generators, switchgear, UPSs, PDUs, air handling units, chillers, cooling towers, pumps, motors, VFDs, and building automation systems.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e- Working at heights and from ladders.\u003cbr/\u003e- Regularly lifting/moving up to 22kg (49lbs) unassisted, and participating in group lifts for heavier loads.\u003cbr/\u003e- Using hands to handle and manipulate small tools, wires, and objects.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003e\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"AWS have an exciting Electrical \u0026 Mechanical Engineering Operations Traineeship opportunity in Dubai available for a UAE national with family book. AWS are committed to contributing towards the UAE’s goal","display_distance":null,"id":"92df47d9-656f-445e-a450-57437b9ea70d","id_icims":"3156044","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3156044/electrical-mechanical-engineering-operations-trainee-aws-data-centers-uae-national-only-6-month-contract-leading-to-full-time-employment","job_schedule_type":"full-time","location":"AE, Dubai","locations":["{\"normalizedCountryCode\":\"ARE\",\"city\":\"Dubai\",\"countryIso3a\":\"ARE\",\"countryIso2a\":\"AE\",\"locationNonStemming\":\"United Arab Emirates, Dubai\",\"coordinates\":\"25.26951,55.30884\",\"normalizedCountyName\":\"Dubai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Arab Emirates\",\"normalizedLocation\":\"Dubai, ARE\",\"location\":\"AE, Dubai\",\"region\":\"\",\"buildingCodeList\":[\"DXB60\"],\"normalizedCityName\":\"Dubai\"}"],"normalized_location":"Dubai, ARE","optional_search_labels":["aws.team-uae","aws.team-mena"],"posted_date":"January  9, 2026","preferred_qualifications":"- Strong written and verbal communication skills\u003cbr/\u003e- Ability to work effectively in a team environment\u003cbr/\u003e- Good time management and organizational skills\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-support","source_system":"JobCreator","state":null,"title":"Electrical \u0026 Mechanical Engineering Operations Trainee, AWS Data Centers (UAE National Only) [6-month contract leading to full-time employment]","university_job":null,"updated_time":"35 minutes","url_next_step":"https://account.amazon.com/jobs/3156044/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- Experience in employee and performance management\u003cbr/\u003e- Experience in English-language communication skills, both written and verbal","business_category":"fulfillment-ops","city":"Cajamar","company_name":"Amazon Servicos de Varejo do Brasil Ltda.","country_code":"BRA","description":"Na Amazon, trabalhamos para ser a empresa mais centrada no cliente do mundo. Para isso, precisamos de pessoas excepcionalmente talentosas, brilhantes e motivadas.\u003cbr/\u003e\u003cbr/\u003eA Amazon está em busca de uma pessoa para a posição de Operations Manager em nossa unidade. Como uma das marcas mais reconhecidas mundialmente, distribuímos milhões de produtos anualmente para clientes em todo o mundo.\u003cbr/\u003e\u003cbr/\u003eVocê terá foco em quatro áreas fundamentais: segurança, qualidade, experiência do cliente e produtividade do seu departamento.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Analisar previsões de trabalho e determinar requisitos de produtividade diária para atingir os objetivos gerais da unidade\u003cbr/\u003e- Trabalhar em parceria com outros Area Managers para equilibrar a força de trabalho, garantindo uma operação balanceada e eficiente, enquanto atinge todas as metas\u003cbr/\u003e- Apoiar todos os programas de segurança e conformidade com normas regulamentadoras para garantir um ambiente de trabalho seguro para todos os associados\u003cbr/\u003e- Identificar e liderar proativamente iniciativas de melhoria de processos e ferramentas Lean\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e- Escala 3x2 (3 dias de trabalho com 3 dias de folga, 2 dias de trabalho com 2 dias de folga)\u003cbr/\u003e- Turnos de 12 horas (06:00-18:00 ou 18:00-05:00)\u003cbr/\u003e- Disponibilidade para trabalhar em finais de semana","department_cost_center":null,"description_short":"Na Amazon, trabalhamos para ser a empresa mais centrada no cliente do mundo. Para isso, precisamos de pessoas excepcionalmente talentosas, brilhantes e motivadas.A Amazon está em busca de uma pessoa para","display_distance":null,"id":"ef3c0c62-66d0-44af-b0bb-025560f80a1e","id_icims":"3142507","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3142507/operations-manager-fulfillment-center","job_schedule_type":"full-time","location":"BR, SP, Cajamar","locations":["{\"normalizedStateName\":\"Sao Paulo\",\"normalizedCountryCode\":\"BRA\",\"city\":\"Cajamar\",\"countryIso3a\":\"BRA\",\"countryIso2a\":\"BR\",\"locationNonStemming\":\"Brazil, SP, Cajamar\",\"coordinates\":\"-23.35635,-46.87702\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Brazil\",\"normalizedLocation\":\"Cajamar, Sao Paulo, BRA\",\"location\":\"BR, SP, Cajamar\",\"region\":\"SP\",\"buildingCodeList\":[\"GRU5\"],\"normalizedCityName\":\"Cajamar\"}"],"normalized_location":"Cajamar, Sao Paulo, BRA","optional_search_labels":[],"posted_date":"December 13, 2025","preferred_qualifications":"- Experience with performance metrics and process improvement and Lean techniques\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"SP","title":"Operations Manager, Fulfillment Center","university_job":null,"updated_time":"36 minutes","url_next_step":"https://account.amazon.com/jobs/3142507/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}