{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 5+ years of technical product or program management experience\u003cbr/\u003e- 7+ years of working directly with engineering teams experience\u003cbr/\u003e- 3+ years of software development experience\u003cbr/\u003e- 5+ years of technical program management working directly with software engineering teams experience\u003cbr/\u003e- Experience managing programs across cross functional teams, building processes and coordinating release schedules","business_category":"consumerpayments","city":"Vancouver","company_name":"Amazon Development Centre Canada ULC","country_code":"CAN","description":"Amazon Payment Products (APP) Tech organization owns technology that serves all APP businesses, including Co-branded Credit Cards (CBCC), Private Label Credit Cards (PLCC), Global Installment Lending (GIL), and card-based Installments. The demand to support the growing businesses of APP and other WW Payments businesses such as Digital and Emerging Market Payments (DEP), and Business Payment Products (BPP that is part of B2B Payments) prompted us to organize APP Tech around the concept of worldwide feature delivery and invest further in the scalability, decoupling, and optimization of our core services. We build and maintain the foundational services and features that serve WW clients and customers journeys including Acquisitions, Servicing, Fraud Prevention, and Financial Offers.\u003cbr/\u003e\u003cbr/\u003eAs a member of the APP team, you will invent new features, and develop delightful user experiences. We are a fast-paced environment, using agile methodology and lightweight Service Oriented Architecture design patterns leveraged by Native AWS applications. We encourage innovation and expect developers to take a high level of ownership throughout the software life cycle.\u003cbr/\u003e\u003cbr/\u003eIf you are a strong Program Manager with experience and interest in high-volume websites, distributed systems, performance and scalability, and are looking for delivering exciting and impactful features, we might be the next step in your career.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Work on a variety of challenging problems that have the potential to significantly impact Amazon’s business and competitive position.\u003cbr/\u003e*Collaborate with groups of experts and cross-functional colleagues in an agile environment.\u003cbr/\u003e*Learn and grow by being exposed to multiple organizational problems in a short time frame.\u003cbr/\u003e*Be expected to discover, define, and apply scientific, engineering, and business best practice.\u003cbr/\u003e*Work with business leaders, scientists, and economists to translate business and functional requirements into concrete deliverables, including the design, roadmaps, development, testing, and deployment of highly scalable distributed services.\u003cbr/\u003e*Coordinate and drive design and implementation efforts across multiple teams.\u003cbr/\u003eAnticipate bottlenecks, evaluate tradeoffs and provide escalation management, balancing the business versus technical constraints\u003cbr/\u003ePartner with scientists, economists, and engineers to help deliver scalable ML and econometric models while building tools to help our customers gain and apply insights.","department_cost_center":null,"description_short":"Amazon Payment Products (APP) Tech organization owns technology that serves all APP businesses, including Co-branded Credit Cards (CBCC), Private Label Credit Cards (PLCC), Global Installment Lending (GIL),","display_distance":null,"id":"b402c82b-69ea-4f01-99ec-97afba8bc78d","id_icims":"3159611","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Technical Program Management","job_function_id":null,"job_path":"/en/jobs/3159611/sr-technical-program-manager-amazon-payment-products","job_schedule_type":"full-time","location":"CA, BC, Vancouver","locations":["{\"normalizedStateName\":\"British Columbia\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Vancouver\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, BC, Vancouver\",\"coordinates\":\"49.26038,-123.11336\",\"normalizedCountyName\":\"Metro Vancouver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Vancouver, British Columbia, CAN\",\"location\":\"CA, BC, Vancouver\",\"region\":\"BC\",\"buildingCodeList\":[\"YVR14\"],\"normalizedCityName\":\"Vancouver\"}"],"normalized_location":"Vancouver, British Columbia, CAN","optional_search_labels":["canada-corporate-stores"],"posted_date":"January 14, 2026","preferred_qualifications":"- 5+ years of project management disciplines including scope, schedule, budget, quality, along with risk and critical path management experience\u003cbr/\u003e- Experience managing projects across cross functional teams, building sustainable processes and coordinating release schedules\u003cbr/\u003e- Experience defining KPI's/SLA's used to drive multi-million dollar businesses and reporting to senior leadership\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(34, 34, 34)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. As a total compensation company, Amazon's package may include other elements such as sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon offers comprehensive benefits including health insurance (medical, dental, vision, prescription, basic life \u0026amp; AD\u0026amp;D insurance), Registered Retirement Savings Plan (RRSP), Deferred Profit Sharing Plan (DPSP), paid time off, and other resources to improve health and well-being. We thank all applicants for their interest, however only those interviewed will be advised as to hiring status.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eCAN, BC, Vancouver - 128,100.00 - 214,000.00 CAD annually","primary_search_label":"consumerpayments.team-paymentproducts","source_system":"JobCreator","state":"BC","title":"Sr. Technical Program Manager, Amazon Payment Products","university_job":null,"updated_time":"37 minutes","url_next_step":"https://account.amazon.com/jobs/3159611/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-paymentproducts","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"international-stores","city":"Vancouver","company_name":"Amazon Development Centre Canada ULC","country_code":"CAN","description":"Do you enjoy working on the latest cloud technologies, collaborating with multiple partner teams, and delivering impactful solutions that drives customer engagement? Are you a tenured software development manager? If so, continue reading.\u003cbr/\u003e\u003cbr/\u003eUPX (Unified Payments Experience) team is growing, modernizing the architecture with the use of bleeding edge technolgies. We are looking for exceptional talent to rapidly build applications that use exciting new AWS services, Reactive Native technology, Open Source frameworks, and Server-less architecture. We solve complex engineering problems from securing customer’s PII end to end or building a highly reliable set of Tier-1 services with 5 9s availability. We influence all Amazon customers that leverage payments experience to pay for their products or services. We also have a number of contributor teams that leverage our federated architecture to enhance the customer’s payment experience by launching new Payment Methods. \u003cbr/\u003e\u003cbr/\u003eOur mission is to Provide Trusted, Intuitive and Accessible Experience to the customer. We also strive to improve our contributor experience, making it as efficient as possible through tools and automation, and empower them with reliable data to make critical business decisions.","department_cost_center":null,"description_short":"Do you enjoy working on the latest cloud technologies, collaborating with multiple partner teams, and delivering impactful solutions that drives customer engagement? Are you a tenured software development","display_distance":null,"id":"1bf2f413-e5bb-49df-bb2e-a3ca47953221","id_icims":"3174027","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3174027/software-development-engineer-unified-payments-experience-upx","job_schedule_type":"full-time","location":"CA, BC, Vancouver","locations":["{\"normalizedStateName\":\"British Columbia\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Vancouver\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, BC, Vancouver\",\"coordinates\":\"49.26038,-123.11336\",\"normalizedCountyName\":\"Metro Vancouver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Vancouver, British Columbia, CAN\",\"location\":\"CA, BC, Vancouver\",\"region\":\"BC\",\"buildingCodeList\":[\"YVR14\"],\"normalizedCityName\":\"Vancouver\"}"],"normalized_location":"Vancouver, British Columbia, CAN","optional_search_labels":["canada-corporate-stores"],"posted_date":"February  4, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected status. If you would like to request an accommodation, please notify your Recruiter.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(34, 34, 34)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. As a total compensation company, Amazon's package may include other elements such as sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon offers comprehensive benefits including health insurance (medical, dental, vision, prescription, basic life \u0026amp; AD\u0026amp;D insurance), Registered Retirement Savings Plan (RRSP), Deferred Profit Sharing Plan (DPSP), paid time off, and other resources to improve health and well-being. We thank all applicants for their interest, however only those interviewed will be advised as to hiring status.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eCAN, BC, Vancouver - 114,800.00 - 191,800.00 CAD annually","primary_search_label":"international-stores.team-amazon-payments","source_system":"JobCreator","state":"BC","title":"Software Development Engineer, Unified Payments Experience (UPX)","university_job":null,"updated_time":"39 minutes","url_next_step":"https://account.amazon.com/jobs/3174027/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-payments","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience with strong project management skills and the ability to thrive in a fast-paced environment","business_category":"aws","city":"Virtual","company_name":"Amazon Development Center U.S., Inc.","country_code":"USA","description":"Application deadline: Feb 13, 2026\u003cbr/\u003e\u003cbr/\u003eAs part of the AWS Applied AI Solutions organization, we have a vision to provide business applications, leveraging Amazon’s unique experience and expertise, that are used by millions of companies worldwide to manage day-to-day operations. We will accomplish this by accelerating our customers’ businesses through delivery of intuitive and differentiated technology solutions that solve enduring business challenges. We blend vision with curiosity and Amazon’s real-world experience to build opinionated, turnkey solutions. Where customers prefer to buy over build, we become their trusted partner with solutions that are no-brainers to buy and easy to use.  \u003cbr/\u003e\u003cbr/\u003eAmazon Just Walk Out as a Service (JWOS) delivers solutions to our Retail Customers to simplify shopping for their shoppers. Our enterprise-ready, autonomous retail technology enables shoppers to simply enter a store, grab what they want, and just go. Born from experience at Amazon Go, Just Walk Out uses a combination of technologies to eliminate checkout lines bringing fast and convenient transactional experiences to shoppers. JWOS is seeking a Manager, Customer Success to build first class customer service and operational support programs for our customers. This role drives customer success in several ways such as value realization, steady-state operational support, continuing customer education, and operational excellence initiatives. This function plays a critical role in defining our global customer success strategy and building the tactical playbooks, processes, and mechanisms to deliver this mandate. In this role, you will design the infrastructure for post-launch customer support, engage with customers to define requirements, and help see around corners for future needs. This role never stops iterating and never stops inventing on behalf of our customers. \u003cbr/\u003e \u003cbr/\u003eThe ideal candidate has a track record of success leading in ambiguous and high-pressure entrepreneurial situations, has impeccable communication and project management skills, and has demonstrable experience in driving customer growth through creation of scalable mechanisms and processes. Our team values an ability to own projects and work autonomously, to deliver results scrappily and at scale, and be authentic as we accomplish our goals together. This candidate understands the profundity of our revolutionary technology and the power of building and earning trust. \u003cbr/\u003e \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey Responsibilities\u003cbr/\u003e·        While always placing the customer first, drive global strategy to serve both our end users: the customer and the shopper\u003cbr/\u003e·        Develop and track customer success metrics\u003cbr/\u003e·        Develop and hit monthly, quarterly, and annual goals to improve customer satisfaction\u003cbr/\u003e·        Track and monitor industry trends and make recommendations\u003cbr/\u003e·        Develop operational excellence series and drive partner teams to deliver upon action items to improve customer experience\u003cbr/\u003e·        Parlay operational excellence outputs into value realization initiatives to strengthen our value proposition\u003cbr/\u003e·        Pursue new ideas for value creation\u003cbr/\u003e·        Solve ad hoc operational concerns as they arise in the field and apply learnings across all other customers\u003cbr/\u003e·        Develop and launch customer support infrastructure- processes, SOPs, platform\u003cbr/\u003e·        Ideate and build formal customer support program\u003cbr/\u003e·        Invent and collaborate both launch + ongoing learning and development to improve customer capabilities and retention\u003cbr/\u003e·        Gather VOC and VOS data to cross-functionally share with JWOS cross-functional teams to iterate our service\u003cbr/\u003e·        Gain alignment from sr. internal stakeholders who own multiple products\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eABOUT AWS:\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"As part of the AWS Applied AI Solutions organization, we have a vision to provide business applications, leveraging Amazon’s unique experience and expertise, that are used by millions of companies worldwide","display_distance":null,"id":"8f0fa208-3c92-4cd7-addf-e1ccd857fc69","id_icims":"3156221","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Customer Success","job_function_id":null,"job_path":"/en/jobs/3156221/program-manager-customer-growth-just-walk-out-jwo","job_schedule_type":"full-time","location":"US, Virtual","locations":["{\"normalizedCountryCode\":\"USA\",\"city\":\"Virtual\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, Virtual\",\"coordinates\":\"38.89036,-77.03196\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"USA\",\"location\":\"US, Virtual\",\"region\":\"\",\"buildingCodeList\":[\"VIR\"]}"],"normalized_location":"USA","optional_search_labels":[],"posted_date":"January  9, 2026","preferred_qualifications":"- Experience managing multiple projects and meeting aggressive deadlines\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, ,  - 80,000.00 - 140,000.00 USD annually","primary_search_label":"aws.team-program-management-primary","source_system":"JobCreator","state":null,"title":"Program Manager, Customer Growth, Just Walk Out, (JWO)","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3156221/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-program-management-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of business development, account management, product management, project management, financial analysis and/or marketing experience\u003cbr/\u003e- Experience in business development, account management, product management, project management, financial analysis and/or marketing\u003cbr/\u003e- Bachelor's degree or equivalent, or 6+ months of working experience\u003cbr/\u003e- Experience in stakeholder management and communication management\u003cbr/\u003e- Knowledge of Microsoft Excel at an advanced level, including: pivot tables, macros, index/match, vlookup, VBA, data links, etc.","business_category":"worldwide-grocery-stores","city":"Virtual","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Application deadline: Feb 13, 2026\u003cbr/\u003e\u003cbr/\u003eThe Principal Forager supports Whole Foods Market’s status as the growth destination for founders and early-stage brands. This role is focused on discovering local and emerging brands and supporting community connection through taste of place. Success is measured by creating a locally relevant customer experience and establishing an emerging brand pipeline. Serves as an industry expert and engages with the local and emerging supplier community through various platforms, including trade-show supplier summits and the Local and Emerging Accelerator Program (LEAP). Nurtures relationships and meets suppliers where they are to provide the right tools for brand growth, development, and Local advocacy.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Ensures that Whole Foods Market’s customers have an unparalleled locally relevant experience by supporting relevant brands and surfacing geographical taste preferences.\u003cbr/\u003e• Partners cross-functionally with Merchants, Marketing, and Retail/Area Operations to drive speed to market, strong execution in stores, and storytelling.\u003cbr/\u003e• Supports the development of local and emerging suppliers to onboard, activate and grow including quality standards compliance, distribution, promo planning, demo activation, and marketing support.\u003cbr/\u003e• Leverages experience to contribute to local and emerging brands team strategy development and key initiatives.\u003cbr/\u003e• Leads product development projects and advises internal and external stakeholders in product and innovation development in support of Category Merchant strategies.\u003cbr/\u003e• Develops local and emerging brands team product and innovation across Center Store, based on insights and analytics, category strategies, customer and product trends, competitive landscape, and Whole Foods Market differentiators.\u003cbr/\u003e• Leverages knowledge of customer, market, data, industry trends and emerging challenges and develops insight-driven recommendations for local and emerging brand assortment and leadership consideration.\u003cbr/\u003e• Supports the development of local and emerging brands promotional strategy and planning, including supporting marketing initiatives, planning, and executing key promotional events and reacting based on sales performance and the competitive landscape.\u003cbr/\u003e• Supports execution of category pricing strategies and helps ensure financially sound and value adding pricing tactics.\u003cbr/\u003e• Leads others in the evaluation and interpretation of complex issues in purchasing, procurement, contract, delivery, quality, pricing, and other issues.\u003cbr/\u003e• Takes complex business analysis and projects from concept to completion and makes results accessible and relevant to business users at all levels.\u003cbr/\u003e• Works with leadership to identify industry events and develop strategies for attendance, panel participation, networking, and other events.\u003cbr/\u003e• Plays a leadership role (formally and informally) working with others, in groups, in cross-functional settings and with diverse stakeholders internally and externally.\u003cbr/\u003e• Provides project leadership on various merchandising initiatives and ability to structure, plan, and lead projects.\u003cbr/\u003e• Viewed as a subject matter expert and thought leader within the merchandising organization.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eSkills:\u003cbr/\u003e• Demonstrates strong understanding of Whole Foods Market business, food retail industry, and the business models of key strategic partners and competitors.\u003cbr/\u003e• Demonstrates strategic understanding of Center Store retail business objectives and competitive strengths and challenges, takes projects from concept to completion and make results accessible and relevant to business users at all levels.\u003cbr/\u003e• Able to identify how strategic direction will be achieved by setting short- and long-term goals and objectives; focuses effort and resources on the strategic priorities with the greatest potential for positive impact.\u003cbr/\u003e• Applies experience and judgement to establish criteria and systems (including lead and lag measures) to track ongoing progress toward goals and follows up on assigned responsibilities.\u003cbr/\u003e• Strong proficiency with data analysis and able to understand statistics and modeling of consumer behavior.\u003cbr/\u003e• Leverages skill set and exemplary judgement to make independent business decisions and deliver results.\u003cbr/\u003e• Able to drive product development and innovation ideas and ensure sustainability in response to changes and feedback.\u003cbr/\u003e• Attuned to category business performance; understands impact on total team, resolves underlying issues, and delivers financial results.\u003cbr/\u003e• Leverages proficiency to serve as a resource across the team for pulling financial reports, analyzing business trends, and assessing underlying drivers of results.\u003cbr/\u003e• Able to identify areas for continuous process and system improvement.\u003cbr/\u003e• Serves as a voice of WFM with suppliers and external audiences.\u003cbr/\u003e• Able to determine action steps and milestones required to implement a specific business initiative; can adjust activities or timelines as circumstances warrant.\u003cbr/\u003e• Ensures that those responsible for implementing a strategic initiative have role clarity and accountability for required actions and outputs and the direction and authority to act in a way consistent with organizational values.\u003cbr/\u003e• Able to identify opportunities to include others in the decision-making process, and invite others to share candid thoughts, ideas, or perspectives.\u003cbr/\u003e• Conveys messages logically, simply, succinctly, and at the right pace; does not digress; is in command of the message; demonstrates excellent interpersonal communication skills and levels of tact, diplomacy, and confidentiality.\u003cbr/\u003e• Effectively presents to a wide range of audiences (direct reports, peers, leadership, suppliers, industry engagement), tailoring communication to audience needs.\u003cbr/\u003e• Exceptional change management skills, works with merchandising leadership to help drive change and support WFM Category Management evolution.\u003cbr/\u003e• Expertly navigates through ambiguity given a blend of experience, input, and intuition.\u003cbr/\u003e• Activates WFM leadership principles, core values, and commitment to customer service at a leadership level to champion the mission, vision, and strategy of the organization.","department_cost_center":null,"description_short":"The Principal Forager supports Whole Foods Market’s status as the growth destination for founders and early-stage brands. This role is focused on discovering local and emerging brands and supporting community","display_distance":null,"id":"a13ae7a9-89b9-4d1f-85bb-b0db0293a9b9","id_icims":"3166380","is_intern":null,"is_manager":null,"job_category":"Buying, Planning, \u0026 Instock Management","job_family":"Buying/Planning","job_function_id":null,"job_path":"/en/jobs/3166380/principal-forager-category-manager","job_schedule_type":"full-time","location":"US, Virtual","locations":["{\"normalizedCountryCode\":\"USA\",\"city\":\"Virtual\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, Virtual\",\"coordinates\":\"38.89036,-77.03196\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"USA\",\"location\":\"US, Virtual\",\"region\":\"\",\"buildingCodeList\":[\"VIR\"]}"],"normalized_location":"USA","optional_search_labels":[],"posted_date":"January 26, 2026","preferred_qualifications":"- Experience working with early stage and emerging brands to successfully navigate growth planning, tactical retail issues, and strategy development preferred.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, ,  - 140,300.00 - 189,800.00 USD annually","primary_search_label":"worldwide-grocery-stores.team-whole-foods-market","source_system":"JobCreator","state":null,"title":"Principal Forager, Category Manager","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3166380/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-whole-foods-market","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience analyzing data and best practices to assess performance drivers\u003cbr/\u003e- Experience relationship building and influencing at the C-level of Fortune 500 customers\u003cbr/\u003e- Experience using Salesforce\u003cbr/\u003e- 10+ years of sales experience\u003cbr/\u003e- Experience prospecting and qualifying companies\u003cbr/\u003e- Experience relationship building and influencing at the C-level of Fortune 500 customers\u003cbr/\u003e- Experience using Salesforce\u003cbr/\u003e- At least 5 years of experience in benefits sales, working directly with employers, consultants and benefit brokers and 3+ years selling to companies with over 15,000 employees","business_category":"healthcare","city":"Virtual Location - Colorado","company_name":"Amazon.com Services LLC - A57","country_code":"USA","description":"Application deadline: Feb 14, 2026\u003cbr/\u003e\u003cbr/\u003eAbout Amazon One Medical\u003cbr/\u003eAmazon One Medical offers convenient access to One Medical providers for employers through unlimited on-demand virtual care, remote primary care, and in-person visits in 20+ MSA's. Our advanced primary care model promotes wellness and prevention with integrated chronic, behavioral, pediatric, and acute care support. Prestigious employers such as NASDAQ, PwC, Airbnb, and Pinterest consider us core to their benefits strategy.\u003cbr/\u003e\u003cbr/\u003eThe Opportunity\u003cbr/\u003eWe are seeking a National Accounts Sales, Principal for our Western region who will be responsible for bringing in business and managing deals with our largest and most strategic client prospects - 15,000 employees or more. Over the last decade One Medical has established relationships with employer groups nationally, and we are now seeing the results - companies who provide One Medical as a part of their benefits package have healthier employees. As we enter our next chapter, we want to scale these initiatives and broaden our reach nationally. Reporting to the Head of Sales, you will work cross-functionally with a diverse set of internal and external stakeholders and develop and drive sales strategy for large employer groups.\u003cbr/\u003e\u003cbr/\u003eAs a natural storyteller you will paint a compelling picture of One Medical’s vision and strategy that motivates others into action and use your consultative approach to articulate our strategy in a way that clients and prospects can easily relate. You consistently exceed your quota, and continue to push yourself and motivate those around you, acting as a mentor to more junior members of Amazon One Medical. You enjoy leveraging formal and informal networks built from previous experience as well as your industry knowledge to anticipate future population health management trends. You will set objectives and targets that align with One Medical’s organizational goals, while taking on new challenges with a sense of urgency, energy, and enthusiasm.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eRepresent One Medical and interact with major clients nationally\u003cbr/\u003eActively prospect, build relationships and secure deals with large accounts with more than 15,000 eligible employees\u003cbr/\u003eCoordinating with internal stakeholders and managing proposals\u003cbr/\u003eBuild a territory and define metrics and milestones that align with broader organizational goals\u003cbr/\u003eForecast deal flow and architect and negotiate creative deals and partnerships\u003cbr/\u003eProvide market-level feedback to help inform product roadmap; act as the voice of the customer\u003cbr/\u003eWork closely with internal teams, including account management, marketing, finance, legal and others, to ensure client success and performance\u003cbr/\u003eCollaborate with corporate leadership to meet or exceed quota and annual growth\u003cbr/\u003eLeverage relationships with consultants, brokers, and other professional networks to strengthen awareness of One Medical products and services\u003cbr/\u003eCollaborate with other members of the sales team and broader Amazon Health Services organization to support in-person activities in specific MSA's","department_cost_center":null,"description_short":"About Amazon One MedicalAmazon One Medical offers convenient access to One Medical providers for employers through unlimited on-demand virtual care, remote primary care, and in-person visits in 20+ MSA's.","display_distance":null,"id":"c08543a9-8054-4422-9b05-b2fa0e82ecde","id_icims":"3126543","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Sales/Account Management","job_function_id":null,"job_path":"/en/jobs/3126543/national-acct-sales-principal-amazon-one-medical","job_schedule_type":"full-time","location":"US, CO, Virtual Location - Colorado","locations":["{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Virtual Contact Center-az\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Virtual Contact Center-az\",\"coordinates\":\"33.44825,-112.07581\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arizona, USA\",\"location\":\"US, AZ, Virtual Contact Center-az\",\"region\":\"AZ\",\"buildingCodeList\":[\"VCCAZ\"]}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Virtual Location - Washington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Virtual Location - Washington\",\"coordinates\":\"47.03954,-122.89165\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Washington, USA\",\"location\":\"US, WA, Virtual Location - Washington\",\"region\":\"WA\",\"buildingCodeList\":[\"VIR\"]}","{\"normalizedStateName\":\"Oregon\",\"normalizedCountryCode\":\"USA\",\"city\":\"Virtual Location - Oregon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OR, Virtual Location - Oregon\",\"coordinates\":\"44.93326,-123.04382\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Oregon, USA\",\"location\":\"US, OR, Virtual Location - Oregon\",\"region\":\"OR\",\"buildingCodeList\":[\"VIR\"]}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Virtual Contact Center-ca\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Virtual Contact Center-ca\",\"coordinates\":\"38.57944,-121.49086\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"California, USA\",\"location\":\"US, CA, Virtual Contact Center-ca\",\"region\":\"CA\",\"buildingCodeList\":[\"VCCCA\"]}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Virtual Location - Colorado\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Virtual Location - Colorado\",\"coordinates\":\"39.74001,-104.99203\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Colorado, USA\",\"location\":\"US, CO, Virtual Location - Colorado\",\"region\":\"CO\",\"buildingCodeList\":[\"VIR\"]}"],"normalized_location":"Colorado, USA","optional_search_labels":[],"posted_date":"November 14, 2025","preferred_qualifications":"- Experience in strategy development\u003cbr/\u003e- Experience identifying, developing, negotiating, and closing opportunities across a wide spectrum of customer engagement levels\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eThe base salary range for this position is listed below. For salaried roles, your Amazon package will include listed sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003ca href=\"https://amazon.jobs/en/benefits/us-benefits-and-stock\"\u003ehttps://amazon.jobs/en/benefits/us-benefits-and-stock\u003c/a\u003e.\u003cbr\u003e\u003cbr\u003eColorado $134,600 - $182,100 annually\u003cbr\u003eNational $121,100 - $200,300 annually","primary_search_label":"healthcare.one-medical","source_system":"JobCreator","state":"CO","title":"National Acct Sales, Principal, Amazon One Medical","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3126543/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"one-medical","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of experience in cloud architecture and implementation\u003cbr/\u003e- Bachelor's degree in Computer Science, Engineering, related field, or equivalent experience\u003cbr/\u003e- 5+ years of software development tools and methodologies\u003cbr/\u003e- 3+ years of experience with automation, scripting, and/or software development (e.g., Python)\u003cbr/\u003e- Current, active US Government Security Clearance of TS/SCI with Polygraph","business_category":"aws","city":"Herndon","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Application deadline: Feb 13, 2026\u003cbr/\u003e\u003cbr/\u003eThe Amazon Web Services Professional Services (ProServe) team is seeking a skilled Delivery Consultant to join our team at Amazon Web Services (AWS). In this role, you'll work closely with customers to design, implement, and manage AWS solutions that meet their technical requirements and business objectives. You'll be a key player in driving customer success through their cloud journey, providing technical expertise and best practices throughout the project lifecycle. Possessing a deep understanding of AWS products and services, as a Delivery Consultant you will be proficient in architecting complex, scalable, and secure solutions tailored to meet the specific needs of each customer. You’ll work closely with stakeholders to gather requirements, assess current infrastructure, and propose effective migration strategies to AWS. As trusted advisors to our customers, providing guidance on industry trends, emerging technologies, and innovative solutions, you will be responsible for leading the implementation process, ensuring adherence to best practices, optimizing performance, and managing risks throughout the project. \u003cbr/\u003e \u003cbr/\u003eThe AWS Professional Services organization is a global team of experts that help customers realize their desired business outcomes when using the AWS Cloud. We work together with customer teams and the AWS Partner Network (APN) to execute enterprise cloud computing initiatives. Our team provides assistance through a collection of offerings which help customers achieve specific outcomes related to enterprise cloud adoption. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries.\u003cbr/\u003e\u003cbr/\u003eThis position requires that the candidate selected be a US Citizen and must currently possess and maintain an active TS/SCI security clearance with polygraph.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs an experienced technology professional, you will be responsible for: \u003cbr/\u003e- Designing and implementing complex, scalable, and secure AWS solutions tailored to customer needs\u003cbr/\u003e- Providing technical guidance and troubleshooting support throughout project delivery\u003cbr/\u003e- Collaborating with stakeholders to gather requirements and propose effective migration strategies\u003cbr/\u003e- Acting as a trusted advisor to customers on industry trends and emerging technologies\u003cbr/\u003e- Sharing knowledge within the organization through mentoring, training, and creating reusable artifacts\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS \u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon  conferences, inspire us to never stop embracing our uniqueness. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.","department_cost_center":null,"description_short":"The Amazon Web Services Professional Services (ProServe) team is seeking a skilled Delivery Consultant to join our team at Amazon Web Services (AWS). In this role, you'll work closely with customers to","display_distance":null,"id":"0be79a61-8457-47f7-bcf6-3f03727e86a9","id_icims":"2942735","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Professional Services","job_function_id":null,"job_path":"/en/jobs/2942735/senior-delivery-consultant-appdev-wwps-proserve","job_schedule_type":"full-time","location":"US, VA, Herndon","locations":["{\"normalizedStateName\":\"Missouri\",\"normalizedCountryCode\":\"USA\",\"city\":\"St. Louis\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MO, St. Louis\",\"coordinates\":\"38.62775,-90.19956\",\"normalizedCountyName\":\"St Louis (City)\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"St Louis, Missouri, USA\",\"location\":\"US, MO, St. Louis\",\"region\":\"MO\",\"buildingCodeList\":[\"STL10\"],\"normalizedCityName\":\"St Louis\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD21\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Herndon, Virginia, USA","optional_search_labels":["aws-team-global-services-optional","amazon-cleared-jobs"],"posted_date":"April  1, 2025","preferred_qualifications":"- Full Stack software development experience (e.g, Python, Angular, React, Java)\u003cbr/\u003e- Solid understanding of DevOps practices and microservices architecture\u003cbr/\u003e- Experience working with containerization technologies (e.g., Docker, Kubernetes)\u003cbr/\u003e- AWS experience preferred, with proficiency in a wide range of AWS services (e.g., EC2, S3, RDS, Lambda, IAM, VPC, CloudFormation)\u003cbr/\u003e- AWS Professional level certifications (e.g., Solutions Architect Professional, DevOps Engineer Professional) preferred\u003cbr/\u003e- Knowledge of security and compliance standards (e.g., HIPAA, GDPR)\u003cbr/\u003e- Strong communication skills with the ability to explain technical concepts to both technical and non-technical audiences\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Denver - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, MO, St. Louis - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, VA, Herndon - 153,600.00 - 207,800.00 USD annually","primary_search_label":"aws.team-us-security-clearance-jobs-primary","source_system":"JobCreator","state":"VA","title":"Senior Delivery Consultant - AppDev, WWPS ProServe","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/2942735/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-us-security-clearance-jobs-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of program or project management experience\u003cbr/\u003e- Experience using data and metrics to determine and drive improvements\u003cbr/\u003e- Experience working cross functionally with tech and non-tech teams\u003cbr/\u003e- Experience leading and implementing large scale, process-related Change Management initiatives, preferably in retail operations and/or supply chain.\u003cbr/\u003e- Retail Change experience preferably in retail operations, purchasing or operational finance\u003cbr/\u003e- Ability to look at big picture to determine holistic Change Management implications of multiple sub-projects\u003cbr/\u003e- Strong verbal and written communication skills including a demonstrated strength in presenting complex concepts and ideas to a variety of audiences\u003cbr/\u003e- Demonstrated ability to build relationships and collaborate effectively in a matrixed environment with many different Change entities across the organization\u003cbr/\u003e- Comfort with ambiguity and ability to respond quickly and appropriately to shifting priorities\u003cbr/\u003e- A passion for advocating for our Team Members, their needs and the experience they have with our systems\u003cbr/\u003e- Previous success building consensus amongst groups with differing points of view\u003cbr/\u003e- Experience with Change process re-engineering\u003cbr/\u003e- Ability to travel to various stores and regions up to 20% at times","business_category":"worldwide-grocery-stores","city":"Austin","company_name":"Amazon.com Services LLC - A57","country_code":"USA","description":"Application deadline: Feb 13, 2026\u003cbr/\u003e\u003cbr/\u003eReports to:  Senior TL, Business Process Improvement of Change Enablement\u003cbr/\u003e\u003cbr/\u003eThe Business Integration Lead will lead the Change Management efforts within World Wide Grocery Stores. They will play a key role in ensuring key strategic initiatives meet the change and project objectives on time and on budget by increasing Team Member speed of adoption. This position will work on several projects and change deliverables simultaneously and ensure timely completion of all project goals. The Business Integration Lead will work with leadership to identify change requirements and provide guidance to, the Change Enablement TMs assigned to create actionable deliverables based on Change Management assessments and plans. They will also create and/or provide input to deliverables working closely with project, training, and communications resources.\u003cbr/\u003e\u003cbr/\u003eWhile the Change Integration Lead does not have direct supervisory responsibility, this person must be comfortable working in a matrixed environment, and acting as a coach to global, OA and store leaders helping them in their roles as leaders and sponsors of change. This position will be responsible for identifying, understanding and facilitating Change process change leading to single Change practices across OAs where appropriate.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tServe as the lead Change expert for assigned business areas\u003cbr/\u003e•\tWork with internal Team, business partners, and key Stakeholders to develop a Change Management strategy for each major sub-project. This would include Change Impact Summaries, Communication and Training Plans as well post-assessment activities to facilitate successful adoption of new initiatives \u003cbr/\u003e•\tBecome an expert in multiple Change areas to facilitate understanding of Change requirements and operational decisions needed as well as facilitate agreement on companywide processes in support of project or program goals.\u003cbr/\u003e•\tDevelop strategic, collaborative partnerships with regional business partners to understand their business needs and priorities in support of Change Management activities\u003cbr/\u003e•\tCollaborate with Change Process Analyst on assigned projects to understand the Change Management impact of process changes and incorporate into action plans\u003cbr/\u003e•\tExecute Change Management plans and activities in support of change and adoption activities\u003cbr/\u003e•\tCreate communication and training collateral at times on own and at times with communication and/or training expert support\u003cbr/\u003e•\tSupport and coach managers and leaders in their change sponsorship role\u003cbr/\u003e•\tPresent Change Management information and updates to a variety of audiences including Steering Committees and Regional and Global Leadership groups\u003cbr/\u003e•\tCollaborate with business partners on systems deployment plans and coordinate successful execution of rollout schedules\u003cbr/\u003e•\tEscalate Change Management related risks as appropriate","department_cost_center":null,"description_short":"Reports to:  Senior TL, Business Process Improvement of Change EnablementThe Business Integration Lead will lead the Change Management efforts within World Wide Grocery Stores. They will play a key role","display_distance":null,"id":"34ff392a-4181-4b47-87b7-025229cd0584","id_icims":"3114377","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Program Management","job_function_id":null,"job_path":"/en/jobs/3114377/business-integration-lead-operations-for-worldwide-physical-grocery-stores","job_schedule_type":"full-time","location":"US, TX, Austin","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"WFM50092\"],\"normalizedCityName\":\"Austin\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA53\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS19\"],\"normalizedCityName\":\"Arlington\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN32\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"Illinois\",\"normalizedCountryCode\":\"USA\",\"city\":\"Chicago\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, IL, Chicago\",\"coordinates\":\"41.88425,-87.63245\",\"normalizedCountyName\":\"Cook\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Chicago, Illinois, USA\",\"location\":\"US, IL, Chicago\",\"region\":\"IL\",\"buildingCodeList\":[\"ORD11\"],\"normalizedCityName\":\"Chicago\"}"],"normalized_location":"Austin, Texas, USA","optional_search_labels":[],"posted_date":"October 23, 2025","preferred_qualifications":"- Prosci certification or comparable change management certification preferred\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $66,800/year in our lowest geographic market up to $142,800/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"worldwide-grocery-stores.team-whole-foods-market","source_system":"JobCreator","state":"TX","title":"Business Integration Lead, Operations for Worldwide Physical Grocery Stores","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3114377/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-whole-foods-market","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree, or 2+ years of Amazon experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- 1+ years of Microsoft Office products and applications experience","business_category":"operations","city":"Thornton","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Application deadline: Feb 14, 2026\u003cbr/\u003e\u003cbr/\u003eOur Reliability \u0026 Maintenance Engineering (RME) team is integral to the success of Amazon worldwide. They manage risks, minimize system downtime, and find innovative ways to improve the way we work. It’s how we’ll become a more sustainable business while building the future one innovative product, service, and idea at a time.\u003cbr/\u003e\u003cbr/\u003eAt Amazon we believe that Every Day is still Day One! We’re working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright and driven people.\u003cbr/\u003e\u003cbr/\u003eThe Maintenance Manager will lead a team of facilities associates, as well as potentially supervise Area Maintenance Managers, and will ensure a safe working environment for all.\u003cbr/\u003e\u003cbr/\u003eIf you do not meet 100% of the preferred qualifications outlined in this job description, we still encourage you to apply. We understand that skills and competencies can be gained in many ways and we are primarily interested in a demonstrated commitment to the work and the potential to grow. Experience comes in many forms and passion goes a long way. If your experience is close to what we're looking for, please consider applying.\u003cbr/\u003e \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Support the Operations team by working in a safe, customer-focused manner; and must be highly self-motivated and customer-centric.\u003cbr/\u003e- Develop and design innovative solutions to difficult problems, manage outside contractors and be on call for emergencies.\u003cbr/\u003e- Handle multiple internally- and externally-sponsored projects and daily activities, manage and meet deadlines, and develop \u0026 track plans on how to accomplish departmental and distribution goals.\u003cbr/\u003e- Work with local site Safety department leadership to understand, implement, and audit safety programs. Ensure that all safety programs and procedures are followed.\u003cbr/\u003e- Develop and maintain preventative maintenance programs and good working relationships with Operations leadership.\u003cbr/\u003e- Facilitate technical and safety training, as well as help to develop professional development of departmental Maintenance technicians.\u003cbr/\u003e- Mentor all Maintenance technicians by motivating and providing direction to help them achieve their goals and make a consistent effort to go above and beyond.\u003cbr/\u003e- Develop Maintenance department business plans and provide guidance and direction for the successful implementation of those plans.\u003cbr/\u003e- Work with site Finance team to develop, set and track budgets.\u003cbr/\u003e- Participate in and support efficiency improvement Kaizen activities for the site, as well as the network when needed.\u003cbr/\u003e- Develop capital spending plans, facilitate cross-functional project planning and perform cost analysis.\u003cbr/\u003e- Own and promote excellent housekeeping.\u003cbr/\u003e- Participate in weekly network Maintenance calls and periodic Maintenance Manager conferences.\u003cbr/\u003e- Candidates must have the ability to provide specific, enriched feedback to enhance individual performance, and provide associates with written performance appraisals including discipline and up to termination.","department_cost_center":null,"description_short":"Our Reliability \u0026 Maintenance Engineering (RME) team is integral to the success of Amazon worldwide. They manage risks, minimize system downtime, and find innovative ways to improve the way we work. It’s","display_distance":null,"id":"4c8cd645-a39f-4fc0-bd6a-b8704b97f4ee","id_icims":"3124984","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/facilities","job_function_id":null,"job_path":"/en/jobs/3124984/maintenance-manager","job_schedule_type":"full-time","location":"US, CO, Thornton","locations":["{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Thornton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Thornton\",\"coordinates\":\"39.8705,-104.98552\",\"normalizedCountyName\":\"Adams\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Thornton, Colorado, USA\",\"location\":\"US, CO, Thornton\",\"region\":\"CO\",\"buildingCodeList\":[\"COS1\",\"DDV2\",\"DEN3\",\"WFM763\"],\"normalizedCityName\":\"Thornton\"}"],"normalized_location":"Thornton, Colorado, USA","optional_search_labels":["operations.team-reliability-maintenance-engineering-na"],"posted_date":"November 12, 2025","preferred_qualifications":"- Bachelor’s degree in a technical discipline (Industrial, Electrical, Mechanical, Civil)\u003cbr/\u003e- Ability to travel to various sites as needed.\u003cbr/\u003e- 5+ years’ experience in the distribution or manufacturing field with equivalent experience in the mechanical or electrical field.\u003cbr/\u003e- Experience in the following areas:\u003cbr/\u003e- Automated conveyors systems and controls\u003cbr/\u003e- Electrical and electronic principles\u003cbr/\u003e- Blueprint and electrical schematic reading\u003cbr/\u003e- CMMS programs\u003cbr/\u003e- Preventive maintenance procedures\u003cbr/\u003e- Industrial electrical\u003cbr/\u003e- Industrial controls\u003cbr/\u003e- Industrial electronics\u003cbr/\u003e- Industrial PC literary\u003cbr/\u003e- N.E.C.\u003cbr/\u003e- Ability to develop and maintain a partnership and communicate effectively, both in writing and verbally with Safety, Operations, Engineering, Sr. Management, peers, contractors and vendors\u003cbr/\u003e- Ability to multitask and prioritize many different projects\u003cbr/\u003e- Six Sigma Certification\u003cbr/\u003e- Understanding of Lean Manufacturing Principles\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eThe base salary range for this position is listed below. For salaried roles, your Amazon package will include listed sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003ca href=\"https://amazon.jobs/en/benefits/us-benefits-and-stock\"\u003ehttps://amazon.jobs/en/benefits/us-benefits-and-stock\u003c/a\u003e.\u003cbr\u003e\u003cbr\u003eColorado $123,300 - $166,800 annually","primary_search_label":"operations.team-reliability-maintenance-engineering","source_system":"JobCreator","state":"CO","title":"Maintenance Manager","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3124984/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-reliability-maintenance-engineering","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in business administration, finance, economics, computer science, data science, engineering, or other related field\u003cbr/\u003e- 5+ years of cloud based solution (AWS or equivalent), system, network and operating system experience, or AWS Associate level certification\u003cbr/\u003e- Experience with software development lifecycle, or experience with training and deploying machine learning systems to solve large-scale optimizations\u003cbr/\u003e- 3+ years of experience in SAP Technical or Functional areas","business_category":"aws","city":"Dallas","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Application deadline: Feb 13, 2026\u003cbr/\u003e\u003cbr/\u003eThe Amazon Web Services Professional Services (ProServe) team is seeking an experienced ProServe Cloud Architect (PCA) to join our team at Amazon Web Services (AWS). In this role, you'll work closely with customers to understand their technical requirements and business objectives, designing and implementing tailored cloud solutions. You'll be a key player in the pre-sales process, providing technical expertise and guidance throughout the customer's cloud journey.\u003cbr/\u003eIn this role, you'll be responsible for creating and leading the solution design to address customer business outcomes (CBO). Operating as the conduit between ProServe Account Executives and our Product and Solutions SAP CoE team, you’ll ensure proposed solutions are realistic, achievable, and optimize ProServe and/or our partners to maximize CBOs. As a PCA you are a trusted advisor to our customers, providing guidance on industry trends, emerging technologies, and innovative solutions to address customer challenges. As a technical SME, you will share knowledge within the organization, through mentoring, training, creation of reusable artifacts and process improvements.\u003cbr/\u003eYour experience in designing technical solutions within the technology/consulting sector, will equip you with the ability to architect complex, scalable, and secure solutions tailored to meet the specific needs of each customer, translating technical concepts into business value. Your success as a PCA will be linked to impacting the signing of SOWs, and the successful implementation of solutions which achieve CBOs while exceeding customer satisfaction (CSAT) expectations. \u003cbr/\u003eThe AWS Professional Services organization is a global team of experts that help customers realize their desired business outcomes when using the AWS Cloud. We work together with customer teams and the AWS Partner Network (APN) to execute enterprise cloud computing initiatives. Our team provides assistance through a collection of offerings which help customers achieve specific outcomes related to enterprise cloud adoption. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs an experienced technology professional, you will be responsible for: \u003cbr/\u003e•\tDesigning complex, scalable, and secure AWS solutions to deliver customer business outcomes (CBOs) \u003cbr/\u003e•\tProviding technical guidance and best practices during pre-sales and implementation phases\u003cbr/\u003e•\tCollaborating with Account Managers and Customers to ensure proposed solutions are realistic and achievable\u003cbr/\u003e•\tActing as a trusted advisor to customers on industry trends and emerging technologies\u003cbr/\u003e•\tSharing knowledge within the organization through mentoring, training, and creating reusable artifacts\u003cbr/\u003e","department_cost_center":null,"description_short":"The Amazon Web Services Professional Services (ProServe) team is seeking an experienced ProServe Cloud Architect (PCA) to join our team at Amazon Web Services (AWS). In this role, you'll work closely with","display_distance":null,"id":"55ebb475-2921-4d52-8833-23c7eca6a101","id_icims":"3104872","is_intern":null,"is_manager":null,"job_category":"Solutions Architect","job_family":"Professional Services","job_function_id":null,"job_path":"/en/jobs/3104872/delivery-consultant-sap-genai-ml-professional-services-sap","job_schedule_type":"full-time","location":"US, TX, Dallas","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS22\"],\"normalizedCityName\":\"Austin\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS17R\"],\"normalizedCityName\":\"Arlington\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA44\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA113\"],\"normalizedCityName\":\"Bellevue\"}","{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Atlanta\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Atlanta\",\"coordinates\":\"33.74831,-84.39111\",\"normalizedCountyName\":\"Fulton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Atlanta, Georgia, USA\",\"location\":\"US, GA, Atlanta\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL11\"],\"normalizedCityName\":\"Atlanta\"}","{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK27\"],\"normalizedCityName\":\"New York\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"Illinois\",\"normalizedCountryCode\":\"USA\",\"city\":\"Chicago\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, IL, Chicago\",\"coordinates\":\"41.88425,-87.63245\",\"normalizedCountyName\":\"Cook\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Chicago, Illinois, USA\",\"location\":\"US, IL, Chicago\",\"region\":\"IL\",\"buildingCodeList\":[\"ORD11\"],\"normalizedCityName\":\"Chicago\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Dallas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Dallas\",\"coordinates\":\"32.77822,-96.79512\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Dallas, Texas, USA\",\"location\":\"US, TX, Dallas\",\"region\":\"TX\",\"buildingCodeList\":[\"DFW15\"],\"normalizedCityName\":\"Dallas\"}"],"normalized_location":"Dallas, Texas, USA","optional_search_labels":[],"posted_date":"October  9, 2025","preferred_qualifications":"- Knowledge of AWS services, such as Elastic Compute Cloud (EC2), Elastic Block Storage (EBS), and Simple Storage Service (S3)\u003cbr/\u003e- Experience with compliance \u0026 security standards including PCI DSS, ISO 27001, HIPAA, and NIST\u003cbr/\u003e- Experience and technical expertise (design and implementation) in cloud computing technologies\u003cbr/\u003e- Experience in communicating technical concepts to a non-technical audience\u003cbr/\u003e- Advanced technology degree or AWS Professional level certifications (e.g., Solutions Architect Professional, DevOps Engineer Professional) preferred\u003cbr/\u003e- Experienced in proposing solutions, developing estimates and responding to request for information\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Denver - 131,300.00 - 177,600.00 USD annually\u003cbr/\u003eUSA, GA, Atlanta - 131,300.00 - 177,600.00 USD annually\u003cbr/\u003eUSA, IL, Chicago - 131,300.00 - 177,600.00 USD annually\u003cbr/\u003eUSA, NY, New York - 144,500.00 - 195,400.00 USD annually\u003cbr/\u003eUSA, TX, Austin - 131,300.00 - 177,600.00 USD annually\u003cbr/\u003eUSA, TX, Dallas - 131,300.00 - 177,600.00 USD annually\u003cbr/\u003eUSA, VA, Arlington - 131,300.00 - 177,600.00 USD annually\u003cbr/\u003eUSA, WA, Bellevue - 131,300.00 - 177,600.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 131,300.00 - 177,600.00 USD annually","primary_search_label":"aws.team-pro-serv","source_system":"JobCreator","state":"TX","title":"Delivery Consultant – SAP GenAI/ML, Professional Services, SAP","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3104872/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-pro-serv","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of Microsoft Excel experience\u003cbr/\u003e- Bachelor's degree in Business Administration, Finance, Economics, Computer Science, Engineering, or related field\u003cbr/\u003e- Experience with sales CRM tools such as Salesforce or similar software\u003cbr/\u003e- Experience defining, refining and implementing sales processes, procedures and policies or equivalent\u003cbr/\u003e- Prior sales compensation experience - Experience with sales ICM tools such as Varicent, Xactly, or similar software","business_category":"aws","city":"Dallas","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Application deadline: Feb 13, 2026\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the leading cloud provider, providing virtualized infrastructure, storage, networking, messaging, and many other services to customers all over the world. AWS runs a globally distributed environment, operating at massive levels of scale and is growing at a staggering pace in terms of revenue, customers, people and complexity. Businesses, educational institutions, governments and non-profits depend on AWS for secure cloud services and solutions.\u003cbr/\u003e\u003cbr/\u003eThe Amazon Web Services (AWS) Global Sales Compensation (GSC) Operations team is seeking a Sales Compensation Systems Analyst to join our operations team. As part of the GSC Operations team, you will be responsible for supporting the day-to-day administration of the Varicent ICM sales compensation system for sales incentive-eligible employees globally. Objectives for this role will include driving operational process improvements in compensation, quota management, compensation adjustments, quarterly payouts, compensation plan administration, and improving the scalability of our program tools. \u003cbr/\u003e   \u003cbr/\u003eThis role requires working with global business owners in HR, Legal, Sales, Finance, Sales Operations, Revenue, Segmentation, Product \u0026 Technology, and our Business Intelligence team to ensure the proper plan design, calculation, delivery, and execution of sales commissions. Cross-team coordination, time management, and excellent communication skills are essential. It is key that we pay employees on time and accurately.  \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe ideal candidate has a proven track record for rolling up their sleeves, maintaining a high level of ownership and accountability and delivering best-in-class support to their internal and external customers.\u003cbr/\u003e\u003cbr/\u003eSupport the day-to-day administration of sales compensation including: \u003cbr/\u003e - Validates data; quantifies impact through data analysis and communicates proposed resolutions and timelines to leadership.\u003cbr/\u003e- Identifies operational risks and engages necessary stakeholders to frame issues and the desired end states\u003cbr/\u003e- Communicates effectively with technical teams on root causes of issues and business requirements. \u003cbr/\u003e - User acceptance testing (UAT) for process and system updates.\u003cbr/\u003e- Assist with the distribution of incentive compensation plans, including plan set up, quota shifts, revenue adjustments, etc..\u003cbr/\u003e- Ensuring all compensation methodologies, policies, procedures and governance are followed.\u003cbr/\u003e- Collaborate with internal stakeholders including, HR, Tax, and Legal to ensure all compensation methodologies, policies, and procedures are maintained in production\u003cbr/\u003e- Support the global quarterly commission payout process including manual compensation adjustments, calculations and approval process\u003cbr/\u003e- Create mechanisms to help improve efficiency of processes. \u003cbr/\u003e- Strong Excel \u0026 SQL skills preferred.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eAbout Sales, Marketing and Global Services (SMGS)\u003cbr/\u003e\u003cbr/\u003eAWS Sales, Marketing, and Global Services (SMGS) is responsible for driving revenue, adoption, and growth from the largest and fastest growing small- and mid-market accounts to enterprise-level customers including public sector.","department_cost_center":null,"description_short":"Amazon Web Services (AWS) is the leading cloud provider, providing virtualized infrastructure, storage, networking, messaging, and many other services to customers all over the world. AWS runs a globally","display_distance":null,"id":"c5ce7df3-9f4a-462f-8944-a974007dbaf6","id_icims":"3088495","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Sales Operations Job Family","job_function_id":null,"job_path":"/en/jobs/3088495/sales-compensation-systems-analyst-amazon-web-services","job_schedule_type":"full-time","location":"US, TX, Dallas","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS17\"],\"normalizedCityName\":\"Arlington\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA58\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Atlanta\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Atlanta\",\"coordinates\":\"33.74831,-84.39111\",\"normalizedCountyName\":\"Fulton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Atlanta, Georgia, USA\",\"location\":\"US, GA, Atlanta\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL11\"],\"normalizedCityName\":\"Atlanta\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Dallas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Dallas\",\"coordinates\":\"32.77822,-96.79512\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Dallas, Texas, USA\",\"location\":\"US, TX, Dallas\",\"region\":\"TX\",\"buildingCodeList\":[\"DFW11\"],\"normalizedCityName\":\"Dallas\"}"],"normalized_location":"Dallas, Texas, USA","optional_search_labels":[],"posted_date":"September 19, 2025","preferred_qualifications":"- 5+ years of finance, business management and sales operations experience\u003cbr/\u003e- Experience working within a high-growth, technology company\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eThe base salary range for this position is listed below. For salaried roles, your Amazon package will include listed sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003ca href=\"https://amazon.jobs/en/benefits/us-benefits-and-stock\"\u003ehttps://amazon.jobs/en/benefits/us-benefits-and-stock\u003c/a\u003e.\u003cbr\u003e\u003cbr\u003eColorado $88,100 - $154,100 annually\u003cbr\u003eNational $79,300 - $169,500 annually","primary_search_label":"aws.team-sales-primary","source_system":"JobCreator","state":"TX","title":"Sales Compensation Systems Analyst, Amazon Web Services","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3088495/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sales-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}