{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- 1+ year of experience in any of the following or similar technical or vocational roles: Computer Hardware Repair, Infrastructure Cabling, Network Deployment, Data Center Operations","business_category":"aws","city":"Sparks","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon is looking for an Infrastructure Delivery Installation Technician to join our growing team within infrastructure operations. You will work with minimum supervision in a dynamic environment to drive the stability and sustainability of our next-generation networks and assist in the development of innovative ways to automate and scale our network.\u003cbr/\u003e\u003cbr/\u003eTo be successful in this role you should possess technical aptitude, written and oral communications skills and the ability to deal effectively with people in a wide variety of situations. In addition, you must possess strong analytical skills with demonstrated problem solving ability. You will be able to leverage your experience exercising high levels of initiative, judgment, and diplomacy.\u003cbr/\u003e\u003cbr/\u003eAdditionally, all candidates should be willing to work both independently and with a team. Work prioritization, organizational skills, effective communication, and the ability to react quickly are critical to being successful.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eAll physical requirements are expected with reasonable accommodations:\u003cbr/\u003e•\tRegularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds\u003cbr/\u003e•\tAbility to work in an environment that operates 24/7 with an ability to participate in primary responder rotation and provide after-hours support as needed\u003cbr/\u003e•\tWorking in cramped and/or elevated and/or noisy environments\u003cbr/\u003e•\tBending, lifting, stretching, reaching, standing and walking for up to 8+ hours a day\u003cbr/\u003e•\tAscending and descending ladders, stairs, and gangways safely and without limitation\u003cbr/\u003e\u003cbr/\u003eThis role supports a “new” data center currently in various stages of development and construction. You may be assigned to a facility still under construction, requiring travel to established locations for training until your designated site becomes operational. Candidates must be willing to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as needed during this transition period. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon is not able to provide sponsorship now or in the future for these positions. Eligible candidates must have work authorization without employer intervention to be considered.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tMoving and implementing large enterprise equipment\u003cbr/\u003e•\tInstalling Fiber and Copper cabling and patching cabling between equipment\u003cbr/\u003e•\tEnsuring proper safety and security standards are maintained during cabling and rack installation, \u003cbr/\u003e•\tFollowing well established hardware installation procedures and break-fix activities\u003cbr/\u003e•\tSafely using material handling tools and equipment\u003cbr/\u003e\u003cbr/\u003eTraveling within and outside of regional work area is required. You will be responsible for having a reliable personal vehicle and valid driver's license to travel within the regional work area, as company transportation will not be provided\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS? \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"b470ae93-9193-450f-9ffd-82c640493be2","id_icims":"3168389","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3168389/cable-installation-technician-dcc-communities","job_schedule_type":"full-time","location":"US, NV, Sparks","locations":["{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sparks\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, Sparks\",\"coordinates\":\"39.54115,-119.74832\",\"normalizedCountyName\":\"Washoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sparks, Nevada, USA\",\"location\":\"US, NV, Sparks\",\"region\":\"NV\",\"buildingCodeList\":[\"RNO100\"],\"normalizedCityName\":\"Sparks\"}"],"normalized_location":"Sparks, Nevada, USA","optional_search_labels":["aws.team-ais","aws.team-dc","hourly","military"],"posted_date":"January 28, 2026","preferred_qualifications":"- Knowledge of network cabling, optic types, and test equipment\u003cbr/\u003e- Industry standard certifications (CompTIA, CCENT, Network+)\u003cbr/\u003e- Experience with cabling infrastructure best practices and methodologies\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NV, Sparks - 27.00 - 47.00 USD hourly","primary_search_label":"aws.team-it-services","source_system":"JobCreator","state":"NV","title":"Cable Installation Technician, DCC Communities ","university_job":null,"updated_time":"1 minute","url_next_step":"https://account.amazon.com/jobs/3168389/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-it-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Charlton","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager. In this role, you will lead a team of hourly workforce and will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e\u003cbr/\u003eOur Operation’s workflow has three major components: First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Support, mentor, and motivate your hourly workforce\u003cbr/\u003e* Manage safety, quality, productivity, and customer delivery promises\u003cbr/\u003e* Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e* Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e* Stand/walk for up to 12 hours during shifts\u003cbr/\u003e* Work in an environment where the noise level varies and can be loud\u003cbr/\u003e* Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e* Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e\u003cbr/\u003eOur fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Area Managers based on location preference and the business’ current openings.","department_cost_center":null,"description_short":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager.","display_distance":null,"id":"ad33da28-9555-43db-ab69-0e6db6b77e67","id_icims":"3176141","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3176141/area-manager-ii","job_schedule_type":"full-time","location":"US, MA, Charlton","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Charlton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Charlton\",\"coordinates\":\"42.13883,-71.97\",\"normalizedCountyName\":\"Worcester\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Charlton, Massachusetts, USA\",\"location\":\"US, MA, Charlton\",\"region\":\"MA\",\"buildingCodeList\":[\"ORH3\"],\"normalizedCityName\":\"Charlton\"}"],"normalized_location":"Charlton, Massachusetts, USA","optional_search_labels":[],"posted_date":"February  6, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 20+ employees\u003cbr/\u003e- Experience with process improvements (Lean process, Kaizen, and/or Six Sigma)\u003cbr/\u003e- Excellent customer service, communication, and interpersonal skills\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Industry experience in: retail, F\u0026B, military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MA, Charlton - 70,000.00 - 90,900.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"MA","title":"Area Manager II ","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3176141/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience defining program requirements and using data and metrics to determine improvements\u003cbr/\u003e- Bachelor's degree, or Master's degree in supply chain management, operations, engineering, analytics or related field\u003cbr/\u003e- 7+ years of Supply Chain Management experience including Demand / Supply planning experience, Enterprise Resource Planning (ERP) system experience; inventory management, and logistics/transportation management\u003cbr/\u003e- 7+ years of experience in new product introduction, procurement, supply chain, inventory management, and operations\u003cbr/\u003e- Proven ability to lead a medium to large team of professionals in supply chain and/or operations\u003cbr/\u003e- Experience with operational and financial analysis","business_category":"retail","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Build the Future of Supply Chain Planning, Inventory \u0026 Logistics for Drone Delivery\u003cbr/\u003e\u003cbr/\u003eHow do you ensure that the advanced hardware for autonomous drones that will deliver packages in under an hour is planned, ready, and available to build or use?  How do you ensure that valuable and important drone parts and operational equipment are organized and properly inventoried and that the team and system is ready to scale to be able to support building and flying thousands of Amazon Prime Air delivery drones and sites? \u003cbr/\u003e\u003cbr/\u003ePrime Air needs a leader that has both strategic vision and daily tactical execution focus to build, develop, and grow processes, mechanisms, and ensure our key customers have the materials and information that they need. \u003cbr/\u003e\u003cbr/\u003eAs Manager of Supply Chain Planning, Inventory \u0026 Logistics, you will lead a team of demand management planners, inventory and warehouse specialists, and shipping and logistics specialists who plan, develop and execute mechanisms for demand and supply planning; receive, manage, and pick/kit hardware; and ensure safe, reliable and compliant transportation to our teams to enable our ultra-fast drone delivery service across the US and Europe.\u003cbr/\u003e\u003cbr/\u003eThis is a unique opportunity to shape supply chain for a business that is redefining last-mile delivery—with Amazon's resources and innovation culture behind you.\u003cbr/\u003eCheck out more about Prime Air on the About Amazon blog.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eWhat You'll Own\u003cbr/\u003e\u003cbr/\u003eLead and Develop High-Performing Supply Chain Planning Specialists, Warehouse/Inventory Specialist \u0026 Logistics Specialists: Manage and mentor a team of Supply Chain Planning Specialists, Warehouse/Inventory Specialist \u0026 Logistics Specialists. Build their capabilities to dive deep across business lines, leverage our supplier base, and optimize performance, quality, efficiency, and cost.\u003cbr/\u003e\u003cbr/\u003eDrive Demand and Supply Planning Strategy: Establish demand forecasting and Enterprise Resource Planning (ERP) tools to ensure accurate requirements timing, work planning, and ordering.  Integrate supplier communication and responses to ensure automated supply chain health visibility. \u003cbr/\u003e\u003cbr/\u003eDrive Warehousing and Inventory Management Strategy: Establish and drive disciplined execution of warehouse management for inbound receiving and outbound shipping, inventory management processes to ensure accurate inventory, and picking, kitting and delivery to support production operations and commercial operation needs. \u003cbr/\u003e\u003cbr/\u003eDrive Logistics and Transportation Strategy: Establish and drive high quality, cost efficient logistics policies, relationships, and visibility to ensure traceable on-time delivery of shipments to Prime Air’s global operations sites. \u003cbr/\u003eand controllership improvements that maximize return on investment and total cost of ownership.\u003cbr/\u003e\u003cbr/\u003eEarn Trust with Business Partners: Establish enduring relationships with internal stakeholders across Prime Air. Build deep understanding of strategic direction, requirements, and priorities to become a trusted advisor on demand, inventory, and logistics development and execution.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement\u003cbr/\u003e\u003cbr/\u003eThis position may require a deemed export control license for compliance with applicable laws and regulations. Placement is contingent on Amazon's ability to apply for and obtain an export control license on your behalf.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWhy This Role Matters\u003cbr/\u003e\u003cbr/\u003ePrime Air is scaling rapidly. The demand strategies, inventory management practices, and logistics network you develop and the supplier relationships you build will directly impact our ability to deploy drone delivery at scale. Your decisions on processes, mechanisms, supplier performance, and cost optimization will affect program timelines, product quality, and our path to profitability.\u003cbr/\u003eYou will work on hardware that span drone systems, ground infrastructure, and software—giving you exposure to diverse technical domains and the aerospace industry. This is a rare opportunity to build strategies for a first-of-its-kind business with meaningful, measurable impact on Amazon's future.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur Supply Chain Planning, Inventory \u0026 Logistics team is passionate about Prime Air's mission of ultra-fast delivery. We combine demand / ERP management, inventory management, and logistics expertise with a willingness to invent and simplify for a business that is scaling from pilot to production.\u003cbr/\u003eWe operate from Seattle, WA and partner closely with Prime Air's engineering, operations, quality and business teams. Our supplier base spans the US, Europe, and Asia, giving you global exposure and the opportunity to work with leading firms across specialized technology firms, consumer electronics, aerospace and service companies.\u003cbr/\u003e","department_cost_center":null,"description_short":"Build the Future of Supply Chain Planning, Inventory \u0026 Logistics for Drone DeliveryHow do you ensure that the advanced hardware for autonomous drones that will deliver packages in under an hour is planned,","display_distance":null,"id":"177196be-7b14-4825-afd5-4368e9f90418","id_icims":"3173239","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Supply Chain Management","job_function_id":null,"job_path":"/en/jobs/3173239/manager-supply-chain-planning-inventory-logistics-amazon-prime-air","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA109\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February  3, 2026","preferred_qualifications":"- Master's degree in supply chain management, operations, engineering, analytics or related field\u003cbr/\u003e- Knowledge of supply chain management concepts - forecasting, planning, sourcing, optimization and logistics or equivalent\u003cbr/\u003e- Strong background in supply chain, operational, cost, and financial analysis\u003cbr/\u003e- Track record of developing tools, reports, process maps, scorecards, and data visualizations to drive decision-making\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 142,800.00 - 193,200.00 USD annually","primary_search_label":"retail.team-global-prime-air","source_system":"JobCreator","state":"WA","title":"Manager, Supply Chain Planning, Inventory \u0026 Logistics, Amazon Prime Air ","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3173239/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-prime-air","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Supply Chain, Business, Engineering, Finance, or a related technical field\u003cbr/\u003e- 3+ years of commodity management, strategic sourcing, or procurement experience in hardware manufacturing environments\u003cbr/\u003e- Experience with RFx processes, supplier negotiations, and contract management\u003cbr/\u003e- Strong analytical skills with experience in spend analysis and cost modeling\u003cbr/\u003e- Proficiency in Excel and data analysis tools\u003cbr/\u003e- Demonstrated ability to work cross-functionally with engineering and operations teams","business_category":"retail","city":"Seattle","company_name":"Amazon.com LLC - A03","country_code":"USA","description":"Source the Hardware That Powers Drone Delivery\u003cbr/\u003e\u003cbr/\u003eHow do you source advanced components for autonomous drones that must meet aerospace safety standards while scaling to millions of deliveries? How do you balance cost, quality, and innovation when working with suppliers across electronics, mechanical systems, and aerospace hardware? Prime Air needs a commodity specialist to solve these challenges.\u003cbr/\u003e\u003cbr/\u003eAs a Hardware Commodity Specialist, you will manage sourcing and supplier relationships for hardware components that power Prime Air's revolutionary drone delivery system. You will execute commodity strategies, negotiate with suppliers, drive orders including procurement ordering/scheduling, analyze spend patterns, and drive cost optimization while ensuring quality and delivery performance. You will work directly with Engineering, Operations, and Supply Chain teams to support Prime Air's rapid scaling across the US and Europe.\u003cbr/\u003e\u003cbr/\u003eThis is a unique opportunity to work on hardware commodities for a first-of-its-kind business—with Amazon's scale, resources, and innovation culture behind you.\u003cbr/\u003e\u003cbr/\u003eCheck out more about Prime Air on the About Amazon blog.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eWhat You'll Own\u003cbr/\u003e\u003cbr/\u003eManage Hardware Commodity Categories: Own day-to-day commodity management for assigned hardware categories such as electronics, sensors, motors, batteries, mechanical components, or structural materials. Execute sourcing strategies, manage supplier relationships, and drive performance improvements across your categories.\u003cbr/\u003e\u003cbr/\u003eExecute Strategic Sourcing Activities: Conduct RFx processes, evaluate supplier proposals, perform cost analysis, and support contract negotiations. Use spend analysis and benchmarking to identify cost savings opportunities and improve total cost of ownership. Present recommendations to commodity management leadership.\u003cbr/\u003e\u003cbr/\u003eDrive Supplier Performance: Monitor supplier performance on quality, delivery, cost, and responsiveness. Conduct regular business reviews with suppliers, track key performance indicators, and drive corrective actions when needed. Build strong working relationships that enable Prime Air's rapid growth.\u003cbr/\u003e\u003cbr/\u003eSupport New Product Introduction: Partner with Engineering teams to identify and qualify suppliers for new hardware components. Evaluate supplier technical capabilities, manufacturing capacity, and quality systems. Support prototype builds, design changes, and production ramps.\u003cbr/\u003e\u003cbr/\u003eAnalyze Spend and Market Trends: Track commodity spend patterns, identify cost drivers, and analyze market trends that impact pricing and availability. Develop should-cost models and competitive benchmarks to inform sourcing decisions. Use data to identify opportunities for supplier consolidation and volume leverage.\u003cbr/\u003e\u003cbr/\u003eEnsure Supply Continuity: Monitor supplier health, identify supply chain risks, and develop mitigation plans. Coordinate with suppliers on inventory positioning, lead time management, and capacity planning to support Prime Air's deployment schedules.\u003cbr/\u003e\u003cbr/\u003eCollaborate Cross-Functionally: Work closely with Engineering, Quality, Manufacturing, Finance, and Operations teams to align commodity activities with program needs. Serve as the subject matter expert on your hardware categories for cost estimating and make-versus-buy decisions.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement\u003cbr/\u003e\u003cbr/\u003eThis position may require a deemed export control license for compliance with applicable laws and regulations. Placement is contingent on Amazon's ability to apply for and obtain an export control license on your behalf.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWhy This Role Matters\u003cbr/\u003e\u003cbr/\u003ePrime Air is scaling from pilot to production. The hardware commodities you manage are the building blocks of our drone delivery system. Your decisions on supplier selection, cost optimization, and quality management will directly impact product performance, program timelines, and our path to profitability.\u003cbr/\u003eYou will work at the intersection of aerospace engineering, high-volume manufacturing, and strategic sourcing—learning how hardware is designed, produced, and scaled in a rapidly growing business. This is a rare opportunity to build commodity management expertise in drone delivery while working with advanced technology and innovative suppliers.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur commodity management team is passionate about Prime Air's mission of ultra-fast delivery. We combine procurement expertise with technical curiosity and a willingness to invent and simplify for a business that is scaling from pilot to production.\u003cbr/\u003eWe operate from Seattle, WA and partner closely with Prime Air's engineering, operations, and business teams. Our supplier base spans the US, Europe, and Asia, giving you global exposure and the opportunity to work with leading aerospace, electronics, and manufacturing companies.\u003cbr/\u003e","department_cost_center":null,"description_short":"Source the Hardware That Powers Drone DeliveryHow do you source advanced components for autonomous drones that must meet aerospace safety standards while scaling to millions of deliveries? How do you balance","display_distance":null,"id":"087af6dc-5424-40c8-baaf-a0032790b4f0","id_icims":"3173238","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"Internal Procurement","job_function_id":null,"job_path":"/en/jobs/3173238/hw-commodity-specialist-amazon-prime-air","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"ZST8\",\"SHK5\",\"IBF4\",\"SEA43\",\"SEA88\",\"SEA57\",\"SEA109\",\"ONM125\",\"SEA91\",\"ATBP18\",\"SEA910\",\"UWA2\",\"SEA33R\",\"SEA26\",\"LBV2\",\"METR7\",\"BFI33\",\"XSE9\",\"UWA4\",\"SEA28\",\"LBV4\",\"WFM761\",\"JSE5\",\"LUM9\",\"SEA55\",\"SEA41\",\"SEA1\",\"SEA69\",\"ONM127\",\"SEA60\",\"SEA74\",\"ISE1\",\"DSW9\",\"PSE\",\"ATBP23\",\"QDS1\",\"SEA38\",\"SEA76\",\"LJG6\",\"SHK3\",\"ZSL2\",\"WFM216\",\"SEA98\",\"SEA45\",\"DCA53\",\"LFC1\",\"SEA116\",\"MAB6\",\"CPA2\",\"ASL1\",\"SEA86\",\"ZST1\",\"SEA70\",\"SEA19\",\"LUM5\",\"ZST4\",\"WFM103\",\"LUM2\",\"SOD5\",\"SEA134\",\"SOD4\",\"FSE1\",\"LWA2\",\"SEA48\",\"PSL1\",\"ONM234\",\"ZST2\",\"ISG2\",\"SEA801\",\"DWX3\",\"ISE3\",\"SEA33\",\"SEA4\",\"ONM135\",\"ZST3\",\"SEA52\",\"SEA63\",\"BFI99\",\"JSE4\",\"SEA300\",\"LUM1\",\"CPA3\",\"SEA62\",\"CPA4\",\"SEA68\",\"SEA3\",\"WFM524\",\"TFC2\",\"T001\",\"ONM126\",\"SEA53\",\"DSE9\",\"ATBP24\",\"SEA81\",\"SEA72\",\"SEA59\",\"COL1\",\"SEA78\",\"BLU1\",\"METR2\",\"WFM59\",\"SEA24\",\"HUS1\",\"SHK4\",\"CWA42\",\"ATBP20\",\"DWA8\",\"LWES\",\"LBV3\",\"SEA142\",\"R004\",\"PUP\",\"UWA3\",\"SEA73\",\"CPA1\",\"SHK6\",\"IBF5\",\"SEA190\",\"SEA42\",\"SEA25\",\"SSE1\",\"SEA39\",\"DSW8\",\"SEA9\",\"MAE1\",\"ZST9\",\"KRA1\",\"IBF3\",\"ATBP22\",\"CWA2\",\"ONM124\",\"SEA44\",\"ATBP17\",\"SEA90\",\"WFM630\",\"HDG13\",\"SEA71\",\"ISE9\",\"SEA58\",\"ISE7\",\"SEA32\",\"SHK2\",\"SEA77\",\"MAB7\",\"XBF2\",\"ONM122\",\"LRSQ\",\"ZSL1\",\"SEA2\",\"SEA01\",\"SEA54\",\"WFM755\",\"SEA23\",\"SEA29\",\"ATBP5\",\"T002\",\"PKD1\",\"FSE3\",\"SEA61\",\"SEA83\",\"ATBP10\",\"ONM232\",\"DTS2\",\"DWX8\",\"ONM128\",\"SEA89\",\"SEA803\",\"ZST7\",\"JSE1\",\"WFM604\",\"LUM4\",\"HCS8\",\"SEA51\",\"MAC8\",\"SEA20\",\"SEA65\",\"ATBP12\",\"SEA18\",\"SEA95\",\"SEA804\",\"SEA22\",\"LUM3\",\"SEA36\",\"SEA147\",\"METR4\",\"ISE6\",\"SEA47\",\"ZSE1\",\"CRP1\",\"ZST5\",\"DWX7\",\"SEA40\",\"IBF1\",\"SOD1\",\"PSE3\",\"WJL5\",\"SEA46\",\"SEA37\",\"SEA401\",\"SEA84\",\"BWA1\",\"XXX0\",\"SEA102\",\"R097\",\"SEA75\",\"METR5\",\"WFM275\",\"SEA27\",\"DSW4\",\"SHK7\",\"ZKL3\",\"SEA21\",\"SEA02\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February  3, 2026","preferred_qualifications":"- Experience sourcing hardware components for aerospace, automotive, consumer electronics, or high-volume manufacturing industries\u003cbr/\u003e- Background in electronics, mechanical systems, or electromechanical components\u003cbr/\u003e- Familiarity with new product introduction processes and supplier qualification\u003cbr/\u003e- Experience with should-cost modeling, benchmarking, and total cost of ownership analysis\u003cbr/\u003e- Knowledge of quality systems such as AS9100, ISO 9001, or IATF 16949\u003cbr/\u003e- Experience with ERP systems and sourcing tools\u003cbr/\u003e- Strong proficiency with data analysis and visualization tools such as SQL, Tableau, or Power BI\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, SEATTLE - 82,700.00 - 139,100.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 79,500.00 - 139,100.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 82,700.00 - 139,100.00 USD annually","primary_search_label":"retail.team-global-prime-air","source_system":"JobCreator","state":"WA","title":"HW Commodity Specialist, Amazon Prime Air ","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3173238/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-prime-air","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"transportation-and-logistics","city":"Lacey","company_name":"Amazon.com Services LLC","country_code":"USA","description":"\u003cbr/\u003eAt Amazon, we are working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Transportation Operations Managers to work in out sites across the country. Amazon is one of the most recognizable brand names in the world and we distribute over a billion shipments each year to our loyal customers.\u003cbr/\u003e\u003cbr/\u003eThe Transportation Operations Manager has complete responsibility for Transportation Operations at a number of sites within a pre-defined region of the country. This position requires a candidate with the proven ability to drive process improvements and the ability to keep pace with our explosive growth while motivating others to meet the challenges of an extremely deadline-driven environment. \u003cbr/\u003e\u003cbr/\u003eSupervisory Responsibilities: \u003cbr/\u003e•\tLead and supervise a team of Transportation Area Managers that are located within the individual sites in an effort to streamline logistics within each individual operation\u003cbr/\u003e•\tResponsible for the overall safety, quality and performance and customer experience of your region\u003cbr/\u003e•\tCarry out supervisory responsibilities in accordance with the organization’s policies and procedures \u003cbr/\u003e•\tAccountability for meeting and exceeding operational goals\u003cbr/\u003e•\tStrategic planning and forecasting; appraise performance; reward and coach employees; resolve problems; address staffing needs\u003cbr/\u003e•\tMentor, train and develop teammates for career progression and learning \u003cbr/\u003e•\tAbility to develop and share best practices across the shifts and network\u003cbr/\u003e•\tTravel up to 50% may be required\u003cbr/\u003e•\tCandidates must be flexible to work a variety of hours as business demands, including overnight, weekends and holidays\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"At Amazon, we are working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Transportation Operations Managers","display_distance":null,"id":"734c4592-8611-4b69-9023-223035b7c1f5","id_icims":"3101011","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3101011/transportation-operations-manager","job_schedule_type":"full-time","location":"US, WA, Lacey","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Lacey\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Lacey\",\"coordinates\":\"47.04437,-122.82324\",\"normalizedCountyName\":\"Thurston\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Lacey, Washington, USA\",\"location\":\"US, WA, Lacey\",\"region\":\"WA\",\"buildingCodeList\":[\"OLM1\"],\"normalizedCityName\":\"Lacey\"}"],"normalized_location":"Lacey, Washington, USA","optional_search_labels":[],"posted_date":"October  3, 2025","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience scoping, leading, and implementing process improvements through: Lean process, Kaizen, and/or Six Sigma.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Lacey - 91,000.00 - 136,500.00 USD annually","primary_search_label":"transportation-and-logistics.team-na-operations","source_system":"JobCreator","state":"WA","title":"Transportation Operations Manager","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3101011/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-na-operations","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 7+ years of recent professional communications or public relations experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Experience working closely with and advising senior executives of an organization or equivalent\u003cbr/\u003e- Track record in communications or PR for high-profile enterprise software/systems companies","business_category":"global-communications-and-community-impact","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Since 2006, AWS has changed the way companies acquire and use technology by providing a highly scalable, secure, cost-effective, and flexible technology platform in the cloud. AWS is growing rapidly in the U.S. and around the world with customers ranging from startups to Fortune 500 corporations. \u003cbr/\u003e\u003cbr/\u003eAWS Communications is looking for an experienced, versatile PR professional to join its Customer and Industries Communications team. We are seeking an exceptional candidate who will drive high-impact, integrated media relations campaigns that showcase how AWS is help organizations innovate with generative AI to create new value for their customers, employees, and overall operations. A core focus of this job will be publicizing stories of how companies use generative AI to power their businesses. The role also will focus on identifying unique and compelling stories of how companies have stepped up their use of generative AI to increase efficiency in functional areas such as finance and sales to support better customer experiences. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Creating and executing proactive, creative, and integrated PR campaigns \u003cbr/\u003e- Developing media strategies that create a cadence of press opportunities that elevate the AWS story \u003cbr/\u003e- Handling complex, fast-moving, and unexpected communications challenges with high judgment and professionalism\u003cbr/\u003e- Managing relationships with reporters and influencers across top-tier business and technology press, trade publications, and non-traditional outlets (podcasts, YouTube, newsletters) \u003cbr/\u003e- Advising on industry-related trends, events, and challenges, as well as guiding any reactive communications efforts \u003cbr/\u003e- Cultivating and maximizing relationships with customers, including business leaders, technologists, and PR teams \u003cbr/\u003e- Crafting compelling story ideas, content, and messaging \u003cbr/\u003e- Leading media programs for AWS-owned and industry, customer, and partner events \u003cbr/\u003e- Managing PR agencies\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou will use your understanding of the intersection of technology and stakeholder engagement to execute high-impact and creative PR plans. You will work across multiple teams, sometimes with competing stakeholders, to produce a steady cadence of coverage, influence conversations, press engagement, and awareness of generative AI's transformational impact across industries. In this role, you will have an opportunity to support creative programs that are worthy of a company that continues to pioneer the cloud. ","department_cost_center":null,"description_short":"Since 2006, AWS has changed the way companies acquire and use technology by providing a highly scalable, secure, cost-effective, and flexible technology platform in the cloud. AWS is growing rapidly in","display_distance":null,"id":"79e15718-a344-4d3c-8862-3166cb2e7c77","id_icims":"3118226","is_intern":null,"is_manager":null,"job_category":"PR","job_family":"Public Relations","job_function_id":null,"job_path":"/en/jobs/3118226/communications-manager-aws-customer-aws-communications","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA41\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS17\"],\"normalizedCityName\":\"Arlington\"}","{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK14\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"October 29, 2025","preferred_qualifications":"- Experience communicating technical concepts and processes using clear, simple language and visuals\u003cbr/\u003e- Can work proactively and independently, meet deadlines, and deliver on projects and tasks\u003cbr/\u003e- Experience communicating technical details verbally and in writing\u003cbr/\u003e- Excellent written and oral communications skills\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $114,000/year in our lowest geographic market up to $188,500/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"global-communications-and-community-impact.team-no-team-listed","source_system":"JobCreator","state":"WA","title":"Communications Manager, AWS Customer, AWS Communications","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3118226/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"alexa-and-amazon-devices","city":"Austin","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is an initiative to launch a constellation of Low Earth Orbit satellites that will provide low-latency, high-speed broadband connectivity to unserved and underserved communities around the world. As a Embedded Software Engineer you will be a part of the team participating in the definition and implementation of the communication software architecture of Amazon Leo’s broadband wireless modem. You will participate in all phases of physical layer software development, from architecture design, through requirements, implementation, test, and operational support. This is a unique opportunity to innovate and define novel wireless technology with few legacy constraints. The team develops the communication system of Leo and validates overall performance within key metrics such as throughput, latency, system availability, packet loss etc.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Develop embedded software in assembly, C, and C++ in a real-time operating system environment for broadband satellite communication modem systems.\u003cbr/\u003e- Work closely with ASIC, communication systems and software teams to support system bring-ups, end-to-end integration, and testing. \u003cbr/\u003e- Ability to adapt design and test activities based on current HW/SW capabilities delivered by the development teams.\u003cbr/\u003e- Support end-to-end testing using lab equipment such as Vector Signal Generators and Analyzers, Packet Generators, Channel Emulators. Contribute to development-test bring up procedures with Linux, Python, bash scripting etc.\u003cbr/\u003e- Support operations and maintenance using telemetry to validate link performance over key indicators such as throughput, latency, etc.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs part of our software engineering team, you will design and implement software to deploy on Leo satellites in R\u0026D and commercial operation. You will also develop tests and debug capabilities to validate implementations on ground and on orbit. You will work in a collaborative environment with teams in hardware development, software development and network operations. You need to be flexible and responsive to fast changing priorities and issues.","department_cost_center":null,"description_short":"Amazon Leo is an initiative to launch a constellation of Low Earth Orbit satellites that will provide low-latency, high-speed broadband connectivity to unserved and underserved communities around the world.","display_distance":null,"id":"8d7056e6-3a3a-45f9-886f-1a40a33e417f","id_icims":"3163715","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3163715/embedded-sw-engineer-wireless-systems","job_schedule_type":"full-time","location":"US, TX, Austin","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS13\"],\"normalizedCityName\":\"Austin\"}"],"normalized_location":"Austin, Texas, USA","optional_search_labels":[],"posted_date":"January 21, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Austin - 143,700.00 - 194,400.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"TX","title":"Embedded SW Engineer, Wireless Systems ","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3163715/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 10+ years in technology industry focused on startups/venture capital, with technical leadership background preferred\u003cbr/\u003e- Experience building and leading high-performing teams in fast-paced environments\u003cbr/\u003e- Proven ability to evaluate and guide early-stage and scaling companies\u003cbr/\u003e- Demonstrated success developing and executing business initiatives that drive measurable outcomes\u003cbr/\u003e- Bachelor’s degree in computer science, Engineering, or related technical field, or equivalent professional experience","business_category":"aws","city":"New York","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Would you like to shape the future of cloud computing by identifying and working with the most promising early-stage startups and venture capital firms. Do you have the technical depth, business acumen, and strategic insight to help establish AWS as the foundation for the next generation of technology companies? \u003cbr/\u003e\u003cbr/\u003eTrusted by more startups around the world, AWS makes the power of cloud computing accessible to all. We give founders everywhere access to the same technology that powers the world’s largest companies. With nearly 20 years of experience, gained from supporting hundreds of thousands of startups, the AWS Startups team helps founders prove that their world-changing ideas are possible, at any stage of growth, and any level of funding. This is why more startups, and over 80% of unicorns, choose to launch on AWS. \u003cbr/\u003e\u003cbr/\u003eIn this role, you will build and lead a team of Startup Investor Managers who work with venture capital firms and angel investors to accelerate portfolio company success. Work closely with key investors to unlock the full potential of their portfolio companies on AWS, enabling faster innovation and scaling. Focus on creating meaningful initiatives between the investment community and AWS, helping startups leverage cloud to achieve breakthrough growth. Lead your team to partner with investors in identifying emerging opportunities in the startup landscape and ensure their portfolio companies have access to the tools, expertise, and support needed to build world-changing products on AWS infrastructure.   \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eBuild, manage, and mentor a team of Startup Investor Managers, set team goals, performance metrics, and drive consistent results \u003cbr/\u003e\u003cbr/\u003eDevelop and drive initiatives with top venture firms, educating them on AWS capabilities and identifying strategic collaboration opportunities  \u003cbr/\u003e\u003cbr/\u003eDevelop investor-focused initiatives that accelerate portfolio company success \u003cbr/\u003e\u003cbr/\u003eDesign and implement programs that address specific startup and investor needs  \u003cbr/\u003e\u003cbr/\u003eCoordinate cross-functional initiatives involving AWS Startups, Sales, Marketing, and Product teams \u003cbr/\u003e\u003cbr/\u003e Measure program effectiveness and iterate based on feedback and results \u003cbr/\u003e\u003cbr/\u003eLeverage early-stage market signals from investors and founders to guide AWS innovation and ensure we continue meeting the evolving needs of tomorrow's breakthrough companies \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e \u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e \u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e \u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e \u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e","department_cost_center":null,"description_short":"Would you like to shape the future of cloud computing by identifying and working with the most promising early-stage startups and venture capital firms. Do you have the technical depth, business acumen,","display_distance":null,"id":"95673d6c-4e6f-4a50-8b51-c63d408b83cc","id_icims":"3078628","is_intern":null,"is_manager":null,"job_category":"Business \u0026 Merchant Development","job_family":"Business/Merchant Development","job_function_id":null,"job_path":"/en/jobs/3078628/senior-manager-startup-investors-vc-and-angel-aws-worldwide-startups","job_schedule_type":"full-time","location":"US, NY, New York","locations":["{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK37\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"New York, New York, USA","optional_search_labels":[],"posted_date":"September  9, 2025","preferred_qualifications":"- Startup founder, C-level executive, or venture capital investment experience with hands-on understanding of startup challenges and growth dynamics\u003cbr/\u003e- Advanced degree (MBA, MS, or PhD) in business, technology, or related field\u003cbr/\u003e- Experience leading teams through rapid scaling phases and organizational growth\u003cbr/\u003e- Strong analytical and technical assessment skills with ability to evaluate complex requirements and business models\u003cbr/\u003e- Commercial acumen in fast-growing technology businesses, including understanding of scaling challenges and go-to-market strategies\u003cbr/\u003e- Proven track record identifying, evaluating, and advising on emerging technologies and market trends\u003cbr/\u003e- Multi-domain technical expertise across areas such as AI/ML, cybersecurity, data analytics, or infrastructure technologies\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, New York - 213,000.00 - 288,200.00 USD annually","primary_search_label":"aws.team-business-development-primary","source_system":"JobCreator","state":"NY","title":"Senior Manager, Startup Investors (VC and Angel), AWS Worldwide Startups","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3078628/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-business-development-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 6+ years of professional non-internship marketing experience\u003cbr/\u003e- Experience building, executing and scaling cross-functional marketing programs\u003cbr/\u003e- Experience communicating results to senior leadership\u003cbr/\u003e- Experience using data and metrics to drive improvements\u003cbr/\u003e- Experience with Excel or Tableau (data manipulation, macros, charts and pivot tables)\u003cbr/\u003e- 4+ years in paid social media or creator marketing\u003cbr/\u003e- Experience managing paid social media campaigns with budgets of $1M+\u003cbr/\u003e- Direct experience with social media advertising platforms (e.g. Meta Business Suite, TikTok Ads Manager, Twitter Ads, etc.)\u003cbr/\u003e- Experience building and scaling cross-functional marketing programs across social and creator initiatives\u003cbr/\u003e- Proficiency in social analytics platforms (e.g., Sprinklr, Hootsuite, Later) and social listening tools\u003cbr/\u003e- Experience presenting social media campaign results and ROI analysis to senior leadership","business_category":"entertainment","city":"Culver City","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon MGM Studios is the home for talent, creating and producing Original films and television series for a global audience. Original series premiere exclusively on Prime Video, which is available in more than 240 countries and territories worldwide. Amazon MGM Studios also produces and acquires Original movies for theatrical release and exclusively for Prime Video.\u003cbr/\u003e\u003cbr/\u003eWe are seeking an experienced Senior Social \u0026 Creator Marketing Manager to lead the planning for boosting initiatives across organic social marketing and creator partnerships. This position will play a crucial role in developing comprehensive campaign boosting strategies and creating data-driven insights to drive social growth. The role will also support broader social analytics initiatives to provide comprehensive performance insights across paid and organic social channels.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Lead end-to-end paid boosting strategy across social platforms and creator marketing initiatives\u003cbr/\u003e- Partner with Prime Video \u0026 Amazon MGM Studios Media \u0026 Launch teams to execute media spends and develop actionable insights\u003cbr/\u003e- Oversee paid boosting strategy and execution for owned social channels across brand and studios titles\u003cbr/\u003e- Manage paid boosting initiatives for creator partnerships\u003cbr/\u003e- Partner with title leads to develop and maintain partnership strategies with social publishers, including both paid and organic opportunities\u003cbr/\u003e-  Establish and maintain quarter-over-quarter goals, providing regular feedback to brand and title teams\u003cbr/\u003e- Create and implement global campaign boosting playbooks and best practices\u003cbr/\u003e- Optimize investment levels across boosting campaigns and channels (e.g. Meta, TikTok, YouTube, X, Reddit, Pinterest, Snap, Discord)\u003cbr/\u003e- Build and manage relationships with key stakeholders across title and brand teams\u003cbr/\u003e- Drive continuous improvement through data analysis and performance optimization\u003cbr/\u003e- Support social \u0026 creator analytics reporting and insights generation across paid and organic channels\u003cbr/\u003e- Contribute to the development and maintenance of comprehensive social performance dashboards\u003cbr/\u003e- Collaborate with the Senior Social Analytics Manager to ensure alignment in measurement frameworks and reporting methodologies\u003cbr/\u003e- Assist in synthesizing cross-channel social insights for stakeholder presentations","department_cost_center":null,"description_short":"Amazon MGM Studios is the home for talent, creating and producing Original films and television series for a global audience. Original series premiere exclusively on Prime Video, which is available in","display_distance":null,"id":"65b7cdf9-c8e1-4f04-ad14-e47a61681208","id_icims":"3144560","is_intern":null,"is_manager":null,"job_category":"Marketing \u0026 PR","job_family":"Marketing","job_function_id":null,"job_path":"/en/jobs/3144560/senior-social-creator-marketing-manager-partnerships-and-amplification-amazon-mgm-studios","job_schedule_type":"full-time","location":"US, CA, Culver City","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Culver City\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Culver City\",\"coordinates\":\"34.02202,-118.39589\",\"normalizedCountyName\":\"Los Angeles\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Culver City, California, USA\",\"location\":\"US, CA, Culver City\",\"region\":\"CA\",\"buildingCodeList\":[\"LAX22\"],\"normalizedCityName\":\"Culver City\"}"],"normalized_location":"Culver City, California, USA","optional_search_labels":[],"posted_date":"December 17, 2025","preferred_qualifications":"- Experience creating and executing integrated marketing lead generation campaigns using tactics that include live or virtual events, webinars, email, lead nurture programs, and CRM/sales insights\u003cbr/\u003e- Experience with Salesforce and Tableau\u003cbr/\u003e- Experience in paid social boosting planning and buying\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Culver City - 125,400.00 - 169,600.00 USD annually","primary_search_label":"entertainment.team-primevideo","source_system":"JobCreator","state":"CA","title":"Senior Social \u0026 Creator Marketing Manager - Partnerships and Amplification, Amazon MGM Studios","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3144560/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-primevideo","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent\u003cbr/\u003e- 2+ years of studio, production company or television network experience\u003cbr/\u003e- Experience working cross-functionally with Finance, Legal, and Creative teams\u003cbr/\u003e- Organizational skills and experience tracking numerous high value deals and projects","business_category":"entertainment","city":"Culver City","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Are you interested in shaping the future of television? Do you want to define the next generation of how and what customers are watching? Amazon MGM Studios has an immediate opening for a Contract Administrator interested in working within our Business Affairs team to help to deliver innovative content. \u003cbr/\u003e\u003cbr/\u003eThe successful candidate in this role will have a strong working knowledge of deal making and relevant terms in the entertainment industry; prior experience working for an entertainment agency, production company, studio or television network; possess the ability to complete high volumes of complex tasks and projects quickly with minimal guidance; react with appropriate urgency to situations and events that require quick response or turnaround; and collaborate effectively with internal teams. The candidate will also have excellent attention to detail and organizational skills. A high level of competence, integrity and discretion in handling highly confidential information and professionalism in dealing with senior professionals inside and outside the company is key. This position is located in Culver City, California.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- High volume deal tracking, including various report and grid maintenance\u003cbr/\u003e- Own corporate approval coverage over a significant portion of the development slate\u003cbr/\u003e- Work cross-functionally with the finance team to delineate terms and ensure talent payments are made in a timely manner\u003cbr/\u003e- Act as an internal and external point of contact for deal related questions and inquiries\u003cbr/\u003e- Use GenAI to develop tools for the BA team\u003cbr/\u003e- General administrative support to 4 or more Business Affairs execs (i.e., helping to schedule calls, expenses, etc.)","department_cost_center":null,"description_short":"Are you interested in shaping the future of television? Do you want to define the next generation of how and what customers are watching? Amazon MGM Studios has an immediate opening for a Contract Administrator","display_distance":null,"id":"0a3bf213-7b55-438b-b6fb-e63f11ac4dfb","id_icims":"3133137","is_intern":null,"is_manager":null,"job_category":"Legal","job_family":"Legal","job_function_id":null,"job_path":"/en/jobs/3133137/contract-administrator-amazon-mgm-studios-business-affairs","job_schedule_type":"full-time","location":"US, CA, Culver City","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Culver City\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Culver City\",\"coordinates\":\"34.02202,-118.39589\",\"normalizedCountyName\":\"Los Angeles\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Culver City, California, USA\",\"location\":\"US, CA, Culver City\",\"region\":\"CA\",\"buildingCodeList\":[\"LAX22\"],\"normalizedCityName\":\"Culver City\"}"],"normalized_location":"Culver City, California, USA","optional_search_labels":[],"posted_date":"November 26, 2025","preferred_qualifications":"- Experience that includes strong analytical skills, attention to detail, and effective communication abilities\u003cbr/\u003e- Knowledge of entertainment industry trends and players\u003cbr/\u003e- Can work proactively and independently, meet deadlines, and deliver on projects and tasks\u003cbr/\u003e- Experience working in fast paced environments, and managing workload even during times of stress, or escalated activity\u003cbr/\u003e- Experience with the Microsoft Office Suite including Word, Outlook, and Excel\u003cbr/\u003e- Basic knowledge of the WGA agreement\u003cbr/\u003e- Box, Rightsline, Quip, and/or Airtable knowledge\u003cbr/\u003e- Attention to detail and time management skills\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Culver City - 70,400.00 - 101,800.00 USD annually","primary_search_label":"entertainment.team-amazonstudios","source_system":"JobCreator","state":"CA","title":"Contract Administrator, Amazon MGM Studios Business Affairs","university_job":null,"updated_time":"21 minutes","url_next_step":"https://account.amazon.com/jobs/3133137/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazonstudios","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}