{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 5+ years of programming with at least one modern language such as C++, C#, Java, Python, Matlab, Golang, PowerShell, Ruby experience\u003cbr/\u003e- 5+ years of deploying and operating in a Linux/Unix environment experience\u003cbr/\u003e- 5+ years of systems design, software development, operations, automation, and process improvement experience\u003cbr/\u003e- Experience leading the design, build and deployment of complex and performant (reliable and scalable) software solutions in production\u003cbr/\u003e- BS or equivalent in Computer Science, Electrical Engineering, Physics or related field\u003cbr/\u003e- 5+ years in SW/HW development environment with at least 3 recent year in architectural/system role\u003cbr/\u003e- 5+ years experience in development for complex telecommunication, high speed digital, antenna, and/or satellite communication systems","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon LEO is an initiative to increase global broadband access through a constellation of 3,236 satellites in low Earth orbit (LEO). Its mission is to bring fast, affordable broadband to unserved and underserved communities around the world. Amazon Leo will help close the digital divide by delivering fast, affordable broadband to a wide range of customers, including consumers, businesses, government agencies, and other organizations operating in places without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs a Sr. Satellite Terminal Validation Engineer, you will be responsible for Customer Terminal (CT) integration and validation with hardware, software, and firmware. You will be working in a collaborative environment with a multi-disciplinary team. In this role, your responsibilities include:\u003cbr/\u003e• Define CT systems architectures and specifications\u003cbr/\u003e• Design tradeoffs of various CT architectures including RF and performance simulation to support tradeoff decisions\u003cbr/\u003e• Develop integration \u0026 test Software \u0026 Firmware for lab verification measurements.\u003cbr/\u003e• Develop, maintain, and support customer terminal validation hardware and software\u003cbr/\u003e• Proactive engagement with internal and external development partners on Systems’ hardware and software architectures and implementation\u003cbr/\u003e• Ensure delivered work meets technical, functional, performance, regulatory and business requirements\u003cbr/\u003e• Perform in-field test and validation of various CT architectures\u003cbr/\u003e• Traveling up to 20% of the time, depending on project phases\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Sr. Satellite Terminal Validation Engineer on the Leo Customer Terminal Team, you will work daily with electrical hardware, RF, antenna, silicon, and product design engineers, as well as software and operations teams in a collaborative environment. Your focus will be on architecting, integrating, and verifying customer terminal functional performance to ensure it delights our customers.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Leo Customer Terminal team is responsible for developing both outdoor \u0026 indoor devices, enabling customers internet service via the Leo satellite network. We own the entire process from early prototypes through mass production including requirements documents, architecture definition, hardware development, and all integration/verification testing.","department_cost_center":null,"description_short":"Amazon LEO is an initiative to increase global broadband access through a constellation of 3,236 satellites in low Earth orbit (LEO). Its mission is to bring fast, affordable broadband to unserved and","display_distance":null,"id":"e000ce1e-4be1-4b7b-9b16-6e4eb7ea6c70","id_icims":"3008055","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"System Development Engineering","job_function_id":null,"job_path":"/en/jobs/3008055/sr-user-terminal-system-engineer-customer-terminal","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA111\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":[],"posted_date":"June 12, 2025","preferred_qualifications":"- Knowledge of engineering practices and patterns for the full software/hardware/networks development life cycle, including coding standards, code reviews, source control management, build processes, testing, certification, and livesite operations\u003cbr/\u003e- Experience working with mobility satellite terminals such as maritime and aeronautical.\u003cbr/\u003e- Experience developing  in LabView and Matlab\u003cbr/\u003e- Experience taking a leading role in building complex software or computing infrastructure that has been successfully delivered to customers\u003cbr/\u003e- Master/PhD degree in Computer Science or Electrical Engineering\u003cbr/\u003e- Familiar with satellite communication theory\u003cbr/\u003e- Familiar with phased array designs and implementations\u003cbr/\u003e- Satellite over-the-air Communication field-trial experience\u003cbr/\u003e- Debugging skills for systems integration from RF front-end to baseband\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Redmond - 151,200.00 - 204,600.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Sr. User Terminal System Engineer, Customer Terminal","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3008055/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 1+ years of software development engineer or related occupational experience\u003cbr/\u003e- 1+ years of designing and developing large-scale, multi-tiered, multi-threaded, embedded or distributed software applications, tools, systems, and services using: C#, C++, Java, or Perl experience\u003cbr/\u003e- 1+ years of Object Oriented Design experience\u003cbr/\u003e- Bachelor's degree or foreign equivalent in Computer Science, Engineering, Mathematics, or a related field\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon Leo will serve people and organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eWe are seeking an experienced Software Engineer to join our team and help us build a robust, end-to-end software-as-a-service platform for our complex space satellite network. In this role, you will be responsible for designing and architecting multi-layered, multi-system services that can collect real-time data from our satellites, analyze the network topology, and correlate the data to identify faults. You will then develop services that can automatically trigger runbooks to resolve issues or escalate them to the appropriate teams. Additionally, you will leverage machine learning, generative AI, and other advanced techniques to detect anomalies, perform root cause analysis, and predict potential customer impact. As a member of the team, you will be expected to break down the overall plan into discrete action items and onboard junior engineers to ensure the work is completed efficiently and effectively. If you have a proven track record of developing sophisticated, mission-critical software solutions, we encourage you to apply for this exciting opportunity.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement: Due to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Lead end-to-end automation initiatives to develop sophisticated tools and services addressing complex network operations, debugging, and troubleshooting challenges.\u003cbr/\u003e• Collaborate with cross-functional teams to analyze network architecture, stakeholder requirements, and customer needs; architect and implement software solutions that deliver measurable business value.\u003cbr/\u003e• Design and implement AI/ML solutions utilizing AWS services to enhance space network operations and problem resolution.\u003cbr/\u003e• Drive data-driven decision making by developing and maintaining comprehensive network KPI (Key Performance Indicators) systems, including databases, dashboards, and visualization platforms for performance monitoring and reporting.\u003cbr/\u003e• Provide technical leadership and mentorship to software/network engineers through effective task delegation, project management, and onboarding programs to optimize team productivity and development cycles.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs Software Engineer, you begin your day by reviewing satellite network data, identifying anomalies, and formulating mitigation plans. You then analyze the performance metrics of the team's software tools/services, using these insights to guide your decision-making. Drawing on your deep expertise in distributed systems, cloud infrastructure, and DevOps, you lead cross-functional discussions to collaboratively design scalable architectures that automate data collection, analysis, and issue resolution. Throughout the day, you mentor junior engineers, align stakeholders, update project plans, showcasing your technical prowess, problem-solving skills, exceptional leadership to ensure the reliable operation of complex space satellite network.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Optical Inter-Satellite Link (OISL) organization is responsible for the design, development, and manufacturing of critical hardware and software that makes laser links between satellites possible. We are rapidly expanding and developing a new Network Automation team. We are looking for a software engineer to join and lead our new team to develop novel software services that can automate fault finding based on satellite data, automate workflows and operational procedures, and use ML/AI to find and correlate anomalies in the space network, identify root causes, and predict customer impacts.","department_cost_center":null,"description_short":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to","display_distance":null,"id":"7a5bbc07-cb0b-4397-aadf-c1161878545c","id_icims":"3133398","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3133398/software-development-engineer-amazon-leo-oisl","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA99\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":[],"posted_date":"November 26, 2025","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, REDMOND - 143,700.00 - 194,400.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Software Development Engineer, Amazon Leo OISL","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3133398/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Sparks","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"0473b557-d398-4e3b-94f2-17b76b085fdb","id_icims":"3151790","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3151790/engineering-operation-technician","job_schedule_type":"full-time","location":"US, NV, Sparks","locations":["{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sparks\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, Sparks\",\"coordinates\":\"39.54115,-119.74832\",\"normalizedCountyName\":\"Washoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sparks, Nevada, USA\",\"location\":\"US, NV, Sparks\",\"region\":\"NV\",\"buildingCodeList\":[\"RNO101\"],\"normalizedCityName\":\"Sparks\"}"],"normalized_location":"Sparks, Nevada, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"January  5, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Technical (Military/Trade School) training\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NV, Sparks - 31.00 - 55.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"NV","title":"Engineering Operation Technician","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3151790/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school diploma, or equivalent\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.\u003cbr/\u003e- 1+ years of computer/server hardware troubleshooting or related IT experience\"","business_category":"aws","city":"Canton","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring seamless data center operations that power millions of businesses and services worldwide. \u003cbr/\u003e \u003cbr/\u003eData Center Technicians should be willing to work both independently and with a team. Work prioritization, organizational skills, effective communication, and the ability to react quickly are critical to success. In addition to hardware and network repair, candidates will install equipment, create documentation, innovate solutions, and fix problems within the data center space. This team works in an environment that operates 24/7. Traveling within and outside of the regional work area is required. \u003cbr/\u003e \u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e-Performing server rack installations, hardware break-fix on various components, troubleshooting network issues, and responding to operational incidents that impact service availability, escalating to senior technicians and management as needed/required \u003cbr/\u003e-Serving as a primary contact point for both internal and external stakeholders, including engineers, software developers, vendors, and contractors \u003cbr/\u003e-Performing on-call duties and participating in scheduled maintenance and change management activities \u003cbr/\u003e-Contributing to documentation and process improvement initiatives based on your analysis of operational issues \u003cbr/\u003e-Helping to train and onboard new team members \u003cbr/\u003e\u003cbr/\u003ePhysical requirements: \u003cbr/\u003e\u003cbr/\u003e-Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds \u003cbr/\u003e-Working in cramped and/or elevated locations \u003cbr/\u003e-Bending, lifting, stretching, and reaching \u003cbr/\u003e-Standing and walking for up to 8+ hours a day \u003cbr/\u003e-Ascending and descending ladders, stairs, and gangways safely and without limitation \u003cbr/\u003e-Work in a noisy environment \u003cbr/\u003e-Work shifts longer than 8 hours to support 24/7 operations (covering both night and day shifts). \u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e-Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e-Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e-Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Data Center Technician professional, you have industry-leading technical abilities and demonstrate a breadth of knowledge while you: \u003cbr/\u003e-Take ownership of technical issues brought by their customer base, engaging other teams when needed to drive resolution \u003cbr/\u003e-Solve problems at their root and step back to understand the broader context \u003cbr/\u003e-Maintain service level agreements through the implementation of proactive issue detection and reporting \u003cbr/\u003e\u003cbr/\u003eYou will be required to work shift work that will include days/nights/weekends/holidays. Traveling within and outside of the regional work area is required. You will be responsible for having a reliable personal vehicle and valid driver's license to travel within the regional work area, as company transportation will not be provided. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring","display_distance":null,"id":"151e0bd8-3da7-4b5e-99aa-7f833c9b2020","id_icims":"3151104","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3151104/data-center-technician","job_schedule_type":"full-time","location":"US, MS, Canton","locations":["{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Canton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Canton\",\"coordinates\":\"32.61258,-90.03472\",\"normalizedCountyName\":\"Madison\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Canton, Mississippi, USA\",\"location\":\"US, MS, Canton\",\"region\":\"MS\",\"buildingCodeList\":[\"JAN200\"],\"normalizedCityName\":\"Canton\"}"],"normalized_location":"Canton, Mississippi, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"January  2, 2026","preferred_qualifications":"- Experience managing work and priorities through a ticketing system\u003cbr/\u003e- Experience working in a Data Center environment\u003cbr/\u003e- An Associate’s degree, technical certification, or equivalent professional or military experience in a relevant field (e.g., computer science, networking engineering, etc.)\u003cbr/\u003e- Understanding of network design, protocols and layer 1/2 troubleshooting\"\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MS, Canton - 24.00 - 42.00 USD hourly","primary_search_label":"aws.team-it-services","source_system":"JobCreator","state":"MS","title":"Data Center Technician","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3151104/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-it-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school diploma, or equivalent\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.\u003cbr/\u003e- 1+ years of computer/server hardware troubleshooting or related IT experience\"","business_category":"aws","city":"Canton","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring seamless data center operations that power millions of businesses and services worldwide. \u003cbr/\u003e \u003cbr/\u003eData Center Technicians should be willing to work both independently and with a team. Work prioritization, organizational skills, effective communication, and the ability to react quickly are critical to success. In addition to hardware and network repair, candidates will install equipment, create documentation, innovate solutions, and fix problems within the data center space. This team works in an environment that operates 24/7. Traveling within and outside of the regional work area is required. \u003cbr/\u003e \u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e-Performing server rack installations, hardware break-fix on various components, troubleshooting network issues, and responding to operational incidents that impact service availability, escalating to senior technicians and management as needed/required \u003cbr/\u003e-Serving as a primary contact point for both internal and external stakeholders, including engineers, software developers, vendors, and contractors \u003cbr/\u003e-Performing on-call duties and participating in scheduled maintenance and change management activities \u003cbr/\u003e-Contributing to documentation and process improvement initiatives based on your analysis of operational issues \u003cbr/\u003e-Helping to train and onboard new team members \u003cbr/\u003e\u003cbr/\u003ePhysical requirements: \u003cbr/\u003e\u003cbr/\u003e-Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds \u003cbr/\u003e-Working in cramped and/or elevated locations \u003cbr/\u003e-Bending, lifting, stretching, and reaching \u003cbr/\u003e-Standing and walking for up to 8+ hours a day \u003cbr/\u003e-Ascending and descending ladders, stairs, and gangways safely and without limitation \u003cbr/\u003e-Work in a noisy environment \u003cbr/\u003e-Work shifts longer than 8 hours to support 24/7 operations (covering both night and day shifts). \u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e-Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e-Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e-Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Data Center Technician professional, you have industry-leading technical abilities and demonstrate a breadth of knowledge while you: \u003cbr/\u003e-Take ownership of technical issues brought by their customer base, engaging other teams when needed to drive resolution \u003cbr/\u003e-Solve problems at their root and step back to understand the broader context \u003cbr/\u003e-Maintain service level agreements through the implementation of proactive issue detection and reporting \u003cbr/\u003e\u003cbr/\u003eYou will be required to work shift work that will include days/nights/weekends/holidays. Traveling within and outside of the regional work area is required. You will be responsible for having a reliable personal vehicle and valid driver's license to travel within the regional work area, as company transportation will not be provided. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring","display_distance":null,"id":"faa9321a-218e-410e-bc45-1cab9219c711","id_icims":"3151140","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3151140/data-center-technician","job_schedule_type":"full-time","location":"US, MS, Canton","locations":["{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Canton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Canton\",\"coordinates\":\"32.61258,-90.03472\",\"normalizedCountyName\":\"Madison\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Canton, Mississippi, USA\",\"location\":\"US, MS, Canton\",\"region\":\"MS\",\"buildingCodeList\":[\"JAN200\"],\"normalizedCityName\":\"Canton\"}"],"normalized_location":"Canton, Mississippi, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"January  2, 2026","preferred_qualifications":"- Experience in data center\u003cbr/\u003e- \"Experience managing work and priorities through a ticketing system\u003cbr/\u003e- An Associate’s degree, technical certification, or equivalent professional or military experience in a relevant field (e.g., computer science, networking engineering, etc.)\u003cbr/\u003e- Understanding of network design, protocols and layer 1/2 troubleshooting\"\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MS, Canton - 24.00 - 42.00 USD hourly","primary_search_label":"aws.team-it-services","source_system":"JobCreator","state":"MS","title":"Data Center Technician","university_job":null,"updated_time":"19 minutes","url_next_step":"https://account.amazon.com/jobs/3151140/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-it-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent\u003cbr/\u003e- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 3+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 3+ years of embedded firmware development experience\u003cbr/\u003e- 3+ years of computer science fundamentals (object-oriented design, data structures, algorithm design, problem solving and complexity analysis) experience\u003cbr/\u003e- Experience with full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations\u003cbr/\u003e- Experience in embedded development in C/C++, or experience programming with at least one software programming language","business_category":"aws","city":"Cupertino","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"AWS Hardware Engineering Services support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eThe AWS Hardware Engineering team is driving rapid innovation in the server and storage infrastructure used by Amazon Web Services. Our designs are industry-leading in frugality and operational excellence, and are critical to the success of the AWS business and the more than one million customers who use AWS today. Our Firmware Engineers solve challenging technology problems, and build architecturally sound, high-quality components to enable AWS to realize critical business strategies. \u2028\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate for this role will be an innovative self-starter. You will be an SSD firmware expert with experience in making architectural tradeoffs to optimize SSD performance for a variety of use cases. You will work with engineers across the company as well as external companies and lead firmware development efforts on custom solid-state devices. You will collaborate with internal and external development engineers (architecture, hardware, validation, software services). AWS Engineers are shaping the way people use computers and designing the future of cloud computing technology – come help us make history!\u003cbr/\u003e\u003cbr/\u003eWhat you will do: You will be a member of a team designing AWS-specific hardware, firmware and software for non-volatile memory devices, including NAND-based SSDs. You will be a part of the firmware effort from conception, through validation and into production. You will contribute to FW development and support device characterization and benchmarking efforts. You will work closely with AWS software engineers to tailor devices for the AWS environment.\u003cbr/\u003e\u003cbr/\u003eWhy it matters: Public cloud IT services represent the majority of growth in the overall IT services market and will continue to do so for several years to come. The scale of AWS, combined with an understanding of how our hardware is used, creates a unique opportunity for component customizations that will directly benefit our customers.\u003cbr/\u003e\u003cbr/\u003eWhy you will love it: You will work with engineers across the company to build next-generation devices. You will have a direct impact on our bottom line and the ability to deliver improvements for our developers. You will be part of a growing, fast paced, and fun team. You will have ownership for the implementation of your work. You will see direct product improvements based on the results of your work.\u003cbr/\u003e\u003cbr/\u003eJob location: Cupertino\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Hardware Engineering Services support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003e*Why AWS*\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003e*Diverse Experiences*\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003e*Work/Life Balance*\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003e*Inclusive Team Culture*\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003e*Mentorship and Career Growth*\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Hardware Engineering Services support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation","display_distance":null,"id":"42381a6b-9252-4abc-a51e-082c4d2bdd45","id_icims":"3138194","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3138194/software-development-engineer-nitro-ssd","job_schedule_type":"full-time","location":"US, CA, Cupertino","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA84\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Cupertino\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Cupertino\",\"coordinates\":\"37.31913,-122.02929\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Cupertino, California, USA\",\"location\":\"US, CA, Cupertino\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC3\"],\"normalizedCityName\":\"Cupertino\"}"],"normalized_location":"Cupertino, California, USA","optional_search_labels":["aws.team-hardware-eng"],"posted_date":"December  5, 2025","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- Deep understanding of SSD hardware architecture and SSD concepts such as wear-leveling, garbage collection, etc.\u003cbr/\u003e- 5+ years of hands-on experience developing firmware for SSD and other related storage devices.\u003cbr/\u003e- High-level understanding of storage technologies and associated block interface protocols.\u003cbr/\u003e- Meets/exceeds Amazon’s leadership principles requirements for this role\u003cbr/\u003e- Meets/exceeds Amazon’s functional/technical depth and complexity for this role.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Cupertino - 165,200.00 - 223,600.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 143,700.00 - 194,400.00 USD annually","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"CA","title":"Software Development Engineer, Nitro SSD","university_job":null,"updated_time":"28 minutes","url_next_step":"https://account.amazon.com/jobs/3138194/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 3+ years of Video Games Industry (supporting title Development, Release, or Live Ops) experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"operations","city":"Hyderabad","company_name":"Amazon Dev Center India - Hyderabad","country_code":"IND","description":"This role is for the AFT Inbound Foundations and Routing team (IBFR) team which is responsible to build core software components/services that orchestrate the movement of inventory within a warehouse and interfacing with sortation and SCOT systems for high fidelity promise and planning decisions. Worldwide, the IBFR team supports 570+ FCs across NA, EU and JP regions.\u003cbr/\u003eWith rapid expansion into new geographies, innovations in supply chain, delivery models and customer experience, increasingly complex transportation network, ever expanding selection of products and growing number of shipments worldwide, we have an opportunity to build software that scales the business, leads the industry through innovation and delights millions of customers worldwide. We have challenging problems (both business and technical) that leverages new technologies that support our high volume, low latency and high availability services.\u003cbr/\u003eIf you are looking for an opportunity to solve deep technical problems and build innovative solutions in a fast paced environment working with smart, passionate software developers, this might be the role for you. A successful candidate for this position will be able to build new software from the ground up, create pragmatic solutions for complex business problems, enjoy working closely with operations staff in Amazon fulfillment centers around the world.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e3+ years of non-internship professional software development experience\u003cbr/\u003e2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003eExperience programming with at least one software programming language","department_cost_center":null,"description_short":"This role is for the AFT Inbound Foundations and Routing team (IBFR) team which is responsible to build core software components/services that orchestrate the movement of inventory within a warehouse and","display_distance":null,"id":"b1499b24-ca39-4bc8-a421-abfe40400884","id_icims":"3115510","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3115510/sde2","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"PMOW\",\"YEXJ\",\"HYD46\",\"HYD113\",\"PHNT\",\"HSCH\",\"PMMO\",\"PMNF\",\"HYDW\",\"YSFB\",\"HYD13\",\"YZZD\",\"QSBC\",\"PMQE\",\"HYD602\",\"HYD51\",\"YEYL\",\"XBLH\",\"SHYG\",\"UHY93\",\"YSUP\",\"YSYN\",\"PNHA\",\"HBM11\",\"HYD22\",\"ZSDZ\",\"BPM54\",\"HYD101\",\"ZSDV\",\"YZZV\",\"SHYC\",\"PMNY\",\"FHY1\",\"HYBV\",\"HYD54\",\"YSO5\",\"HBX2\",\"HYD84\",\"HYD122\",\"PMNC\",\"HYD121\",\"HYD83\",\"PMOS\",\"VGA3\",\"YSUE\",\"HYD2\",\"PMOZ\",\"PNHH\",\"PMOT\",\"PMPY\",\"FHYD\",\"QSLJ\",\"BPM62\",\"UHYA\",\"FHY2\",\"QSO0\",\"PNVP\",\"PNH9\",\"QWQP\",\"HHDC\",\"PMOX\",\"HYD50\",\"HHDA\",\"HYD601\",\"HYD16\",\"HYD7\",\"PNIL\",\"PMOV\",\"YSFA\",\"HYD3\",\"KSZD\",\"HYD57\",\"UHY3\",\"PHYD\",\"HYD12\",\"PNOA\",\"FHYC\",\"XSIP\",\"HYD60\",\"HYD47\",\"YSFJ\",\"PMOQ\",\"HYD252\",\"YSTU\",\"BPM60\",\"PNLC\",\"YSFH\",\"HHY4\",\"PMNX\",\"YZZ5\",\"UHY1\",\"BPM55\",\"HYD49\",\"SHYL\",\"HVR40\",\"PMQJ\",\"HSTG\",\"HYD503\",\"HYD257\",\"UHYD\",\"FHYA\",\"PMNQ\",\"XSMM\",\"SHYI\",\"HHDB\",\"PNHR\",\"TTL3\",\"YSUR\",\"HYD48\",\"SHTX\",\"PMOY\",\"FHYB\",\"UHY4\",\"YZZM\",\"SHTI\",\"FHY3\",\"PMOU\",\"PNHY\",\"HYD111\",\"PNHG\",\"HYD120\",\"PMMM\",\"PNH8\",\"QSAJ\",\"HYD123\",\"FHYF\",\"HYT2\",\"UHYR\",\"HHY5\",\"PMOC\",\"YEXD\",\"RSB8\",\"HYD85\",\"RSBC\",\"RSBD\",\"HYD253\",\"XSEV\",\"QSD6\",\"HYD56\",\"BPM61\",\"YEYJ\",\"YSYP\",\"SHYB\",\"PDSU\",\"UHY91\",\"HYD8\",\"YEYK\",\"FHYE\",\"PNHN\",\"UHY92\",\"HYD102\",\"HYD103\",\"PNLA\",\"HYD20\",\"QSN6\",\"MHYB\",\"HYD112\",\"HYD11\",\"PHYH\",\"PNWN\",\"UHY5\",\"YEXK\",\"YSUK\",\"HYD254\",\"MHYD\",\"HYBP\",\"PNO4\",\"HYT1\",\"TTL2\",\"HYD100\",\"VGX1\",\"HYD45\",\"XSML\",\"PMPZ\",\"SHYH\",\"UHYQ\",\"FAPA\",\"REBY\",\"VGA1\",\"PDKP\",\"QSN5\",\"HYD110\",\"HYD256\",\"YSUF\",\"HYD9\",\"KSZ7\",\"ZSDW\",\"SHYA\",\"XSAD\",\"HYD71\",\"QSD7\",\"VGA4\",\"YEYI\",\"HYX1\",\"YSUM\",\"PMOR\",\"PNIP\",\"IPCX\",\"FHYG\",\"HYD23\",\"HYD007\",\"HBM10\",\"YSUA\",\"YSED\",\"PMOP\",\"SHYF\",\"ZSDY\",\"XBLS\",\"HBH91\",\"YSIZ\",\"HYD81\",\"HYD251\",\"HYD600\",\"UHY2\",\"PNH3\",\"HYB47\",\"PNTL\",\"SHYR\"],\"normalizedCityName\":\"Hyderabad\"}","{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bangalore\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bangalore\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bangalore\",\"region\":\"KA\",\"buildingCodeList\":[\"YSUI\",\"YESN\",\"WBL7\",\"YSUT\",\"TBR5\",\"FBLG\",\"QSAS\",\"QSAH\",\"ZSDS\",\"PBL4\",\"TBP8\",\"HBL6\",\"WBLB\",\"YSE5\",\"RSBM\",\"QSAL\",\"TBAA1\",\"QRRR\",\"YSUX\",\"TBS7\",\"YSF7\",\"WBLQ\",\"QSCT\",\"ZSEF\",\"RSBB\",\"RSO2\",\"QSBU\",\"BLR73\",\"BLU46\",\"WBLM\",\"YSE1\",\"BLU43\",\"HBL2\",\"WSAA\",\"YEYT\",\"FKPB\",\"YSFF\",\"RSAK\",\"TBS4\",\"BLR47\",\"YSIT\",\"YSUB\",\"ZSE8\",\"WBLI\",\"HBB42\",\"RSA4\",\"DPYN\",\"WBLT\",\"FBLO\",\"QSAD\",\"FBLN\",\"BLT01\",\"ZSEC\",\"TBS3\",\"UBL9\",\"TBR2\",\"IRYI\",\"QSAE\",\"YSYR\",\"BLR32\",\"TBP5\",\"YSYJ\",\"QSAP\",\"HBL3\",\"BLU47\",\"YESJ\",\"UBLE\",\"YSFM\",\"YSUL\",\"BLR81\",\"YSL2\",\"WBAA\",\"BLR48\",\"PNR3\",\"YSYK\",\"BLU42\",\"QSBV\",\"WBA6\",\"YEYS\",\"WBA5\",\"MYQ2\",\"QSHS\",\"HBB91\",\"BLR52\",\"RSBL\",\"BLU80\",\"UBL2\",\"YESC\",\"WBLU\",\"TBP4\",\"TBR6\",\"TBN1\",\"BLR53\",\"KSZB\",\"YSE6\",\"YSUJ\",\"PBL5\",\"QSBB\",\"WBL6\",\"SBLD\",\"FBLH\",\"WBLC\",\"BLU49\",\"UBL3\",\"FBLJ\",\"YSIS\",\"YESD\",\"XSAA\",\"TBR4\",\"YSNZ\",\"YESM\",\"WBLE\",\"HSS40\",\"WBLN\",\"KEZM\",\"YESK\",\"QSAX\",\"YSUQ\",\"BLR57\",\"RSBN\",\"BLR88\",\"TBR8\",\"HBE5\",\"TBN3\",\"WBA1\",\"YSDY\",\"YZZ3\",\"YSUH\",\"SBLZ\",\"YZZ6\",\"WBL2\",\"FBLL\",\"BRU92\",\"YSUO\",\"TBQ8\",\"YZZK\",\"WBA3\",\"QSAZ\",\"BLR93\",\"TBR1\",\"KERX\",\"YSL6\",\"WBLS\",\"QSAN\",\"BLT4\",\"QSAB\",\"ZSEA\",\"TBY9\",\"YEWD\",\"ZSDT\",\"WBL4\",\"WBLL\",\"HBB40\",\"YSE3\",\"YSIU\",\"TBS6\",\"YSF8\",\"KELI\",\"YSUV\",\"UBL41\",\"BLR4\",\"RSBI\",\"FBL2\",\"XBLB\",\"BRU46\",\"YESF\",\"YEW8\",\"YSYT\",\"UBL5\",\"TBC7\",\"YEXP\",\"TBN8\",\"BRU91\",\"QSAU\",\"QSBA\",\"BLR54\",\"RSBK\",\"XSBZ\",\"PKHS\",\"YEW0\",\"YSIR\",\"YSFD\",\"BLX2\",\"QSCG\",\"BLU41\",\"YESP\",\"TBR7\",\"KELQ\",\"FBL3\",\"BLR83\",\"ZSEH\",\"YESE\",\"QSMU\",\"MYQ1\",\"BLR50\",\"RSBG\",\"ZSDU\",\"TBP6\",\"YSYL\",\"QSBE\",\"SBLA\",\"RSA6\",\"RSA3\",\"WBLD\",\"YZZB\",\"BLR262\",\"WBL5\",\"FBLI\",\"YSL4\",\"BLU91\",\"WBA7\",\"BLR8\",\"BLR257\",\"YSDZ\",\"WBL1\",\"UBLC\",\"ZSED\",\"TBP3\",\"YSUN\",\"ZSE9\",\"UBL7\",\"SMA3\",\"YESH\",\"HBB43\",\"YSE0\",\"WBLV\",\"FBLM\",\"KEZ4\",\"TBQ9\",\"YEW4\",\"WBLH\",\"BRD40\",\"BLR80\",\"ZSEE\",\"BLR91\",\"YSF6\",\"BLR87\",\"QSBP\",\"BLU48\",\"TBS2\",\"YEYR\",\"YSYE\",\"YSL3\",\"BLROTH\",\"QSAQ\",\"WBAB\",\"HBL4\",\"BLR49\",\"YSUG\",\"BLNX\",\"XSAB\",\"FKPC\",\"YSUS\",\"YESO\",\"YSF5\",\"YEXA\",\"YESI\",\"BLR7\",\"KSLD\",\"QSBD\",\"PBL3\",\"UBL8\",\"TBR3\",\"YEXS\",\"BLR84\",\"BNG93\",\"FKPA\",\"YSFE\",\"YSO0\",\"RSBJ\",\"YESB\",\"YSUU\",\"TBP9\",\"QSAT\",\"KSLP\",\"WBM1\",\"WBLP\",\"QSAK\",\"WBLY\",\"BLR72\",\"YSYD\",\"BLR86\",\"XSAJ\",\"QSAR\",\"BLR5\",\"TBZ1\",\"RSBA\",\"KSLL\",\"YEY5\",\"BLR51\",\"QSDH\",\"QRRS\",\"YZZT\",\"RSBH\",\"WBA4\",\"ZSIJ\",\"HBL5\",\"BLU40\",\"YSE4\",\"BLR82\",\"BLR999\",\"FBLF\",\"YEYQ\",\"BLR41\",\"YSL5\",\"BLR92\",\"BLU45\",\"PNLE\",\"UBLZ\",\"IRXF\",\"TBA11\",\"SBLT\",\"BLR46\",\"WBA2\",\"TBQ7\",\"QSBR\",\"YSUD\",\"UBL6\",\"PBL1\",\"BLU88\",\"TBP2\",\"HBB41\",\"TBN9\",\"ZSEB\",\"BLU93\",\"SMA4\",\"BLT02\",\"HBM7\",\"WBLK\",\"YESG\",\"YSYG\",\"QSAY\",\"FBLP\",\"WBLF\",\"BLR140\",\"ZSEG\",\"YSDX\",\"QSAM\",\"RSA7\",\"BLR263\",\"BLX1\",\"RSAJ\",\"FBLK\",\"BLT3\",\"RSBO\",\"YSNY\",\"YESL\",\"BLR74\",\"TBN2\",\"BRU40\",\"BLR200\",\"WBLR\",\"SBLC\",\"TBP7\"],\"normalizedCityName\":\"Bengaluru\"}","{\"normalizedStateName\":\"Haryana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Gurugram\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, HR, Gurugram\",\"coordinates\":\"28.47716,77.06847\",\"normalizedCountyName\":\"Gurugram\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Gurugram, Haryana, IND\",\"location\":\"IN, HR, Gurugram\",\"region\":\"HR\",\"buildingCodeList\":[\"HNDJ\",\"DEL24\",\"TSE1\",\"SDEP\",\"DED4\",\"IRDH\",\"DEL73\",\"QNZZ\",\"HDLC\",\"KSZ2\",\"HDX1\",\"DEL19\",\"TSH3\",\"SDEB\",\"HNDI\",\"WBL9\",\"SDEG\",\"PNGX\",\"PDLV\",\"FDL9\",\"TSB3\",\"HDO2\",\"TDK9\",\"XNAB\",\"PDLG\",\"KNDA\",\"HDO3\",\"FDL6\",\"ZNJS\",\"YZZ4\",\"SHDZ\",\"TSE7\",\"DED5\",\"HBX1\",\"KELH\",\"DEL8\",\"SDEY\",\"DEL94\",\"SDLD\",\"PNGZ\"],\"normalizedCityName\":\"Gurugram\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":[],"posted_date":"October 27, 2025","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"operations.team-last-mile-tech","source_system":"JobCreator","state":"TS","title":"SDE2","university_job":null,"updated_time":"29 minutes","url_next_step":"https://account.amazon.com/jobs/3115510/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-tech","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High School diploma or equivalent\u003cbr/\u003e- 1+ years in a high traceability manufacturing environment, or relevant trade school certification\u003cbr/\u003e- 1+ years of hand tools experience (i.e., Calipers, multi-meters, torque wrenches)\u003cbr/\u003e- 1+ years working with test tools and test methods that adequately validate the system","business_category":"alexa-and-amazon-devices","city":"Kirkland","company_name":"Amazon Kuiper Manufacturing Enterprises LLC - M90","country_code":"USA","description":"Amazon Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the capacity, flexibility, and performance to serve a wide range of customers, from individual households to schools, hospitals, businesses, government agencies, and other organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eWe are looking for talented technicians to help full-scale production of the Leo satellites. The success of Leo depends on the quality, reliability, cost, manufacturability, throughput, and security of the products that you deliver. If you seek a fast-paced, dynamic environment; if you thrive on solving difficult problems where resolutions have high impact; and if you love the challenge of building something from scratch, then this role will be an ideal next career step. To be successful you need to be highly motivated and detail oriented while showing the highest standards of execution. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Follow work instructions and safety procedures\u003cbr/\u003e- Assemble and test with emphasis to detail, an assortment of LRUs, electrical-mechanical assemblies, avionics, or other complex aerospace builds\u003cbr/\u003e- Participate in process improvements, maintain floor stock inventory\u003cbr/\u003e- You will independently execute and prioritize work to meet company deliverables \u003cbr/\u003e- Execute test procedures for component and system level testing maintenance \u003cbr/\u003e- Champion safety requirements in all designated zones and work locations\u003cbr/\u003e- Ensure lab equipment is maintained and calibrated\u003cbr/\u003e- Supports some preventative maintenance activities on test equipment and data acquisition systems\u003cbr/\u003e- Receive shipments and coordinate deliveries with recipients (Using pallet jacks, kit carts, etc)\u003cbr/\u003e- Your work may include contributing to improving SOPs and safety procedures\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eCandidates must be 18 years or older with the ability to understand and adhere to all job requirements and safety guidelines.\u003cbr/\u003e\u003cbr/\u003eThe starting pay for this role in Washington State is up to $33.50 / hour and employees are eligible for incremental raises based on tenure. This information is provided per the Washington State Pay Transparency Act. Base pay information is based on market location. Applicants should apply via Amazon’s internal or external careers site.\u003cbr/\u003e\u003cbr/\u003eAdditional Requirements: \u003cbr/\u003eWilling to work 4 / 10s as assigned:\u003cbr/\u003e1st shift : 6:00 am - 4:30 pm PST (Sun - Wed) \u003cbr/\u003e- Willing to work overtime and weekends as needed. \u003cbr/\u003e- Flexible working/commuting in between site locations Redmond, WA and Kirkland, WA\u003cbr/\u003e- Standing for long periods of time, climbing up and down ladders, bending, grasping, sitting, pulling, pushing, stooping, and stretching may be required to perform the functions of this position\u003cbr/\u003e - Able to lift-up to 25lbs. unassisted \u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the","display_distance":null,"id":"9d5b2b86-2f57-410a-be41-fd39dbbcefa5","id_icims":"3175524","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Manufacturing","job_function_id":null,"job_path":"/en/jobs/3175524/mfg-technician-ii-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Kirkland","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Kirkland\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Kirkland\",\"coordinates\":\"47.67887,-122.2066\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Kirkland, Washington, USA\",\"location\":\"US, WA, Kirkland\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA133\"],\"normalizedCityName\":\"Kirkland\"}"],"normalized_location":"Kirkland, Washington, USA","optional_search_labels":["devices-services.kuiper-prod-ops"],"posted_date":"February  5, 2026","preferred_qualifications":"- Aircraft \u0026 Powerplant (A\u0026P) certification/license Prior telecom (fiber optics) experience a plus\u003cbr/\u003e- CFOT certification or equivalent experience\u003cbr/\u003e- Airman or Avionic certification or equivalent experience -ASE certification or equivalent experience\u003cbr/\u003e- Experience in fast-paced production environment with flight hardware\u003cbr/\u003e- Ability to use precision measuring instruments\u003cbr/\u003e- 1+ years able to read, interpret and work from engineering documentation and/ or drawings\u003cbr/\u003e- Experience working with FOD, ESD sensitive hardware and clean room requirements\u003cbr/\u003e- 1+ years of Electro-Mechanical Assembly, Final Integration and/or Harness Integration experience\u003cbr/\u003e- Ability to work effectively in a team environment\u003cbr/\u003e- Ability to rapidly change roles/responsibilities while working in a high-paced, challenging work environment\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below including the base pay rate plus the highest available shift differential which applies depending on the shift you select. As a total compensation company, you are eligible for additional earnings including overtime pay and performance bonuses. Final pay will be based on factors including shift selection and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Kirkland - 33.00 - 36.00 USD hourly","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Mfg Technician II, Amazon Leo","university_job":null,"updated_time":"30 minutes","url_next_step":"https://account.amazon.com/jobs/3175524/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High School diploma or equivalent\u003cbr/\u003e- 1+ years in a high traceability manufacturing environment, or relevant trade school certification\u003cbr/\u003e- 1+ years of hand tools experience (i.e., Calipers, multi-meters, torque wrenches)\u003cbr/\u003e- 1+ years working with test tools and test methods that adequately validate the system","business_category":"alexa-and-amazon-devices","city":"Kirkland","company_name":"Amazon Kuiper Manufacturing Enterprises LLC - M90","country_code":"USA","description":"Amazon Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the capacity, flexibility, and performance to serve a wide range of customers, from individual households to schools, hospitals, businesses, government agencies, and other organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eWe are looking for talented technicians to help full-scale production of the Leo satellites. The success of Leo depends on the quality, reliability, cost, manufacturability, throughput, and security of the products that you deliver. If you seek a fast-paced, dynamic environment; if you thrive on solving difficult problems where resolutions have high impact; and if you love the challenge of building something from scratch, then this role will be an ideal next career step. To be successful you need to be highly motivated and detail oriented while showing the highest standards of execution. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Follow work instructions and safety procedures\u003cbr/\u003e- Assemble and test with emphasis to detail, an assortment of LRUs, electrical-mechanical assemblies, avionics, or other complex aerospace builds\u003cbr/\u003e- Participate in process improvements, maintain floor stock inventory\u003cbr/\u003e- You will independently execute and prioritize work to meet company deliverables \u003cbr/\u003e- Execute test procedures for component and system level testing maintenance \u003cbr/\u003e- Champion safety requirements in all designated zones and work locations\u003cbr/\u003e- Ensure lab equipment is maintained and calibrated\u003cbr/\u003e- Supports some preventative maintenance activities on test equipment and data acquisition systems\u003cbr/\u003e- Receive shipments and coordinate deliveries with recipients (Using pallet jacks, kit carts, etc)\u003cbr/\u003e- Your work may include contributing to improving SOPs and safety procedures\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eCandidates must be 18 years or older with the ability to understand and adhere to all job requirements and safety guidelines.\u003cbr/\u003e\u003cbr/\u003eThe starting pay for this role in Washington State is up to $33.50 / hour and employees are eligible for incremental raises based on tenure. This information is provided per the Washington State Pay Transparency Act. Base pay information is based on market location. Applicants should apply via Amazon’s internal or external careers site.\u003cbr/\u003e\u003cbr/\u003eAdditional Requirements: \u003cbr/\u003eWilling to work 4 / 10s as assigned:\u003cbr/\u003e1st shift : 6:00 am - 4:30 pm PST (Sun - Wed) \u003cbr/\u003e- Willing to work overtime and weekends as needed. \u003cbr/\u003e- Flexible working/commuting in between site locations Redmond, WA and Kirkland, WA\u003cbr/\u003e- Standing for long periods of time, climbing up and down ladders, bending, grasping, sitting, pulling, pushing, stooping, and stretching may be required to perform the functions of this position\u003cbr/\u003e - Able to lift-up to 25lbs. unassisted \u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the","display_distance":null,"id":"37d29f43-7a81-4e89-9e7b-a0f1368e33bb","id_icims":"3175523","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Manufacturing","job_function_id":null,"job_path":"/en/jobs/3175523/mfg-technician-ii-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Kirkland","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Kirkland\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Kirkland\",\"coordinates\":\"47.67887,-122.2066\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Kirkland, Washington, USA\",\"location\":\"US, WA, Kirkland\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA133\"],\"normalizedCityName\":\"Kirkland\"}"],"normalized_location":"Kirkland, Washington, USA","optional_search_labels":["devices-services.kuiper-prod-ops"],"posted_date":"February  5, 2026","preferred_qualifications":"- Aircraft \u0026 Powerplant (A\u0026P) certification/license Prior telecom (fiber optics) experience a plus\u003cbr/\u003e- CFOT certification or equivalent experience\u003cbr/\u003e- Airman or Avionic certification or equivalent experience -ASE certification or equivalent experience\u003cbr/\u003e- Experience in fast-paced production environment with flight hardware\u003cbr/\u003e- Ability to use precision measuring instruments\u003cbr/\u003e- 1+ years able to read, interpret and work from engineering documentation and/ or drawings\u003cbr/\u003e- Experience working with FOD, ESD sensitive hardware and clean room requirements\u003cbr/\u003e- 1+ years of Electro-Mechanical Assembly, Final Integration and/or Harness Integration experience\u003cbr/\u003e- Ability to work effectively in a team environment\u003cbr/\u003e- Ability to rapidly change roles/responsibilities while working in a high-paced, challenging work environment\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below including the base pay rate plus the highest available shift differential which applies depending on the shift you select. As a total compensation company, you are eligible for additional earnings including overtime pay and performance bonuses. Final pay will be based on factors including shift selection and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Kirkland - 33.00 - 36.00 USD hourly","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Mfg Technician II, Amazon Leo","university_job":null,"updated_time":"31 minutes","url_next_step":"https://account.amazon.com/jobs/3175523/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- high school diploma or equivalent\u003cbr/\u003e- 1+ years in a high traceability manufacturing environment, or relevant trade school certification\u003cbr/\u003e- 1+ years of hand tools experience (i.e., Calipers, multi-meters, torque wrenches)\u003cbr/\u003e- 1+ years working with test tools and test methods that adequately validate the system","business_category":"alexa-and-amazon-devices","city":"Kirkland","company_name":"Amazon Kuiper Manufacturing Enterprises LLC - M90","country_code":"USA","description":"Amazon Leo is Amazon's low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon Leo will serve people and organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eOne of the most ambitious missions that Amazon has undertaken to date, the Leo satellite constellation, is our solution to providing reliable internet. We are looking for talented technicians to help full-scale production of the Leo satellites.\u003cbr/\u003e\u003cbr/\u003eThe success of Leo depends on the quality, reliability, cost, manufacturability, throughput, and security of the products that you deliver. If you seek a fast-paced, dynamic environment; if you thrive on solving difficult problems where resolutions have high impact; and if you love the challenge of building something from scratch, then this role will be an ideal next career step. To be successful you need to be highly motivated and detail oriented while showing the highest standards of execution.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Champion safety requirements in all designated zones and work locations\u003cbr/\u003e- Assemble and test with emphasis to detail, an assortment of avionic LRUs, electrical-mechanical assemblies, handle and install fiber-optics, and PCBAs\u003cbr/\u003e- Ensure lab equipment is maintained and calibrated\u003cbr/\u003e- Supports some preventative maintenance activities on test equipment and data acquisition systems\u003cbr/\u003e- Identify equipment requirements, process improvements, maintain floor stock inventory\u003cbr/\u003e- You will independently execute and prioritize work to meet company deliverables\u003cbr/\u003e- Execute test procedures for component and system level testing maintenance\u003cbr/\u003e- Receive shipments and coordinate deliveries with recipients (Using pallet jacks, kit carts, etc)\u003cbr/\u003e- Your work may include contributing to improving SOPs and safety procedures\u003cbr/\u003e\u003cbr/\u003eCandidates must be 18 years or older with the ability to understand and adhere to all job requirements and safety guidelines.\u003cbr/\u003e\u003cbr/\u003eSecond Shift Schedule: 4 /10s  Sun-Wednesday 5pm-3:30pm\u003cbr/\u003e\u003cbr/\u003eThe starting pay for this role in Washington State is up to $33.50/hour and employees are eligible for incremental raises based on tenure. A full range of medical, financial, and/or other benefits are provided. This information is provided per the Washington State Pay Transparency Act. Base pay information is based on market location. Applicants should apply via Amazon's internal or external careers site.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are a group of Technicians with well over 20+ years of diverse skills and experience. Each team member brings in willingness to train and positive team energy. Some tasks you may be an individual contributor, but may also work in a group environment to achieve organizational goals. This group of Technicians thrived in success by working as a team. We are currently in research and development but moving towards production environment.","department_cost_center":null,"description_short":"Amazon Leo is Amazon's low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to","display_distance":null,"id":"de5059b1-72e6-4dbc-9595-beba4fe105cc","id_icims":"3175525","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Manufacturing","job_function_id":null,"job_path":"/en/jobs/3175525/manufacturing-assembly-technician-ii-2nd-shift-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Kirkland","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Kirkland\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Kirkland\",\"coordinates\":\"47.67887,-122.2066\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Kirkland, Washington, USA\",\"location\":\"US, WA, Kirkland\",\"region\":\"WA\",\"buildingCodeList\":[\"ONM233\",\"SEA11\",\"ZKL2\",\"METR6\",\"SEA133\",\"ATBP16\",\"LSE2\",\"ONM129\",\"JSE7\",\"PAE33\",\"ONM235\",\"UWA1\",\"WFM655\"],\"normalizedCityName\":\"Kirkland\"}"],"normalized_location":"Kirkland, Washington, USA","optional_search_labels":["devices-services.kuiper-prod-ops"],"posted_date":"February  5, 2026","preferred_qualifications":"- Aircraft \u0026 Powerplant (A\u0026P) certification/license Prior telecom (fiber optics) experience a plus\u003cbr/\u003e- CFOT certification or equivalent experience\u003cbr/\u003e- Airman or Avionic certification or equivalent experience -ASE certification or equivalent experience\u003cbr/\u003e- Experience in fast-paced production environment with flight hardware\u003cbr/\u003e- Ability to use precision measuring instruments\u003cbr/\u003e- 1+ years able to read, interpret and work from engineering documentation and/ or drawings\u003cbr/\u003e- Experience working with FOD, ESD sensitive hardware and clean room requirements\u003cbr/\u003e- 1+ years of Electro-Mechanical Assembly, Final Integration and/or Harness Integration experience\u003cbr/\u003e- Ability to work effectively in a team environment\u003cbr/\u003e- Ability to rapidly change roles/responsibilities while working in a high-paced, challenging work environment\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below including the base pay rate plus the highest available shift differential which applies depending on the shift you select. As a total compensation company, you are eligible for additional earnings including overtime pay and performance bonuses. Final pay will be based on factors including shift selection and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Kirkland - 33.00 - 36.00 USD hourly","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Manufacturing Assembly Technician II (2nd Shift), Amazon Leo","university_job":null,"updated_time":"31 minutes","url_next_step":"https://account.amazon.com/jobs/3175525/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}