{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 1+ years of technical product or program management experience\u003cbr/\u003e- 2+ years of software development experience\u003cbr/\u003e- 3+ years of project management disciplines including scope, schedule, budget, quality, along with risk and critical path management experience\u003cbr/\u003e- Experience managing programs across cross functional teams, building processes and coordinating release schedules","business_category":"aws","city":"Austin","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"This position is part of the AWS Specialist and Partner Organization (ASP). Specialists own the end-to-end go-to-market strategy for their respective technology domains, providing the business and technical expertise to help our customers succeed. Partner teams own the strategy, recruiting, development, and growth of our key technology and consulting partners. Together they provide our customers with the expertise and scale needed to build innovative solutions for their most complex challenges.\u003cbr/\u003e\u003cbr/\u003eAs part of the AWS Solutions organization, we have a vision to provide business applications, leveraging Amazon’s unique experience and expertise, that are used by millions of companies worldwide to manage day-to-day operations. We will accomplish this by accelerating our customers’ businesses through delivery of intuitive and differentiated technology solutions that solve enduring business challenges. We blend vision with curiosity and Amazon’s real-world experience to build opinionated, turnkey solutions. Where customers prefer to buy over build, we become their trusted partner with solutions that are no-brainers to buy and easy to use. \u003cbr/\u003e \u003cbr/\u003e Amazon Connect is a highly disruptive cloud-based contact center that enables businesses to deliver engaging, dynamic, and personal customer service experiences. Amazon Connect is the result of the ten years of development that went into building the tools Amazon uses to provide its award winning customer service at massive scale and launching it as a publicly available AWS service. With Amazon Connect, you can create your own cloud-based contact center and be taking calls in minutes. Amazon Connect leverages the power of Artificial Intelligence and the large ecosystem of AWS services such as Amazon Lex, Amazon Polly, AWS Lambda, Amazon S3 and Amazon Kinesis to provide a truly frustration free, easy-to-use, extensible, and natural customer experience. With this technology, we are transforming an industry and the way customers interact with businesses and how agents service them.\u003cbr/\u003e   \u003cbr/\u003e We have a rapidly growing customer base and an exciting charter in front of us that includes solving highly complex engineering and algorithmic problems. We are looking for passionate and talented Technical Program Manager to join us to innovate on this new service that addresses customer needs to build modern contact centers in the cloud. The position represents a rare opportunity to be a part of a fast-growing business soon after launch, and help shape the technology and product as we grow. You will be playing a crucial role in developing the next generation contact center, and get the opportunity to design and deliver scaleable, resilient systems while maintaining a constant customer focus.\u003cbr/\u003e \u003cbr/\u003eWe are looking for a highly effective Technical Program Manager that can lead a team to quickly design and deliver systems while maintaining a constant customer focus.\u003cbr/\u003eThe Technical Program Manager for this team needs a sound understanding of the fundamentals of communications and practical experience building large-scale distributed systems. If you become the Technical Program Manager, you will work with design, technical, and business leaders to set strategy and define the product. You will drive, track, and report the development effort to leadership and partners. You will define the engagement model and manage internal/external dependencies and relationships. You will be key leader responsible for delivering the distributed systems and analytics that will enable AWS to continue changing the software industry by delivering more capabilities to more customers.\u003cbr/\u003e \u003cbr/\u003e This team is a great fit for you if\u003cbr/\u003e     - You enjoy working with a fun team that prides itself on      a great work environment with an inclusive group of people that are      working together towards a common goal.\u003cbr/\u003e   - You are sensitive to      customer needs and interested in working      on a service that will be used, directly and indirectly, by millions of      customers and has a meaningful impact to their functions and interactions.\u003cbr/\u003e   - You’d like to be directly responsible for solving real      customer problems.\u003cbr/\u003e   - You are a passionate learner and are motivated to take      on new challenges.\u003cbr/\u003e - You want to have fun; surround yourself with a highly talented pool of engineers that like to solve complex problems, but also enjoy work life balance.\u003cbr/\u003e   Learn more about Amazon Connect \u003ca href=\"http://aws.amazon.com/connect\"\u003ehere\u003c/a\u003e.\u003cbr/\u003e \u003cbr/\u003e \u003ca href=\"http://www.zdnet.com/article/how-the-abs-prepared-for-the-same-sex-marriage-survey-using-the-public-cloud/\"\u003eMedia coverage on Amazon Connect\u003c/a\u003e can be found \u003ca href=\"https://www.benzinga.com/analyst-ratings/analyst-color/17/03/9241888/how-amazons-connect-could-impact-twilio-zendesk-ringcent\"\u003ehere\u003c/a\u003e, \u003ca href=\"http://www.zdnet.com/article/how-the-abs-prepared-for-the-same-sex-marriage-survey-using-the-public-cloud/\"\u003ehere\u003c/a\u003e and \u003ca href=\"https://aws.amazon.com/blogs/aws/new-amazon-connect-and-amazon-lex-integration/\"\u003ehere\u003c/a\u003e\u003cbr/\u003e \u003ca href=\"https://www.youtube.com/watch?v=9qky_E39-_I\"\u003ePower of Amazon Connect\u003c/a\u003e\u003cbr/\u003e   \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003e\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003e\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e","department_cost_center":null,"description_short":"This position is part of the AWS Specialist and Partner Organization (ASP). Specialists own the end-to-end go-to-market strategy for their respective technology domains, providing the business and technical","display_distance":null,"id":"9af7318c-0b5e-4ffb-8534-ffe3ff2d3709","id_icims":"3131610","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Technical Program Management","job_function_id":null,"job_path":"/en/jobs/3131610/technical-program-manager-amazon-connect","job_schedule_type":"full-time","location":"US, TX, Austin","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS20\"],\"normalizedCityName\":\"Austin\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA44\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Austin, Texas, USA","optional_search_labels":["aws.team-aspo"],"posted_date":"November 24, 2025","preferred_qualifications":"- 3+ years of working directly with engineering teams experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Austin - 127,100.00 - 172,000.00 USD annually","primary_search_label":"aws.team-program-management-primary","source_system":"JobCreator","state":"TX","title":"Technical Program Manager, Amazon Connect","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3131610/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-program-management-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of data center, network engineering, and/or systems engineering experience\u003cbr/\u003e- 2+ years of experience managing people in a technical environment.  \"","business_category":"aws","city":"Avondale","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"This position involves leading teams in hardware and network diagnostics followed by physical repair and includes participation in an on-call rotation. All candidates should be willing to work both independently and managing their teams effectively. Work prioritization, organizational skills, effective communication, and the ability to react quickly are critical to being successful. In addition to strong knowledge in Data Centers, hardware and network repair, candidates will create documentation, innovate solutions, participate in site-level project work, and fix complex problems within the Data Center Space. This team works in an environment that operates 24/7, in addition this role will operate on a night shift schedule that is subject to adjustment to meet operational demands.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe successful candidate will be operationally responsible for a Data Center. Some high-level responsibilities include:\u003cbr/\u003e- Prioritize and assign trouble tickets to data center technicians and operators\u003cbr/\u003e- Manage the performance of a diverse team(s) of data center operation professionals with varying skills across different locations\u003cbr/\u003e- Developing Career Paths for the employees and to make updates in our internal tools.\u003cbr/\u003e- Recruit and train data technicians to ensure appropriate staffing levels\u003cbr/\u003e- Ensure effective and efficient management of day to day data center operations including queue management, 7/24 shift arrangement and hardware logistics\u003cbr/\u003e- Fast learn or act as the subject matter expert across all aspects in data center operations\u003cbr/\u003e- Ensure all operational KPIs and metrics are being measured and met\u003cbr/\u003e- Inspire and guide improvement in team process, technology innovation and automation\u003cbr/\u003e- Manage Large Scale Events (outages) and act as the call leader\u003cbr/\u003e- Manage and improve the work-flows and through-put for data centers operations\u003cbr/\u003e- Recommend, document, and oversee policies and procedures to meet industry best practices and to meet required SLAs\u003cbr/\u003e- Maintain the on-call schedule coordinating absence and vacations\u003cbr/\u003e- Be passionate about the quality and quantity of services being provided, and continuously strive to improve our Customer Experience\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAmazon Web Services (AWS) is a fast paced technology company and a leader in the world of data centers. The position will help ensure overall availability and reliability to meet or exceed defined service levels of data center operations. We are currently expanding our infrastructure management team and are looking for technology managers with experience in people management, strong technical understanding and the drive and vision to take AWS Data Center Operations to the next level. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is a fast paced technology company and a leader in the world of data centers. The position will help ensure overall availability and reliability to meet or exceed defined service levels of data center operations. We are currently expanding our infrastructure management team and are looking for technology managers with experience in people management, strong technical understanding and the drive and vision to take AWS Data Center Operations to the next level. ","department_cost_center":null,"description_short":"This position involves leading teams in hardware and network diagnostics followed by physical repair and includes participation in an on-call rotation. All candidates should be willing to work both independently","display_distance":null,"id":"186bf06f-efd6-4971-b40e-a9fade1ad755","id_icims":"3155953","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3155953/data-center-manager","job_schedule_type":"full-time","location":"US, AZ, Avondale","locations":["{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Avondale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Avondale\",\"coordinates\":\"33.44096,-112.34966\",\"normalizedCountyName\":\"Maricopa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Avondale, Arizona, USA\",\"location\":\"US, AZ, Avondale\",\"region\":\"AZ\",\"buildingCodeList\":[\"PHX69\"],\"normalizedCityName\":\"Avondale\"}"],"normalized_location":"Avondale, Arizona, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"January  9, 2026","preferred_qualifications":"- 2+ years of computer hardware experience, including troubleshooting and repairing experience\u003cbr/\u003e- Experience in technical writing in a relevant field\u003cbr/\u003e- Certifications in a relevant field (CCENT, Network+, CCNA)\u003cbr/\u003e- Behavioral interviewing and hiring experience\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends. \"\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, AZ, Avondale - 78,400.00 - 137,300.00 USD annually","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"AZ","title":"Data Center Manager","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3155953/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"transportation-shipping-logistics","city":"Altoona","company_name":"Amazon.com Services LLC","country_code":"USA","description":"This position requires in-role training at an operating site which will be 2+ weeks in duration. This training will be located 50+ miles away from the home site location. All travel accommodations for training will be booked and paid for by Amazon.\u003cbr/\u003e\u003cbr/\u003ePlease note: this role requires open flexibility to work 10 hour overnight shifts (late afternoon to early morning hours) and will be scheduled on a front-half (Sunday – Wednesday) or back-half (Wednesday – Saturday) schedule. Shifts will be assigned upon starting in the role and could be subject to change based upon business need.\u003cbr/\u003e\u003cbr/\u003eABOUT AMAZON\u003cbr/\u003e\u003cbr/\u003eOur Worldwide Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager. In this role, you will lead a team of hourly employees and will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. You will also play a key part in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e\u003cbr/\u003eOur Operation’s workflow has three major components: First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer.\u003cbr/\u003e\u003cbr/\u003eRapid and Rural Logistics (R2L) is an exciting organization within Amazon specializing in delighting our customers with speed in which we can make items appear on their doorsteps. Rural Super Rural (RSR) is a subset of R2L dedicated to ensuring our customers receive their deliveries and are satisfied with their service, even in our most remote area. We are a combination of operations and support teams aligned to continually strive to innovate the last mile delivery process while bringing smiles to our customer’s faces. Come build the future with us!\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e - Support, mentor, and motivate your team\u003cbr/\u003e - Manage safety, quality, productivity, and customer delivery promises\u003cbr/\u003e - Collaborate with all support teams including Safety, Ops Integration, Loss Prevention and Human Resources to develop plans to meet business objectives\u003cbr/\u003e - Lift up to 49 pounds, stand and walk during shifts lasting up to 12 hours, and frequently push, pull, squat, bend, and reach, as well as continuously climb and descend stairs\u003cbr/\u003e - Work in an environment where the noise level varies and is subject to variable temperatures and weather (delivery stations include outside loading departments, and grocery locations include refrigerated environments)\u003cbr/\u003e - Work a flexible schedule (weekends and/or overnight shifts) ","department_cost_center":null,"description_short":"This position requires in-role training at an operating site which will be 2+ weeks in duration. This training will be located 50+ miles away from the home site location. All travel accommodations for","display_distance":null,"id":"a6668792-7437-4f1e-8822-0a22135b69c6","id_icims":"3163720","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3163720/area-manager-rsr","job_schedule_type":"full-time","location":"US, PA, Altoona","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Altoona\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Altoona\",\"coordinates\":\"40.50733,-78.3991\",\"normalizedCountyName\":\"Blair\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Altoona, Pennsylvania, USA\",\"location\":\"US, PA, Altoona\",\"region\":\"PA\",\"buildingCodeList\":[\"WOO1\"],\"normalizedCityName\":\"Altoona\"}"],"normalized_location":"Altoona, Pennsylvania, USA","optional_search_labels":[],"posted_date":"January 21, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, PA, Altoona - 70,000.00 - 90,900.00 USD annually","primary_search_label":"transportation-shipping-logistics.rural-super-rural","source_system":"JobCreator","state":"PA","title":"Area Manager, RSR","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3163720/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"rural-super-rural","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 10+ years of professional or military experience\u003cbr/\u003e- 5+ years of SQL experience\u003cbr/\u003e- Experience programming to extract, transform and clean large (multi-TB) data sets\u003cbr/\u003e- Experience with theory and practice of design of experiments and statistical analysis of results\u003cbr/\u003e- Experience with AWS technologies\u003cbr/\u003e- Experience in scripting for automation (e.g. Python) and advanced SQL skills.\u003cbr/\u003e- Experience with theory and practice of information retrieval, data science, machine learning and data mining","business_category":"operations-team","city":"Hyderabad","company_name":"ADCI HYD 13 SEZ","country_code":"IND","description":"Amazon is seeking a candidate to identify, develop and integrate innovative solutions and programs that lead to improvements that redefine the standards for customer experience in our North American Transportation Network. Amazon transportation encompasses all the operations that deliver shipments from our fulfillment centers and third party locations to customers worldwide.\u003cbr/\u003eTESS team in Hyderabad is looking for an experienced, innovative, hands-on and customer-obsessed BIE for it's Analytics team. The candidate must be detail oriented, have superior verbal and written communication skills, strong organizational skills, excellent technical skills and should be able to juggle multiple tasks at once.\u003cbr/\u003eThe ideal candidate must be able to identify problems before they happen and implement solutions that detect and prevent outages. The candidate must be able to accurately prioritize projects, make sound judgments, work to improve the customer experience and get the right things done.\u003cbr/\u003eThis job requires you to constantly hit the ground running and have the ability to learn quickly. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003ePrimary responsibilities include defining the problem and building analytical frameworks to help the operations to streamline the process, identifying gaps in the existing process by analyzing data and liaising with relevant team(s) to plug it and analyzing data and metrics and sharing update with the internal teams.\u003cbr/\u003e\u003cbr/\u003eAs a BIE III on the Transportation Engineering Systems Team, you will own business stakeholder engagement, focus on delivering new, or streamlining existing processes and programs, and create documentation to support defect reduction, improvements in productivity, and shape mid to long term planning and prioritization for supported business groups. You’ll work cross functionally with a broad range of business stakeholders to define detailed requirements and implement process/system based solutions for the Amazon Fulfillment/Transportation Network. You will also work on creating documentation to support defect reduction, improvements in productivity and identify and mitigate associated risks. Additionally, this role will create operational structure and change control for our quickly evolving landscape and provide strategic direction and subject matter expertise in determining investment prioritization for our business analytics and tech partners. You will utilize a range of analytical tools and techniques to build business reports, generate dashboards, create metrics to measure success and negotiate required tech features and their priority while driving process automation.","department_cost_center":null,"description_short":"Amazon is seeking a candidate to identify, develop and integrate innovative solutions and programs that lead to improvements that redefine the standards for customer experience in our North American Transportation","display_distance":null,"id":"ddd36a69-8205-41b6-bee9-0d6b55572398","id_icims":"3134339","is_intern":null,"is_manager":null,"job_category":"Business Intelligence","job_family":"Business Intel Engineer","job_function_id":null,"job_path":"/en/jobs/3134339/business-intel-engineer-iii-gts-field-kadie-newman","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD13\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"December  1, 2025","preferred_qualifications":"- Experience working directly with business stakeholders to translate between data and business needs\u003cbr/\u003e- Experience managing, analyzing and communicating results to senior leadership\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"operations-team.transportation-operations-management","source_system":"JobCreator","state":"TS","title":"Business Intel Engineer III, GTS Field - Kadie Newman","university_job":null,"updated_time":"21 minutes","url_next_step":"https://account.amazon.com/jobs/3134339/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"transportation-operations-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in engineering, statistics, computer science, operations research, business analytics, information systems or equivalent\u003cbr/\u003e- Experience owning/driving roadmap strategy and definition\u003cbr/\u003e- Experience with feature delivery and tradeoffs of a product\u003cbr/\u003e- Experience contributing to engineering discussions around technology decisions and strategy related to a product\u003cbr/\u003e- Experience in representing and advocating for a variety of critical customers and stakeholders during executive-level prioritization and planning","business_category":"fulfillment-technology-and-robotics","city":"Springdale","company_name":"Amazon.com Services LLC - A57","country_code":"USA","description":"Transform the future of automation by driving technological innovations that revolutionize how Amazon’s complex logistical systems operate and interact! Join our dynamic team where you'll be at the forefront of designing intelligent automation solutions that reshape Amazon’s global logistics and technological capabilities. As a Senior Technical Product Manager – Electrical Standards, you'll dive into a world where technology meets innovation and efficiency. As the functional CEO of Amazon’s electrical and controls hardware products, you will balance business and technical to create the future of Amazon’s material handling electrical architecture with new, innovative solutions driven by you!  Your day will be filled with strategic problem-solving, collaborative design sessions, and transformative product development that pushes the boundaries of what's possible in robotics and automation.  \u003cbr/\u003eWe are a passionate group of innovators, engineers and business leaders dedicated to reducing the variability and complacency in our current logistics systems. Our team thrives on collaboration, continuous learning, and the shared vision of developing technologies to bring innovation and scalability back to our automation equipment.  \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Drive Technological Innovation: Serve as the expert for electrical standard components - such as variable frequency drives, control panels, network architecture, etc - maintaining knowledge and providing strategic technical guidance\u003cbr/\u003e- Design and Development: Create comprehensive product documentation, lead research initiatives, and collaborate with cross-functional teams to enhance product performance\u003cbr/\u003e- Strategic Communication: Build consensus, communicate complex technical concepts, and develop strategic narratives that inspire the business and inform leadership\u003cbr/\u003e- Technical Problem-Solving: Analyze complex system architectures, develop innovative solutions, and make critical design decisions that impact global operations\u003cbr/\u003e- End-to-End Product Management: Lead product lifecycle management, define success metrics, and mentor teams in best practices of technical product development\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon installs a significant quantity of new buildings every year. The historical model has been to allow each integrator to use their own equipment, controls, subsystems, and methodologies. While that has allowed Amazon to be successful to this point, the variability between buildings has proven difficult to support and scale.  One MHS’ charge is to build partnerships to focus on consistency and scalability across our network of the future. We will be partnering with key suppliers to help them scale up their manufacturing capabilities to keep up with our needs, as well as refining their designs to drive innovation and operational uptime and better meet the specific needs of Amazon’s operational environment. ","department_cost_center":null,"description_short":"Transform the future of automation by driving technological innovations that revolutionize how Amazon’s complex logistical systems operate and interact! Join our dynamic team where you'll be at the forefront","display_distance":null,"id":"b1d4ff05-f4e4-4a71-b618-241b6099b6e2","id_icims":"3119504","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Product Management - Technical","job_function_id":null,"job_path":"/en/jobs/3119504/sr-product-manager-technical-electrical-onemhs","job_schedule_type":"full-time","location":"US, OH, Springdale","locations":["{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Nashville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Nashville\",\"coordinates\":\"36.16792,-86.77798\",\"normalizedCountyName\":\"Davidson\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Nashville, Tennessee, USA\",\"location\":\"US, TN, Nashville\",\"region\":\"TN\",\"buildingCodeList\":[\"LNV3\",\"BNA22\",\"BNA5\",\"BNA19\",\"ICAO\",\"GEO13\",\"BNA18\",\"LNV2\",\"BNA20\",\"GFA1\",\"PKG1\",\"TBC138\",\"GEO5\",\"R095\",\"BNA200\",\"HBN9\",\"BNA11\",\"SNL1\",\"UIO9\",\"BNA21\",\"BNA250\",\"STN1\",\"BNA24\",\"JBN1\",\"HBN1\",\"GEO8\",\"ZTN2\",\"WFM685\",\"BNA12\",\"WFM241\",\"BNA15\",\"HBN2\",\"DBM7\",\"VUQA\",\"DNA2\",\"BNA400\",\"DNA1\",\"R094\",\"UTN1\",\"BNA13\",\"BNA10\"],\"normalizedCityName\":\"Nashville\"}","{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Westborough\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Westborough\",\"coordinates\":\"42.2843,-71.59909\",\"normalizedCountyName\":\"Worcester\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Westborough, Massachusetts, USA\",\"location\":\"US, MA, Westborough\",\"region\":\"MA\",\"buildingCodeList\":[\"QMA1\",\"DTB8\",\"ISPD2\",\"BOS700\",\"SMA1\",\"BOS35\"],\"normalizedCityName\":\"Westborough\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"ZBL2\",\"FLR5\",\"SEA127\",\"MAB2\",\"KFTS\",\"LBV5\",\"SEA94\",\"CWA12\",\"SEA132\",\"ZBL1\",\"SEA113\",\"NST3\",\"UNP1\",\"SEA108\",\"NST9\",\"SEA120\",\"SEA93\",\"METR1\",\"JSE3\",\"SEA105\",\"SEA119\",\"SEA123\",\"SPP67\",\"SEA6\",\"NST5\",\"SEA107\",\"SEA104\",\"ZSE2\",\"SEA121\",\"SEA8\",\"ONM123\",\"SEA112\",\"WFM657\",\"IBF2\",\"WFM153\",\"SEA82\",\"SEA106\",\"ZBL3\"],\"normalizedCityName\":\"Bellevue\"}","{\"normalizedStateName\":\"Kentucky\",\"normalizedCountryCode\":\"USA\",\"city\":\"Hebron\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, KY, Hebron\",\"coordinates\":\"39.06603,-84.70084\",\"normalizedCountyName\":\"Boone\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Hebron, Kentucky, USA\",\"location\":\"US, KY, Hebron\",\"region\":\"KY\",\"buildingCodeList\":[\"LUKZ\",\"RNRM\",\"CVG7\",\"LUKA\",\"HCN1\",\"CVG5\",\"WVG1\",\"CVG2\",\"VURA\",\"CVG1\",\"KEVA\",\"LSI3\",\"CVG121\",\"VXX2\",\"CVG9\",\"CVG3\",\"AUV1\",\"CRW11\",\"KWFS\"],\"normalizedCityName\":\"Hebron\"}","{\"normalizedStateName\":\"Ohio\",\"normalizedCountryCode\":\"USA\",\"city\":\"Springdale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OH, Springdale\",\"coordinates\":\"39.29259,-84.48168\",\"normalizedCountyName\":\"Hamilton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Springdale, Ohio, USA\",\"location\":\"US, OH, Springdale\",\"region\":\"OH\",\"buildingCodeList\":[\"CVG91\",\"SOH2\",\"PCI2\"],\"normalizedCityName\":\"Springdale\"}"],"normalized_location":"Springdale, Ohio, USA","optional_search_labels":[],"posted_date":"October 31, 2025","preferred_qualifications":"- MBA\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, KY, Hebron - 151,200.00 - 204,600.00 USD annually\u003cbr/\u003eUSA, MA, WESTBOROUGH - 151,200.00 - 204,600.00 USD annually\u003cbr/\u003eUSA, MA, Westborough - 151,200.00 - 204,600.00 USD annually\u003cbr/\u003eUSA, OH, Springdale - 151,200.00 - 204,600.00 USD annually\u003cbr/\u003eUSA, TN, NASHVILLE - 143,700.00 - 194,300.00 USD annually\u003cbr/\u003eUSA, TN, Nashville - 143,700.00 - 194,300.00 USD annually\u003cbr/\u003eUSA, TN, Nashville - 151,200.00 - 204,600.00 USD annually\u003cbr/\u003eUSA, WA, BELLEVUE - 151,200.00 - 204,600.00 USD annually\u003cbr/\u003eUSA, WA, Bellevue - 151,200.00 - 204,600.00 USD annually","primary_search_label":"fulfillment-technology-and-robotics.one-material-handling-system","source_system":"JobCreator","state":"OH","title":"Sr. Product Manager Technical - Electrical, OneMHS","university_job":null,"updated_time":"25 minutes","url_next_step":"https://account.amazon.com/jobs/3119504/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"one-material-handling-system","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of technical product or program management experience\u003cbr/\u003e- 2+ years of project management disciplines including scope, schedule, budget, quality, along with risk and critical path management experience\u003cbr/\u003e- Experience managing programs across cross functional teams, building processes and coordinating release schedules\u003cbr/\u003e- Experience in written and verbal communication with the ability to present complex technical information in a clear and concise manner to executives and non-technical leaders\u003cbr/\u003e- Experience with AI/ML technologies","business_category":"legal","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Transform how legal services are delivered at a global entertainment powerhouse. As our Technical Program Manager, you'll be at the forefront of implementing AI solutions that will reshape how legal professionals work across Prime Video, Amazon MGM Studios, Amazon Music, Audible, and Amazon Games.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Lead comprehensive deployment of AI tools across Entertainment Legal teams\u003cbr/\u003e- Design and execute tailored training programs for legal professionals\u003cbr/\u003e- Coordinate cross-functional initiatives with attorneys, engineers, and technology partners\u003cbr/\u003e- Analyze AI tool performance and identify opportunities for process optimization\u003cbr/\u003e- Develop technical documentation and user guides to support AI solution adoption\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour day will be a dynamic blend of technical innovation and strategic collaboration. You'll dive into AI tool deployment, work closely with legal professionals, and bridge the gap between complex technology and practical legal solutions. Expect to engage in cross-functional meetings, design training programs, and continuously explore how AI can streamline legal workflows.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe are a forward-thinking legal organization committed to leveraging technology to enhance our service delivery. Our team supports some of the most innovative entertainment brands globally, and we're passionate about using AI to transform traditional legal practices. You'll be working alongside attorneys, engineers, and technology experts who are committed to pushing the boundaries of legal technology.","department_cost_center":null,"description_short":"Transform how legal services are delivered at a global entertainment powerhouse. As our Technical Program Manager, you'll be at the forefront of implementing AI solutions that will reshape how legal professionals","display_distance":null,"id":"27927e14-da0b-403f-a525-17252aacd45f","id_icims":"3169097","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Technical Program Management","job_function_id":null,"job_path":"/en/jobs/3169097/technical-program-manger-ai-transformation-amazon-entertainment-legal","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Culver City\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Culver City\",\"coordinates\":\"34.02202,-118.39589\",\"normalizedCountyName\":\"Los Angeles\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Culver City, California, USA\",\"location\":\"US, CA, Culver City\",\"region\":\"CA\",\"buildingCodeList\":[\"LAX22\"],\"normalizedCityName\":\"Culver City\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA40\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"January 28, 2026","preferred_qualifications":"- Bachelor's degree in engineering, computer science or equivalent\u003cbr/\u003e- Experience developing, deploying and managing AI products at scale\u003cbr/\u003e- Experience in legal and regulatory environment of internet, software, and media industries\u003cbr/\u003e- Experience with analytical tools and ability to dive deep into metrics and reporting\u003cbr/\u003e- Familiarity with legal, contracting, or procurement workflows\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Culver City - 127,100.00 - 172,000.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 127,100.00 - 172,000.00 USD annually","primary_search_label":"legal.team-legal-technology","source_system":"JobCreator","state":"WA","title":"Technical Program Manger, AI Transformation, Amazon Entertainment Legal","university_job":null,"updated_time":"28 minutes","url_next_step":"https://account.amazon.com/jobs/3169097/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-legal-technology","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- PhD in economics or equivalent\u003cbr/\u003e- Experience distilling informal customer requirements into problem definitions, dealing with ambiguity and competing objectives\u003cbr/\u003e- Experience hiring and leading experienced scientists as well as having a successful record of developing junior members from academia or industry to a successful career track\u003cbr/\u003e- 5+ Years of experience building large-scale Causal Inference and AI solutions","business_category":"consumer_engagement","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"\u003cbr/\u003eThe Marketing Measurement \u0026 Performance Support (MAPS) organization is looking for a Science Manager, interested in leading a team of Economists, Data Scientists and Applied Scientists in designing a measurement system to solve one of the most challenging business problems in marketing measurement. This exceptional leader will develop solutions combining experimental evidence, observational models and decision frameworks to redefine brand marketing measurement.\u003cbr/\u003e\u003cbr/\u003eThe MAPS organization’s mission is to be the most trusted source of measurement science solutions to drive marketing investment decisions across Amazon. The MAPS team provides incrementality, efficiency measurement services and decision support to marketing stakeholders across Amazon’s Stores suit of businesses. MAPS applies industry leading causal inference models and designs experiments to measure omni-channel effectiveness of marketing campaigns from these businesses worldwide. Our outputs shape Amazon product and marketing teams’ decisions and therefore how Amazon customers see, use, and value their experience with Amazon. As a Science Manager, you will lead a team of scientists to  develop state-of-the-art models, while collaborating with other scientists, businesses, marketers, and software teams to solve key challenges facing the teams. Such challenges include measuring the incremental impact of multi-channel marketing portfolios, estimating the impact on long term inter-related customer actions, and scaling measurement solutions for WW marketplaces. Unlike many companies who buy existing off-the-shelf marketing measurement systems, we are responsible for studying, designing, and building systems to serve Amazon’s suite of businesses. Our team members have an opportunity to be on the forefront of marketing measurement thought leadership by working on some of the most difficult problems in the industry with some of the best product managers, scientists, economists and software developers in the business. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eIn this role, you will be a people manager and a technical leader in Econometric research with significant scope, impact, and high visibility. You will own developing the next generation of Causal Marketing-Mix-Media (MMM) models combining experimental evidence with observational econometric techniques. Your solution will deliver to business leaders accurate and actionable incrementality estimates and recommendations to optimize their marketing portfolio.  As a successful Science Manager, you can navigate ambiguity, lead problem solving, guide development of new frameworks, and credibly interface between technical teams and business stakeholders. You are an innovator who can push the limits on what’s scientifically possible with a razor sharp focus on measurable business impact. You will coach and guide scientists in your team across different job families including Economists, Data Scientists and Applied Scientists to grow the team’s talent and scale the impact of your work.","department_cost_center":null,"description_short":"The Marketing Measurement \u0026 Performance Support (MAPS) organization is looking for a Science Manager, interested in leading a team of Economists, Data Scientists and Applied Scientists in designing a measurement","display_distance":null,"id":"6065fe7d-0660-4b00-a27b-688bde184524","id_icims":"3171078","is_intern":null,"is_manager":null,"job_category":"Economics","job_family":"Economist","job_function_id":null,"job_path":"/en/jobs/3171078/manager-senior-economist-marketing-measurement","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA70\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"January 30, 2026","preferred_qualifications":"- Experience in applied economic analysis and with big data and machine learning or data science\u003cbr/\u003e- Experience building and growing teams of economists or machine learning scientists\u003cbr/\u003e- 5+ years of people management experience\u003cbr/\u003e- Experience with big data technologies such as AWS, Hadoop, Spark, Pig, Hive etc.\u003cbr/\u003e- Experience with scripting language (e.g., Python, Java, or R)\u003cbr/\u003e- 5+ years of applied economics or statistics experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 175,100.00 - 236,900.00 USD annually","primary_search_label":"consumer_engagement.team-customer-behavior-analytics","source_system":"JobCreator","state":"WA","title":"Manager, Senior Economist, Marketing Measurement ","university_job":null,"updated_time":"28 minutes","url_next_step":"https://account.amazon.com/jobs/3171078/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-customer-behavior-analytics","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of driving compelling creative strategy and execution at an agency or in-house creative team experience\u003cbr/\u003e- Bachelor's degree, or Bachelor of Arts degree\u003cbr/\u003e- Experience as an Copywriter within an agency\u003cbr/\u003e- Strong conceptual portfolio with proven award-winning work\u003cbr/\u003e- Experience managing small to medium-sized shoots\u003cbr/\u003e- Experience with social campaigns\u003cbr/\u003e- Experience leveraging AI tools for execution to enhance creative output","business_category":"subsidiaries","city":"Newark","company_name":"Audible, Inc.","country_code":"USA","description":"At Audible, we believe stories have the power to transform lives. It’s why we work with some of the world’s leading creators to produce and share audio storytelling with our millions of global listeners. We are dreamers and inventors who come from a wide range of backgrounds and experiences to empower and inspire each other. Imagine your future with us.\u003cbr/\u003e\u003cbr/\u003eABOUT THE ROLE\u003cbr/\u003eAudible is seeking a Senior Creative, Copywriter who is a strategic, idea-driven storyteller responsible for developing compelling, insight-led copy across all channels, from brand platforms and campaigns to social, digital, film, and experiential. They partner closely with art directors, strategists, and account teams to translate business objectives into clear, distinctive creative ideas that build brands and drive results. This role requires the ability to lead concept development, write with a strong point of view, and elevate the creative work through craft, clarity, and cultural relevance. A Senior Copywriter is expected to present work confidently to internal teams and clients, articulate creative rationale, and push thinking while staying open to feedback. They mentor junior writers, set creative standards, and help shape the voice and tone of the brands they work on. Above all, they balance big idea thinking with flawless execution, ensuring every word earns its place.\u003cbr/\u003e\u003cbr/\u003eAs an Senior Creative, Copywriter, you will...\u003cbr/\u003e- Lead the visual development of big ideas across integrated campaigns\u003cbr/\u003e- Translate strategy and insights into clear, compelling visual concepts\u003cbr/\u003e- Set and maintain a high bar for craft, originality, and execution\u003cbr/\u003e- Push work beyond the obvious through strong conceptual thinking\u003cbr/\u003e- Partner closely with art directors and other creatives to develop cohesive, idea-led work\u003cbr/\u003e- Collaborate with strategy, production, and account teams to deliver on brief\u003cbr/\u003e- Present work confidently to clients and senior leadership\u003cbr/\u003e- Incorporate feedback without compromising the creative vision\u003cbr/\u003e- Oversee copy and execution across digital, social, film, print, and experiential\u003cbr/\u003e- Ensure language consistency and brand integrity across all deliverables\u003cbr/\u003e- Stay fluent in current tools, platforms, and emerging creative formats\u003cbr/\u003e- Guide production to ensure ideas are executed with excellence\u003cbr/\u003e\u003cbr/\u003eABOUT AUDIBLE\u003cbr/\u003eAudible is the leading producer and provider of audio storytelling. We spark listeners’ imaginations, offering immersive, cinematic experiences full of inspiration and insight to enrich our customers daily lives. We are a global company with an entrepreneurial spirit. We are dreamers and inventors who are passionate about the positive impact Audible can make for our customers and our neighbors. This spirit courses throughout Audible, supporting a culture of creativity and inclusion built on our People Principles and our mission to build more equitable communities in the cities we call home.","department_cost_center":null,"description_short":"At Audible, we believe stories have the power to transform lives. It’s why we work with some of the world’s leading creators to produce and share audio storytelling with our millions of global listeners.","display_distance":null,"id":"b4989551-aba1-484b-98ee-1e1a21bf41ee","id_icims":"3156531","is_intern":null,"is_manager":null,"job_category":"Marketing \u0026 PR","job_family":"Marketing","job_function_id":null,"job_path":"/en/jobs/3156531/senior-creative-copywriter","job_schedule_type":"full-time","location":"US, NJ, Newark","locations":["{\"normalizedStateName\":\"New Jersey\",\"normalizedCountryCode\":\"USA\",\"city\":\"Newark\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NJ, Newark\",\"coordinates\":\"40.73197,-74.17421\",\"normalizedCountyName\":\"Essex\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Newark, New Jersey, USA\",\"location\":\"US, NJ, Newark\",\"region\":\"NJ\",\"buildingCodeList\":[\"EWR1\"],\"normalizedCityName\":\"Newark\"}"],"normalized_location":"Newark, New Jersey, USA","optional_search_labels":[],"posted_date":"January  9, 2026","preferred_qualifications":"- Portfolio of work that demonstrates a mix of big brand ideas, storytelling, and campaign systems\u003cbr/\u003e- Deep understanding of the evolving digital and social media landscape\u003cbr/\u003e- Experience working on entertainment, lifestyle, or consumer tech brands\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NJ, Newark - 155,400.00 - 210,300.00 USD annually","primary_search_label":"subsidiaries.team-global-audible","source_system":"JobCreator","state":"NJ","title":"Senior Creative, Copywriter","university_job":null,"updated_time":"30 minutes","url_next_step":"https://account.amazon.com/jobs/3156531/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-audible","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Electrical Engineering, Mechanical Engineering, or a related field, or 1+ years of relevant discipline work experience\u003cbr/\u003e- 1+ years of engineering, installation, or startup/commissioning of electrical and mechanical systems\u003cbr/\u003e- Qualified trades personnel Mechanical, Electrical or relevant discipline.","business_category":"aws","city":"Herndon","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"A Commissioning Project Engineer (CxPE) supports the delivery of data center capacity through managing project milestone auditing, calibration, and commissioning execution for new construction and Capital Improvement Projects (CIPP).\u003cbr/\u003e\u003cbr/\u003eThis position is part of a career development program, which aims to develop the CxPE into a Commissioning Engineer (CxE) through a three-phase mentoring program. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e The key responsibility of a Project Engineer is to develop a detailed understanding of AWS critical infrastructure. You will learn the fundamentals related to managing a commissioning project within AWS. As part of this process you will work with different team members who will introduce you to the internal project management tools. You will then progress to the on the job phase where you will participate in the on-site commissioning activities. During the phase of you will support the Lead Commissioning Engineers (CxE) with managing a project from beginning to end.\u003cbr/\u003e\u003cbr/\u003e- Manage the creation of projects within internal Amazon systems.\u003cbr/\u003e- Manage the administrative task related to the commissioning process.\u003cbr/\u003e- Support the Request for Quote process, ensuring all relevant documentation is available for the commissioning vendors to provide a detailed quote.\u003cbr/\u003e- Manage the required vendor project deliverables ensuring on time delivery for the CxE's review.\u003cbr/\u003e- Manage project resourcing ensuring all vendors comply with the Leads Qualification Process (LQP).\u003cbr/\u003e- Create and manage the approval of the Change Management requests for the commissioning activities of the assigned project\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e \u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003e#DCCD_AMER\u003cbr/\u003e","department_cost_center":null,"description_short":"A Commissioning Project Engineer (CxPE) supports the delivery of data center capacity through managing project milestone auditing, calibration, and commissioning execution for new construction and Capital","display_distance":null,"id":"7ac01666-d6cd-4d09-8be7-c61d6ad3411b","id_icims":"3171074","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3171074/commissioning-project-engineer-amer-east-acx","job_schedule_type":"full-time","location":"US, VA, Herndon","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD31\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Herndon, Virginia, USA","optional_search_labels":["aws.team-dc","aws.team-ais","military-tech","military"],"posted_date":"January 30, 2026","preferred_qualifications":"- Manage the creation of projects within internal Amazon systems and administrative tasks related to the Cx process\u003cbr/\u003e- Support the Request for Quote process, ensuring all relevant documentation is available for the commissioning vendors to provide a detailed quote.\u003cbr/\u003e- Manage the required vendor project deliverables ensuring on time delivery for the CxE's review.\u003cbr/\u003e- Manage project resourcing ensuring all vendors comply with the Leads Qualification Process (LQP).\u003cbr/\u003e- Create and manage the approval of the Change Management requests for the commissioning activities of the assigned project.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Herndon - 96,000.00 - 166,300.00 USD annually","primary_search_label":"aws.team-program-management-primary","source_system":"JobCreator","state":"VA","title":"Commissioning Project Engineer, AMER-East ACx","university_job":null,"updated_time":"32 minutes","url_next_step":"https://account.amazon.com/jobs/3171074/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-program-management-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of engineering, installation, or startup/commissioning of electrical and mechanical systems experience\u003cbr/\u003e- Bachelor's degree in Mechanical or Electrical Engineering, or 3+ years of relevant discipline work experience\u003cbr/\u003e- 1+ years of field level project support/execution","business_category":"aws","city":"Herndon","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Are you experienced in Critical Infrastructure Commissioning and looking for a fast paced  environment to work in? As a Data Center Commissioning Engineer (CxE), you will be part of highly creative, efficient team tasked with tackling fascinating and challenging problems building and supporting the operations of Amazon owned data centers. The Amazon Commissioning team (ACx) understands, evaluates, defines and manages the expectations of construction quality in accordance to engineering designs to meet the customer requirements. The CxE is responsible for supporting vendors, contractors, and other teams involved in the construction and commissioning of various systems such as:\u003cbr/\u003e\u003cbr/\u003e- Medium and low voltage power systems\u003cbr/\u003e- Generators\u003cbr/\u003e- UPS\u003cbr/\u003e- HVAC (Air Handlers / Exhaust Fans / VFD)\u003cbr/\u003e- Chilled Water Systems\u003cbr/\u003e- Building Management systems (BMS)\u003cbr/\u003e- Electrical Power Monitoring Systems (EPMS)\u003cbr/\u003e- Testing and balancing\u003cbr/\u003e- Pumps and Hydronic systems\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs the Commissioning Engineer (CxE), you will provide testing and validation oversight of AWS data center electrical and mechanical infrastructure. This includes, but not limited to, review of design documents and equipment submittals, leading Factory Witness Testing (FWT), and managing third-party commissioning vendors in the performance of onsite pre-functional, functional, and integrated systems testing. You will own your projects’ successes where you Deep Dived to resolve technical issues and had Bias for Action to address schedule impacts and coordination demands onsite. You will be sharing your lessons learned leading towards team growth and program improvements.\u003cbr/\u003e\u003cbr/\u003eYou will get the opportunity to provide multi-discipline input into the scheduling, test script development, designing, and planning of projects. During commissioning, you will be continuously auditing Cx vendors’ activities to ensure compliance with environmental, quality, and safety requirements. Following the AWS project reporting format, you will be responsible for regular reporting of commissioning progress and metrics of assigned project to your Regional Commissioning Manager. You will have the opportunity to lead several projects simultaneously to achieve key milestones and deliver data center capacity, while managing project budget as approved by Finance.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eOn a typical project, the CxE works across AWS engineering, capacity delivery, operations, and contractor teams to coordinate site activities, prioritize tasks, and ensure each issue has clear path to resolution. The CxE manages the project commissioning vendor whose primary scope is to execute functional tests, identify issues, determine criticality, propose solutions, and document their findings. If project turnover is at risk, the CxE escalates to the appropriate stakeholders. Upon project completion, the CxE will communicate lessons learned to help peers on similar projects in flight and participate in initiatives that drive improvement to the commissioning program.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe AWS Data Center Commissioning Team (ACx) is a wholly independent business within the DCGS organization. This team of veteran professional Electrical Engineers, Mechanical Engineers, Controls Engineers, Project Managers, and Operators is uniquely positioned to provide detailed engineering and operational review and testing of equipment designs, operational functionality and construction practices. The team is focused on ensuring the rapid delivery of a quality product while maintaining full transparency, recording metrics of any and every defect discovered during commissioning.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e \u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003e#DCCD_AMER\u003cbr/\u003e","department_cost_center":null,"description_short":"Are you experienced in Critical Infrastructure Commissioning and looking for a fast paced  environment to work in? As a Data Center Commissioning Engineer (CxE), you will be part of highly creative, efficient","display_distance":null,"id":"301368a6-f389-49bd-828e-3e4c5ade2b9f","id_icims":"3171071","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Infrastructure Eng","job_function_id":null,"job_path":"/en/jobs/3171071/commissioning-engineer-data-center-commissioning","job_schedule_type":"full-time","location":"US, VA, Herndon","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD31\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Herndon, Virginia, USA","optional_search_labels":["aws.team-ais","aws.team-dc","military"],"posted_date":"January 30, 2026","preferred_qualifications":"- Knowledge of Microsoft Office products and applications (Excel, PowerPoint, Word, Visio, and MS Project) at an advanced level\u003cbr/\u003e- Experience that includes strong analytical skills, attention to detail, and effective communication abilities\u003cbr/\u003e- Experience understanding electrical and mechanical systems involved in critical data center operations including systems such as feeders, transformers, generators, switch gear, UPS systems, ATS units, PDU units, chillers, pumps, or air handling units\u003cbr/\u003e- Experience reading and editing construction documents (design drawings, control diagrams, specifications, etc.)\u003cbr/\u003e- Experience developing and executing test procedures for mechanical or electrical systems/components based on design intent and approved equipment submittals\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Herndon - 96,600.00 - 160,000.00 USD annually","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"VA","title":"Commissioning Engineer, Data Center Commissioning","university_job":null,"updated_time":"33 minutes","url_next_step":"https://account.amazon.com/jobs/3171071/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}