{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 1+ years of data center or mission critical facilities (example: hospital, military facility, public safety facility, etc.) experience\u003cbr/\u003e- 1+ years of electrical or mechanical experience\u003cbr/\u003e- Associate degree or Technical (Military/ Trade School) Certification in related field","business_category":"aws","city":"Manassas","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":" At Amazon, we're working to be the most customer-centric company on earth! Amazon is a place where builders can build. We hire the world's brightest minds and offer them an environment in which they can invent and innovate to improve the experience for our customers. If you'd like to help us build a place where you can find and buy anything online, this is the job for you. We are currently seeking a Nondestructive Testing Engineer to serve as a technical resource within Amazon data centers.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will possess the ability to design, develop, and deploy innovative solutions to address operational challenges. This role requires both independent contribution as well as the ability to work within multi-disciplinary teams. The scope of projects will include but is not limited to the improvement of electrical, mechanical, fire detection, and building automation systems. A fundamental understanding of these systems is required, as the individual will be expected to identify areas for improvement as well as act on data provided from other teams and organizations.\u003cbr/\u003eIf you are passionate about the Customer Experience; you think and act globally; and you want to contribute to the operational excellence of Amazon.com data centers, then this may be a challenge for you! Those with critical data center environment experience are strongly encouraged to apply.\u003cbr/\u003e\u003cbr/\u003eAs the Nondestructive Testing Engineer, you are expected to oversee medium sized projects from conception to completion. These will involve large amounts of independent work as well as collaboration with internal and external stakeholders. In the Nondestructive Testing Engineer role, you are expected to delight the customer by building trust and delivering on key milestones. Above all else, you will drive a culture of safety and security while maintaining a focus on availability.\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Safety Ambassador responsible for driving a culture of safety and promoting a safe working environment for all.\u003cbr/\u003e- Remain cognizant of, and act in compliance with, all security protocols while motivating others to do the same.\u003cbr/\u003e- Utilize internal CMMS to schedule and oversee the day-to-day execution of Nondestructive Testing preventative maintenance across all regional data centers.\u003cbr/\u003e- Act as an escalation point for all safety, security and facilities-related issues as it relates to your assigned work, escalating to your manager as required.\u003cbr/\u003e- Deploy and support all existing and new standard practices for Nondestructive Testing.\u003cbr/\u003e- Communicate complex technical information to a non-technical audience.\u003cbr/\u003e- Interact with engineers, technicians, project managers and management daily.\u003cbr/\u003e- Work with engineers to develop detailed and creative solutions to complex problems, while keeping a watchful eye on timelines and costs.\u003cbr/\u003e- Oversee projects and provide solutions for root causes of facility issues.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":" At Amazon, we're working to be the most customer-centric company on earth! Amazon is a place where builders can build. We hire the world's brightest minds and offer them an environment in which they can","display_distance":null,"id":"81bdfc4c-518e-4046-82a7-0ff000b7b5d1","id_icims":"3108260","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3108260/non-destructive-testing-engineer-electrical-services-team","job_schedule_type":"full-time","location":"US, VA, Manassas","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Manassas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Manassas\",\"coordinates\":\"38.75125,-77.47086\",\"normalizedCountyName\":\"Manassas (City)\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Manassas, Virginia, USA\",\"location\":\"US, VA, Manassas\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD443\",\"IAD35\",\"DCA72\",\"IAD612\",\"IAD96\",\"IAD590\",\"IAD113\",\"IAD49\",\"IAD19\",\"IAD97\",\"IAD52\",\"IAD112\",\"IAD944\",\"IAD95\",\"IAD111\",\"IAD100\",\"IAD84\",\"IAD442\",\"IAD914\",\"IAD445\",\"IAD109\",\"IAD7\",\"IAD130\",\"IAD314\",\"IAD85\",\"IAD46\",\"IAD224\",\"IAD132\",\"IAD110\",\"IAD607\",\"IAD107\",\"IAD523\",\"IAD223\",\"IAD193\",\"MAK7\",\"IAD516\",\"IAD47\",\"IAD101\",\"IAD24\",\"IAD211\",\"DVA5\",\"IAD59\",\"DCA080\",\"IAD236\",\"IAD75\",\"IAD447\",\"IAD34\",\"IAD441\",\"IAD444\",\"IAD235\",\"IAD449\",\"IAD104\",\"IAD43\",\"IAD221\",\"IAD521\",\"IAD518\",\"IAD218\",\"IAD105\",\"IAD44\",\"IAD520\",\"IAD220\",\"HWY120\",\"IAD519\",\"IAD74\",\"IAD11\",\"IAD103\",\"IAD14\",\"IAD39\",\"IAD598\",\"IAD234\",\"IAD73\",\"IAD133\",\"IAD448\",\"IAD237\",\"IAD248\",\"IAD87\",\"IAD517\",\"IAD322\",\"IAD106\",\"IAD522\",\"IAD307\",\"IAD446\",\"IAD515\",\"IAD440\",\"IAD38\",\"IAD102\",\"IAD210\",\"IAD524\",\"IAD216\",\"IAD108\",\"IAD370\",\"IAD238\",\"IAD77\",\"IAD846\",\"IAD225\",\"IAD131\",\"DCA73\",\"IAD247\",\"IAD20\",\"IAD594\",\"IAD194\",\"IAD48\",\"IAD222\",\"IAD45\"],\"normalizedCityName\":\"Manassas\"}"],"normalized_location":"Manassas, Virginia, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"October 14, 2025","preferred_qualifications":"- Understanding of basic physical concepts, to include: optics, thermodynamics, electromagnetism, and material science\u003cbr/\u003e- 1-2 years of relevant work experience in any Non-Destructive Testing Discipline\u003cbr/\u003e- Hold a ASNT level II in a Non-Destructive Testing Discipline\u003cbr/\u003e- Ability to recognize safety concerns and maintain a safe work environment in accordance with NFPA 70e guidelines\u003cbr/\u003e- Strong project management skills, verbal and written communication skills, vendor relationship management skills\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, MANASSAS - 32.00 - 57.00 USD hourly\u003cbr/\u003eUSA, VA, Manassas - 32.00 - 57.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"VA","title":"Non-Destructive Testing Engineer, Electrical Services Team","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3108260/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of tax, finance or a related analytical field experience\u003cbr/\u003e- Bachelor's degree in finance, accounting, business, economics, or a related analytical field (e.g., engineering, math, computer science)\u003cbr/\u003e- Experience delivering forecasting, budgeting, and variance analysis, and data interpretation of results","business_category":"finance","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"As a Finance Manager on the Books FP\u0026A team, you will play a critical role in driving financial planning, analysis, and business partnership for Amazon's worldwide Books business. You'll collaborate with business leaders to provide financial insights, develop forecasts, analyze financial metrics, and support strategic decision-making. This role requires strong analytical capabilities, excellence in delivering on complex, multi-pronged workstreams, and the skill to translate complex financial data into actionable recommendations.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Lead and own key workstreams in annual financial planning, ensuring alignment with business objectives and long-term strategy\u003cbr/\u003e- Coordinate and deliver monthly/quarterly financial reporting packages with actionable insights for business leaders\u003cbr/\u003e- Implement AI and automation solutions to optimize reporting processes, reduce manual effort, and increase insights\u003cbr/\u003e- Seek out and drive adoption of best practices, reporting tools, and training resources that improve operational efficiency across teams and enhance analytical capabilities\u003cbr/\u003e- Design and deliver process improvements for month-end and quarter-end close activities, focused on accuracy, consistency, and efficiency in financial reporting\u003cbr/\u003e- Proactively collaborate with accounting and cross-functional finance teams to ensure timely and accurate financial reporting\u003cbr/\u003e- Lead ad hoc analytical projects that require cross-functional collaboration across FP\u0026A, BI/technology teams, and other finance teams.","department_cost_center":null,"description_short":"As a Finance Manager on the Books FP\u0026A team, you will play a critical role in driving financial planning, analysis, and business partnership for Amazon's worldwide Books business. You'll collaborate with","display_distance":null,"id":"1ebb84f2-3e08-4740-ade2-8c237acd9892","id_icims":"3138730","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/Planning","job_function_id":null,"job_path":"/en/jobs/3138730/finance-manager-ww-books-digital-content-finance","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA22\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"December  8, 2025","preferred_qualifications":"- MBA, or CPA\u003cbr/\u003e- Experience in creating process improvements with automation and analysis\u003cbr/\u003e- Experience communicating results to senior leadership\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 95,400.00 - 163,200.00 USD annually","primary_search_label":"finance.team-consumer","source_system":"JobCreator","state":"WA","title":"Finance Manager, WW Books \u0026 Digital Content Finance","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3138730/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-consumer","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in a multi-site environment\u003cbr/\u003e- Bachelor's degree in environmental engineering, chemical engineering, environmental science or related field\u003cbr/\u003e- 5+ years of experience in air quality compliance, specifically with stationary diesel generators\u003cbr/\u003e- Strong knowledge of EPA and state regulations governing diesel generator emissions","business_category":"aws","city":"Herndon","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join a diverse, dynamic, and enthusiastic team of environmental compliance professionals who play a leading role in air quality permitting and compliance at Amazon Web Services (AWS), where we have a history of leading the world in innovative technologies and services. As a member of the Air Permitting team, you will support environmental programs aimed at ensuring compliance with air quality regulations and standards in the Americas while also enabling AWS's growth around the world.\u003cbr/\u003e\u003cbr/\u003eAs an Air Compliance Regional Environmental Engineer (REE), your primary focus will be serving as the air quality compliance subject matter expert (SME) across the Americas region, providing programmatic oversight and ensuring alignment of compliance practices across all AWS data centers. You will work closely with other REEs, operations teams, environmental consultants, and regulatory agencies to ensure consistent application of air quality compliance programs, particularly those related to tier 4 compliant diesel generators. You'll be responsible for developing and maintaining compliance systems and best practices that support AWS growth in the Americas, collaborating with partner teams throughout the data center operational lifecycle. Your role will involve providing technical expertise on local, state, and federal air regulations, establishing standardized audit protocols, developing emissions testing programs, and creating strategies for continuous improvement in air quality management. As the team's air compliance SME, you will support REEs across the region to resolve complex air compliance challenges and drive environmental performance. You will also play a key role in standardizing incident response and reporting protocols related to air quality events.\u003cbr/\u003eThe successful candidate will have extensive knowledge of air quality compliance programs and regulatory requirements in North America, demonstrated ability to develop and standardize complex compliance systems across multiple jurisdictions, and proven experience leading air quality initiatives that drive environmental performance and sustainability. The ideal candidate will excel at providing strategic guidance while maintaining strong attention to technical details and have a track record of successfully collaborating with diverse stakeholders to implement environmental compliance programs at scale.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Lead air quality compliance programs focused on Tier 4 diesel generator operations across multiple data center locations in the United States.\u003cbr/\u003e- Manage and oversee compliance with federal, state, and local air quality regulations related to emergency backup power systems.\u003cbr/\u003e- Ensure compliance with EPA regulations including 40 CFR 60 Subpart IIII (Standards of Performance for Stationary Compression Ignition Internal Combustion Engines).\u003cbr/\u003e- Develop and implement air quality monitoring programs and compliance tracking systems for diesel generators.\u003cbr/\u003e- Coordinate with environmental consultants and testing firms to complete required emissions testing and verify compliance.\u003cbr/\u003e- Provide technical guidance on air quality compliance requirements. \u003cbr/\u003e- Conduct periodic compliance audits of diesel generator operations and oversee corrective action implementation.\u003cbr/\u003e- Support emergency response planning related to air quality incidents.\u003cbr/\u003e- Collaborate with the air permitting team and Regional Environmental Engineers to ensure operational compliance with existing permit conditions.\u003cbr/\u003e- Stay current with evolving air quality regulations and industry best practices for diesel generator management.\u003cbr/\u003e- Develop and deliver air quality compliance training for relevant staff.\u003cbr/\u003e- Establish and track key performance indicators (KPIs) for air quality compliance.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services (AIS) owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e","department_cost_center":null,"description_short":"Join a diverse, dynamic, and enthusiastic team of environmental compliance professionals who play a leading role in air quality permitting and compliance at Amazon Web Services (AWS), where we have a history","display_distance":null,"id":"831e90db-ab68-4920-b283-131d817dd145","id_icims":"3103862","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3103862/regional-environmental-engineer-air-compliance-aws-environmental","job_schedule_type":"full-time","location":"US, VA, Herndon","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Berwick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Berwick\",\"coordinates\":\"41.05089,-76.24352\",\"normalizedCountyName\":\"Columbia\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Berwick, Pennsylvania, USA\",\"location\":\"US, PA, Berwick\",\"region\":\"PA\",\"buildingCodeList\":[\"PHL100\"],\"normalizedCityName\":\"Berwick\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD31\"],\"normalizedCityName\":\"Herndon\"}","{\"normalizedStateName\":\"Maryland\",\"normalizedCountryCode\":\"USA\",\"city\":\"Frederick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MD, Frederick\",\"coordinates\":\"39.41574,-77.41203\",\"normalizedCountyName\":\"Frederick\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Frederick, Maryland, USA\",\"location\":\"US, MD, Frederick\",\"region\":\"MD\",\"buildingCodeList\":[\"IAD245\"],\"normalizedCityName\":\"Frederick\"}"],"normalized_location":"Herndon, Virginia, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"October  7, 2025","preferred_qualifications":"- 3+ years of managing stakeholders in cross-functional project experience\u003cbr/\u003e- Experience leading change in multiple site environments and influenceing those that are not direct reports or within your organization\u003cbr/\u003e- Experience in project management including resource planning, managing schedules, reporting project status and prioritizing tasks\u003cbr/\u003e- Experience with data center or critical infrastructure operations\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MD, Frederick - 109,700.00 - 183,300.00 USD annually\u003cbr/\u003eUSA, PA, Berwick - 109,700.00 - 183,300.00 USD annually\u003cbr/\u003eUSA, VA, Herndon - 109,700.00 - 183,300.00 USD annually","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"VA","title":"Regional Environmental Engineer, Air Compliance, AWS Environmental","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3103862/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of computer networking experience\u003cbr/\u003e- 1+ years of Linux operating systems experience\u003cbr/\u003e- Bachelor's degree in Information Technology, Computer Science, or a related field\u003cbr/\u003e- Experience in computer networking\u003cbr/\u003e- Experience working with Linux operating systems\u003cbr/\u003e- Can lift and rack equipment up to 40 pounds\u003cbr/\u003e- Experience with computer hardware troubleshooting and repair","business_category":"aws","city":"Canton","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring seamless data center operations that power millions of businesses and services worldwide. \u003cbr/\u003eData Center Technician position involves in-depth hardware and network diagnostics followed by physical repair as well as participating in an on-call rotation. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e-Performing server rack installations, hardware break-fix on various components, troubleshooting network issues, responding to operational incidents that impact service availability, and carrying out routine network, server hardware, and operating system repairs to contribute to the overall availability of AWS services \u003cbr/\u003e-Serving as a primary contact point for both internal and external stakeholders, including engineers, software developers, vendors, and contractors \u003cbr/\u003e-Performing on-call duties and participating in scheduled maintenance and change management activities \u003cbr/\u003e-Contributing to documentation and process improvement initiatives based on your analysis of operational issues \u003cbr/\u003e-Helping to interview, train and onboard new team members \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e-Lifting and moving material up to 40 pounds each \u003cbr/\u003e-Working in cramped and/or elevated locations \u003cbr/\u003e-Bending, lifting, stretching, and reaching \u003cbr/\u003e-Standing and walking for up to 8+ hours a day \u003cbr/\u003e-Ascending and descending ladders, stairs, and gangways safely and without limitation \u003cbr/\u003e\u003cbr/\u003eWork in an industrial environment \u003cbr/\u003e-Work shifts longer than 8 hours to support 24/7 operations (covering both night and day shifts). \u003cbr/\u003e-This role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e-Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e-Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e-Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eOur Data Center Technician professionals, who have industry-leading technical abilities and demonstrate a breadth of knowledge while they: \u003cbr/\u003e\u003cbr/\u003e-Take ownership of technical issues brought by their customer base, engaging other teams when needed to drive resolution \u003cbr/\u003e-Show a strong aptitude for troubleshooting and problem solving \u003cbr/\u003e-Solve problems at their root and step back to understand the broader context \u003cbr/\u003e-Maintain service level agreements through the implementation of proactive issue detection and reporting \u003cbr/\u003e-Are biased to act in the absence of direction or support \u003cbr/\u003e-Improve effectiveness through process innovation \u003cbr/\u003e\u003cbr/\u003e You will be required to work shift work that will include days/nights/weekends/holidays. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring","display_distance":null,"id":"03067445-9a23-4314-92a0-f6ce2ec63f8f","id_icims":"3152006","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3152006/data-center-technician","job_schedule_type":"full-time","location":"US, MS, Canton","locations":["{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Canton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Canton\",\"coordinates\":\"32.61258,-90.03472\",\"normalizedCountyName\":\"Madison\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Canton, Mississippi, USA\",\"location\":\"US, MS, Canton\",\"region\":\"MS\",\"buildingCodeList\":[\"JAN200\"],\"normalizedCityName\":\"Canton\"}"],"normalized_location":"Canton, Mississippi, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"January  5, 2026","preferred_qualifications":"- Can work in cramped spaces or in elevated locations while adhering to health \u0026 safety guidelines\u003cbr/\u003e- Experience dealing effectively with customers during problem resolution and operating efficiently under pressure\u003cbr/\u003e- Experience managing work and priorities through a ticketing system\u003cbr/\u003e- Experience with cabling infrastructure best practices and methodologies\u003cbr/\u003e- Experience working in a data center environment (racking and stacking gear, cable management, hot/cold aisle containment)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MS, Canton - 26.00 - 47.00 USD hourly","primary_search_label":"aws.team-it-services","source_system":"JobCreator","state":"MS","title":"Data Center Technician ","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3152006/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-it-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school diploma, or equivalent\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.\u003cbr/\u003e- 1+ years of computer/server hardware troubleshooting or related IT experience\"","business_category":"aws","city":"Canton","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring seamless data center operations that power millions of businesses and services worldwide. \u003cbr/\u003e \u003cbr/\u003eData Center Technicians should be willing to work both independently and with a team. Work prioritization, organizational skills, effective communication, and the ability to react quickly are critical to success. In addition to hardware and network repair, candidates will install equipment, create documentation, innovate solutions, and fix problems within the data center space. This team works in an environment that operates 24/7. Traveling within and outside of the regional work area is required. \u003cbr/\u003e \u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e-Performing server rack installations, hardware break-fix on various components, troubleshooting network issues, and responding to operational incidents that impact service availability, escalating to senior technicians and management as needed/required \u003cbr/\u003e-Serving as a primary contact point for both internal and external stakeholders, including engineers, software developers, vendors, and contractors \u003cbr/\u003e-Performing on-call duties and participating in scheduled maintenance and change management activities \u003cbr/\u003e-Contributing to documentation and process improvement initiatives based on your analysis of operational issues \u003cbr/\u003e-Helping to train and onboard new team members \u003cbr/\u003e\u003cbr/\u003ePhysical requirements: \u003cbr/\u003e\u003cbr/\u003e-Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds \u003cbr/\u003e-Working in cramped and/or elevated locations \u003cbr/\u003e-Bending, lifting, stretching, and reaching \u003cbr/\u003e-Standing and walking for up to 8+ hours a day \u003cbr/\u003e-Ascending and descending ladders, stairs, and gangways safely and without limitation \u003cbr/\u003e-Work in a noisy environment \u003cbr/\u003e-Work shifts longer than 8 hours to support 24/7 operations (covering both night and day shifts). \u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e-Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e-Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e-Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Data Center Technician professional, you have industry-leading technical abilities and demonstrate a breadth of knowledge while you: \u003cbr/\u003e-Take ownership of technical issues brought by their customer base, engaging other teams when needed to drive resolution \u003cbr/\u003e-Solve problems at their root and step back to understand the broader context \u003cbr/\u003e-Maintain service level agreements through the implementation of proactive issue detection and reporting \u003cbr/\u003e\u003cbr/\u003eYou will be required to work shift work that will include days/nights/weekends/holidays. Traveling within and outside of the regional work area is required. You will be responsible for having a reliable personal vehicle and valid driver's license to travel within the regional work area, as company transportation will not be provided. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring","display_distance":null,"id":"c68309a9-3a17-4250-9b11-80d54c9e7f18","id_icims":"3151134","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3151134/data-center-technician","job_schedule_type":"full-time","location":"US, MS, Canton","locations":["{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Canton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Canton\",\"coordinates\":\"32.61258,-90.03472\",\"normalizedCountyName\":\"Madison\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Canton, Mississippi, USA\",\"location\":\"US, MS, Canton\",\"region\":\"MS\",\"buildingCodeList\":[\"JAN200\"],\"normalizedCityName\":\"Canton\"}"],"normalized_location":"Canton, Mississippi, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"January  2, 2026","preferred_qualifications":"- Experience in data center\u003cbr/\u003e- \"Experience managing work and priorities through a ticketing system\u003cbr/\u003e- An Associate’s degree, technical certification, or equivalent professional or military experience in a relevant field (e.g., computer science, networking engineering, etc.)\u003cbr/\u003e- Understanding of network design, protocols and layer 1/2 troubleshooting\"\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MS, Canton - 24.00 - 42.00 USD hourly","primary_search_label":"aws.team-it-services","source_system":"JobCreator","state":"MS","title":"Data Center Technician","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3151134/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-it-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of engineering team management experience\u003cbr/\u003e- 7+ years of engineering experience\u003cbr/\u003e- 8+ years of leading the definition and development of multi tier web services experience\u003cbr/\u003e- 3+ years of Software Engineer, Software Developer, or related occupational experience\u003cbr/\u003e- 1+ years of providing technical leadership and project management for all aspects of the software development lifecycle experience\u003cbr/\u003e- 1+ years of developing large-scale, multi-tiered distributed software systems using Java, C#, or C++ experience\u003cbr/\u003e- 1+ years of developing large-scale, multi-tiered distributed software systems using service-oriented architecture experience\u003cbr/\u003e- 1+ years of developing large-scale, multi-tiered distributed software systems using distributed programming experience\u003cbr/\u003e- Bachelor's degree or foreign equivalent in Computer Science, Engineering, Mathematics, or a related field\u003cbr/\u003e- Knowledge of engineering practices and patterns for the full software/hardware/networks development life cycle, including coding standards, code reviews, source control management, build processes, testing, certification, and livesite operations\u003cbr/\u003e- Experience partnering with product or program management teams","business_category":"aws","city":"Arlington","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Web Services (AWS) provides companies of all sizes with an infrastructure web services platform in the cloud. With AWS, you can requisition compute power, storage, and other services – paying as you go for only the resources you need. Within AWS, our Catalog solutions span Glue Data Catalog, Lake Formation, and DataZone. We offer customers a comprehensive inventory of an organization's assets, enrich this view through metadata, and provide data discovery, governance, trust, and query routing functionality. Catalogs are at the forefront of modern Analytics, acting as the bridge between the consumption layer and data services. They effectively enable Engines to query information and allow humans and AI to find semantic meaning in data. Our suite of Catalog services make it easy to set up a secure data lake in days. A data lake is a centralized, curated, and secured repository that stores all your data, both in its original form and prepared for analysis. A data lake enables you to break down data silos and combine different types of analytics to gain insights and guide better business decisions.\u003cbr/\u003e\u003cbr/\u003eJoining the AWS Catalog organization gives you the opportunity to:\u003cbr/\u003e- Work on a disruptive product that’s still in its early stages\u003cbr/\u003e- Solve challenging problems that will revolutionize database computing in the cloud\u003cbr/\u003e- Build a product that will leverage the scale of resources available in the cloud\u003cbr/\u003e- Work for a company that’s a recognized leader in the cloud computing space\u003cbr/\u003e- Be involved in the fast growing, big data space\u003cbr/\u003e\u003cbr/\u003eWe are looking for a software development manager with expertise and passion for building large-scale data-intensive systems and distributed systems. In particular, we are looking for software development manager who want to work on the next generation big data systems that will transform data management on AWS and across the industry.\u003cbr/\u003e\u003cbr/\u003eExperience with large scale data analytics, big data platforms, highly available/fault tolerant systems, replicated data storage, and operating complex services running in the cloud are all pluses.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eIn this role, you will have responsibility for:\u003cbr/\u003e- Translating functional and technical requirements into detailed architecture and design\u003cbr/\u003e- Participating in code and design reviews to maintain our high development standards\u003cbr/\u003e- Working with other teams to deliver and operate large scale, distributed services in the cloud\u003cbr/\u003e- Overall system architecture, scalability, reliability, and performance\u003cbr/\u003e- Mentoring other engineers, defining our challenging technical culture, and helping to build a fast-growing team\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout the team\u003cbr/\u003e\u003cbr/\u003eAbout AWS\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. ","department_cost_center":null,"description_short":"Amazon Web Services (AWS) provides companies of all sizes with an infrastructure web services platform in the cloud. With AWS, you can requisition compute power, storage, and other services – paying as","display_distance":null,"id":"a22a030b-0fd8-40f8-9757-8268fd8fce80","id_icims":"3186372","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3186372/software-dev-manager-iii-amazon-sagemaker-catalog","job_schedule_type":"full-time","location":"US, VA, Arlington","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS17\"],\"normalizedCityName\":\"Arlington\"}"],"normalized_location":"Arlington, Virginia, USA","optional_search_labels":[],"posted_date":"February 20, 2026","preferred_qualifications":"- Experience in communicating with users, other technical teams, and senior leadership to collect requirements, describe software product features, technical designs, and product strategy\u003cbr/\u003e- Experience in recruiting, hiring, mentoring/coaching and managing teams of Software Engineers to improve their skills, and make them more effective, product software engineers\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Arlington - 184,900.00 - 250,200.00 USD annually","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"VA","title":"Software Dev Manager III, Amazon SageMaker Catalog","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3186372/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Work flexible schedules including weekends, nights, and holidays\u003cbr/\u003e- 18+ months of computer/server hardware troubleshooting or related IT experience\u003cbr/\u003e- 18+ months of computer layer 1/2 networking experience (including troubleshooting and repair)\"","business_category":"aws","city":"Canton","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring seamless data center operations that power millions of businesses and services worldwide. \u003cbr/\u003eData Center Technician position involves in-depth hardware and network diagnostics followed by physical repair as well as participating in an on-call rotation. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e-Performing server rack installations, hardware break-fix on various components, troubleshooting network issues, responding to operational incidents that impact service availability, and carrying out routine network, server hardware, and operating system repairs to contribute to the overall availability of AWS services \u003cbr/\u003e-Serving as a primary contact point for both internal and external stakeholders, including engineers, software developers, vendors, and contractors \u003cbr/\u003e-Performing on-call duties and participating in scheduled maintenance and change management activities \u003cbr/\u003e-Contributing to documentation and process improvement initiatives based on your analysis of operational issues \u003cbr/\u003e-Helping to interview, train and onboard new team members \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e-Lifting and moving material up to 40 pounds each \u003cbr/\u003e-Working in cramped and/or elevated locations \u003cbr/\u003e-Bending, lifting, stretching, and reaching \u003cbr/\u003e-Standing and walking for up to 8+ hours a day \u003cbr/\u003e-Ascending and descending ladders, stairs, and gangways safely and without limitation \u003cbr/\u003e\u003cbr/\u003eWork in an industrial environment \u003cbr/\u003e-Work shifts longer than 8 hours to support 24/7 operations (covering both night and day shifts). \u003cbr/\u003e-This role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e-Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e-Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e-Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eOur Data Center Technician professionals, who have industry-leading technical abilities and demonstrate a breadth of knowledge while they: \u003cbr/\u003e\u003cbr/\u003e-Take ownership of technical issues brought by their customer base, engaging other teams when needed to drive resolution \u003cbr/\u003e-Show a strong aptitude for troubleshooting and problem solving \u003cbr/\u003e-Solve problems at their root and step back to understand the broader context \u003cbr/\u003e-Maintain service level agreements through the implementation of proactive issue detection and reporting \u003cbr/\u003e-Are biased to act in the absence of direction or support \u003cbr/\u003e-Improve effectiveness through process innovation \u003cbr/\u003e\u003cbr/\u003e You will be required to work shift work that will include days/nights/weekends/holidays. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring","display_distance":null,"id":"444ba902-ee35-4a99-b59d-70385b480077","id_icims":"3150926","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3150926/data-center-technician","job_schedule_type":"full-time","location":"US, MS, Canton","locations":["{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Canton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Canton\",\"coordinates\":\"32.61258,-90.03472\",\"normalizedCountyName\":\"Madison\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Canton, Mississippi, USA\",\"location\":\"US, MS, Canton\",\"region\":\"MS\",\"buildingCodeList\":[\"JAN200\"],\"normalizedCityName\":\"Canton\"}"],"normalized_location":"Canton, Mississippi, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"January  1, 2026","preferred_qualifications":"- Experience in a data center or other critical environment\u003cbr/\u003e- Bachelor's degree or equivalent professional or military experience in an IT-related field (e.g. computer science, network engineering, etc.)\u003cbr/\u003e- Industry standard certifications (CompTIA, CCENT, Network+)\u003cbr/\u003e- Understanding of Linux or similar operating systems\u003cbr/\u003e- Behavioral interviewing and hiring experience\u003cbr/\u003e- Experience training and onboarding of new team members\"\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MS, Canton - 26.00 - 47.00 USD hourly","primary_search_label":"aws.team-it-services","source_system":"JobCreator","state":"MS","title":"Data Center Technician ","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3150926/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-it-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school diploma, or equivalent\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.\u003cbr/\u003e- 1+ years of computer/server hardware troubleshooting or related IT experience\"","business_category":"aws","city":"Canton","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring seamless data center operations that power millions of businesses and services worldwide. \u003cbr/\u003e \u003cbr/\u003eData Center Technicians should be willing to work both independently and with a team. Work prioritization, organizational skills, effective communication, and the ability to react quickly are critical to success. In addition to hardware and network repair, candidates will install equipment, create documentation, innovate solutions, and fix problems within the data center space. This team works in an environment that operates 24/7. Traveling within and outside of the regional work area is required. \u003cbr/\u003e \u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e-Performing server rack installations, hardware break-fix on various components, troubleshooting network issues, and responding to operational incidents that impact service availability, escalating to senior technicians and management as needed/required \u003cbr/\u003e-Serving as a primary contact point for both internal and external stakeholders, including engineers, software developers, vendors, and contractors \u003cbr/\u003e-Performing on-call duties and participating in scheduled maintenance and change management activities \u003cbr/\u003e-Contributing to documentation and process improvement initiatives based on your analysis of operational issues \u003cbr/\u003e-Helping to train and onboard new team members \u003cbr/\u003e\u003cbr/\u003ePhysical requirements: \u003cbr/\u003e\u003cbr/\u003e-Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds \u003cbr/\u003e-Working in cramped and/or elevated locations \u003cbr/\u003e-Bending, lifting, stretching, and reaching \u003cbr/\u003e-Standing and walking for up to 8+ hours a day \u003cbr/\u003e-Ascending and descending ladders, stairs, and gangways safely and without limitation \u003cbr/\u003e-Work in a noisy environment \u003cbr/\u003e-Work shifts longer than 8 hours to support 24/7 operations (covering both night and day shifts). \u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e-Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e-Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e-Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Data Center Technician professional, you have industry-leading technical abilities and demonstrate a breadth of knowledge while you: \u003cbr/\u003e-Take ownership of technical issues brought by their customer base, engaging other teams when needed to drive resolution \u003cbr/\u003e-Solve problems at their root and step back to understand the broader context \u003cbr/\u003e-Maintain service level agreements through the implementation of proactive issue detection and reporting \u003cbr/\u003e\u003cbr/\u003eYou will be required to work shift work that will include days/nights/weekends/holidays. Traveling within and outside of the regional work area is required. You will be responsible for having a reliable personal vehicle and valid driver's license to travel within the regional work area, as company transportation will not be provided. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring","display_distance":null,"id":"ecff99a4-b83c-4faf-845d-4f37e55a7b1b","id_icims":"3151189","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3151189/data-center-technician","job_schedule_type":"full-time","location":"US, MS, Canton","locations":["{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Canton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Canton\",\"coordinates\":\"32.61258,-90.03472\",\"normalizedCountyName\":\"Madison\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Canton, Mississippi, USA\",\"location\":\"US, MS, Canton\",\"region\":\"MS\",\"buildingCodeList\":[\"JAN200\"],\"normalizedCityName\":\"Canton\"}"],"normalized_location":"Canton, Mississippi, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"January  2, 2026","preferred_qualifications":"- Experience managing work and priorities through a ticketing system\u003cbr/\u003e- Experience working in a Data Center environment\u003cbr/\u003e- An Associate’s degree, technical certification, or equivalent professional or military experience in a relevant field (e.g., computer science, networking engineering, etc.)\u003cbr/\u003e- Understanding of network design, protocols and layer 1/2 troubleshooting\"\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MS, Canton - 24.00 - 42.00 USD hourly","primary_search_label":"aws.team-it-services","source_system":"JobCreator","state":"MS","title":"Data Center Technician","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3151189/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-it-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- Bachelor's degree in accounting, finance, business or related field\u003cbr/\u003e- Knowledge of Microsoft Office products and applications at an advanced level\u003cbr/\u003e- Experience working in a large public accounting firm or multi-national corporate tax department","business_category":"finance","city":"Mexico City","company_name":"Servicios Comerciales Amazon Mexico S. de R.L. de C.V.","country_code":"MEX","description":"Amazon is looking for an Indirect Tax Compliance Sr. Analyst that will be responsible for supporting and supervising tax compliance activities, as well as assisting with tax audits and  projects implementation for Mexico.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003ePrimary duties include:\u003cbr/\u003e\u003cbr/\u003e• Execute the day to day activities regarding indirect taxes (VAT, IEPS, MPF, ESS)\u003cbr/\u003e• Prepare, analyze and supervise filing tax returns and reporting obligations\u003cbr/\u003e• Perform tax compliance activities to support the Global team responsible for accounting, corporate and intercompany transactions\u003cbr/\u003e• Work with tax technology and FinTech teams to come up with automated solutions to the compliance process and assist with implementation to reduce manual work\u003cbr/\u003e• Developing, implementing and documenting tax compliance process improvements\u003cbr/\u003e• Provide assistance attending authorities and government agencies on assessments, audits and any relevant issues\u003cbr/\u003e• Review financial data for proper application of tax laws and transfer pricing\u003cbr/\u003e• Follow up with tax law changes and implement new processes and strategies\u003cbr/\u003e• Help coordinating and reviewing activities of contractors\u003cbr/\u003e• Update, monitor and control metrics\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003ePrimary duties include:\u003cbr/\u003e\u003cbr/\u003e· Perform tax compliance activities to support the Global team responsible for accounting, corporate and intercompany transactions.\u003cbr/\u003e· Supervise tax compliance, filing returns and reporting obligations\u003cbr/\u003e· Work with tax technology and IT teams to come up with automated solutions to the compliance process and assist with implementation.\u003cbr/\u003e· Developing, implementing and documenting tax compliance process improvements.\u003cbr/\u003e· Coordinate and manage the use of outside advisors for preparing and filing tax returns and reporting obligations.\u003cbr/\u003e· Provide assistance to local tax audits and controversy matters.\u003cbr/\u003e· Review financial data for proper application of tax laws and transfer pricing.\u003cbr/\u003e· Develop and maintain knowledge of tax laws and current developments to identify potential impacts on the Amazon business.\u003cbr/\u003e·Monitor industry positions relevant to Amazon’s Mexico business operations.\u003cbr/\u003e· Follow up with tax law changes and implement new processes and strategies.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eInclusive team culture\u003cbr/\u003e\u003cbr/\u003eAt Amazon we embrace our differences and we are committed to furthering our culture of inclusion. We host annual and ongoing learning experiences. Amazon’s culture of inclusion is reinforced within our 14 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.\u003cbr/\u003e\u003cbr/\u003eWork Life Balance\u003cbr/\u003e\u003cbr/\u003eWe believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfillment. We offer flexibility in working hours and encourage you to find your own balance between your work and personal lives.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003e\u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded professional.","department_cost_center":null,"description_short":"Amazon is looking for an Indirect Tax Compliance Sr. Analyst that will be responsible for supporting and supervising tax compliance activities, as well as assisting with tax audits and  projects implementation","display_distance":null,"id":"be4350cc-76ca-43ee-925a-b136f593e5d1","id_icims":"3169936","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Tax","job_function_id":null,"job_path":"/en/jobs/3169936/tax-compliance-sr-analyst-international-tax-compliance","job_schedule_type":"full-time","location":"MX, DIF, Mexico City","locations":["{\"normalizedStateName\":\"Mexico City\",\"normalizedCountryCode\":\"MEX\",\"city\":\"Mexico City\",\"countryIso3a\":\"MEX\",\"countryIso2a\":\"MX\",\"locationNonStemming\":\"Mexico, DIF, Mexico City\",\"coordinates\":\"19.43195,-99.13315\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Mexico\",\"normalizedLocation\":\"Mexico City, Mexico City, MEX\",\"location\":\"MX, DIF, Mexico City\",\"region\":\"DIF\",\"buildingCodeList\":[\"MEX16\"],\"normalizedCityName\":\"Mexico City\"}"],"normalized_location":"Mexico City, Mexico City, MEX","optional_search_labels":[],"posted_date":"January 29, 2026","preferred_qualifications":"- 2+ years of maintaining and operating transaction tax calculation software (e.g. Vertex) experience\u003cbr/\u003e- Knowledge of at least one data-focused technology tool, such as Python, SQL, Alteryx, Amazon QuickSight, or similar\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-fpa","source_system":"JobCreator","state":"DIF","title":"Tax Compliance Sr. Analyst, International Tax Compliance","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3169936/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fpa","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience with automation, testing, or monitoring framework development\u003cbr/\u003e- Experience in Postgres, or experience in managing and troublshooting network and experience with automation and any version control tools\u003cbr/\u003e- Experience with full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations, or experience with general troubleshooting/debugging of hardware","business_category":"amazon-artificial-general-intelligence","city":"San Francisco","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Autonomy is a research lab based in San Francisco with the charter to develop state of the art browser use agents at scale. Our research leverages Large Language Models (LLMS) and reinforcement learning (RL) algorithms at scale, and benefits from the ability to work Amazon’s scale and a startup’s agility.\u003cbr/\u003e\u003cbr/\u003eAs a Member of Technical staff (MTS), you’ll be responsible for helping develop the training environments, tasks, and integrations needed to scale our data and drive core model capabilities. You’ll work closely with our researchers and be given the autonomy to drive significant outcomes.\u003cbr/\u003e\u003cbr/\u003eThis role is for you if you have a learner’s mindset, enjoy building at the frontier of what’s possible, and thrive in a collaborative fast-paced environment. You'll be responsible for building the infrastructure + SDKs needed to integrate web applications and their associated tasks into a production RL environment, with significant concurrency limits and operational requirements.\u003cbr/\u003e\u003cbr/\u003eCore Engineering:\u003cbr/\u003e- Architect and deliver robust software solutions throughout the development lifecycle\u003cbr/\u003e\u003cbr/\u003e- Design and implement applications using modern TypeScript and Python\u003cbr/\u003e\u003cbr/\u003e- Build and deploy cloud-native applications and RESTful APIs\u003cbr/\u003e\u003cbr/\u003e- Engineer and optimize high-performance systems at scale\u003cbr/\u003e\u003cbr/\u003eCollaboration \u0026 Leadership:\u003cbr/\u003e- Collaborate with cross-functional stakeholders to deliver aligned features\u003cbr/\u003e\u003cbr/\u003e- Mentor junior engineering staff\u003cbr/\u003e\u003cbr/\u003e- Maintain technical documentation and architectural decision records","department_cost_center":null,"description_short":"Amazon Autonomy is a research lab based in San Francisco with the charter to develop state of the art browser use agents at scale. Our research leverages Large Language Models (LLMS) and reinforcement","display_distance":null,"id":"5eb73e16-81fe-436d-a3b6-168cce911b07","id_icims":"3186379","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Member of Technical Staff","job_function_id":null,"job_path":"/en/jobs/3186379/member-of-technical-staff-agi-autonomy","job_schedule_type":"full-time","location":"US, CA, San Francisco","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Francisco\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Francisco\",\"coordinates\":\"37.77702,-122.41956\",\"normalizedCountyName\":\"San Francisco\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Francisco, California, USA\",\"location\":\"US, CA, San Francisco\",\"region\":\"CA\",\"buildingCodeList\":[\"SFO19\"],\"normalizedCityName\":\"San Francisco\"}"],"normalized_location":"San Francisco, California, USA","optional_search_labels":[],"posted_date":"February 20, 2026","preferred_qualifications":"- Experience leading the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems, or experience leading engineering teams as a mentor or tech lead\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several U.S. geographic markets. The base pay for this position ranges from $150,000/year in our lowest geographic market up to $325,000/year in our highest geographic market. Pay is based on a number of factors, including market location, and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. Applicants should apply via our internal or external career site.","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":"CA","title":"Member of Technical Staff, AGI Autonomy","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3186379/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}