{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 2+ years of Microsoft Office products and applications experience\u003cbr/\u003e- 2+ years of electrical and mechanical experience\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Frederick","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e- Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"34d69b44-c3c6-4d26-8c43-809d25a04def","id_icims":"3154219","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3154219/engineering-operations-technician","job_schedule_type":"full-time","location":"US, MD, Frederick","locations":["{\"normalizedStateName\":\"Maryland\",\"normalizedCountryCode\":\"USA\",\"city\":\"Frederick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MD, Frederick\",\"coordinates\":\"39.41574,-77.41203\",\"normalizedCountyName\":\"Frederick\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Frederick, Maryland, USA\",\"location\":\"US, MD, Frederick\",\"region\":\"MD\",\"buildingCodeList\":[\"IAD532\"],\"normalizedCityName\":\"Frederick\"}"],"normalized_location":"Frederick, Maryland, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"January  7, 2026","preferred_qualifications":"- Experience working in a data center or mission critical facility (example: hospital, military facility, public safety facility, etc.)\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e- Experience with reading and writing procedures, technical documents, and engineering drawings\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MD, Frederick - 36.00 - 63.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"MD","title":"Engineering Operations Technician","university_job":null,"updated_time":"2 minutes","url_next_step":"https://account.amazon.com/jobs/3154219/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Work flexible shifts including night shifts/weekends\u003cbr/\u003e- 1+ years of electrical/mechanical/industrial water experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products","business_category":"aws","city":"Frederick","company_name":"Amazon Data Services, Inc. - A19","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tDaily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability \u003cbr/\u003e•\tMonitor Building Management Systems (BMS) and Electrical Power Management System (EPMS) \u003cbr/\u003e•\tAssist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA) \u003cbr/\u003e•\tPerform rack installs and rack decommissioning within internal SLA \u003cbr/\u003e•\tPerform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment \u003cbr/\u003e•\tTechnical writing to support change management program \u003cbr/\u003e•\tMonitor daily work requests and manage to resolution, and execute projects from conception to completion \u003cbr/\u003e•\tOn-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation \u003cbr/\u003e•\tWork schedule changes depending on specific site needs. Shifts can be up to 12 hours and may rotate on a predefined schedule. Some locations have on-call rotations. \u003cbr/\u003e•\tRole may support more than one location/site. \u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e•\tWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations: \u003cbr/\u003e•\tRegularly lift and/or move up to 39 pounds independently \u003cbr/\u003e•\tParticipate in group lifts for 40+ pounds \u003cbr/\u003e•\tMaintain balance and perform construction tasks while on a ladder \u003cbr/\u003e•\tRegularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position \u003cbr/\u003e•\tWork in an environment requiring provided ear protection \u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e•\tAbility to travel to or commute between data center locations as needed  \u003cbr/\u003e•\tWillingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e•\tTravel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. \u003cbr/\u003e","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"8cf13e10-5c96-4578-a236-8b6fa29234d3","id_icims":"3160748","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3160748/engineering-operation-technician","job_schedule_type":"full-time","location":"US, MD, Frederick","locations":["{\"normalizedStateName\":\"Maryland\",\"normalizedCountryCode\":\"USA\",\"city\":\"Frederick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MD, Frederick\",\"coordinates\":\"39.41574,-77.41203\",\"normalizedCountyName\":\"Frederick\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Frederick, Maryland, USA\",\"location\":\"US, MD, Frederick\",\"region\":\"MD\",\"buildingCodeList\":[\"IAD533\"],\"normalizedCityName\":\"Frederick\"}"],"normalized_location":"Frederick, Maryland, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"January 16, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Industrial-scale chiller plant operation\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MD, Frederick - 31.00 - 55.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"MD","title":"Engineering Operation Technician ","university_job":null,"updated_time":"3 minutes","url_next_step":"https://account.amazon.com/jobs/3160748/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 4+ years of applied research experience\u003cbr/\u003e- 3+ years of building machine learning models for business application experience\u003cbr/\u003e- PhD, or Master's degree and 6+ years of applied research experience\u003cbr/\u003e- Experience programming in Java, C++, Python or related language\u003cbr/\u003e- Experience with neural deep learning methods and machine learning","business_category":"north-america-stores","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"We are looking for a talented, organized, and customer-focused applied researchers to join our Pricing Optimization science group, with a charter to measure, refine, and launch customer-obsessed improvements to our algorithmic pricing and promotion models across all products listed on Amazon.\u003cbr/\u003e\u003cbr/\u003eThis role requires an individual with exceptional machine learning modeling and architecture expertise, excellent cross-functional collaboration skills, business acumen, and an entrepreneurial spirit. \u003cbr/\u003e\u003cbr/\u003eWe are looking for an experienced innovator, who is a self-starter, comfortable with ambiguity, demonstrates strong attention to detail, and has the ability to work in a fast-paced and ever-changing environment.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* See the big picture. Understand and influence the long term vision for Amazon's science-based competitive, perception-preserving pricing techniques\u003cbr/\u003e* Build strong collaborations. Partner with product, engineering, and science teams within Pricing \u0026 Promotions to deploy machine learning price estimation and error correction solutions at Amazon scale\u003cbr/\u003e* Stay informed. Establish mechanisms to stay up to date on latest scientific advancements in machine learning, neural networks, natural language processing, probabilistic forecasting, and multi-objective optimization techniques. Identify opportunities to apply them to relevant Pricing \u0026 Promotions business problems\u003cbr/\u003e* Keep innovating for our customers. Foster an environment that promotes rapid experimentation, continuous learning, and incremental value delivery.\u003cbr/\u003e* Successfully execute \u0026 deliver. Apply your exceptional technical machine learning expertise to incrementally move the needle on some of our hardest pricing problems.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are hiring a Sr. Applied Scientist to drive our pricing optimization initiatives. We drive cross-domain and cross-system improvements through:\u003cbr/\u003e\u003cbr/\u003e* shape and extend our RL optimization platform - a pricing centric tool that automates the optimization of various system parameters and price inputs.\u003cbr/\u003e* Error detection and price quality guardrails at scale.\u003cbr/\u003e* Identifying opportunities to optimally price across systems and contexts (marketplaces, request types, event periods)\u003cbr/\u003e\u003cbr/\u003ePrice is a highly relevant input into Stores  architectures; this role creates the opportunity to drive extremely large impact (measured in Bs not Ms), but demands careful thought and clear communication.","department_cost_center":null,"description_short":"We are looking for a talented, organized, and customer-focused applied researchers to join our Pricing Optimization science group, with a charter to measure, refine, and launch customer-obsessed improvements","display_distance":null,"id":"ec6ea6a2-5805-4a39-a684-94958ab409a9","id_icims":"3151585","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3151585/sr-applied-scientist-pricing-science","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA71\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"January  4, 2026","preferred_qualifications":"- Experience with modeling tools such as R, scikit-learn, Spark MLLib, MxNet, Tensorflow, numpy, scipy etc.\u003cbr/\u003e- Experience with large scale distributed systems such as Hadoop, Spark etc.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $150,400/year in our lowest geographic market up to $260,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"north-america-stores.pricing","source_system":"JobCreator","state":"WA","title":"Sr. Applied Scientist,  Pricing Science","university_job":null,"updated_time":"3 minutes","url_next_step":"https://account.amazon.com/jobs/3151585/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"pricing","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Work flexible shifts including night shifts/weekends\u003cbr/\u003e- 1+ years of electrical/mechanical/industrial water experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products","business_category":"aws","city":"Frederick","company_name":"Amazon Data Services, Inc. - A19","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tDaily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability \u003cbr/\u003e•\tMonitor Building Management Systems (BMS) and Electrical Power Management System (EPMS) \u003cbr/\u003e•\tAssist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA) \u003cbr/\u003e•\tPerform rack installs and rack decommissioning within internal SLA \u003cbr/\u003e•\tPerform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment \u003cbr/\u003e•\tTechnical writing to support change management program \u003cbr/\u003e•\tMonitor daily work requests and manage to resolution, and execute projects from conception to completion \u003cbr/\u003e•\tOn-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation \u003cbr/\u003e•\tWork schedule changes depending on specific site needs. Shifts can be up to 12 hours and may rotate on a predefined schedule. Some locations have on-call rotations. \u003cbr/\u003e•\tRole may support more than one location/site. \u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e•\tWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations: \u003cbr/\u003e•\tRegularly lift and/or move up to 39 pounds independently \u003cbr/\u003e•\tParticipate in group lifts for 40+ pounds \u003cbr/\u003e•\tMaintain balance and perform construction tasks while on a ladder \u003cbr/\u003e•\tRegularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position \u003cbr/\u003e•\tWork in an environment requiring provided ear protection \u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e•\tAbility to travel to or commute between data center locations as needed  \u003cbr/\u003e•\tWillingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e•\tTravel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. \u003cbr/\u003e","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"e97d28d3-be39-40fc-8a2b-36ad56d9399a","id_icims":"3160754","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3160754/engineering-operation-technician","job_schedule_type":"full-time","location":"US, MD, Frederick","locations":["{\"normalizedStateName\":\"Maryland\",\"normalizedCountryCode\":\"USA\",\"city\":\"Frederick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MD, Frederick\",\"coordinates\":\"39.41574,-77.41203\",\"normalizedCountyName\":\"Frederick\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Frederick, Maryland, USA\",\"location\":\"US, MD, Frederick\",\"region\":\"MD\",\"buildingCodeList\":[\"IAD533\"],\"normalizedCityName\":\"Frederick\"}"],"normalized_location":"Frederick, Maryland, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"January 16, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Industrial-scale chiller plant operation\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MD, Frederick - 31.00 - 55.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"MD","title":"Engineering Operation Technician ","university_job":null,"updated_time":"3 minutes","url_next_step":"https://account.amazon.com/jobs/3160754/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Work flexible shifts including night shifts/weekends\u003cbr/\u003e- 1+ years of electrical/mechanical/industrial water experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products","business_category":"aws","city":"Frederick","company_name":"Amazon Data Services, Inc. - A19","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tDaily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability \u003cbr/\u003e•\tMonitor Building Management Systems (BMS) and Electrical Power Management System (EPMS) \u003cbr/\u003e•\tAssist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA) \u003cbr/\u003e•\tPerform rack installs and rack decommissioning within internal SLA \u003cbr/\u003e•\tPerform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment \u003cbr/\u003e•\tTechnical writing to support change management program \u003cbr/\u003e•\tMonitor daily work requests and manage to resolution, and execute projects from conception to completion \u003cbr/\u003e•\tOn-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation \u003cbr/\u003e•\tWork schedule changes depending on specific site needs. Shifts can be up to 12 hours and may rotate on a predefined schedule. Some locations have on-call rotations. \u003cbr/\u003e•\tRole may support more than one location/site. \u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e•\tWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations: \u003cbr/\u003e•\tRegularly lift and/or move up to 39 pounds independently \u003cbr/\u003e•\tParticipate in group lifts for 40+ pounds \u003cbr/\u003e•\tMaintain balance and perform construction tasks while on a ladder \u003cbr/\u003e•\tRegularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position \u003cbr/\u003e•\tWork in an environment requiring provided ear protection \u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e•\tAbility to travel to or commute between data center locations as needed  \u003cbr/\u003e•\tWillingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e•\tTravel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. \u003cbr/\u003e","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"61aa0b8b-b4ea-4491-afb3-28b7ccf2b24c","id_icims":"3160801","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3160801/engineering-operation-technician","job_schedule_type":"full-time","location":"US, MD, Frederick","locations":["{\"normalizedStateName\":\"Maryland\",\"normalizedCountryCode\":\"USA\",\"city\":\"Frederick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MD, Frederick\",\"coordinates\":\"39.41574,-77.41203\",\"normalizedCountyName\":\"Frederick\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Frederick, Maryland, USA\",\"location\":\"US, MD, Frederick\",\"region\":\"MD\",\"buildingCodeList\":[\"IAD533\"],\"normalizedCityName\":\"Frederick\"}"],"normalized_location":"Frederick, Maryland, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"January 16, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Industrial-scale chiller plant operation\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MD, Frederick - 31.00 - 55.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"MD","title":"Engineering Operation Technician ","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3160801/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Work flexible shifts including night shifts/weekends\u003cbr/\u003e- 1+ years of electrical/mechanical/industrial water experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products","business_category":"aws","city":"Frederick","company_name":"Amazon Data Services, Inc. - A19","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tDaily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability \u003cbr/\u003e•\tMonitor Building Management Systems (BMS) and Electrical Power Management System (EPMS) \u003cbr/\u003e•\tAssist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA) \u003cbr/\u003e•\tPerform rack installs and rack decommissioning within internal SLA \u003cbr/\u003e•\tPerform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment \u003cbr/\u003e•\tTechnical writing to support change management program \u003cbr/\u003e•\tMonitor daily work requests and manage to resolution, and execute projects from conception to completion \u003cbr/\u003e•\tOn-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation \u003cbr/\u003e•\tWork schedule changes depending on specific site needs. Shifts can be up to 12 hours and may rotate on a predefined schedule. Some locations have on-call rotations. \u003cbr/\u003e•\tRole may support more than one location/site. \u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e•\tWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations: \u003cbr/\u003e•\tRegularly lift and/or move up to 39 pounds independently \u003cbr/\u003e•\tParticipate in group lifts for 40+ pounds \u003cbr/\u003e•\tMaintain balance and perform construction tasks while on a ladder \u003cbr/\u003e•\tRegularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position \u003cbr/\u003e•\tWork in an environment requiring provided ear protection \u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e•\tAbility to travel to or commute between data center locations as needed  \u003cbr/\u003e•\tWillingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e•\tTravel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. \u003cbr/\u003e","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"0f8b08af-a491-4d32-8b73-658cafd494dc","id_icims":"3160743","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3160743/engineering-operation-technician","job_schedule_type":"full-time","location":"US, MD, Frederick","locations":["{\"normalizedStateName\":\"Maryland\",\"normalizedCountryCode\":\"USA\",\"city\":\"Frederick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MD, Frederick\",\"coordinates\":\"39.41574,-77.41203\",\"normalizedCountyName\":\"Frederick\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Frederick, Maryland, USA\",\"location\":\"US, MD, Frederick\",\"region\":\"MD\",\"buildingCodeList\":[\"IAD533\"],\"normalizedCityName\":\"Frederick\"}"],"normalized_location":"Frederick, Maryland, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"January 16, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Industrial-scale chiller plant operation\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MD, Frederick - 31.00 - 55.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"MD","title":"Engineering Operation Technician ","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3160743/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Work flexible shifts including night shifts/weekends\u003cbr/\u003e- 1+ years of electrical/mechanical/industrial water experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products","business_category":"aws","city":"Frederick","company_name":"Amazon Data Services, Inc. - A19","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tDaily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability \u003cbr/\u003e•\tMonitor Building Management Systems (BMS) and Electrical Power Management System (EPMS) \u003cbr/\u003e•\tAssist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA) \u003cbr/\u003e•\tPerform rack installs and rack decommissioning within internal SLA \u003cbr/\u003e•\tPerform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment \u003cbr/\u003e•\tTechnical writing to support change management program \u003cbr/\u003e•\tMonitor daily work requests and manage to resolution, and execute projects from conception to completion \u003cbr/\u003e•\tOn-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation \u003cbr/\u003e•\tWork schedule changes depending on specific site needs. Shifts can be up to 12 hours and may rotate on a predefined schedule. Some locations have on-call rotations. \u003cbr/\u003e•\tRole may support more than one location/site.\u003cbr/\u003e \u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e•\tWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations: \u003cbr/\u003e•\tRegularly lift and/or move up to 39 pounds independently \u003cbr/\u003e•\tParticipate in group lifts for 40+ pounds \u003cbr/\u003e•\tMaintain balance and perform construction tasks while on a ladder \u003cbr/\u003e•\tRegularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position \u003cbr/\u003e•\tWork in an environment requiring provided ear protection \u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e•\tAbility to travel to or commute between data center locations as needed  \u003cbr/\u003e•\tWillingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e•\tTravel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. \u003cbr/\u003e","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"0bc34071-0142-45a3-819a-4194c50fffb0","id_icims":"3159912","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3159912/engineering-operations-technician","job_schedule_type":"full-time","location":"US, MD, Frederick","locations":["{\"normalizedStateName\":\"Maryland\",\"normalizedCountryCode\":\"USA\",\"city\":\"Frederick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MD, Frederick\",\"coordinates\":\"39.41574,-77.41203\",\"normalizedCountyName\":\"Frederick\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Frederick, Maryland, USA\",\"location\":\"US, MD, Frederick\",\"region\":\"MD\",\"buildingCodeList\":[\"IAD533\"],\"normalizedCityName\":\"Frederick\"}"],"normalized_location":"Frederick, Maryland, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"January 15, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Industrial-scale chiller plant operation\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MD, Frederick - 31.00 - 55.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"MD","title":"Engineering Operations Technician","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3159912/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 7+ years of engineering team management experience\u003cbr/\u003e- Experience in DFx (cost, test, manufacturing)\u003cbr/\u003e- Experience with the project management of technical projects\u003cbr/\u003e- Bachelor's degree in Mechanical Engineering, Electrical Engineering, Computer Engineering, or a related technical field, or equivalent\u003cbr/\u003e- 5+ years of engineering experience in an aerospace or related technical field","business_category":"retail","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Here at Amazon, we embrace our differences. We are committed to furthering our culture of diversity and inclusion of our teams within the organization. How do you get items to customers quickly, cost-effectively, and—most importantly—safely, in less than an hour? And how do you do it in a way that can scale? Our teams of hundreds of scientists, engineers, aerospace professionals, and futurists have been working hard to do just that! We are delivering to customers and are excited for what’s to come. If you are seeking an iterative environment where you can drive innovation, apply state-of-the-art technologies to solve real world delivery challenges, and provide benefits to customers, Prime Air is the place for you. Come work on the Amazon Prime Air Team! \u2028Check out more information about Prime Air on the About Amazon blog: https://www.aboutamazon.com/news/tag/drone\u003cbr/\u003e\u003cbr/\u003eAmazon Prime Air (PA) is seeking a Product Support Engineering (PSO) Service Engineering Manager to lead a team of engineers investigating and resolving in-service problems for Prime Air's drone delivery system.  One of this team's primary responsibilities is to operate as the voice of Prime Air's Commercial Operations to the greater Engineering community. Additionally this team develops prototypes for Operational Support Equipment.\u003cbr/\u003e\u003cbr/\u003eThis role will be responsible for ensuring a high degree of technical reliability within drone operations, working closely with design engineering staff and powering a flywheel of continuous improvement in the drone system design. On the front line of drone system operations, you will establish and maintain close relationships with drone maintainers and operators, and provide engineering analyses and solutions to improve the system use experience and uptime. The successful candidate will leverage data-driven insights to identify opportunities and lead implementation of system improvements. \u003cbr/\u003e\u003cbr/\u003eThis role is a core member of the PA Product Support Organization (PSO) Engineering team, serving as a the first line liaison between operator/maintainer experiences and design engineering improvements or mitigations. In this position, you will bring a unique perspective informed by direct operational data and customer feedback to spearhead system improvements, and address engineering problems discovered in the field. Strong cross-functional engineering fundamentals (mechanical, electrical, software development basics) skills are essential, as well as strong technical communication and documentation skills. Your ability to translate complex system functions into digestible insights and summarize effectively with stakeholders at all levels will be critical to success in this role.\u003cbr/\u003e\u003cbr/\u003eThis position may require a deemed export control license for compliance with applicable laws and regulations. Placement is contingent on Amazon’s ability to apply for and obtain an export control license on your behalf.","department_cost_center":null,"description_short":"Here at Amazon, we embrace our differences. We are committed to furthering our culture of diversity and inclusion of our teams within the organization. How do you get items to customers quickly, cost-effectively,","display_distance":null,"id":"34ea11a8-2dd7-4dde-beac-d404b3550ff8","id_icims":"3165824","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/3165824/pso-service-engineering-mgr-amazon-prime-air","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA109\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"January 23, 2026","preferred_qualifications":"- Knowledge of AWS or cloud technologies\u003cbr/\u003e- Master's degree in Engineering, or a related field\u003cbr/\u003e- Experience developing or providing engineering support for products with large production volume or fleet size\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 151,000.00 - 204,300.00 USD annually","primary_search_label":"retail.team-global-prime-air","source_system":"JobCreator","state":"WA","title":"PSO Service Engineering Mgr, Amazon Prime Air","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3165824/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-prime-air","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in developing functional specifications, design verification plans and functional test procedures\u003cbr/\u003e- Experience working with interdisciplinary teams to execute product design from concept to production\u003cbr/\u003e- Experience with the project management of technical projects\u003cbr/\u003e- Bachelor's degree in mechanical engineering, electrical engineering, material science, physics or equivalent\u003cbr/\u003e- 5+ years of product compliance experience in the area of restricted substance compliance including REACH/RoHS/POPs, TSCA, etc.\u003cbr/\u003e- 5+ years of experience in product development in electronic, consumer, or aerospace industry.\u003cbr/\u003e- 5+ years of experience leading regulatory compliance certification campaigns for electronics and battery assemblies.","business_category":"retail","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Here at Amazon, we embrace our differences. We are committed to furthering our culture of diversity and inclusion of our teams within the organization.\u003cbr/\u003e\u003cbr/\u003eHow do you get items to customers quickly, cost-effectively, and—most importantly—safely, in less than an hour? And how do you do it in a way that can scale? Our teams of hundreds of scientists, engineers, aerospace professionals, and futurists have been working hard to do just that! We are delivering to customers, and are excited for what’s to come. Check out more information about Prime Air on the About Amazon blog (https://www.aboutamazon.com/news/transportation/amazon-prime-air-delivery-drone-reveal-photos).\u003cbr/\u003e\u003cbr/\u003eIf you are seeking an iterative environment where you can drive innovation, apply state-of-the-art technologies to solve real world delivery challenges, and provide benefits to customers, Prime Air is the place for you.\u003cbr/\u003e\u003cbr/\u003eCome work on the Amazon Prime Air Team!\u003cbr/\u003e\u003cbr/\u003ePrime Air is seeking an experienced Sr. Material Compliance Engineer, Environmental and Product Compliance, who will develop design-for-compliance specification and plan, troubleshoot and resolve compliance issues that arise in the course of Prime Air’s NPI and other business processes. This leader will have a strong background in Environmental and Product Compliance with a demonstrated ability to lead and get the right things done quickly and effectively. We’re looking for people who innovate and love solving hard problems. The right candidate will also be a strong integrator who prioritizes well and communicates effectively. You will work hard, have fun, and of course, make history!\u003cbr/\u003e \u003cbr/\u003eExport Control License: This position may require a deemed export control license for compliance with applicable laws and regulations. Placement is contingent on Amazon’s ability to apply for and obtain an export control license on your behalf.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e1) Implement Prime Air's material and product compliance strategy, roadmap, and specification in the area of hazardous substances, and material safety to meet business objectives such as new product launch, new site launch, new technology development, onboarding new ODMs, etc.  \u003cbr/\u003e\u003cbr/\u003e2) Create procedures and guidelines to mitigate compliance issues early in the design phase, and ensure that hardware meets governmental and industry regulations in international markets. \u003cbr/\u003e\u003cbr/\u003e3) Deliver compliance risk assessment, design-for-compliance specification, design review, and certifications/declarations during product development to ensure new hardware design meeting technical compliance requirement in the global market. \u003cbr/\u003e\u003cbr/\u003e4) Influence internal and external partners and stakeholders to align on a compliance solution or mitigation path that favors our business objectives during product development and operation.\u003cbr/\u003e\u003cbr/\u003e5) Engage closely with hardware and supplier teams on product development to determine the impact of the proposed regulatory changes on HW design, performance, reliability, and compliance.\u003cbr/\u003e \u003cbr/\u003e6) Develop key metrics to evaluate material and product compliance engineering program’s performance, and build implementation plans to confirm our performance and compliance, against program metrics, internal company requirements, and regulations\u003cbr/\u003e\u003cbr/\u003e7) Participate in design reviews to ensure EMC/EMI and RF (Ka/Wi-Fi/BT) mitigations are properly implemented in the designs.","department_cost_center":null,"description_short":"Here at Amazon, we embrace our differences. We are committed to furthering our culture of diversity and inclusion of our teams within the organization.How do you get items to customers quickly, cost-effectively,","display_distance":null,"id":"f1bf2d29-1b93-4b07-9d57-c0ef469e9c6d","id_icims":"3115174","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/3115174/sr-material-compliance-engineer-environmental-and-product-compliance-prime-air","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA109\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"October 24, 2025","preferred_qualifications":"- Master's degree in electrical engineering, computer engineering, or equivalent\u003cbr/\u003e- 10+ years of product compliance experience in the area of restricted substance compliance including REACH/RoHS/POPs, TSCA, etc.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 137,300.00 - 185,700.00 USD annually","primary_search_label":"retail.team-global-prime-air","source_system":"JobCreator","state":"WA","title":"Sr. Material Compliance Engineer, Environmental and Product Compliance, Prime Air","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3115174/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-prime-air","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Work flexible shifts including night shifts/weekends\u003cbr/\u003e- 1+ years of electrical/mechanical/industrial water experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products","business_category":"aws","city":"Frederick","company_name":"Amazon Data Services, Inc. - A19","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tDaily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability \u003cbr/\u003e•\tMonitor Building Management Systems (BMS) and Electrical Power Management System (EPMS) \u003cbr/\u003e•\tAssist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA) \u003cbr/\u003e•\tPerform rack installs and rack decommissioning within internal SLA \u003cbr/\u003e•\tPerform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment \u003cbr/\u003e•\tTechnical writing to support change management program \u003cbr/\u003e•\tMonitor daily work requests and manage to resolution, and execute projects from conception to completion \u003cbr/\u003e•\tOn-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation \u003cbr/\u003e•\tWork schedule changes depending on specific site needs. Shifts can be up to 12 hours and may rotate on a predefined schedule. Some locations have on-call rotations. \u003cbr/\u003e•\tRole may support more than one location/site.\u003cbr/\u003e \u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e•\tWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations: \u003cbr/\u003e•\tRegularly lift and/or move up to 39 pounds independently \u003cbr/\u003e•\tParticipate in group lifts for 40+ pounds \u003cbr/\u003e•\tMaintain balance and perform construction tasks while on a ladder \u003cbr/\u003e•\tRegularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position \u003cbr/\u003e•\tWork in an environment requiring provided ear protection \u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e•\tAbility to travel to or commute between data center locations as needed  \u003cbr/\u003e•\tWillingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e•\tTravel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. \u003cbr/\u003e","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"5c2cf62d-8155-4c8f-99d4-f1b79d808d7a","id_icims":"3159917","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3159917/engineering-operations-technician","job_schedule_type":"full-time","location":"US, MD, Frederick","locations":["{\"normalizedStateName\":\"Maryland\",\"normalizedCountryCode\":\"USA\",\"city\":\"Frederick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MD, Frederick\",\"coordinates\":\"39.41574,-77.41203\",\"normalizedCountyName\":\"Frederick\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Frederick, Maryland, USA\",\"location\":\"US, MD, Frederick\",\"region\":\"MD\",\"buildingCodeList\":[\"IAD533\"],\"normalizedCityName\":\"Frederick\"}"],"normalized_location":"Frederick, Maryland, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"January 15, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Industrial-scale chiller plant operation\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MD, Frederick - 31.00 - 55.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"MD","title":"Engineering Operations Technician","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3159917/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}