{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 3+ years of program or project management experience\u003cbr/\u003e- 3+ years of working cross functionally with tech and non-tech teams experience\u003cbr/\u003e- 3+ years of defining and implementing process improvement initiatives using data and metrics experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Knowledge of Excel (Pivot Tables, VLookUps) at an advanced level and SQL\u003cbr/\u003e- Experience defining program requirements and using data and metrics to determine improvements\u003cbr/\u003e- Speak, write, and read fluently in English","business_category":"retail","city":"Mexico City","company_name":"Servicios Comerciales Amazon Mexico S. de R.L. de C.V. - D44","country_code":"MEX","description":"Are you a strategic thinker with a passion for driving growth and optimizing selection in e-commerce? Amazon Mexico is seeking a dynamic and results-driven Selection Growth Program Manager to lead our efforts in expanding and optimizing our product selection across multiple channels.\u003cbr/\u003e\u003cbr/\u003eAs Selection Growth PM, you will play a crucial role in growing our local selection offer, working closely with retail and third party teams to drive strategic growth initiatives. This role requires a unique blend of commercial acumen, strong negotiation skills, and the ability to navigate complex stakeholder landscapes.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eDevelop and implement strategies to grow local selection\u003cbr/\u003eOwn and manage the channel-agnostic priority leads hit list, identifying key brands and addressing blockers\u003cbr/\u003eDrive accountability for selection addition goals across teams\u003cbr/\u003eOptimize selection growth in challenging spaces, such as low Average Selling Price (ASP) items\u003cbr/\u003eEnforce and evolve Amazon Standard of Brands (ASB) processes to ensure smooth channel operations\u003cbr/\u003eLead initiatives to increase domestic Fast Track ASINs Creation (FTAC) in partnership with 3P selection teams\u003cbr/\u003eDevelop and implement optimal format models for specific product categories (e.g., Everyday Essentials)\u003cbr/\u003eDesign and implement graduation models for transitioning selection between channels.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will:\u003cbr/\u003e\u003cbr/\u003eHave a proven track record in e-commerce, category management, or business development\u003cbr/\u003eDemonstrate strong commercial awareness and negotiation skills\u003cbr/\u003eExcel at stakeholder management and cross-functional collaboration\u003cbr/\u003eBe able to navigate ambiguity and drive results in a fast-paced environment\u003cbr/\u003eShow resilience and the ability to influence without direct authority\u003cbr/\u003eHave experience in data-driven decision making and strategic planning\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eInclusive team culture \u003cbr/\u003eAt Amazon we embrace our differences and we are committed to furthering our culture of inclusion. We host annual and ongoing learning experiences. Amazon’s culture of inclusion is reinforced within our 14 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.\u003cbr/\u003e\u003cbr/\u003eWork Life Balance \u003cbr/\u003eWe believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfillment. We offer flexibility in working hours and encourage you to find your own balance between your work and personal lives.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth \u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded professional.","department_cost_center":null,"description_short":"Are you a strategic thinker with a passion for driving growth and optimizing selection in e-commerce? Amazon Mexico is seeking a dynamic and results-driven Selection Growth Program Manager to lead our","display_distance":null,"id":"827c947d-4781-42a3-b3b7-57a088b38b96","id_icims":"3069379","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Program Management","job_function_id":null,"job_path":"/en/jobs/3069379/mx-selection-intelligence-mexico-team","job_schedule_type":"full-time","location":"MX, DIF, Mexico City","locations":["{\"normalizedStateName\":\"Mexico City\",\"normalizedCountryCode\":\"MEX\",\"city\":\"Mexico City\",\"countryIso3a\":\"MEX\",\"countryIso2a\":\"MX\",\"locationNonStemming\":\"Mexico, DIF, Mexico City\",\"coordinates\":\"19.43195,-99.13315\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Mexico\",\"normalizedLocation\":\"Mexico City, Mexico City, MEX\",\"location\":\"MX, DIF, Mexico City\",\"region\":\"DIF\",\"buildingCodeList\":[\"MEX16\"],\"normalizedCityName\":\"Mexico City\"}"],"normalized_location":"Mexico City, Mexico City, MEX","optional_search_labels":["mx-stores"],"posted_date":"August 29, 2025","preferred_qualifications":"- 3+ years of driving end to end delivery, and communicating results to senior leadership experience\u003cbr/\u003e- 3+ years of driving process improvements experience\u003cbr/\u003e- Experience in stakeholder management, dealing with multiple stakeholders at varied levels of the organization\u003cbr/\u003e- Experience building processes, project management, and schedules\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"retail.team-pricing-systems","source_system":"JobCreator","state":"DIF","title":"MX Selection Intelligence, Mexico Team","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3069379/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-pricing-systems","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- PhD, or Master's degree and 6+ years of applied research experience\u003cbr/\u003e- Experience programming in Java, C++, Python or related language\u003cbr/\u003e- Experience with neural deep learning methods and machine learning\u003cbr/\u003e- Hands-on experience with RL policy training and deployment for robotics","business_category":"subsidiaries","city":"Sunnyvale","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Robots are about to step out of the movies and into our homes. If you're excited about this robotics revolution, come join Amazon's Personal Robotics Group. As an Applied Scientist in this org, you'll push the state-of-the-art techniques in Robotics. You'll drive technical excellence in areas such as perception, manipulation, sim2real transfer, reinforcement learning and multi-task learning, designing novel algorithms that bridge the gap between research and real-world deployment. \u003cbr/\u003e\u003cbr/\u003eIn this role, you will integrate hands-on technical expertise with scientific leadership, ensuring your team delivers robust solutions for dynamic real-world environments. While staying updated with the latest advancements in robotics research, you will leverage your experience and expertise to guide the team towards the most promising direction. Collaborating with a talented group of software engineers and scientists, you will bring your ideas to fruition. Deploying robots in home environments requires you to anticipate challenges not encountered in structured settings like warehouses. Additionally, consumer-grade sensors and actuators necessitate working around their limitations, requiring out-of-the-box innovative ideas. As such, you are someone who truly enjoys thinking about problems using first principles at a holistic and systems level to address the aforementioned challenges. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Lead technical initiatives in areas such as robotics foundation models, reinforcement learning and manipulation - - Design experiments to identify the limitations of current state-of-the-art models and developing new models or techniques that can surpass these models \u003cbr/\u003e - Design and implement novel deep learning architectures that push the boundaries of what robots can understand and accomplish\u003cbr/\u003e - Mentor fellow scientists while maintaining strong individual technical contributions\u003cbr/\u003e - Collaborate with engineering teams to optimize and scale models for real-world applications\u003cbr/\u003e - Influence technical decisions and implementation strategies within your area of focus\u003cbr/\u003e- Experienced in communicating complex technical work to a non-technical audience\u003cbr/\u003e- The ability to work with minimal guidance, be proactive and to handle ambiguity and the challenge of quickly evolving goals\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e- Train ML models for deployment in simulation and real-world robots, identify and document their limitations post-deployment\u003cbr/\u003e- Drive technical discussions within your team and with key stakeholders to develop innovative solutions to address identified limitations\u003cbr/\u003e - Guide fellow scientists in solving complex technical challenges, from sim2real transfer to training RL policies\u003cbr/\u003e - Mentor team members while maintaining significant hands-on contribution to technical solutions\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Personal Robotics Group is pioneering intelligent robotic products that deliver meaningful customer experiences. We're building the next generation of robotic systems that will redefine how customers interact with technology. This is a unique opportunity to shape the future of personal robotics working with world-class teams pushing the boundaries of what's possible in robotic manipulation, locomotion, and human-robot interaction.\u003cbr/\u003e\u003cbr/\u003eJoin us if you’re passionate about creating the future of personal robotics, solving complex challenges at the intersection of hardware and software, and seeing your innovation deliver transformative customer experiences.\u003cbr/\u003e","department_cost_center":null,"description_short":"Robots are about to step out of the movies and into our homes. If you're excited about this robotics revolution, come join Amazon's Personal Robotics Group. As an Applied Scientist in this org, you'll","display_distance":null,"id":"c79e2cbb-81f0-4c0f-824c-b620dc6cbfe4","id_icims":"3175259","is_intern":null,"is_manager":null,"job_category":"Research Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3175259/senior-applied-scientist-personal-robotics-group","job_schedule_type":"full-time","location":"US, CA, Sunnyvale","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sunnyvale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Sunnyvale\",\"coordinates\":\"37.37188,-122.03751\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sunnyvale, California, USA\",\"location\":\"US, CA, Sunnyvale\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC14\"],\"normalizedCityName\":\"Sunnyvale\"}"],"normalized_location":"Sunnyvale, California, USA","optional_search_labels":[],"posted_date":"February  5, 2026","preferred_qualifications":"- PhD in engineering, technology, computer science, machine learning, robotics, operations research, statistics, mathematics or equivalent quantitative field\u003cbr/\u003e- Have publications at top-tier peer-reviewed conferences or journals\u003cbr/\u003e- Experience with training and deploying machine learning systems to solve large-scale optimizations, or experience with software development lifecycle\u003cbr/\u003e- Hand-on experience of deploying Deep Learning models on robots\u003cbr/\u003e- Experience in developing Vision Language Action (VLA) models and/or Reinforcement learning for robot manipulation\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Sunnyvale - 192,200.00 - 260,000.00 USD annually","primary_search_label":"subsidiaries.team-amazon-robotics","source_system":"JobCreator","state":"CA","title":"Senior Applied Scientist, Personal Robotics Group","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3175259/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-robotics","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"aws","city":"Toronto","company_name":"Amazon Development Centre Canada ULC","country_code":"CAN","description":"Amazon Web Services (AWS) has been leading the world into the cloud computing era since its inception in 2006. The AWS Partner Network (APN) is the vital ecosystem we have created with our tens of thousands of consulting and technology partners, to promote AWS in every industry, every size of company, and every region of the world. APN offerings include validating partner qualifications in distinct areas, lead/opportunity sharing, training and certifications, marketing assistance, funding reimbursement, et al. The AWS Partner Systems team is responsible for external and internal supporting Partner Sales, the APN, and other elements driving the AWS partner ecosystem. We serve three groups of stakeholders: partners who work with us to sell AWS, customers who use AWS, and internal users responsible for driving AWS sales and adoption via partners.\u003cbr/\u003e\u003cbr/\u003eSales, Marketing and Global Services (SMGS)\u003cbr/\u003eAWS Sales, Marketing, and Global Services (SMGS) is responsible for driving revenue, adoption, and growth from the largest and fastest growing small- and mid-market accounts to enterprise-level customers including public sector. The AWS Global Support team interacts with leading companies and believes that world-class support is critical to customer success. AWS Support also partners with a global list of customers that are building mission-critical applications on top of AWS services.\u003cbr/\u003e\u003cbr/\u003eOur team also puts a high value on work-life balance. Striking a healthy balance between your personal and professional life is crucial to your happiness and success here, which is why we aren’t focused on how many hours you spend at work or online. Instead, we’re happy to offer a flexible schedule so you can have a more productive and well-balanced life—both in and outside of work.\u003cbr/\u003e\u003cbr/\u003eAre you interested in building secured, highly available, performant, and scalable systems, web services, products and integrations between cloud and on-prem applications that support AWS' current and future growth? Are you seeking an environment where you can drive innovation? Do you have a passion for ensuring a positive customer experience? This is the job for you.\u003cbr/\u003e\u003cbr/\u003eAWS Partner Systems is looking for a results-oriented, self-driven  Development  who can help us create the next generation of distributed, scalable systems that support AWS' current and future business needs. In this role, you will enjoy working in a fast-paced environment, relish working with high volume of data, the challenge of highly complex business contexts that are typically being defined in real-time. You will design and develop services that processes millions of transactions in secured environment.\u003cbr/\u003e \u003cbr/\u003e If you have cloud experience, love building , are self-directed, know how to get things done, are passionate learner, can mentor and lead teams, and are motivated to take on big challenges, this is the right job for you. In this position you will leverage your practical experience in building high-performance, reliable systems in a complex, multi-tiered, distributed environment (Service Oriented Architecture).\u003cbr/\u003e\u003cbr/\u003e \u003cbr/\u003e10010\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eABOUT AWS:\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Web Services (AWS) has been leading the world into the cloud computing era since its inception in 2006. The AWS Partner Network (APN) is the vital ecosystem we have created with our tens of thousands","display_distance":null,"id":"11c65450-7847-480d-8b5a-c7ceecf249eb","id_icims":"3168128","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3168128/software-development-engineer-aws-apo-engineering","job_schedule_type":"full-time","location":"CA, ON, Toronto","locations":["{\"normalizedStateName\":\"Ontario\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Toronto\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, ON, Toronto\",\"coordinates\":\"43.64869,-79.38544\",\"normalizedCountyName\":\"Toronto\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Toronto, Ontario, CAN\",\"location\":\"CA, ON, Toronto\",\"region\":\"ON\",\"buildingCodeList\":[\"YYZ18\"],\"normalizedCityName\":\"Toronto\"}"],"normalized_location":"Toronto, Ontario, CAN","optional_search_labels":["aws.team-apn"],"posted_date":"January 27, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(34, 34, 34)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. As a total compensation company, Amazon's package may include other elements such as sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon offers comprehensive benefits including health insurance (medical, dental, vision, prescription, basic life \u0026amp; AD\u0026amp;D insurance), Registered Retirement Savings Plan (RRSP), Deferred Profit Sharing Plan (DPSP), paid time off, and other resources to improve health and well-being. We thank all applicants for their interest, however only those interviewed will be advised as to hiring status.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eCAN, ON, Toronto - 114,800.00 - 191,800.00 CAD annually","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"ON","title":"Software Development Engineer, AWS APO Engineering","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3168128/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of Microsoft Office products and applications experience\u003cbr/\u003e- 1+ years of electrical or mechanical experience\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Sparks","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"c80c957d-eac0-448a-b22d-22db10cfcdd4","id_icims":"3169310","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3169310/engineering-operations-technician-dcc-communities","job_schedule_type":"full-time","location":"US, NV, Sparks","locations":["{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sparks\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, Sparks\",\"coordinates\":\"39.54115,-119.74832\",\"normalizedCountyName\":\"Washoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sparks, Nevada, USA\",\"location\":\"US, NV, Sparks\",\"region\":\"NV\",\"buildingCodeList\":[\"RNO100\"],\"normalizedCityName\":\"Sparks\"}"],"normalized_location":"Sparks, Nevada, USA","optional_search_labels":["aws.team-ais","aws.team-dc","hourly","military"],"posted_date":"January 29, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Technical (Military/Trade School) training\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NV, Sparks - 31.00 - 55.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"NV","title":"Engineering Operations Technician, DCC Communities ","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3169310/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree, or experience in sales","business_category":"no-business-category","city":"Bengaluru","company_name":"ASSPL - Karnataka - B56","country_code":"IND","description":"Amazon has one of the largest \u0026 most trusted shipping networks in India (ATS). We want to extend the benefits of these shipping services to D2C brands and SMBs for their own business to help them serve their customers better \u0026 in turn grow their business. This role will be responsible for managing and growing relationships with our key shipper accounts.\u003cbr/\u003e\u003cbr/\u003eWe are seeking a street-smart, result-oriented candidate with B2B/SME sales and business development experience and preferably from the shipping \u0026 logistics industry. Candidate should be able to thrive and succeed in an entrepreneurial environment, and not be hindered by ambiguity or competing priorities and changing landscapes. One should be collaborative, but equally data-driven and analytical. The individual should constantly strive to expand our understanding of the metrics and industry.\u003cbr/\u003e\u003cbr/\u003eYou to create an understanding of the product and target market and create your account management strategy to retain and grow shippers and win business volume from them. Additionally, you will be responsible for maintaining positive shipper relations by managing critical input levers.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Deliver positive experience to assigned shipper accounts and win volume (#Shipments and Revenue) and hygiene parameters\u003cbr/\u003e• Develop your individual account management strategy at a shipper-level\u003cbr/\u003e• Understanding and reinforcing the value proposition and creating joint business plans with shippers\u003cbr/\u003e• Action proactive and reactive measures on key business parameters like operations, claims, and receivables\u003cbr/\u003e• Follow the standard operating processes to scale the working of the function.\u003cbr/\u003e• Help refine the business value proposition using local knowledge, secondary research and past data","department_cost_center":null,"description_short":"Amazon has one of the largest \u0026 most trusted shipping networks in India (ATS). We want to extend the benefits of these shipping services to D2C brands and SMBs for their own business to help them serve","display_distance":null,"id":"81d69237-f12e-4bdf-93b0-0cfcf3869655","id_icims":"3157819","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Cust. Experience Qualit Ops","job_function_id":null,"job_path":"/en/jobs/3157819/transportation-specialist-amazon-shipping","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR37\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"January 13, 2026","preferred_qualifications":"- Experience in English-language communication skills, both written and verbal\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"KA","title":"Transportation Specialist, Amazon Shipping","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3157819/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of Microsoft Office products and applications experience\u003cbr/\u003e- 2+ years of electrical and mechanical experience\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Sparks","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e- Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"828fa841-a40c-4016-97dc-fe9c7bde3ad6","id_icims":"3168074","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3168074/engineering-operations-technician-dcc-communities","job_schedule_type":"full-time","location":"US, NV, Sparks","locations":["{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sparks\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, Sparks\",\"coordinates\":\"39.54115,-119.74832\",\"normalizedCountyName\":\"Washoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sparks, Nevada, USA\",\"location\":\"US, NV, Sparks\",\"region\":\"NV\",\"buildingCodeList\":[\"RNO100\"],\"normalizedCityName\":\"Sparks\"}"],"normalized_location":"Sparks, Nevada, USA","optional_search_labels":["military","aws.team-dc","hourly","aws.team-ais"],"posted_date":"January 27, 2026","preferred_qualifications":"- Experience working in a data center or mission critical facility (example: hospital, military facility, public safety facility, etc.)\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e- Experience with reading and writing procedures, technical documents, and engineering drawings\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NV, Sparks - 36.00 - 63.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"NV","title":"Engineering Operations Technician, DCC Communities ","university_job":null,"updated_time":"19 minutes","url_next_step":"https://account.amazon.com/jobs/3168074/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in finance, accounting or related field\u003cbr/\u003e- 5+ years of tax, finance or a related analytical field experience","business_category":"finance","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join a dynamic team where your financial expertise will directly impact millions of music lovers worldwide. At Amazon Music, you'll be a key strategic partner driving customer growth and innovation through innovative financial insights and collaborative decision-making.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e -   Develop comprehensive customer growth forecasts and strategic financial models\u003cbr/\u003e -   Partner with business teams to evaluate and validate strategic propositions\u003cbr/\u003e -   Craft compelling business cases that inform critical financial decisions\u003cbr/\u003e-    Enhance financial controllership through sophisticated reporting and process improvements\u003cbr/\u003e -   Leverage data-driven insights to identify and implement strategic opportunities for optimization\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour day will be a blend of strategic analysis, cross-functional collaboration, and customer lifecycle forecast. You'll engage with product and marketing teams, translating complex financial data into actionable recommendations that shape Amazon Music's future. From developing comprehensive business cases to supporting critical product launches, you'll be at the heart of our growth strategy.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe are a collaborative finance team committed to driving Amazon Music's success. Our approach emphasizes individual ownership balanced with collective support, creating an environment where innovative thinking and mutual growth are celebrated. We work closely across different finance specialties to deliver comprehensive financial strategies.","department_cost_center":null,"description_short":"Join a dynamic team where your financial expertise will directly impact millions of music lovers worldwide. At Amazon Music, you'll be a key strategic partner driving customer growth and innovation through","display_distance":null,"id":"57be7c33-d082-488b-b8a3-e2a2926b89c3","id_icims":"3159785","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/Planning","job_function_id":null,"job_path":"/en/jobs/3159785/finance-manager-amazon-music-finance","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Culver City\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Culver City\",\"coordinates\":\"34.02202,-118.39589\",\"normalizedCountyName\":\"Los Angeles\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Culver City, California, USA\",\"location\":\"US, CA, Culver City\",\"region\":\"CA\",\"buildingCodeList\":[\"LAX35\"],\"normalizedCityName\":\"Culver City\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA43\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"January 15, 2026","preferred_qualifications":"- MBA, or CPA\u003cbr/\u003e- 4+ years of solving complex business challenges by delivering accurate and timely financial models, analysis, and recommendations that have a proven impact on business (e.g., financial savings, operational improvements, or customer benefits) experience\u003cbr/\u003e- Knowledge of SQL/ETL\u003cbr/\u003e- Experience working with large-scale data mining and reporting tools (examples: SQL, MS Access, Essbase, Cognos) and other financial systems (examples: Oracle, SAP, Lawson, JD Edwards)\u003cbr/\u003e- Experience delivering forecasting, budgeting, and variance analysis, and data interpretation of results\u003cbr/\u003e- Experience in creating process improvements with automation and analysis\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Culver City - 95,400.00 - 163,200.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 95,400.00 - 163,200.00 USD annually","primary_search_label":"finance.team-gmac","source_system":"JobCreator","state":"WA","title":"Finance Manager, Amazon Music Finance","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3159785/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-gmac","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of tax, finance or a related analytical field experience\u003cbr/\u003e- 4+ years of applying key financial performance indicators (KPIs) to analyses experience\u003cbr/\u003e- 4+ years of creating process improvements with automation and analysis experience\u003cbr/\u003e- 4+ years of identifying, leading, and executing opportunities to improve, automate, standardize or simplify finance or business tools and processes experience\u003cbr/\u003e- Experience with advanced use of SQL for data mining and business intelligence\u003cbr/\u003e- Experience in identifying, leading, and executing opportunities to improve, automate, standardize or simplify finance or business tools and processes","business_category":"finance","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Imagine being a part of a small, agile team where your ideas have the potential to reach millions within a matter of months. Picture partnering on innovative consumer-facing products, where every single team member is a critical voice in the decision-making process. Envision being able to leverage the resources of a Fortune-500 company within the atmosphere of a start-up. Welcome to Amazon Music, where ideas are born, and come to life as Amazon Music Unlimited, Amazon Music HD, Amazon Music Prime, Amazon Music Free and a Digital Music Store. Come join us and make history.\u003cbr/\u003e\u003cbr/\u003eAmazon.com is seeking a Senior Finance Analyst on the Amazon Music Finance team. In partnership with business, operations, and technology teams throughout Amazon, this position will drive strategic initiatives to improve financial reporting and customer experience through automation, process improvements, and defects prevention. This role will engage with executive leadership and cross functional teams to drive results.\u003cbr/\u003e\u003cbr/\u003eThe successful candidate will have the ability to tackle multiple projects and efficiently execute deliverables. The right individual will have strong leadership skills and solid business acumen capable of driving results and improving processes. They will have operated successfully in a fast-paced, global, results-oriented environment.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e - Driving planning and budgeting and related deliverables, and ensuring financial discipline and compliance.\u003cbr/\u003e - Prepare financial metrics, financial reporting, and financial analysis\u003cbr/\u003e - Manage and execute entire projects or components of large projects from start to finish\u003cbr/\u003e - Provide controllership over several variable costs of the business\u003cbr/\u003e - Anticipate business requirements, trends, and variances; develop action plans; measure and analyze results; initiate corrective actions; minimize the impact of negative variances","department_cost_center":null,"description_short":"Imagine being a part of a small, agile team where your ideas have the potential to reach millions within a matter of months. Picture partnering on innovative consumer-facing products, where every single","display_distance":null,"id":"aa1ca931-f856-4422-bce2-dc5c70902c13","id_icims":"3129934","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/Planning","job_function_id":null,"job_path":"/en/jobs/3129934/senior-financial-analyst-amazon-music","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA40\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"November 20, 2025","preferred_qualifications":"- 4+ years of participating in continuous improvement projects in your team to scale and improve controllership with measurable results experience\u003cbr/\u003e- MBA, or CPA\u003cbr/\u003e- Experience working with large-scale data mining and reporting tools (examples: SQL, MS Access, Essbase, Cognos) and other financial systems (examples: Oracle, SAP, Lawson, JD Edwards)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 82,700.00 - 117,100.00 USD annually","primary_search_label":"finance.team-gmac","source_system":"JobCreator","state":"WA","title":"Senior Financial Analyst, Amazon Music","university_job":null,"updated_time":"22 minutes","url_next_step":"https://account.amazon.com/jobs/3129934/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-gmac","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in finance, accounting or related field\u003cbr/\u003e- Experience in tax, finance or a related analytical field\u003cbr/\u003e- Experience applying key financial performance indicators (KPIs) to analyses\u003cbr/\u003e- Experience in financial modeling, P\u0026L management or analysis","business_category":"finance","city":"London","company_name":"Amazon Digital UK Limited","country_code":"GBR","description":"Imagine being a part of an agile team where your ideas have the potential to reach millions within a matter of months. Picture partnering on consumer-facing products, where every single team member is a critical voice in the decision-making process. Welcome to Amazon Music!\u003cbr/\u003e\u003cbr/\u003eAmazon Music is seeking a Finance Manager to own Music Business Development by strategizing with the business and generating insights to foster business growth, while also supporting the business in deal evaluations, goal performance reporting and management, forecasting, and process building and enhancements. Additionally, the individual supports Amazon Music royalty licenses, partnering with the Music content acquisition team on royalty deal negotiations analysis and various strategic planning projects.\u003cbr/\u003e\u003cbr/\u003eThe successful candidate will demonstrate exceptional strategic thinking and business partnering capabilities, with the ability to influence decisions through financial insights and drive alignment across multiple stakeholders. You will have the ability to tackle multiple projects and efficiently execute deliverables, is a self-starter with strong business and financial modeling skills, has a keen attention to detail and good track record of influencing business partners. The candidate will also have operated successfully in a fast-paced, global, results-oriented environment. Advanced financial modeling skills, excellent communication abilities, and a track record of driving results through influence are crucial for success in this role.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Partner with business teams to value propositions\u003cbr/\u003e- Develop business cases to support all major financial decisions\u003cbr/\u003e- Prepare financial metrics, financial analysis, and financial reporting\u003cbr/\u003e- Manage global financial and business forecast model(s)\u003cbr/\u003e- Develop, maintain and enhance finance controllership via models, reports, and processes\u003cbr/\u003e- Demonstrate the ability to manage competing priorities \u0026 providing level-headed guidance during unexpected events\u003cbr/\u003e- Root cause opportunities for improvement using data, then assisting the Amazon Music team to take action on your findings\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eEnvision strategizing with product and marketing stakeholders on customer-facing initiatives to drive customer growth.\u003cbr/\u003e\u003cbr/\u003eYou will partner cross-functionally with Accounting, Finance Operations, and Business Intelligence teams to drive product and deal launches, critical requirements, and the next big idea for 3rd Party partnerships in Amazon Music.\u003cbr/\u003e\u003cbr/\u003eYou will partner with Music Content Acquisition to analyze deal terms in the midst of royalty negotiations.\u003cbr/\u003e\u003cbr/\u003eYou will partner across Amazon Music Finance to complete operating planning cycles and critical month-end close processes.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Amazon Music Finance team is designed to be collaborative; although each individual have clear ownership of an area(s), success typically involves partnering with our finance leads for other tiers, or specialties.","department_cost_center":null,"description_short":"Imagine being a part of an agile team where your ideas have the potential to reach millions within a matter of months. Picture partnering on consumer-facing products, where every single team member is","display_distance":null,"id":"7181761f-8234-4dd9-91bc-00b0b67dfe7c","id_icims":"3149888","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/Planning","job_function_id":null,"job_path":"/en/jobs/3149888/sr-financial-analyst-amazon-music-finance","job_schedule_type":"full-time","location":"GB, London","locations":["{\"normalizedStateName\":\"England\",\"normalizedCountryCode\":\"GBR\",\"city\":\"London\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, London\",\"coordinates\":\"51.50643,-0.12719\",\"normalizedCountyName\":\"London\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"London, England, GBR\",\"location\":\"GB, London\",\"region\":\"\",\"buildingCodeList\":[\"LHR16\"],\"normalizedCityName\":\"London\"}"],"normalized_location":"London, England, GBR","optional_search_labels":[],"posted_date":"December 29, 2025","preferred_qualifications":"- MBA, or CPA\u003cbr/\u003e- Knowledge of Tableau\u003cbr/\u003e- Experience working with large-scale data mining and reporting tools (examples: SQL, MS Access, Essbase, Cognos) and other financial systems (examples: Oracle, SAP, Lawson, JD Edwards)\u003cbr/\u003e- Experience working with stakeholders\u003cbr/\u003e- Experience in creating process improvements with automation and analysis\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-finops","source_system":"JobCreator","state":null,"title":"Sr. Financial Analyst, Amazon Music Finance","university_job":null,"updated_time":"23 minutes","url_next_step":"https://account.amazon.com/jobs/3149888/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-finops","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 12+ years of tax, finance or a related analytical field experience\u003cbr/\u003e- 12+ years of finance technology, forecast \u0026 budgeting, or other finance-focused competency experience\u003cbr/\u003e- Knowledge of Excel and Excel VBA at an expert level","business_category":"finance","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The US Home and Lifestyle (H\u0026L) organization is seeking a talented Finance Leader to join the team. This is an exciting opportunity to partner across a group of profitable and large core businesses to drive success. In this pivotal role, you will be an analytical powerhouse behind H\u0026L’s business growth strategy, generating and operationalizing insights that challenge senior leaders to Think Big.  You will design innovative financial solutions that enhance organizational efficiency, challenge traditional processes, and deliver insights that directly impact business growth and performance. The role also offers cross-collaborative opportunities with Category, Operations, Services, Ads and Marketing and provides leadership visibility on mission-critical business decisions. \u003cbr/\u003e\u003cbr/\u003eThe successful candidate will thrive in data, analytics and partnering with a diverse group of stakeholders on solving customer problems – big and small. They will have a deep passion for learning, being curious and moving quickly to execute be it through financial modeling, reporting or process improvements. This is a great opportunity to also gain exposure to P\u0026L management of core businesses and leverage financial acumen for business decision support. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tDesign, iterate and automate Finance frameworks that help steer Businesses through emerging challenges.\u003cbr/\u003e•\tLead comprehensive financial transformation projects that redesign how financial data is consumed, stored, and analyzed across the organization\u003cbr/\u003e•\tDevelop Financial models and plans with data and narrative to inform tactical decision-making.\u003cbr/\u003e•\tPartner with senior Finance and Business Leaders to drive strategic initiatives around AI, automation and serve as a force multiplier for the Home and Lifestyles Product Family.\u003cbr/\u003e•\tProactively identify opportunities to inspect finance defects, rootcause and embed controls at the right level to mitigate business-driven risk. \u003cbr/\u003e•\tCommunicate complex financial insights effectively to senior leadership, driving strategic decision-making \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour day will be a dynamic blend of strategic analysis, cross-functional collaboration, and transformative problem-solving. You'll dive deep into complex financial ecosystems, developing approaches to financial reporting, allocation, and analysis that reshape how our organization understands and leverages financial information. While day-to-day operations will revolve around month-end close and NA Stores planning calendar timelines, you will also partner closely with senior Finance controllers and business leaders to solve challenging problems through single-threaded owners and stewardship.","department_cost_center":null,"description_short":"The US Home and Lifestyle (H\u0026L) organization is seeking a talented Finance Leader to join the team. This is an exciting opportunity to partner across a group of profitable and large core businesses to","display_distance":null,"id":"51132234-fc6e-4552-828a-e84520d06b3d","id_icims":"3165831","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/Planning","job_function_id":null,"job_path":"/en/jobs/3165831/principal-finance-manager-home-lifestyle-core-categories-and-tech","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA70\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"January 23, 2026","preferred_qualifications":"- MBA, or CPA\u003cbr/\u003e- Experience in a leadership position managing finance, accounting and operational processes\u003cbr/\u003e- Experience in mentoring junior finance or business team members\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 139,100.00 - 188,200.00 USD annually","primary_search_label":"finance.team-consumer","source_system":"JobCreator","state":"WA","title":"Principal Finance Manager, Home \u0026 Lifestyle Core Categories and Tech","university_job":null,"updated_time":"24 minutes","url_next_step":"https://account.amazon.com/jobs/3165831/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-consumer","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}