{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 1+ years of Microsoft Office products and applications experience\u003cbr/\u003e- High school or equivalent diploma\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- 3+ years of conducting predictive and preventative maintenance procedures experience\u003cbr/\u003e- 4+ years of repairing material handling equipment (MHE), automated conveyor systems, or related mechanical/controls equipment experience\u003cbr/\u003e- 4+ years of reading blueprints and electrical schematics experience\u003cbr/\u003e- 4+ years of demonstrating safety standards experience\u003cbr/\u003e- 5+ years of troubleshooting and diagnostics of material handling equipment (MHE) experience","business_category":"operations","city":"Wilmington","company_name":"Amazon.com Services LLC","country_code":"USA","description":"About Maintenance at Amazon:\u003cbr/\u003e\u003cbr/\u003eOperations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every day. Reliability \u0026 Maintenance Engineering (RME) are the business partners that work tirelessly behind the scenes to make it all happen. We drive continuous improvement, and maintain all of the Robotics and Material Handling Equipment (MHE) to ensure our customers are met with the Amazon smile. Come join us on our journey!\u003cbr/\u003e\u003cbr/\u003eAbout the Role:\u003cbr/\u003e\u003cbr/\u003eAs a Senior Mechatronics \u0026 Robotics Technician, you will lead service technicians on the team in the installation and repair of automated packaging and distribution equipment. You will support the Operations Maintenance team by designing solutions for difficult problems and managing projects. You will help train, and mentor service technicians and contract technicians.\u003cbr/\u003e\u003cbr/\u003eWhat Do We Offer?\u003cbr/\u003e\u003cbr/\u003eAmazon offers competitive compensation packages including comprehensive healthcare benefits starting on Day 1, matching 401(k) program, and up to 20 weeks of paid parental leave. But wait, there’s more: we don’t wear suits and ties! Come as you are because jeans, t-shirts, sneakers and sometimes a neon safety vest will be your daily outfit.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eResponsibilities include, but are not limited to\u003cbr/\u003e\u003cbr/\u003e• Promote a safe working environment by following all safety procedures\u003cbr/\u003e• Maintain and troubleshoot all conveyor systems in the building\u003cbr/\u003e• Lead and audit preventative maintenance procedures\u003cbr/\u003e• Install, maintain, and troubleshoot relay logic, ladder diagrams, control components, photo-eyes, motor starters, limit switches, proximity sensors, solenoids, etc.\u003cbr/\u003e• Create and close out work orders with data including labor hours, equipment maintenance and parts used\u003cbr/\u003e• Maintain a positive working relationships across all of the Amazon Operations facility\u003cbr/\u003e• Develop training plans for service technicians\u003cbr/\u003e• Develop work plans for emergency repair of critical assets\u003cbr/\u003e• Move up to 49lbs as well as stand and walk during shifts lasting up to 12 hours, with or without reasonable accommodation\u003cbr/\u003e\u003cbr/\u003ePlease note that while we strive to accommodate employees' preferences for shift assignments, due to operational requirements and scheduling constraints, we cannot guarantee a specific shift assignment.\u003cbr/\u003e\u003cbr/\u003eThe following are typical shifts in the Senior Mechatronics \u0026 Robotics Technician role: \u003cbr/\u003e\u003cbr/\u003eFront Half Day Shift:\u003cbr/\u003eSchedule: 4 days on, 3 days off. The days can be set according to your operational needs, a common pattern is working Sunday to Wednesday.\u003cbr/\u003eHours: Typically, this shift might start in the morning and end in the late afternoon. For a 10-hour shift, this could be 6:00 AM to 4:30 PM, with a half-hour break included.\u003cbr/\u003e\u003cbr/\u003eBack Half Day Shift:\u003cbr/\u003eSchedule: 4 days on, 3 days off. Often, this shift could be Wednesday to Saturday to complement the Front Half Day Shift.\u003cbr/\u003eHours: Like the Front Half Day shift, this shift would also occur during daytime hours. Depending on your downtime windows, a typical schedule might be from 7:00 AM to 5:30 PM, with a half-hour break.\u003cbr/\u003e\u003cbr/\u003eFront Half Night Shift:\u003cbr/\u003eSchedule: 4 days on, 3 days off. The days can be arranged as per your needs, such as Sunday to Wednesday.\u003cbr/\u003eHours: This shift would occur during the night. For example, it could run from 6:00 PM to 4:30 AM, with a half-hour break.\u003cbr/\u003e\u003cbr/\u003eBack Half Night Shift:\u003cbr/\u003eSchedule: 4 days on, 3 days off. To complement the Front Half Night Shift, this might run from Wednesday to Saturday.\u003cbr/\u003eHours: Like the Front Half Night shift, this shift would take place during the night. Depending on your downtime windows, a typical schedule might be from 7:00 PM to 5:30 AM, with a half-hour break.","department_cost_center":null,"description_short":"About Maintenance at Amazon:Operations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds","display_distance":null,"id":"39bca4b1-a74c-4b25-9c5c-ab6be0205949","id_icims":"3117421","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/facilities","job_function_id":null,"job_path":"/en/jobs/3117421/senior-mechatronics-robotics-technician-wilmington-nc","job_schedule_type":"full-time","location":"US, NC, Wilmington","locations":["{\"normalizedStateName\":\"North Carolina\",\"normalizedCountryCode\":\"USA\",\"city\":\"Wilmington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NC, Wilmington\",\"coordinates\":\"34.23525,-77.94603\",\"normalizedCountyName\":\"New Hanover\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Wilmington, North Carolina, USA\",\"location\":\"US, NC, Wilmington\",\"region\":\"NC\",\"buildingCodeList\":[\"ILM1\"],\"normalizedCityName\":\"Wilmington\"}"],"normalized_location":"Wilmington, North Carolina, USA","optional_search_labels":["operations.team-reliability-maintenance-engineering-na"],"posted_date":"October 29, 2025","preferred_qualifications":"- Experience with material handling equipment (MHE) safety standards accordance with original equipment manufacturer (OEM) and safety standards\u003cbr/\u003e- Experience in troubleshooting installation, fault finding, and repairs\u003cbr/\u003e- Experience with a Computerized Maintenance Management System (CMMS)\u003cbr/\u003e- Experience leading continuous process improvement in a technical support environment\u003cbr/\u003e- 4+ years of electrical theory, robotics, controls components, and automated equipment experience\u003cbr/\u003e- 2+ years of electrical or mechanical experience\u003cbr/\u003e- 2+ years of programmable logic controls (PLC) programs experience\u003cbr/\u003e- 2+ years of robotics system components and controls experience\u003cbr/\u003e- Experience managing projects\u003cbr/\u003e- Experience acting in a shift lead capacity that supports, trains, and mentors less experienced technicians\u003cbr/\u003e- Willingness to learn and grow within Amazon RME\u003cbr/\u003e- Experience working with multiple stakeholders (Operations, Safety, etc.) to coordinate complex maintenance activities\u003cbr/\u003e- Associates or higher degree from a vocational school or college with a focus in the Mechanical or Electrical field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NC, Wilmington - 40.00 - 46.00 USD hourly","primary_search_label":"operations.team-reliability-maintenance-engineering","source_system":"JobCreator","state":"NC","title":"Senior Mechatronics \u0026 Robotics Technician - Wilmington, NC","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3117421/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-reliability-maintenance-engineering","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one modern language such as C++, C#, Java, Python, Golang, PowerShell, Ruby\u003cbr/\u003e- Proven track record of delivering software systems in production environments\u003cbr/\u003e- Strong understanding of computer science fundamentals including data structures, algorithms, and distributed systems\u003cbr/\u003e- Experience building and operating software systems that meet business goals and operational requirements","business_category":"subsidiaries","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Industrial Robotics is building the future of manufacturing and industrial operations. Our team combines cutting-edge robotics technology with world-class software engineering to deliver AI-native solutions that operate on an unprecedented scale. We're pioneering high-performance, low-latency systems (\u003c100ms) that coordinate complex robotic operations while continuously learning and improving from production data. You'll work with passionate builders who are customer-obsessed and committed to technical excellence in applying buffer-centric and flow optimization principles to create manufacturing environments where humans and robots work safely and efficiently together. In this environment your contributions directly impact Amazon's ability to serve customers worldwide by optimizing entire systems rather than individual components.\u003cbr/\u003e\u003cbr/\u003eAmazon Industrial Robotics is seeking an exceptional Software Development Engineer to build and scale software systems that enable advanced manufacturing capabilities and industrial operations. You will design, develop, and deliver critical components of our software stack, from real-time operational systems to enterprise-scale platforms, working at the forefront of AI-driven robotics and automation technology that orchestrates sophisticated operations at unprecedented scale.\u003cbr/\u003e\u003cbr/\u003eAs an SDE, you will apply strong technical skills to solve complex problems while collaborating with cross-functional teams including Senior Engineers, Principal Engineers, Software Development Managers, Technical Program Managers, and technology partners. You will leverage AI in development practices to enhance productivity through AWS Kiro and other AI-native development tools and contribute to building AI-enabled product capabilities. This is a ground-floor opportunity to make significant technical contributions to a strategic robotics initiative that combines cutting-edge AI, distributed systems, and advanced manufacturing processes.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Design, develop, and extend high-performance, test-driven code that is scalable, maintainable, and meets business requirements for industrial robotics systems\u003cbr/\u003e- Implement solutions that are scalable, cost-effective, and operate reliably at Amazon scale\u003cbr/\u003e- Participate in technical design reviews and contribute to architectural decisions for distributed systems supporting manufacturing operations\u003cbr/\u003e- Build software solutions leveraging AI-native development practices and tools to enhance productivity and contribute to AI-enabled product capabilities\u003cbr/\u003e- Own delivery of software components from design through deployment, including production support and operational excellence\u003cbr/\u003e- Follow and help maintain technical standards for code quality, testing, deployment, and monitoring\u003cbr/\u003e- Collaborate with team members and provide technical guidance to junior engineers\u003cbr/\u003e- Partner with cross-functional stakeholders to translate business requirements into technical solutions\u003cbr/\u003e- Work in an Agile/Scrum environment to deliver high-quality software with aggressive timelines\u003cbr/\u003e- Identify and solve difficult problems with well-defined solutions\u003cbr/\u003e- Participate in technical reviews and provide valuable feedback\u003cbr/\u003e- Contribute to continuous improvement in development processes, tools, and practices","department_cost_center":null,"description_short":"Amazon Industrial Robotics is building the future of manufacturing and industrial operations. Our team combines cutting-edge robotics technology with world-class software engineering to deliver AI-native","display_distance":null,"id":"0bb978ec-9e33-4693-8b72-a4feafd1c05e","id_icims":"3173456","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3173456/software-development-engineer-ii-amazon-industrial-robotics","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA90\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February  4, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in Computer Science, Engineering, a related field, or equivalent experience\u003cbr/\u003e- Experience with AI-native software development practices and leveraging AI tools for productivity gains (e.g., Amazon Kiro, Amazon Q Developer, Amazon CodeWhisperer, Cline, Wasabi)\u003cbr/\u003e- Experience with AI/ML capabilities in software systems\u003cbr/\u003e- Experience with cloud platforms (AWS preferred) and building scalable distributed systems\u003cbr/\u003e- Knowledge of flow optimization, theory of constraints, or manufacturing/industrial systems\u003cbr/\u003e- Experience with partner integrations and enterprise software systems\u003cbr/\u003e- Experience with robotics systems, autonomous agents, or industrial automation\u003cbr/\u003e- Ability to balance competing interests between time, quality, and resources\u003cbr/\u003e- Ability to work backwards from customer needs to define appropriate solutions\u003cbr/\u003e- Demonstrated ability to work in fast-paced environments with changing priorities\u003cbr/\u003e- Strong problem-solving skills with ability to think creatively and propose innovative solutions\u003cbr/\u003e- Effective written and verbal communication skills, with ability to clearly present technical concepts\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 143,700.00 - 194,400.00 USD annually","primary_search_label":"subsidiaries.team-amazon-robotics","source_system":"JobCreator","state":"WA","title":"Software Development Engineer II, Amazon Industrial Robotics","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/3173456/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-robotics","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Work a flexible schedule including weekends, nights, and holidays\u003cbr/\u003e- 18+ months of computer/server hardware troubleshooting or related IT experience\u003cbr/\u003e- 18+ months of computer layer 1/2 networking experience (including troubleshooting and repair)","business_category":"aws","city":"Mansfield","company_name":"Amazon Data Services, Inc. - A19","country_code":"USA","description":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring seamless data center operations that power millions of businesses and services worldwide.\u003cbr/\u003eData Center Technician position involves in-depth hardware and network diagnostics followed by physical repair as well as participating in an on-call rotation.\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role.\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e•\tLifting and moving material up to 40 pounds each\u003cbr/\u003e•\tWorking in cramped and/or elevated locations\u003cbr/\u003e•\tBending, lifting, stretching, and reaching\u003cbr/\u003e•\tStanding and walking for up to 8+ hours a day\u003cbr/\u003e•\tAscending and descending ladders, stairs, and gangways safely and without limitation\u003cbr/\u003e•\tWork in an industrial environment\u003cbr/\u003e•\tWork shifts longer than 8 hours to support 24/7 operations (covering both night and day shifts).\u003cbr/\u003e•\tThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational.\u003cbr/\u003e\u003cbr/\u003eEssential Requirements: \u003cbr/\u003e•\tAbility to travel to or commute between data center locations as needed \u003cbr/\u003e•\tWillingness to temporarily work at alternative sites during training periods or until assigned facility is operational \u003cbr/\u003e•\tTravel frequency will vary based on business needs and operational status of assigned facility\u003cbr/\u003e•\tCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tPerforming server rack installations, hardware break-fix on various components, troubleshooting network issues, responding to operational incidents that impact service availability, and carrying out routine network, server hardware, and operating system repairs to contribute to the overall availability of AWS services\u003cbr/\u003e•\tServing as a primary contact point for both internal and external stakeholders, including engineers, software developers, vendors, and contractors\u003cbr/\u003e•\tPerforming on-call duties and participating in scheduled maintenance and change management activities\u003cbr/\u003e•\tContributing to documentation and process improvement initiatives based on your analysis of operational issues\u003cbr/\u003e•\tHelping to interview, train and onboard new team members\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eOur Data Center Technician professionals, who have industry-leading technical abilities and demonstrate a breadth of knowledge while they:\u003cbr/\u003e•\t Take ownership of technical issues brought by their customer base, engaging other teams when needed to drive resolution\u003cbr/\u003e•\tShow a strong aptitude for troubleshooting and problem solving\u003cbr/\u003e•\tSolve problems at their root and step back to understand the broader context\u003cbr/\u003e•\tMaintain service level agreements through the implementation of proactive issue detection and reporting\u003cbr/\u003e•\tAre biased to act in the absence of direction or support\u003cbr/\u003e•\tImprove effectiveness through process innovation\u003cbr/\u003e You will be required to work shift work that will include days/nights/weekends/holidays.\u003cbr/\u003e","department_cost_center":null,"description_short":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring","display_distance":null,"id":"341947ab-9493-4227-9db8-d167a850fd2f","id_icims":"3178702","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3178702/data-center-technician","job_schedule_type":"full-time","location":"US, TX, Mansfield","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Mansfield\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Mansfield\",\"coordinates\":\"32.56517,-97.14185\",\"normalizedCountyName\":\"Tarrant\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Mansfield, Texas, USA\",\"location\":\"US, TX, Mansfield\",\"region\":\"TX\",\"buildingCodeList\":[\"DFW70\"],\"normalizedCityName\":\"Mansfield\"}"],"normalized_location":"Mansfield, Texas, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"February 11, 2026","preferred_qualifications":"- Experience in a data center or other critical environment\u003cbr/\u003e- Bachelor's degree or equivalent professional or military experience in an IT-related field (e.g. computer science, network engineering, etc.)\u003cbr/\u003e- Industry standard certifications (CompTIA, CCENT, Network+)\u003cbr/\u003e- Understanding of Linux or similar operating systems\u003cbr/\u003e- Behavioral interviewing and hiring experience\u003cbr/\u003e- Experience training and onboarding of new team members\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Mansfield - 29.00 - 52.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"TX","title":"Data Center Technician","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3178702/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"-Bachelor’s degree in Mechanical Engineering, Electrical Engineering, Construction Management and 14+ years of relevant experience or an equivalent engineering science degree *OR * 18 years of related construction management experience *in lieu* of a degree\u003cbr/\u003e\u003cbr/\u003e-14+ years of relevant experience constructing and managing complex MEP systems, including large-scale power distribution/generation gear and cooling systems in mission-critical environments\u003cbr/\u003e\u003cbr/\u003e-10+ years of relevant experience managing general contractors and vendors, including RFP processes, bidding, change orders, quality control, and RFI/submittal tracking in construction project execution\u003cbr/\u003e\u003cbr/\u003e-10+ years of relevant experience *constructing *electrical engineering systems including large scale power distribution/generation gear and constructing mechanical engineering systems including cooling systems\u003cbr/\u003e\u003cbr/\u003e","business_category":"aws","city":"Herndon","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we're the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we're looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou'll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You'll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you'll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAs a Data Center Construction Manager, you will be part of a creative, diverse team tasked with solving fascinating problems in constructing Amazon Data Centers. Our data centers are industry-leading examples of energy-efficient, cost-effective designs. You will work alongside partner teams such as Operations, Networking, Controls, Security, and Commissioning to build Data Centers that directly support our Customers.\u003cbr/\u003e\u003cbr/\u003eAs our Data Center Construction Manager, you will build some of the most interesting electrical and mechanical systems in the world. You will be on the construction site daily, interacting with the construction trades as Amazon's owner's representative. You will be directly responsible for driving cost, schedule, and quality while managing construction vendors and contractors building data centers.\u003cbr/\u003e\u003cbr/\u003eAt Amazon, we are all Owners and leverage unique opportunities presented to us by owning everything from design review to construction bidding to construction execution and final hand-off to our customers. We are a diverse, upbeat, creative team of engineers and managers working daily to develop innovative data centers for our Customers.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe Data Center Construction Manager will be responsible for construction project management and oversight of construction-related activities as they relate to new builds or general capital projects. This includes ownership of the project scope, quality, schedule, and budget.\u003cbr/\u003e\u003cbr/\u003eSome of the typical daily tasks of the Construction Manager:\u003cbr/\u003e\u003cbr/\u003e-Direct interface with construction general contractors during the bidding, award, execution, and project closeout/punch list phases.\u003cbr/\u003e\u003cbr/\u003e-Conduct negotiations with general contractors and evaluate bids/proposals with detail and accuracy.\u003cbr/\u003e\u003cbr/\u003e-Create construction project scope and requests for proposals.\u003cbr/\u003e\u003cbr/\u003e-Perform financial analysis of construction.\u003cbr/\u003e\u003cbr/\u003e-Manage construction projects for specific initiatives aimed at increasing the resiliency of our data centers.\u003cbr/\u003e\u003cbr/\u003e-Conduct constructability reviews of electrical and mechanical designs associated with the construction of new data centers or optimization of existing data centers.\u003cbr/\u003e\u003cbr/\u003e-Manage construction documents including submittal review, RFIs, change orders, and invoicing.\u003cbr/\u003e\u003cbr/\u003e-Ensure construction project quality control.\u003cbr/\u003eRecord and report key construction metrics to team members and management.\u003cbr/\u003e\u003cbr/\u003e-Drive teams to perform troubleshooting and root-cause failure analysis associated with equipment failures.\u003cbr/\u003e\u003cbr/\u003e-Be a leader within the group as well as within internal and external teams that support the data center.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e**Why AWS**\u003cbr/\u003e Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003e*Diverse Experiences*\u003cbr/\u003e Amazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003e*Work/Life Balance*\u003cbr/\u003e We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003e*Inclusive Team Culture*\u003cbr/\u003e Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003e*Mentorship and Career Growth*\u003cbr/\u003e We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we're the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"d2b2d7a2-c496-41f5-827e-a47539e9b10c","id_icims":"3068193","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3068193/senior-construction-manager-aws-dccd-amer-se","job_schedule_type":"full-time","location":"US, VA, Herndon","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD31\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Herndon, Virginia, USA","optional_search_labels":["aws.team-ais"],"posted_date":"August 28, 2025","preferred_qualifications":"-Strong understanding of data center system-level architecture, including electrical (e.g., switch gear, UPS, transformers) and mechanical (cooling systems) engineering principles. \u003cbr/\u003e\u003cbr/\u003e-Experience in designing and managing construction of complex data centers, critical infrastructure, or large-scale MEP plants. \u003cbr/\u003e\u003cbr/\u003e-Proficiency in reading and interpreting construction specifications and drawings for all disciplines, and ability to create and maintain project documentation.\u003cbr/\u003e\u003cbr/\u003e-Knowledge of relevant building codes and regulations (e.g., Life Safety, BOCA, NFPA, NEC, OSHA) and certifications such as Professional Engineer (PE), LEED, or Certified Construction Manager (CCM). \u003cbr/\u003e\u003cbr/\u003e-Demonstrated ability to value engineer, finding innovative solutions to reduce costs and duration without compromising quality and reliability. \u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Herndon - 139,300.00 - 208,000.00 USD annually","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"VA","title":"Senior Construction Manager , AWS DCCD AMER SE ","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3068193/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- - • 1+ years in a high traceability manufacturing environment, or relevant trade school certification\u003cbr/\u003e- - • 1+ years using hand tools and/or precision measuring instruments (i.e., Calipers, multi-meters, torque wrenches)\u003cbr/\u003e- - • 1+ years working with test tools and test methods that adequately validate the system\u003cbr/\u003e- - • Experience reading, interpreting and working from engineering documentation and/or drawings","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"LEO is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the capacity, flexibility, and performance to serve a wide range of customers, from individual households to schools, hospitals, businesses, government agencies, and other organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eWe are looking for talented technicians to help full-scale production of the LEO  satellites. The success of LEO depends on the quality, reliability, cost, manufacturability, throughput, and security of the products that you deliver. If you seek a fast-paced, dynamic environment; if you thrive on solving difficult problems where resolutions have high impact; and if you love the challenge of building something from scratch, then this role will be an ideal next career step. To be successful you need to be highly motivated and detail oriented while showing the highest standards of execution.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Follow work instructions and safety procedures\u003cbr/\u003e- Assemble and test with emphasis to detail, an assortment of LRUs, electrical-mechanical assemblies, avionics, or other complex aerospace builds\u003cbr/\u003e- Participate in process improvements, maintain floor stock inventory\u003cbr/\u003e- You will independently execute and prioritize work to meet company deliverables\u003cbr/\u003e- Execute test procedures for component and system level testing maintenance\u003cbr/\u003e- Champion safety requirements in all designated zones and work locations\u003cbr/\u003e- Ensure lab equipment is maintained and calibrated\u003cbr/\u003e- Supports some preventative maintenance activities on test equipment and data acquisition systems\u003cbr/\u003e- Receive shipments and coordinate deliveries with recipients (Using pallet jacks, kit carts, etc)\u003cbr/\u003e- Your work may include contributing to improving SOPs and safety procedures\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eCandidates must be 18 years or older with the ability to understand and adhere to all job requirements and safety guidelines.\u003cbr/\u003e\u003cbr/\u003eThe starting pay for this role in Washington State is up to $33.50 / hour and employees are eligible for incremental raises based on tenure. This information is provided per the Washington State Pay Transparency Act. Base pay information is based on market location. Applicants should apply via Amazon’s internal or external careers site.","department_cost_center":null,"description_short":"LEO is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the capacity,","display_distance":null,"id":"742a0b72-ec82-4cbe-9a9d-4e70983acc2d","id_icims":"3176507","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Manufacturing","job_function_id":null,"job_path":"/en/jobs/3176507/manufacturing-assembly-technician-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA99\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":["devices-manufacturing"],"posted_date":"February 13, 2026","preferred_qualifications":"- •\tExperience in the aerospace industry, automotive industry, medical device industry, aviation, military or other high-reliability operating environment\u003cbr/\u003e- •\tExperience in a fast-paced production environment\u003cbr/\u003e- •\tExperience working with FOD, ESD sensitive hardware and clean room requirements\u003cbr/\u003e- •\tExperience with forklifts, cranes and heavy equipment (including previous certifications)\u003cbr/\u003e- •\tA demonstrated ability in reading/understanding technical drawings, work instructions and standard operating procedures\u003cbr/\u003e- •\tSome basic knowledge of electrical, optical and mechanical systems, antennas, functional testing and/or satellite components\u003cbr/\u003e- •\tAbility to use multiple types of precision measuring instruments\u003cbr/\u003e- •\tAbility to work effectively in a team environment\u003cbr/\u003e- •\tAbility to rapidly change roles/responsibilities while working in a high-paced, challenging work environment\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below including the base pay rate plus the highest available shift differential which applies depending on the shift you select. As a total compensation company, you are eligible for additional earnings including overtime pay and performance bonuses. Final pay will be based on factors including shift selection and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, REDMOND - 32.00 - 35.00 USD hourly","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Manufacturing Assembly Technician , Amazon Leo","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3176507/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Work a flexible schedule including weekends, nights, and holidays\u003cbr/\u003e- 18+ months of computer/server hardware troubleshooting or related IT experience\u003cbr/\u003e- 18+ months of computer layer 1/2 networking experience (including troubleshooting and repair)","business_category":"aws","city":"Mansfield","company_name":"Amazon Data Services, Inc. - A19","country_code":"USA","description":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring seamless data center operations that power millions of businesses and services worldwide.\u003cbr/\u003eData Center Technician position involves in-depth hardware and network diagnostics followed by physical repair as well as participating in an on-call rotation.\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role.\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e•\tLifting and moving material up to 40 pounds each\u003cbr/\u003e•\tWorking in cramped and/or elevated locations\u003cbr/\u003e•\tBending, lifting, stretching, and reaching\u003cbr/\u003e•\tStanding and walking for up to 8+ hours a day\u003cbr/\u003e•\tAscending and descending ladders, stairs, and gangways safely and without limitation\u003cbr/\u003e•\tWork in an industrial environment\u003cbr/\u003e•\tWork shifts longer than 8 hours to support 24/7 operations (covering both night and day shifts).\u003cbr/\u003e•\tThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational.\u003cbr/\u003e\u003cbr/\u003eEssential Requirements: \u003cbr/\u003e•\tAbility to travel to or commute between data center locations as needed \u003cbr/\u003e•\tWillingness to temporarily work at alternative sites during training periods or until assigned facility is operational \u003cbr/\u003e•\tTravel frequency will vary based on business needs and operational status of assigned facility\u003cbr/\u003e•\tCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tPerforming server rack installations, hardware break-fix on various components, troubleshooting network issues, responding to operational incidents that impact service availability, and carrying out routine network, server hardware, and operating system repairs to contribute to the overall availability of AWS services\u003cbr/\u003e•\tServing as a primary contact point for both internal and external stakeholders, including engineers, software developers, vendors, and contractors\u003cbr/\u003e•\tPerforming on-call duties and participating in scheduled maintenance and change management activities\u003cbr/\u003e•\tContributing to documentation and process improvement initiatives based on your analysis of operational issues\u003cbr/\u003e•\tHelping to interview, train and onboard new team members\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eOur Data Center Technician professionals, who have industry-leading technical abilities and demonstrate a breadth of knowledge while they:\u003cbr/\u003e•\t Take ownership of technical issues brought by their customer base, engaging other teams when needed to drive resolution\u003cbr/\u003e•\tShow a strong aptitude for troubleshooting and problem solving\u003cbr/\u003e•\tSolve problems at their root and step back to understand the broader context\u003cbr/\u003e•\tMaintain service level agreements through the implementation of proactive issue detection and reporting\u003cbr/\u003e•\tAre biased to act in the absence of direction or support\u003cbr/\u003e•\tImprove effectiveness through process innovation\u003cbr/\u003e You will be required to work shift work that will include days/nights/weekends/holidays.\u003cbr/\u003e","department_cost_center":null,"description_short":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring","display_distance":null,"id":"d6413869-32b0-4345-90b8-ad1a8bd1e374","id_icims":"3178713","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3178713/data-center-technician","job_schedule_type":"full-time","location":"US, TX, Mansfield","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Mansfield\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Mansfield\",\"coordinates\":\"32.56517,-97.14185\",\"normalizedCountyName\":\"Tarrant\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Mansfield, Texas, USA\",\"location\":\"US, TX, Mansfield\",\"region\":\"TX\",\"buildingCodeList\":[\"DFW70\"],\"normalizedCityName\":\"Mansfield\"}"],"normalized_location":"Mansfield, Texas, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"February 11, 2026","preferred_qualifications":"- Experience in a data center or other critical environment\u003cbr/\u003e- Bachelor's degree or equivalent professional or military experience in an IT-related field (e.g. computer science, network engineering, etc.)\u003cbr/\u003e- Industry standard certifications (CompTIA, CCENT, Network+)\u003cbr/\u003e- Understanding of Linux or similar operating systems\u003cbr/\u003e- Behavioral interviewing and hiring experience\u003cbr/\u003e- Experience training and onboarding of new team members\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Mansfield - 29.00 - 52.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"TX","title":"Data Center Technician","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3178713/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- Knowledge of QA methodology and tools","business_category":"alexa-and-amazon-devices","city":"Chennai","company_name":"ADCI MAA 15 SEZ - K20","country_code":"IND","description":"The Quality Services (QS) organization provides testing support for Devices, Retail, and AWS products. The primary objective of the QS organization is to provide manual testing support. As an Associate, Quality Services, you will perform manual test execution of documented task instructions, produce accurate test results meeting daily targets, and adhere to defined processes. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e1.Gain understanding of the application test procedures and how to use applicable software and tools.\u003cbr/\u003e2.Execute test instructions and report test results accurately and promptly.\u003cbr/\u003e3.Report any deviations observed\u003cbr/\u003e4.Understand any changes in test instructions related to their assigned work\u003cbr/\u003e5.Follow defined processes to perform assigned work","department_cost_center":null,"description_short":"The Quality Services (QS) organization provides testing support for Devices, Retail, and AWS products. The primary objective of the QS organization is to provide manual testing support. As an Associate,","display_distance":null,"id":"1ca1a76e-408a-4873-87e6-345dd57347ed","id_icims":"3163399","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Device associates","job_function_id":null,"job_path":"/en/jobs/3163399/associate-quality-services-last-mile-transporterx","job_schedule_type":"full-time","location":"IN, TN, Chennai","locations":["{\"normalizedStateName\":\"Tamil Nadu\",\"normalizedCountryCode\":\"IND\",\"city\":\"Chennai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TN, Chennai\",\"coordinates\":\"13.08404,80.28274\",\"normalizedCountyName\":\"Chennai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Chennai, Tamil Nadu, IND\",\"location\":\"IN, TN, Chennai\",\"region\":\"TN\",\"buildingCodeList\":[\"MAA15\"],\"normalizedCityName\":\"Chennai\"}"],"normalized_location":"Chennai, Tamil Nadu, IND","optional_search_labels":["alexa-and-amazon-devices.team-administrative-support-job-family"],"posted_date":"January 21, 2026","preferred_qualifications":"- Understanding about software testing. Ability to complete assigned tasks accurately and promptly.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"alexa-and-amazon-devices.no-team-listed","source_system":"JobCreator","state":"TN","title":"Associate, Quality Services, Last Mile TransporterX","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3163399/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- Knowledge of QA methodology and tools","business_category":"alexa-and-amazon-devices","city":"Chennai","company_name":"ADCI MAA 15 SEZ - K20","country_code":"IND","description":"The Quality Services (QS) organization provides testing support for Devices, Retail, and AWS products. The primary objective of the QS organization is to provide manual testing support. As an Associate, Quality Services, you will perform manual test execution of documented task instructions, produce accurate test results meeting daily targets, and adhere to defined processes. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e1.Gain understanding of the application test procedures and how to use applicable software and tools.\u003cbr/\u003e2.Execute test instructions and report test results accurately and promptly.\u003cbr/\u003e3.Report any deviations observed\u003cbr/\u003e4.Understand any changes in test instructions related to their assigned work\u003cbr/\u003e5.Follow defined processes to perform assigned work","department_cost_center":null,"description_short":"The Quality Services (QS) organization provides testing support for Devices, Retail, and AWS products. The primary objective of the QS organization is to provide manual testing support. As an Associate,","display_distance":null,"id":"c2110044-0fcf-45f8-aecf-cff425a35787","id_icims":"3163403","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Device associates","job_function_id":null,"job_path":"/en/jobs/3163403/associate-quality-services-last-mile-transporterx","job_schedule_type":"full-time","location":"IN, TN, Chennai","locations":["{\"normalizedStateName\":\"Tamil Nadu\",\"normalizedCountryCode\":\"IND\",\"city\":\"Chennai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TN, Chennai\",\"coordinates\":\"13.08404,80.28274\",\"normalizedCountyName\":\"Chennai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Chennai, Tamil Nadu, IND\",\"location\":\"IN, TN, Chennai\",\"region\":\"TN\",\"buildingCodeList\":[\"MAA15\"],\"normalizedCityName\":\"Chennai\"}"],"normalized_location":"Chennai, Tamil Nadu, IND","optional_search_labels":["alexa-and-amazon-devices.team-administrative-support-job-family"],"posted_date":"January 21, 2026","preferred_qualifications":"- Understanding about software testing. Ability to complete assigned tasks accurately and promptly.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"alexa-and-amazon-devices.no-team-listed","source_system":"JobCreator","state":"TN","title":"Associate, Quality Services, Last Mile TransporterX","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3163403/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Knowledge of QA methodology and tools\u003cbr/\u003e- Bachelor's degree","business_category":"alexa-and-amazon-devices","city":"Chennai","company_name":"ADCI MAA 12 SEZ","country_code":"IND","description":"The Quality Services (QS) organization provides testing support for Devices, Retail, and AWS products. The primary objective of the QS organization is to provide manual testing support. As an Associate, Quality Services, you will perform manual test execution of documented task instructions, produce accurate test results meeting daily targets, and adhere to defined processes.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Gain understanding of the application test procedures and how to use applicable software and tools.\u003cbr/\u003e- Execute test instructions and report test results accurately and promptly.\u003cbr/\u003e- Report any deviations observed.\u003cbr/\u003e- Understand any changes in test instructions related to their assigned work.\u003cbr/\u003e- Follow defined processes to perform assigned work.","department_cost_center":null,"description_short":"The Quality Services (QS) organization provides testing support for Devices, Retail, and AWS products. The primary objective of the QS organization is to provide manual testing support. As an Associate,","display_distance":null,"id":"9e7ad45f-5f12-47f5-87e4-263f8271ba24","id_icims":"3166130","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Device associates","job_function_id":null,"job_path":"/en/jobs/3166130/associate-quality-services-amazon-kids","job_schedule_type":"full-time","location":"IN, TN, Chennai","locations":["{\"normalizedStateName\":\"Tamil Nadu\",\"normalizedCountryCode\":\"IND\",\"city\":\"Chennai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TN, Chennai\",\"coordinates\":\"13.08404,80.28274\",\"normalizedCountyName\":\"Chennai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Chennai, Tamil Nadu, IND\",\"location\":\"IN, TN, Chennai\",\"region\":\"TN\",\"buildingCodeList\":[\"MAA12\"],\"normalizedCityName\":\"Chennai\"}"],"normalized_location":"Chennai, Tamil Nadu, IND","optional_search_labels":["devices-india"],"posted_date":"January 25, 2026","preferred_qualifications":"- Experience with testing consumer devices\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"alexa-and-amazon-devices.no-team-listed","source_system":"JobCreator","state":"TN","title":"Associate, Quality Services, Amazon Kids","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3166130/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of corporate setting Windows, Mac or Linux Operating systems support experience\u003cbr/\u003e- Experience troubleshooting integrated and interdependent computer systems\u003cbr/\u003e- Experience in a dynamic environment with a high degree of customer service\u003cbr/\u003e- Can lift up to 49 pounds, stand/walk during shifts lasting up to 12 hours, and be able to frequently push, pull, squat, bend, and reach","business_category":"operations","city":"Wilmington","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Operations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every day. OTS provides nonstop global IT support to Amazon Operations as a vital piece to the puzzle. We are looking for self-motivated individuals to take\u003cbr/\u003eon new challenges and motivate teams in fostering solutions to the hurdles we face. Together, we take ownership for what we do — whether supporting IT infrastructure, developing new technology in-house, launching a new Amazon Operations facility, or delighting our customers by delivering packages directly to them.\u003cbr/\u003e\u003cbr/\u003eAbout The Role\u003cbr/\u003eAs an IT Support Associate II, you will use your skills to support the operations team in resolving technical problems within Amazon operations facilities in a defined geographical area that span across a multitude of technical disciplines. We are committed to improvement; you will be encouraged to participate in career development opportunities as presented to progress your career at Amazon.\u003cbr/\u003e\u003cbr/\u003eWhat Do We Offer?\u003cbr/\u003eAmazon offers competitive compensation packages including comprehensive healthcare benefits starting on Day 1, matching 401(k) program, and up to 20 weeks of paid parental leave. But wait, there’s more: we are a casual dress code at each of our locations (jeans, t-shirts, safety shoes and at times a neon safety vest will be your daily outfit). Learn more about Amazon in Andy Jassy's most recent letter to shareholders at https://www.aboutamazon.com/news/company-news/2021-letter-to-shareholders.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eResponsibilities include, but are not limited to:\u003cbr/\u003e- Allocating, maintaining, and troubleshooting of IT equipment used in Amazon Operations facilities.\u003cbr/\u003e - Handling support requests and procedures across the network.\u003cbr/\u003e - Assisting in training new hires.\u003cbr/\u003e - Continuous learning of new technologies.\u003cbr/\u003e- Supporting customers from multiple buildings in the area, as well as remote customers.\u003cbr/\u003e- Moving up to 49lbs as well as standing and walking for shifts lasting up to 12 hours.\u003cbr/\u003e- Traveling within your local or regional area to support our customers.\u003cbr/\u003e","department_cost_center":null,"description_short":"Operations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every","display_distance":null,"id":"a5b4b535-177a-4601-b0cc-51a11dc6f23a","id_icims":"3171881","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Technical Services","job_function_id":null,"job_path":"/en/jobs/3171881/it-support-associate-ii-ops-tech-solutions-ots","job_schedule_type":"full-time","location":"US, MA, Wilmington","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Wilmington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Wilmington\",\"coordinates\":\"42.54793,-71.17239\",\"normalizedCountyName\":\"Middlesex\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Wilmington, Massachusetts, USA\",\"location\":\"US, MA, Wilmington\",\"region\":\"MA\",\"buildingCodeList\":[\"SRH2\"],\"normalizedCityName\":\"Wilmington\"}"],"normalized_location":"Wilmington, Massachusetts, USA","optional_search_labels":["military"],"posted_date":"February  2, 2026","preferred_qualifications":"- CompTIA A+, CompTIA Network+, Cisco/CCNA, Linux (Redhat), Microsoft hardware (installation), AWS, or other industry relevant certifications\u003cbr/\u003e- Experience in a dynamic environment with a high degree of customer service\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MA, Wilmington - 23.00 - 37.00 USD hourly","primary_search_label":"operations.team-ops-tech-engineering-it","source_system":"JobCreator","state":"MA","title":"IT Support Associate II, Ops Tech Solutions (OTS) ","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3171881/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-ops-tech-engineering-it","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}