{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 8+ years of major internet routing protocols experience\u003cbr/\u003e- 5+ years of working in a Linux/Unix environment experience\u003cbr/\u003e- 3+ years of automation scripting using Python, Bash, Shell and/or Perl experience\u003cbr/\u003e- Experience in IP networking technologies such as - BGP, OSPF, IS-IS, MPLS, TCP, SLB, network hardware platforms, and packet forwarding architectures.\u003cbr/\u003e- Network design, engineering, implementation, and/or operations experience.\u003cbr/\u003e- Experience leading solutioning, planning, engineering, growth, operations, and/or enhancement of industry leading IP network solutions.\u003cbr/\u003e- Bachelor's degree in Networking, Computer Science, Computer Engineering, or related technical discipline.","business_category":"aws","city":"Herndon","company_name":"Amazon Development Center U.S., Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services Networking is searching for hands-on Senior Network Development Engineer to join our network team that owns critical Amazon Web Services IP networks for our public sector regions. The team drives design, engineering, implementation, operations, reliability, and sustainability of these next-generation networks and works on innovative ways to automate and scale our network as we expand. Position location can be Herndon, VA, Arlington, VA, or Seattle, WA.\u003cbr/\u003e\u003cbr/\u003eOur ideal candidate is hands-on, autonomous, detail oriented, possesses strong written and verbal communication skills, strong project management and time management skills, and has a successful track record of engineering, delivering, and optimizing durable solutions. The desire and ability to work in a fast paced, collaborative environment; with geographically diverse teams is essential. This is a fantastic opportunity to work with some of the best engineers in the industry and help shape the direction of one of the largest and fastest growing cloud networks in the world.\u003cbr/\u003e  \u003cbr/\u003eResponsibilities:\u003cbr/\u003e\u003cbr/\u003e - As a Senior Network Development Engineer working in AWS Networking, you will have end to end ownership (design, engineering, implementation, operations escalation) of our current and newly developing IP networks\u003cbr/\u003e -  Lead the design and evolution of highly available hyper-scale networks, driving them from concept to launch, and beyond  \u003cbr/\u003e -  Define and influence strategy within and outside the team \u003cbr/\u003e -  Lead project teams to deliver impactful benefits to our customers \u003cbr/\u003e -  Work closely with our network engineers and software developers to automate network deployment and operations \u003cbr/\u003e -  Drive operational excellence projects to improve network performance and reliability \u003cbr/\u003e -  Troubleshoot complex problems and develop innovative solutions \u003cbr/\u003e - Hiring, mentoring and coaching engineers \u003cbr/\u003e -  Review and implement changes on the network\u003cbr/\u003ePhysical and Other Requirements:\u003cbr/\u003e -  Must be willing to support an off-hours operations escalation pager rotation. \u003cbr/\u003e -  Experience dealing with customers during problem resolution and operating efficiently under pressure.\u003cbr/\u003e -   The ability to sit in front of computer during scheduled work hours  with appropriate breaks while maintaining a high level of alertness and  attention to detail.\u003cbr/\u003e -  Travel to data center/network sites and Amazon/customer offices as needed.\u003cbr/\u003e\u003cbr/\u003eThis position requires that the candidate selected be a U.S. citizen and obtain and maintain an active TS/SCI with a polygraph.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. ","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"199dfb7d-d5be-49bd-9201-72a73a79bd7c","id_icims":"3055031","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Network Development","job_function_id":null,"job_path":"/en/jobs/3055031/sr-network-development-engineer-adc-network-design-engineering-and-solutions","job_schedule_type":"full-time","location":"US, VA, Herndon","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD21\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Herndon, Virginia, USA","optional_search_labels":["aws.team-adc-infra-optional","aws.team-neteng","military","aws.team-clearedvets","aws.team-ais"],"posted_date":"August  8, 2025","preferred_qualifications":"- Ability to lead and deliver complex network projects and drive operational excellence.\u003cbr/\u003e- Proficiency in developing network automation software.\u003cbr/\u003e- Ability to drive and manage customer impacting network events.\u003cbr/\u003e- Ability to work in a fast paced and collaborative environment.\u003cbr/\u003e- Ability to deal with ambiguity, prioritize, and time manage effectively.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $143,200/year in our lowest geographic market up to $247,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-us-security-clearance-jobs-primary","source_system":"JobCreator","state":"VA","title":"Sr. Network Development Engineer, ADC Network Design, Engineering, and Solutions","university_job":null,"updated_time":"2 minutes","url_next_step":"https://account.amazon.com/jobs/3055031/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-us-security-clearance-jobs-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"A Master’s degree or foreign equivalent in engineering, business administration, or related field and 3 years of experience in job offered or in product/program management related occupation. In the alternative, a Bachelor’s degree or foreign equivalent in engineering, business administration, or related field followed by 5 progressively responsible years of experience in job offered or in product/program management related occupation.  Experience must include:\u003cbr/\u003e\u003cbr/\u003e1.\t3 years of experience must include: product/program management;\u003cbr/\u003e2.\t3 years of experience conducting analysis and performing data mining utilizing tools such as, LAN, WAN, Wireless, Telecommunications, Systems Administration, Low voltage data cabling, or data facilities technologies; and\u003cbr/\u003e3.\t3 years of experience developing and driving strategic Initiatives within a cross-functional environment, involving multiple stakeholders and varying levels of management.\u003cbr/\u003e4.\t3 years of Technical program management experience working on infrastructure projects of new site or existing site launches from initiation to closure.\u003cbr/\u003e5.\t3 years of experience in procurement of equipment, Construction, IT, Material Handling Equipment (MHE) infrastructure and service concepts.\u003cbr/\u003e","business_category":"no-business-category","city":"Pflugerville","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Employer: Amazon.com Services LLC\u003cbr/\u003ePosition: Tech Infra Program Manager II\u003cbr/\u003eLocation: Pflugerville, TX\u003cbr/\u003e\u003cbr/\u003eMultiple Positions Available:\u003cbr/\u003e\u003cbr/\u003e1.\tDevelop and manage IT projects from beginning to end, including project scope, timeline, hardware procurement, resource allocation, and project execution coordinating remote work closely with field teams.\u003cbr/\u003e2.\tProvide project management and direction to ensure the project team has a clear understanding of timelines, risks, escalation path and roles/responsibilities they will undertake within the project team.\u003cbr/\u003e3.\tAct as an escalation point for the project team and project stakeholders to manage risks, develop mitigation plans and path to green throughout the project.\u003cbr/\u003e4.\tOwn updates and knowledge documentation regarding hardware and equipment standards to ensure appropriate hardware standards are met and the correct equipment procured.\u003cbr/\u003e5.\tProactively manage change control and communicate impact in project scope, identify issues, and devising contingency plans.\u003cbr/\u003e6.\tIdentify and manage project dependencies and critical paths and with maintaining accurate project plans with real-time milestone, task and project health data for all your projects in the PPM tool.\u003cbr/\u003e7.\tProvide frequent on-site monitoring and enforcement of installation schedules and vendor quality, inspect prospective and completed facilities in accordance with corporate standards and procedures, and ensure proper follow-up.\u003cbr/\u003e8.\tFacilitate formal turn-over with onsite team, support partners and monitor deliverables until agreed upon launch/project milestone is achieved.\u003cbr/\u003e9.\tUpdate or develop documentation on processes that are critical to successfully implementing your projects.\u003cbr/\u003e10.\tIdentify opportunities to streamline deployments, share best practices with your peers and leaders and implement continuous improvement actions on a regular basis.\u003cbr/\u003e11.\tDomestic and international travel up to 50% to perform role responsibilities may be required.\u003cbr/\u003e","department_cost_center":null,"description_short":"Employer: Amazon.com Services LLCPosition: Tech Infra Program Manager IILocation: Pflugerville, TXMultiple Positions Available:1.\tDevelop and manage IT projects from beginning to end, including project","display_distance":null,"id":"701ea428-a8f6-47e7-a0e0-0c19954bab02","id_icims":"3072021","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Tech Infrastructure Prgrm Mgmt","job_function_id":null,"job_path":"/en/jobs/3072021/tech-infra-program-manager-ii-amz12094-12","job_schedule_type":"full-time","location":"US, TX, Pflugerville","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Pflugerville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Pflugerville\",\"coordinates\":\"30.44056,-97.61994\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Pflugerville, Texas, USA\",\"location\":\"US, TX, Pflugerville\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS2\"],\"normalizedCityName\":\"Pflugerville\"}"],"normalized_location":"Pflugerville, Texas, USA","optional_search_labels":[],"posted_date":"September  3, 2025","preferred_qualifications":"All applicants must meet all the above listed requirements.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"TX","title":"Tech Infra Program Manager II - AMZ12094.12","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3072021/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Laurea.\u003cbr/\u003e- Esperienza pregressa comprovata nella gestione di team, KPI e performance.\u003cbr/\u003e- Livello di inglese minimo B2 (intermedio alto)","business_category":"fulfillment-and-operations","city":"Rome","company_name":"Amazon Italia Transport Srl","country_code":"ITA","description":"Il team Operations è il cuore pulsante di Amazon. Svolge un ruolo fondamentale per il nostro business, perché ci permette di evadere e spedire gli ordini in modo efficiente, così che i nostri clienti li ricevano nei tempi previsti. Nel ruolo di Area Manager, dovrai garantire la regolare operatività del tuo sito logistico, per riuscire a soddisfare le richieste dei clienti. Sarai a capo di un team che contribuisce a garantire la sicurezza, l’efficienza e l’alta qualità dei nostri processi e ti occuperai di una serie di progetti su tutta la nostra rete con lo scopo di incrementare la produttività. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Creare, portare avanti e promuovere una cultura incentrata sulla sicurezza e sul benessere.\u003cbr/\u003e- Analizzare e implementare cambiamenti per mantenere qualità e produttività a livelli costantemente elevati.\u003cbr/\u003e- Supervisionare progetti di miglioramento dei processi, ottimizzare la produttività e incrementare la qualità del servizio ai clienti all’interno della tua area di responsabilità.\u003cbr/\u003e- Analizzare le prestazioni dei turni rispetto agli obiettivi aziendali e mettere in atto azioni per migliorare la nostra eccellenza operativa.\u003cbr/\u003e- Lavorare in collaborazione con i colleghi manager per standardizzare le prassi adottate nei turni.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eLavorerai su turni presso uno dei nostri siti logistici, garantendo la massima produttività possibile. Il tuo obiettivo principale sarà promuovere una cultura della sicurezza e il rispetto degli standard di qualità e di performance durante i turni. Dovrai inoltre supervisionare le attività di miglioramento dei processi nella tua area e agevolarne l’implementazione. La tipica giornata di lavoro è molto varia: dovrai occuparti di attività di routine di gestione del team, avrai responsabilità quotidiane volte al miglioramento dei processi e iniziative contingenti di gestione operativa su più ampia scala. Dovrai anche fungere da esempio e da guida per i nuovi manager.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eCollaborazione con aziende di distribuzione terze. La nostra forza è focalizzarci sul pensiero creativo e sul miglioraci continuamente per assicurare che milioni di prodotti arrivino nelle mani dei nostri consumatori. Il nostro obiettivo è semplice: regalare ai clienti l’esperienza di consegna più fluida possibile e lanciare soluzioni globali per la consegna nei nostri nuovi business, come Amazon Fresh, Prime Now e Amazon Restaurants.\u003cbr/\u003eLa nostra attività si articola su due livelli. Da un lato c’è chi opera in sede e gestisce milioni di prodotti, facendoli arrivare ai team responsabili della consegna. Il nostro team è orientato alle persone e sempre pronto a darsi una mano, soprattutto considerato che molti dei nostri colleghi svolgono il turno notturno. Ci concentriamo principalmente sulle attività operative, con turni articolati sulle 24 ore, 7 giorni alla settimana, nella maggior parte delle nostre sedi.\u003cbr/\u003eDall’altro lato invece, c’è chi opera sul campo e collabora con Amazon Flex, la rete di collaboratori esterni a cui ci appoggiamo per le consegne. Di anno in anno puntiamo a offrire ai clienti un’esperienza sempre migliore, grazie a servizi di consegna innovativi. Siamo sempre alla ricerca di nuovi modi per superare le notevoli sfide logistiche tipiche del nostro settore e di nuove idee per ridurre il nostro impatto ambientale, grazie a una flotta di veicoli all’avanguardia (anche elettrici) e a soluzioni tecnologiche mirate. ","department_cost_center":null,"description_short":"Il team Operations è il cuore pulsante di Amazon. Svolge un ruolo fondamentale per il nostro business, perché ci permette di evadere e spedire gli ordini in modo efficiente, così che i nostri clienti li","display_distance":null,"id":"85084b61-38a3-438d-a7c4-fc8b6cf9e03a","id_icims":"3166319","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3166319/area-manager","job_schedule_type":"full-time","location":"IT, RM, Rome","locations":["{\"normalizedStateName\":\"Latium\",\"normalizedCountryCode\":\"ITA\",\"city\":\"Rome\",\"countryIso3a\":\"ITA\",\"countryIso2a\":\"IT\",\"locationNonStemming\":\"Italy, RM, Rome\",\"coordinates\":\"41.90325,12.49563\",\"normalizedCountyName\":\"Rome\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Italy\",\"normalizedLocation\":\"Rome, Latium, ITA\",\"location\":\"IT, RM, Rome\",\"region\":\"RM\",\"buildingCodeList\":[\"DLZ3\"],\"normalizedCityName\":\"Rome\"}"],"normalized_location":"Rome, Latium, ITA","optional_search_labels":["ops.lander-ops-management-it"],"posted_date":"January 26, 2026","preferred_qualifications":"- Esperienza con le metodologie Lean, Six Sigma e Kaizen.\u003cbr/\u003e- Esperienza lavorativa nel settore logistico.\u003cbr/\u003e- Buona padronanza del pacchetto MS Office (Word, Excel, Outlook) ad uso professionale.\u003cbr/\u003e- Vasta esperienza nella comunicazione con un’ampia gamma di stakeholder, tra cui colleghi e manager.\u003cbr/\u003e- Vasta esperienza nell’utilizzo di dati o evidenze storiche per influenzare le decisioni aziendali.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-last-mile-delivery","source_system":"JobCreator","state":"RM","title":"Area Manager ","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3166319/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-delivery","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of building models for business application experience\u003cbr/\u003e- PhD, or Master's degree and 4+ years of CS, CE, ML or related field experience\u003cbr/\u003e- Experience programming in Java, C++, Python or related language\u003cbr/\u003e- Experience in patents or publications at top-tier peer-reviewed conferences or journals\u003cbr/\u003e- Experience in any of the following areas: algorithms and data structures, parsing, numerical optimization, data mining, parallel and distributed computing, high-performance computing","business_category":"subsidiaries","city":"Sunnyvale","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Robots are about to step out of the movies and into our homes. If you're excited about this robotics revolution, come join Amazon's Personal Robotics Group. As an Applied Scientist in this org, you'll design and implement state-of-the-art algorithms that bridge Computer Vision, Metric-semantic Mapping, and Contextual Reasoning to create comprehensive 3D/4D scene understanding capabilities. Your work will directly impact how our intelligent system perceives and reasons about dynamic home environments, building rich world representations that enable safe and effective autonomous operation alongside family members. You'll push the state-of-the-art techniques in Robotics and design novel algorithms that bridge the gap between research and real-world deployment. \u003cbr/\u003e\u003cbr/\u003eIn this role, you'll develop expert models as well as end-to-end learning-based solutions that integrate Spatial Scene Understanding, Semantic Scene Graphs, and High-level Reasoning into unified world models. You'll leverage advanced Deep Learning techniques including Transformer architectures, Neural Radiance Fields, and Multi-modal Foundation Models to create robust representations of domestic spaces. Your solutions will need to handle the unique challenges of unstructured environments - from varying lighting conditions and cluttered spaces to dynamic interactions with humans and pets.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Develop multi-modal perception systems that fuse sensiing modalities in cluding but not limited to RGB-D, LiDAR, and other sensing modalities to create robust spatial-semantic world models.\u003cbr/\u003e- Design and implement advanced 3D/4D scene understanding systems using neural implicit representations, occupancy networks, and dynamic scene graphs\u003cbr/\u003e- Design experiments to identify the limitations of current state-of-the-art models and developing new models or techniques that can surpass these models \u003cbr/\u003e - Collaborate with engineering teams to optimize and scale models for real-world applications. Influence technical decisions and implementation strategies within your area of focus\u003cbr/\u003e- The ability to work with minimal guidance, be proactive and to handle ambiguity and the challenge of quickly evolving goals\u003cbr/\u003e- Communicate complex technical work to a non-technical audience\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e- Design Expert architectures and Train ML models for deployment in simulation and real-world robots, identify and document their limitations post-deployment\u003cbr/\u003e- Drive technical discussions within your team and with key stakeholders to develop innovative solutions to address identified limitations\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Personal Robotics Group is pioneering intelligent robotic products that deliver meaningful customer experiences. We're building the next generation of robotic systems that will redefine how customers interact with technology. This is a unique opportunity to shape the future of personal robotics working with world-class teams pushing the boundaries of what's possible in robotic Manipulation, Locomotion, and Open World Understanding.\u003cbr/\u003e\u003cbr/\u003eJoin us if you’re passionate about creating the future of personal robotics, solving complex challenges at the intersection of hardware and software, and seeing your innovation deliver transformative customer experiences.\u003cbr/\u003e","department_cost_center":null,"description_short":"Robots are about to step out of the movies and into our homes. If you're excited about this robotics revolution, come join Amazon's Personal Robotics Group. As an Applied Scientist in this org, you'll","display_distance":null,"id":"256018e4-43a0-4c98-9096-04d13b7d325a","id_icims":"3179124","is_intern":null,"is_manager":null,"job_category":"Research Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3179124/applied-scientist-personal-robotics-group","job_schedule_type":"full-time","location":"US, CA, Sunnyvale","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sunnyvale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Sunnyvale\",\"coordinates\":\"37.37188,-122.03751\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sunnyvale, California, USA\",\"location\":\"US, CA, Sunnyvale\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC14\"],\"normalizedCityName\":\"Sunnyvale\"}"],"normalized_location":"Sunnyvale, California, USA","optional_search_labels":[],"posted_date":"February 11, 2026","preferred_qualifications":"- 5+ years of deep learning, computer vision, human robotic interaction, algorithms implementation experience\u003cbr/\u003e- PhD\u003cbr/\u003e- Knowledge of architectural concepts and algorithms, schedule tradeoffs and new opportunities with technical team members\u003cbr/\u003e- Experience using Unix/Linux\u003cbr/\u003e- Experience in professional software development\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Sunnyvale - 171,600.00 - 222,200.00 USD annually","primary_search_label":"subsidiaries.team-amazon-robotics","source_system":"JobCreator","state":"CA","title":"Applied Scientist, Personal Robotics Group","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3179124/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-robotics","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"alexa-and-amazon-devices","city":"Sunnyvale","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is an initiative to launch a constellation of Low Earth Orbit satellites that will provide low-latency, high-speed broadband network connectivity to unserved and underserved communities around the world. In this role as a SDE, you will be part of the core technical team building the ground based traffic processing pipelines for connecting Kuiper’s satellite network to the external world. This opportunity will afford you an exciting SDE role in Amazon Leo that would enable you to architect and build software from the ground up and drive the engineering culture of the team.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* You will develop code, build CI/CD pipelines, test automation, and dashboards for monitoring health of systems and data pipelines.\u003cbr/\u003e* You will work with multiple cross functional teams to gather requirements, design, develop, deploy, and operate the infrastructure you build\u003cbr/\u003e* You will develop and mentor junior and new team members.\u003cbr/\u003e* You will engineer and build a cloud service that is reliable and available to provide connectivity for our customers\u003cbr/\u003e* You will work on features that enhance the quality of service and security for our customers.\u003cbr/\u003e* You will collaborate and work on initiatives across multiple teams to build networking functions on AWS cloud infrastructure and set best practices for software development processes.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e\u003cbr/\u003eSDE's at Amazon Leo work on designing networking features with various stakeholders, implementing and testing them on prototype/production environments and delivering solutions with the highest quality. We write code, debug, and create the world’s most innovative products. We also operate our own service fleets and handle our customer issues to provide the best experience for our customers.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at Amazon Leo, we embrace our differences. We are committed to furthering our culture of inclusion. We have innovative benefit offerings, and host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) conference. Amazon’s culture of inclusion is reinforced within our 14 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eOur team puts a high value on work-life balance. It isn’t about how many hours you spend at home or at work, it’s about the workflow you establish that brings energy to both parts of your life. We believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfillment. We are flexible in our working hours and encourage you to find harmony between your work and personal lives.\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Leo is an initiative to launch a constellation of Low Earth Orbit satellites that will provide low-latency, high-speed broadband network connectivity to unserved and underserved communities around","display_distance":null,"id":"74117a17-72cf-44a4-8027-d8d93c088ad4","id_icims":"3136242","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3136242/software-development-engineer-amazon-leo-network-services","job_schedule_type":"full-time","location":"US, CA, Sunnyvale","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sunnyvale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Sunnyvale\",\"coordinates\":\"37.37188,-122.03751\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sunnyvale, California, USA\",\"location\":\"US, CA, Sunnyvale\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC10\"],\"normalizedCityName\":\"Sunnyvale\"}"],"normalized_location":"Sunnyvale, California, USA","optional_search_labels":["kuiper-sde"],"posted_date":"December  2, 2025","preferred_qualifications":"- Experience building services using AWS products\u003cbr/\u003e- Experience in software development, or experience in Linux and Networking protocols\u003cbr/\u003e- Experience troubleshooting networks (e.g., TCP/IP, DNS, routing, switching, firewalls, LAN/WAN, traceroute, iperf, dig, cURL or similar/related technology) \u003cbr/\u003e- Experience with C/C++ or Rust programming language\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Sunnyvale - 165,200.00 - 223,600.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"CA","title":"Software Development Engineer - Amazon Leo Network Services","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3136242/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 8+ years of specific technology domain areas (e.g. software development, cloud computing, systems engineering, infrastructure, security, networking, data \u0026 analytics) experience\u003cbr/\u003e- 3+ years of design, implementation, or consulting in applications and infrastructures experience\u003cbr/\u003e- 10+ years of IT development or implementation/consulting in the software or Internet industries experience","business_category":"aws","city":"San Francisco","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"AWS Global Sales drives adoption of the AWS cloud worldwide, enabling customers of all sizes to innovate and expand in the cloud. Our team empowers every customer to grow by providing tailored service, unmatched technology, and unwavering support. We dive deep to understand each customer's unique challenges, then craft innovative solutions that accelerate their success. This customer-first approach is how we built the world's most adopted cloud. Join us and help us grow.\u003cbr/\u003e\u003cbr/\u003eAre you passionate about helping top software companies accelerate their global innovation journey? Do you want to be at the forefront of Data, Analytics, and Generative AI transformation while supporting one of AWS's key Independent Software Vendor (ISV) partners?\u003cbr/\u003eAmazon Web Services (AWS) is seeking a Senior Solutions Architect to join our Data, Analytics, and GenAI. In this role, you'll work hand in hand with customers to help them make the most of AWS Cloud capabilities to enhance their offerings and drive mutual customer success.\u003cbr/\u003eSolutions Architects own the overall technical relationship between customers and AWS. As a trusted advocate, you'll help customers understand best practices around advanced cloud-based solutions and provide strategic guidance on how to optimize their platform on AWS. You will be at the crossroads of business and technology, engaging with customers at all stages of their cloud adoption journey and expansion.\u003cbr/\u003eIn this role, you will get to practice your creativity, linking technology to tangible solutions and collaborating with customers on the art of the possible. You will have the opportunity to define and design cloud-native reference architectures for data and analytics use cases that support customer's platform. You will also identify patterns and trends that can help accelerate innovation within customer's AWS environment.\u003cbr/\u003e\u003cbr/\u003eKey Responsibilities:\u003cbr/\u003e\u003cbr/\u003e* Own the technical relationship with customers providing technical advocacy as they build and enhance their products on AWS\u003cbr/\u003e* Participate in deep architectural and design discussions with customers to create world-class solutions built on AWS\u003cbr/\u003e* Work with customers to understand their business needs and provide prescriptive guidance on how to leverage AWS technologies\u003cbr/\u003e* Formulate and execute a strategy to drive adoption of AWS services within customer's platform\u003cbr/\u003e* Author and contribute to technical publications such as whitepapers and proof of concepts that highlight AWS.\u003cbr/\u003e* Build deep relationships with senior technical individuals at our customer to enable them to be cloud advocates\u003cbr/\u003e* Capture and share best-practice knowledge amongst the AWS solutions architect community\u003cbr/\u003e* Drive successful outcomes for both AWS and customers through technical enablement\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003e\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003e\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.","department_cost_center":null,"description_short":"AWS Global Sales drives adoption of the AWS cloud worldwide, enabling customers of all sizes to innovate and expand in the cloud. Our team empowers every customer to grow by providing tailored service,","display_distance":null,"id":"75457e8f-d7c9-4944-a216-36ff8e2b88c8","id_icims":"3178060","is_intern":null,"is_manager":null,"job_category":"Solutions Architect","job_family":"Solution Architect","job_function_id":null,"job_path":"/en/jobs/3178060/senior-solutions-architect-data-analytics-genai-isv","job_schedule_type":"full-time","location":"US, CA, San Francisco","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Francisco\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Francisco\",\"coordinates\":\"37.77702,-122.41956\",\"normalizedCountyName\":\"San Francisco\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Francisco, California, USA\",\"location\":\"US, CA, San Francisco\",\"region\":\"CA\",\"buildingCodeList\":[\"SFO28\"],\"normalizedCityName\":\"San Francisco\"}"],"normalized_location":"San Francisco, California, USA","optional_search_labels":[],"posted_date":"February 10, 2026","preferred_qualifications":"- Experience with AWS technologies\u003cbr/\u003e- Experience in IT development or implementation/consulting in the software or Internet industries\u003cbr/\u003e- Experience in a technical role within a sales organization\u003cbr/\u003e- Experience architecting, migrating, transforming or modernizing customer requirements to the cloud\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, San Francisco - 176,600.00 - 239,000.00 USD annually","primary_search_label":"aws.team-solutions-architect-primary","source_system":"JobCreator","state":"CA","title":"Senior Solutions Architect , Data, Analytics, GenAI ISV","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3178060/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-solutions-architect-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of building models for business application experience\u003cbr/\u003e- PhD, or Master's degree and 4+ years of CS, CE, ML or related field experience\u003cbr/\u003e- Experience in patents or publications at top-tier peer-reviewed conferences or journals\u003cbr/\u003e- Experience programming in Java, C++, Python or related language\u003cbr/\u003e- Experience in any of the following areas: algorithms and data structures, parsing, numerical optimization, data mining, parallel and distributed computing, high-performance computing","business_category":"alexa-and-amazon-devices","city":"Bellevue","company_name":"Amazon Kuiper Commercial Services LLC","country_code":"USA","description":"Amazon LEO is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon Leo will serve people and organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eThe Amazon LEO Global Capacity Planning team owns designing, implementing, and operating systems that support the planning, management, and optimization of LEO network resources worldwide. We are looking for a talented scientist to implement LEO's long-term vision and strategy for capacity simulations and inventory optimization. This effort will be instrumental in helping LEO execute on its business plans globally. As one of our valued team members, you will be obsessed with matching our standards for operational excellence with a relentless focus on delivering results.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eIn this role, you will:\u003cbr/\u003e\u003cbr/\u003eWork cross-functionally with product, business development, and various technical teams (engineering, science, R\u0026D, simulations, etc.) to implement the long-term vision, strategy, and architecture for capacity simulations and inventory optimization.\u003cbr/\u003eDesign and deliver modern, flexible, scalable solutions to complex optimization problems for operating and planning satellite resources.\u003cbr/\u003eContribute to short and long terms technical roadmap definition efforts to predict future inventory availability and key operational and financial metrics across the network.\u003cbr/\u003eDesign and deliver systems that can keep up with the rapid pace of optimization improvements and simulating how they interact with each other.\u003cbr/\u003eAnalyze large amounts of satellite and business data to identify simulation and optimization opportunities.\u003cbr/\u003eSynthesize and communicate insights and recommendations to audiences of varying levels of technical sophistication to drive change across LEO. \u003cbr/\u003e\u003cbr/\u003eExport Control Requirement: Due to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.","department_cost_center":null,"description_short":"Amazon LEO is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to","display_distance":null,"id":"3b84d8a8-ddcc-4783-bf62-a19b5b9d2f75","id_icims":"3069068","is_intern":null,"is_manager":null,"job_category":"Design","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3069068/applied-scientist-amazon-leo-capacity-planning","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA106\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":["devices-hwdev"],"posted_date":"August 29, 2025","preferred_qualifications":"- Experience using Unix/Linux\u003cbr/\u003e- Experience in professional software development\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, BELLEVUE - 142,800.00 - 193,200.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Applied Scientist, Amazon Leo Capacity Planning","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3069068/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of building models for business application experience\u003cbr/\u003e- PhD, or Master's degree and 4+ years of CS, CE, ML or related field experience\u003cbr/\u003e- Experience in patents or publications at top-tier peer-reviewed conferences or journals\u003cbr/\u003e- Experience programming in Java, C++, Python or related language\u003cbr/\u003e- Experience in any of the following areas: algorithms and data structures, parsing, numerical optimization, data mining, parallel and distributed computing, high-performance computing","business_category":"alexa-and-amazon-devices","city":"Bellevue","company_name":"Amazon Kuiper Commercial Services LLC","country_code":"USA","description":"Amazon LEO is an initiative to increase global broadband access through a constellation of 3,236 satellites in low Earth orbit (LEO). Its mission is to bring fast, affordable broadband to unserved and underserved communities around the world. Amazon LEO will help close the digital divide by delivering fast, affordable broadband to a wide range of customers, including consumers, businesses, government agencies, and other organizations operating in places without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eThe Amazon LEO Global Capacity Planning team owns designing, implementing, and operating systems that support the planning, management, and optimization of Amazon LEO network resources worldwide. We are looking for a talented scientist to implement Amazon LEO's long-term vision and strategy for capacity simulations and inventory optimization. This effort will be instrumental in helping Amazon LEO execute on its business plans globally. As one of our valued team members, you will be obsessed with matching our standards for operational excellence with a relentless focus on delivering results.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eIn this role, you will:\u003cbr/\u003e\u003cbr/\u003eWork cross-functionally with product, business development, and various technical teams (engineering, science, R\u0026D, simulations, etc.) to implement the long-term vision, strategy, and architecture for capacity simulations and inventory optimization.\u003cbr/\u003e\u003cbr/\u003eDesign and deliver modern, flexible, scalable solutions to complex optimization problems for operating and planning satellite resources.\u003cbr/\u003e\u003cbr/\u003eContribute to short and long terms technical roadmap definition efforts to predict future inventory availability and key operational and financial metrics across the network.\u003cbr/\u003e\u003cbr/\u003eDesign and deliver systems that can keep up with the rapid pace of optimization improvements and simulating how they interact with each other.\u003cbr/\u003e\u003cbr/\u003eAnalyze large amounts of satellite and business data to identify simulation and optimization opportunities.\u003cbr/\u003e\u003cbr/\u003eSynthesize and communicate insights and recommendations to audiences of varying levels of technical sophistication to drive change across Amazon LEO. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement: Due to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon LEO is an initiative to increase global broadband access through a constellation of 3,236 satellites in low Earth orbit (LEO). Its mission is to bring fast, affordable broadband to unserved and","display_distance":null,"id":"3a068c28-da0c-4c51-978c-ac20e2476b0b","id_icims":"3023006","is_intern":null,"is_manager":null,"job_category":"Design","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3023006/applied-scientist-amazon-leo-capacity-planning-simulation-optimization","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA106\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":["devices-hwdev"],"posted_date":"July  1, 2025","preferred_qualifications":"- Experience using Unix/Linux\u003cbr/\u003e- Experience in professional software development\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, BELLEVUE - 142,800.00 - 193,200.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Applied Scientist, Amazon LEO Capacity Planning - Simulation \u0026 Optimization","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3023006/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Berwick","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability \u003cbr/\u003e• Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS) \u003cbr/\u003e• Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA) \u003cbr/\u003e• Perform rack installs and rack decommissioning within internal SLA \u003cbr/\u003e• Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment \u003cbr/\u003e• Technical writing to support change management program \u003cbr/\u003e• Monitor daily work requests and manage to resolution, and execute projects from conception to completion \u003cbr/\u003e• On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation \u003cbr/\u003e• Work schedule changes depending on specific site needs. Shifts can be up to 12 hours and may rotate on a predefined schedule. Some locations have on-call rotations. \u003cbr/\u003e• Role may support more than one location/site. \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e• Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodations: \u003cbr/\u003e• Regularly lift and/or move up to 39 pounds independently \u003cbr/\u003e• Participate in group lifts for 40+ pounds \u003cbr/\u003e• Maintain balance and perform construction tasks while on a ladder \u003cbr/\u003e• Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position \u003cbr/\u003e• Work in an environment requiring provided ear protection \u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e• Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e• Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e• Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"c6c4a9fa-a26c-4dfa-9860-13969d43dfd7","id_icims":"3179363","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3179363/engineering-operation-technician","job_schedule_type":"full-time","location":"US, PA, Berwick","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Berwick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Berwick\",\"coordinates\":\"41.05089,-76.24352\",\"normalizedCountyName\":\"Columbia\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Berwick, Pennsylvania, USA\",\"location\":\"US, PA, Berwick\",\"region\":\"PA\",\"buildingCodeList\":[\"PHL122\",\"PHL125\",\"PHL108\",\"PHL99\",\"PHL114\",\"PHL111\",\"PHL119\",\"PHL103\",\"PHL901\",\"PHL100\",\"PHL123\",\"PHL120\",\"PHL126\",\"PHL107\",\"PHL118\",\"PHL115\",\"PHL101\",\"PHL104\",\"PHL112\",\"PHL900\",\"PHL106\",\"PHL109\",\"PHL110\",\"PHL124\",\"PHL116\",\"PHL121\",\"PHL113\",\"PHL117\",\"PHL102\",\"PHL105\"],\"normalizedCityName\":\"Berwick\"}"],"normalized_location":"Berwick, Pennsylvania, USA","optional_search_labels":["aws.team-ais","aws.team-dc","hourly","military"],"posted_date":"February 12, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Technical (Military/Trade School) training\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, PA, Berwick - 32.00 - 57.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"PA","title":"Engineering Operation Technician","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3179363/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Louisville","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager. In this role, you will lead a team of hourly workforce and will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e\u003cbr/\u003eOur Operation’s workflow has three major components: First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Support, mentor, and motivate your hourly workforce\u003cbr/\u003e* Manage safety, quality, productivity, and customer delivery promises\u003cbr/\u003e* Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e* Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e* Stand/walk for up to 12 hours during shifts\u003cbr/\u003e* Work in an environment where the noise level varies and can be loud\u003cbr/\u003e* Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e* Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e\u003cbr/\u003eOur fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Area Managers based on location preference and the business’ current openings.","department_cost_center":null,"description_short":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager.","display_distance":null,"id":"a0595087-3117-48d2-80af-68124118c3a9","id_icims":"3177739","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3177739/area-manager-ii","job_schedule_type":"full-time","location":"US, TN, Louisville","locations":["{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Louisville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Louisville\",\"coordinates\":\"35.82208,-84.03988\",\"normalizedCountyName\":\"Blount\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Louisville, Tennessee, USA\",\"location\":\"US, TN, Louisville\",\"region\":\"TN\",\"buildingCodeList\":[\"TYS1\"],\"normalizedCityName\":\"Louisville\"}"],"normalized_location":"Louisville, Tennessee, USA","optional_search_labels":[],"posted_date":"February 10, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 20+ employees\u003cbr/\u003e- Experience with process improvements (Lean process, Kaizen, and/or Six Sigma)\u003cbr/\u003e- Excellent customer service, communication, and interpersonal skills\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Industry experience in: retail, F\u0026B, military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TN, Louisville - 70,000.00 - 90,900.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"TN","title":"Area Manager II ","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3177739/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}