{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Ingenieurtechnisches Studium oder Meister / Technikerabschluss im Maschinenbau, der Elektrotechnik oder ähnlich gelagerten Studiengängen.\u003cbr/\u003e- Disziplinarische Führungserfahrung von Instandhaltungsteams.\u003cbr/\u003e- Multiqualifiziert in elektrischen und mechanischen Disziplinen.\u003cbr/\u003e- Erfahrung in der industriellen Instandhaltung, bevorzugt mit automatisierten Anlagen wie Verpackungsmaschinen, Sortier- und Fördersystemen.\u003cbr/\u003e- Erfahrung im (technischen) Projektmanagement.\u003cbr/\u003e- Kenntnisse von modernen Instandhaltungskonzepten (CBM, TPM).\u003cbr/\u003e- Sehr gute analytische Fähigkeiten.\u003cbr/\u003e- Teamfähigkeit und gute Präsentationsfähigkeit von komplexen Sachverhalten.\u003cbr/\u003e- Gute analytische Fähigkeiten sowie eine strukturierte und eigenständige Arbeitsweise.\u003cbr/\u003e- Fließende Deutsch- und sehr gute Englischkenntnisse.","business_category":"fulfillment-ops","city":"Helmstedt","company_name":"Amazon Helmstedt GmbH - M40","country_code":"DEU","description":"Im Mittelpunkt von Amazon Operations steht das Kundenerlebnis. Von dem Moment an, in dem ein Kauf durch einen Mausklick getätigt wird, bis zu dem Moment, in dem der Artikel geliefert wird, bemühen wir uns um das Beste für unsere Kunden. In Europa gibt es mehr als fünfzig Logistikzentren, hunderte von Lieferstationen, tausende von Maschinen und zehntausende von Mitarbeitenden. Täglich arbeiten unsere Teams daran, die richtigen Artikel zur richtigen Zeit an die richtige Person am richtigen Ort zu bringen.\u003cbr/\u003e\u003cbr/\u003eDie Arbeit bei Amazon Operations ist für Diejenigen, die gerne aktiv sind und alles geben. Wir arbeiten in einem dynamischen Umfeld und sind Teil eines großen Teams, das stolz darauf ist, jeden Tag die Erwartungen von Millionen von Kunden zu erfüllen. Wir sind offen, inklusiv und begrüßen Individualität und Vielfalt. Unsere Teams haben Spaß an guter Arbeit, wertschätzen sich, achten aufeinander und darauf, dass die höchsten Sicherheitsstandards gewährleistet sind. So tragen sie ihren Teil zur außergewöhnlichen Servicequalität bei, für die Amazon weltweit bekannt ist.\u003cbr/\u003e\u003cbr/\u003eIn dieser Position sind Sie schichtverantwortlich für den kompletten technischen Bereich eines Logistikzentrums. Sie führen das Instandhaltungsteam und sorgen zusammen mit diesem für den reibungslosen Ablauf und eine hohe Verfügbarkeit der förder- und gebäudetechnischen Anlagen. Dabei stellen Sie sicher, dass vorbeugende Wartungsarbeiten fristgerecht durchgeführt und interne Prozesse und Standards eingehalten werden. Mit einem Fokus auf unsere Sicherheitskultur trainieren, entwickeln und coachen Sie Ihr Team und holen das Beste aus Ihren Mitarbeitenden heraus.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eUnser Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) sorgt dafür, dass unsere Geräte und Ausstattung jederzeit optimal funktionieren. Wir sind ein Team von Techniker:innen und Ingenieur:innen, das aus hervorragenden Teamplayern besteht und von erfahrenen Führungskräften geleitet wird. Wir arbeiten gemeinsam daran, die Geräte in unserem gesamten globalen Netzwerk von Fulfillment-Centern zu warten, zu reparieren und ihre Fehler zu beheben. Einige unserer Mitarbeiter:innen sind Führungskräfte, die das Team bei der Arbeit an spannender, innovativer Technologie beaufsichtigen – die es teilweise nur bei Amazon gibt.\u003cbr/\u003eVon der Installation automatisierter Verpackungssysteme bis hin zur Beaufsichtigung der allgemeinen Wartungsarbeiten eines Standorts sowie der Reparatur von für den Vertrieb wesentlichen Geräten wickelt unser Team einen Großteil der technischen Aufgaben bei Amazon ab. Unter anderem sorgt es auch dafür, dass Gebäude weiterhin den rechtlichen Auflagen entsprechen, damit alle sicher bleiben und unsere Standorte mit maximaler Effizienz betrieben werden. Es gibt zahlreiche Aufstiegschancen im RME-Team selbst ebenso wie im gesamten Amazon-Unternehmen.\u003cbr/\u003eAlle unsere Aktivitäten sind darauf ausgerichtet, die Ausfallzeiten an Amazons wichtigsten Betriebsstandorten zu reduzieren, damit Kund:innen ihre Bestellungen rechtzeitig erhalten. Oft arbeiten wir früh morgens, spät abends oder in der Nachtschicht, um Wartungsarbeiten mit den geringstmöglichen Störungen vorzunehmen. Falls wir eine bessere Möglichkeit finden, eine bestimmte Aufgabe zu erledigen, verfügen wir über die Fertigkeiten und Gelegenheiten, vollständig neue Prozesse oder bahnbrechende Technologie wie Amazon Robotics oder unseren Complex Item Sorter einzuführen.","department_cost_center":null,"description_short":"Im Mittelpunkt von Amazon Operations steht das Kundenerlebnis. Von dem Moment an, in dem ein Kauf durch einen Mausklick getätigt wird, bis zu dem Moment, in dem der Artikel geliefert wird, bemühen wir","display_distance":null,"id":"7e266f12-d9f1-4174-827a-48ecfba05363","id_icims":"3161677","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3161677/technischer-abteilungsleiter-in-instandhaltung-rme-area-manager","job_schedule_type":"full-time","location":"DE, Helmstedt","locations":["{\"normalizedStateName\":\"Lower-Saxony\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Helmstedt\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, Helmstedt\",\"coordinates\":\"52.2247,11.01448\",\"normalizedCountyName\":\"Helmstedt\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Helmstedt, Lower-Saxony, DEU\",\"location\":\"DE, Helmstedt\",\"region\":\"\",\"buildingCodeList\":[\"HAJ1\"],\"normalizedCityName\":\"Helmstedt\"}"],"normalized_location":"Helmstedt, Lower-Saxony, DEU","optional_search_labels":["ops.lander-emea-rme-manager"],"posted_date":"January 19, 2026","preferred_qualifications":"- Für eine Bewerbung bei Amazon sind keine bevorzugten Qualifikationen erforderlich. Wenn Sie über alle oben genannten Grundqualifikationen verfügen, würden wir uns freuen, von Ihnen zu hören.\u003cbr/\u003e- Erfahrung im Umgang mit gesetzlichen Vorschriften, beispielsweise Compliance-Prüfungen und Sicherheitsprotokollen für Maschinen\u003cbr/\u003e- Erfahrung mit automatisierten Geräten, einschließlich Packmaschinen, Sortier- und Fördersystemen\u003cbr/\u003e- Erfahrung im Gebrauch von Datenanalysetools und SPS-basierten Steuersystemen\u003cbr/\u003e- Erfahrung mit Projektmanagement oder mit Kaizen-, Lean- oder Six-Sigma-Prozessen\u003cbr/\u003e- Erfahrung mit Computerized Maintenance Management Systemen (CMMS)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":null,"title":"Technischer Abteilungsleiter/in Instandhaltung / RME Area Manager","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3161677/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience (non-internship) in professional software development\u003cbr/\u003e- Experience designing or architecting (design patterns, reliability and scaling) of new and existing systems\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"amazonian-experience-and-tech","city":"Dublin","company_name":"Amazon Development Centre Ireland Limited","country_code":"IRL","description":"Are you excited by building systems that power one of the largest fulfillment networks in the world? Join the Workforce Solutions (WS) team and shape the future of Amazon's operational excellence. We process millions of metrics daily to evaluate productivity and quality across global fulfillment operations. Our mission-critical systems directly impact how Amazon associates work, grow, and succeed, giving them the tools to thrive on the front lines.\u003cbr/\u003e\u003cbr/\u003eAs a software engineer on the WS team, you'll own high-scale, metrics-driven workflows that impact hundreds of thousands of associates worldwide. You'll tackle complex, orchestrated workflows and distributed systems that handle massive datasets, all while working in a fast-paced environment where your work has immediate operational impact.\u003cbr/\u003e\u003cbr/\u003eIf you want to own systems that shape operational decisions at Amazon, influence global workflows, and see the results of your work in action every day, this is the team for you.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Design, build, and maintain high-throughput workflows that process millions of metrics daily.\u003cbr/\u003e* Develop distributed systems and orchestrated workflows that monitor productivity, quality, and operational efficiency across Amazon's global fulfillment network.\u003cbr/\u003e* Partner with product managers, data scientists, and operations teams to translate complex business needs into scalable technical solutions.\u003cbr/\u003e* Ensure mission-critical systems are reliable, performant, and maintainable, even at massive scale.\u003cbr/\u003e* Drive technical innovation across the stack architecture, tooling, and processes while championing best practices in code quality, testing, and deployment.\u003cbr/\u003e* Mentor and guide other engineers, fostering a culture of collaboration, operational excellence, and continuous learning.\u003cbr/\u003e* Influence the technical direction and help the broader organization understand and leverage WS capabilities.\u003cbr/\u003e* Continuously improve monitoring, alerting, and operational processes to ensure systems remain robust under heavy load.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Software Development Engineer, you will lead the design and implementation of complex distributed systems while also mentoring other engineers on the team. You'll be responsible for making key architectural decisions, conducting design reviews, and ensuring the technical excellence of your team's deliverables. You'll collaborate with product managers and other technical teams to define technical strategy and roadmap, while staying hands-on with coding and implementation\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWorkforce Solutions (WS) is a horizontal, multi-discipline organization whose mission is to build the best people-forward technology to enable corporate recruitment for Amazon, globally. We build the intelligent technology products Amazon uses to make the right hiring decisions, every time, while being more equitable and candidate-centric in the end-to-end experience. We accomplish this by using our ability in product and program management, and design/research. Our portfolio of products is global (built mostly on native AWS), accounting for recruitment for all corporate roles. From the candidate-facing job site, to ensuring the role is filled - we build the entire gamut. We value people-centric solutions, and open exchange of ideas. ","department_cost_center":null,"description_short":"Are you excited by building systems that power one of the largest fulfillment networks in the world? Join the Workforce Solutions (WS) team and shape the future of Amazon's operational excellence. We process","display_distance":null,"id":"425e6d96-976d-42cd-b30d-9f016c8e48ba","id_icims":"3163573","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3163573/software-development-engineer-workforce-solutions-talent-management","job_schedule_type":"full-time","location":"IE, D, Dublin","locations":["{\"normalizedCountryCode\":\"IRL\",\"city\":\"Dublin\",\"countryIso3a\":\"IRL\",\"countryIso2a\":\"IE\",\"locationNonStemming\":\"Ireland, D, Dublin\",\"coordinates\":\"53.34807,-6.24827\",\"normalizedCountyName\":\"County Dublin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Ireland\",\"normalizedLocation\":\"Dublin, IRL\",\"location\":\"IE, D, Dublin\",\"region\":\"D\",\"buildingCodeList\":[\"DUB14\"],\"normalizedCityName\":\"Dublin\"}"],"normalized_location":"Dublin, IRL","optional_search_labels":[],"posted_date":"January 21, 2026","preferred_qualifications":"- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- Experience with full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazonian-experience-and-tech.team-es-technology","source_system":"JobCreator","state":"D","title":"Software Development Engineer, Workforce Solutions - Talent Management","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3163573/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-es-technology","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of project management disciplines including scope, schedule, budget, quality, along with risk and critical path management experience\u003cbr/\u003e- 2+ years COMSEC experience as a Primary or Alternate COMSEC Custodian.\u003cbr/\u003e- Experience with various Type 1 Cryptographic devices, keys and loaders\u003cbr/\u003e- Current, active US Government Security Clearance of TS/SCI with Polygraph","business_category":"aws","city":"Denver","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Application deadline: Feb 28, 2026\u003cbr/\u003e\u003cbr/\u003eAre you skilled at helping customers to address their program requirements? Do you want to learn  the very latest in cloud web services technologies and securely apply  them to some of the most interesting computing workloads in the world?    \u003cbr/\u003e\u003cbr/\u003eAt AWS, we are hiring a Communications Security (COMSEC) Custodian/Officer to help manage and continue to develop the COMSEC Program. This will entail managing/dealing with multiple mission partners and COMSEC accounts found around the United States. It will also require continuous engagement with mission partners and vendors as we continue to scale the program to meet customer needs and requirements.\u003cbr/\u003e\u003cbr/\u003eThis position requires that the candidate selected be a US Citizen and must currently possess and maintain an active TS/SCI security clearance with polygraph.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Establish and maintain all COMSEC accounts regionally, to include on-site troubleshooting, network deployment, regular keying and inventorying of devices, and administrative tasks associated with account compliance. \u003cbr/\u003e\u003cbr/\u003e- Appoint and train partner teams to support ad-hoc requirements. \u003cbr/\u003e\u003cbr/\u003e- Update AWS policy doctrine to ensure compliance with overarching customer requirements. \u003cbr/\u003e\u003cbr/\u003e- Vigorously audit individuals accounts. \u003cbr/\u003e- Reviewing proposed new programs requiring COMSEC to ensure the security of the program. \u003cbr/\u003e- Advising management and mission partners on the current and planned COMSEC postures for all AWS locations. \u003cbr/\u003e- Maintaining liaison with Government customers and COMSEC vendors to provide advice, guidance, and exchange information with regards to COMSEC standards and policies. \u003cbr/\u003e- Serve as a COMSEC subject matter experts on Government inter-agency working groups, committees, and task forces.\u003cbr/\u003e-    Maintain 100% accountability of all accountable COMSEC items.\u003cbr/\u003e-    Provide support and oversight over multiple COMSEC accounts and subaccounts across multiple sites.\u003cbr/\u003e-    Develop and update operating procedures based on site, equipment and mission partners.\u003cbr/\u003e-    Develop and update Emergency Action Plans (EAP) based on site, equipment and mission partners.\u003cbr/\u003e-    Conduct semi-annual COMSEC training and EAP training per site for all AWS custodians.\u003cbr/\u003e-    Perform all necessary backups, system upgrades, reconciliations, and inventories of COMSEC material.\u003cbr/\u003e-    Support the semi-annual COMSEC training of all COMSEC custodians.\u003cbr/\u003e-    Support the semi-annual EAP training of all COMSEC custodians.\u003cbr/\u003e-    Maintain all COMSEC account and subaccount file plans as instructed per mission partner.\u003cbr/\u003e-    Use and maintain common fill devices (KIK, SKL, SDS).\u003cbr/\u003e-    Prepare and ship COMSEC material as instructed by mission partner policies as needed\u003cbr/\u003e-    Coordinate with internal and external customers/stakeholders to support information security programs\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur team is dedicated to supporting new team members. Our team has a broad mix of experience levels and Amazon tenures, and we’re building an environment that celebrates knowledge sharing and mentorship.\u003cbr/\u003e\u003cbr/\u003eHere at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and we host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences. Amazon’s culture of inclusion is reinforced within our 16 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.\u003cbr/\u003e\u003cbr/\u003eOur team also puts a high value on work-life balance. Striking a healthy balance between your personal and professional life is crucial to your happiness and success here, which is why we aren’t focused on how many hours you spend at work or online. Instead, we’re happy to offer a flexible schedule so you can have a more productive and well-balanced life—both in and outside of work.","department_cost_center":null,"description_short":"Are you skilled at helping customers to address their program requirements? Do you want to learn  the very latest in cloud web services technologies and securely apply  them to some of the most interesting","display_distance":null,"id":"853724aa-846e-40ca-ab21-cf525efaaac9","id_icims":"3108598","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"Security Industry Specialist","job_function_id":null,"job_path":"/en/jobs/3108598/comsec-officer-information-security-us-amazon-dedicated-cloud-security","job_schedule_type":"full-time","location":"US, CO, Denver","locations":["{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}"],"normalized_location":"Denver, Colorado, USA","optional_search_labels":[],"posted_date":"October 14, 2025","preferred_qualifications":"- Experience communicating across technical and non-technical audiences, including executive level stakeholders or clients\u003cbr/\u003e- Experience with AWS products and services\u003cbr/\u003e- Experience developing and interpreting policies, procedures, and strategies governing the planning and delivery and execution of COMSEC programs.\u003cbr/\u003e- Experience in making recommendations for resolving COMSEC problems and requirements for multiple mission partners that utilize Type-1 encryptors to secure their networks.\u003cbr/\u003e- Experience providing technical advice, guidance, and recommendations to high level management officials and technical staff on critical COMSEC security issues.\u003cbr/\u003e- Experience in developing SOPs for all types of COMSEC actions. (E.g. Annual Rekey, Encryptor Upgrades, STE Use)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eThe base salary range for this position is listed below. For salaried roles, your Amazon package will include listed sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003ca href=\"https://amazon.jobs/en/benefits/us-benefits-and-stock\"\u003ehttps://amazon.jobs/en/benefits/us-benefits-and-stock\u003c/a\u003e.\u003cbr\u003e\u003cbr\u003eColorado $102,000 - $178,400 annually","primary_search_label":"aws.team-us-security-clearance-jobs-primary","source_system":"JobCreator","state":"CO","title":"COMSEC Officer, Information Security, US Amazon Dedicated Cloud Security","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3108598/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-us-security-clearance-jobs-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Knowledge of critical data center mechanical and electrical equipment\u003cbr/\u003e- Experience with the design, construction, operation, or maintenance of mission critical facilities, especially data centers\u003cbr/\u003e- Bachelor's degree in mechanical engineering or equivalent","business_category":"aws","city":"Aurora","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Application deadline: Mar 1, 2026\u003cbr/\u003e\u003cbr/\u003eWe have an immediate opening for a Field Engineer in the Aurora, CO  region. \u003cbr/\u003e\u003cbr/\u003eAs an Amazon Field Engineer, you will provide full life-cycle support to AWS Data Centers from design inception through site improvement and maintenance. You will be the ‘go to’ engineering resource for your region when technical advice is needed, and will use your subject matter expertise and engage with diverse teams to:\u003cbr/\u003e\u003cbr/\u003e- Perform design and equipment submittal review for new Data Centers in your region.\u003cbr/\u003e- Troubleshoot, conduct Root Cause Analysis (RCA) and create Corrective Action (CA) documentation for site/equipment failures. \u003cbr/\u003e- Directly support operational issues with ad-hoc training, complex operating procedure reviews, including critical equipment, and event support.\u003cbr/\u003e- Own the design for existing data center upgrades and design-solutions, which add capacity, improve availability, and increase efficiency.\u003cbr/\u003e- Interface with internal data center design engineering team, server hardware team, environmental health and safety team to promote standards that maintain consistency and reliability in services delivered.\u003cbr/\u003e- Work on concurrent projects, sometimes in multiple geographical regions.\u003cbr/\u003e- Initiate and lead engineering site audits within Amazon’s owned or colo data centers. Produce reports outlining risks with recommended mitigations and remediation. \u003cbr/\u003e- Act as resident engineer during new construction projects. Support construction, commissioning, and turnover.\u003cbr/\u003e \u003cbr/\u003eMust have a valid US driver's license and reliable personal transportation by start date.\u003cbr/\u003e\u003cbr/\u003eThis position requires that the candidate selected be a US Citizen and obtain and maintain an active TS/SCI security clearance with polygraph.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAmazon's vision is to be the world's most customer-centric company, and this role is key to that vision. As a Field Engineer, you will be leading projects to fit out our data centers to meet ever-evolving customer needs as we continue expanding our fleet to hyper-scale. As an ideal candidate you:\u003cbr/\u003e\u003cbr/\u003e* Possess Strong Engineering Judgement and are able to provide recommendations despite uncertainty/ambiguity.\u003cbr/\u003e\u003cbr/\u003e* Are detail and data oriented?\u003cbr/\u003e\u003cbr/\u003e* Have experience solving problems with engineered solutions.\u003cbr/\u003e\u003cbr/\u003e* Have experience managing engineering projects and consultants.\u003cbr/\u003e\u003cbr/\u003e* Build trust and relationships with different stakeholders (e.g., Operations, Controls, Construction, Design, Commissioning, Product Managers, Technical Program Managers).\u003cbr/\u003e\u003cbr/\u003e* Are adaptable and inclined to get into the field to see things up close.\u003cbr/\u003e\u003cbr/\u003e* Excited about a mix of office and field work.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eEach day you will interact with different teams responsible for all aspects of the data centers. You will prioritize your activities to support data center capacity availability and safety focusing on the actions that are most impactful. You will have the opportunity to work on projects locally and globally.\u003cbr/\u003e\u003cbr/\u003eIf you meet these qualifications, exude passion, and enjoy the challenge of innovative projects at hyper-scale, this job is for you!\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eADC (Amazon Dedicated Cloud) Field Engineering provides engineering support to the data center operations personnel at sites supporting the US intelligence community. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. ","department_cost_center":null,"description_short":"We have an immediate opening for a Field Engineer in the Aurora, CO  region. As an Amazon Field Engineer, you will provide full life-cycle support to AWS Data Centers from design inception through site","display_distance":null,"id":"40f9b471-40f2-4aad-8a88-1a99213afc18","id_icims":"3181383","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Infrastructure Eng","job_function_id":null,"job_path":"/en/jobs/3181383/cleared-data-center-mechanical-field-engineer-adc-field-engineering-field-engineering","job_schedule_type":"full-time","location":"US, CO, Aurora","locations":["{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Aurora\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Aurora\",\"coordinates\":\"39.70932,-104.81458\",\"normalizedCountyName\":\"Arapahoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Aurora, Colorado, USA\",\"location\":\"US, CO, Aurora\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN22\"],\"normalizedCityName\":\"Aurora\"}"],"normalized_location":"Aurora, Colorado, USA","optional_search_labels":["aws.team-ais","aws.team-adc-infra-optional","amazon-cleared-jobs","aws.team-clearedvets","amazon-cleared","military"],"posted_date":"February 14, 2026","preferred_qualifications":"- Knowledge of HVAC systems\u003cbr/\u003e- Experience carrying design concepts through exploration, development, and into deployment or mass production\u003cbr/\u003e- Experience reading, interpreting, and creating construction drawings, specifications, and submittal documents\u003cbr/\u003e- Knowledge of mechanical, electrical, and controls systems for critical infrastructures\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Aurora - 96,600.00 - 160,000.00 USD annually","primary_search_label":"aws.team-us-security-clearance-jobs-primary","source_system":"JobCreator","state":"CO","title":"Cleared Data Center Mechanical Field Engineer, ADC Field Engineering, Field Engineering","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3181383/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-us-security-clearance-jobs-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- 1+ years of Microsoft Office products and applications experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- certification from Amazon's Mechatronics and Robotics Apprenticeship Program, or 2+ years of automated conveyor systems and controls experience\u003cbr/\u003e- 2+ years of conducting predictive and preventative maintenance procedures experience\u003cbr/\u003e- 2+ years of reading blueprints and electrical schematics experience\u003cbr/\u003e- 2+ years of demonstrating safety standards experience\u003cbr/\u003e- 2+ years of troubleshooting and diagnostics of material handling equipment (MHE) experience","business_category":"operations","city":"Commerce City","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Application deadline: Mar 1, 2026\u003cbr/\u003e\u003cbr/\u003eAbout Maintenance at Amazon\u003cbr/\u003e\u003cbr/\u003eOperations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every day. Reliability Maintenance \u0026 Engineering (RME) are the business partners that work tirelessly behind the scenes to make it all happen. We drive continuous improvement and maintain all of the Robotics and Material Handling Equipment (MHE) to ensure our customers are met with the Amazon smile. Come join us on our journey!\u003cbr/\u003e\u003cbr/\u003eAbout the Role\u003cbr/\u003e\u003cbr/\u003eAs a Mechatronics \u0026 Robotics Technician, you will use your skills to support the Operations Maintenance team in repairing and maintaining material handling equipment and pneumatic systems throughout the building. You will have the opportunity to install, maintain, and repair automated packaging and distribution equipment. In addition to developing your skills, you will mentor junior technicians to grow in their roles.\u003cbr/\u003e\u003cbr/\u003eWhat Do We Offer?\u003cbr/\u003e\u003cbr/\u003eAmazon offers competitive compensation packages including comprehensive healthcare benefits starting on Day 1, matching 401(k) program, and up to 20 weeks of paid parental leave. But wait, there is more: We provide lightweight fire-resistant daily wear and composite toe safety shoes for your safety!\u003cbr/\u003e\u003cbr/\u003eHere is what you can expect with the Reliability \u0026 Maintenance Engineering (RME) selection process for Mechatronics \u0026 Robotics Technicians: (Timeframe: Approximately 30-days)\u003cbr/\u003e\u003cbr/\u003eStep 1: Congratulations! You successfully submitted your application! \u003cbr/\u003e\u003cbr/\u003eStep 2: Amazon Recruiting will review your application and invite the most qualified candidate to complete a pre-employment assessment. \u003cbr/\u003e\u003cbr/\u003eStep 3: If you meet the role qualifications, you will receive an invitation from Amazon Recruiting (do-not-reply@criteriacorp.com) to begin your Criteria assessment. You have 5 days to complete. \u003cbr/\u003e\u003cbr/\u003eStep 4: Once you successfully meet the pre-employment assessment requirements, you will be invited to complete a video interview. Your video interview invitation will be from HireVue (interviews@hirevue.com) and you will have 7 days to record your interview.\u003cbr/\u003e\u003cbr/\u003eStep 5: Your video interview will be reviewed by the Amazon Hiring Team and you will be notified of next steps via email within 5 business days. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities include, but are not limited to: \u003cbr/\u003e- You will promote a safe working environment by following all safety procedures \u003cbr/\u003e- You will complete preventative maintenance routines with proper documentation \u003cbr/\u003e- You will troubleshoot electrical and mechanical problems related to all Material Handling Equipment (MHE) which includes belts, motors, photo-eyes, relays, and more \u003cbr/\u003e- You will maintain a positive working relationship across all of the Amazon Operations facility \u003cbr/\u003e- You must be able to move up to 49lbs, stand and walk during shifts lasting up to 12 hours, climb ladders and gangways safely, and without limitation, as well as perform regular bending, lifting, stretching, and reaching both below the waist and above the head\u003cbr/\u003e\u003cbr/\u003ePlease note that while we strive to accommodate employees' preferences for shift assignments, due to operational requirements and scheduling constraints, we cannot guarantee a specific shift assignment.\u003cbr/\u003e","department_cost_center":null,"description_short":"About Maintenance at AmazonOperations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds","display_distance":null,"id":"23fcae02-74e8-40c6-b748-c1e7207776f1","id_icims":"3173387","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3173387/mechatronics-robotics-tech-nasc-rme-bdu5","job_schedule_type":"full-time","location":"US, CO, Commerce City","locations":["{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Commerce City\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Commerce City\",\"coordinates\":\"39.80568,-104.89754\",\"normalizedCountyName\":\"Adams\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Commerce City, Colorado, USA\",\"location\":\"US, CO, Commerce City\",\"region\":\"CO\",\"buildingCodeList\":[\"BDU5\"],\"normalizedCityName\":\"Commerce City\"}"],"normalized_location":"Commerce City, Colorado, USA","optional_search_labels":["operations.team-reliability-maintenance-engineering-na"],"posted_date":"February  4, 2026","preferred_qualifications":"- Experience with robotic operation and maintenance\u003cbr/\u003e- 2+ years of electrical and electronic principles experience\u003cbr/\u003e- Associate's degree in Mechnical or Electrical\u003cbr/\u003e- 2+ years of Mechanical or Electrical apprenticeship experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below including the base pay rate plus the highest available shift differential which applies depending on the shift you select. As a total compensation company, you are eligible for additional earnings including overtime pay and performance bonuses. Final pay will be based on factors including shift selection and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Commerce City - 35.00 - 37.00 USD hourly","primary_search_label":"operations.team-reliability-maintenance-engineering","source_system":"JobCreator","state":"CO","title":"Mechatronics \u0026 Robotics Tech , NASC RME - BDU5","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3173387/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-reliability-maintenance-engineering","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience analyzing data and best practices to assess performance drivers\u003cbr/\u003e- Experience relationship building and influencing at the C-level of Fortune 500 customers\u003cbr/\u003e- Experience using Salesforce\u003cbr/\u003e- 10+ years of sales experience\u003cbr/\u003e- Experience prospecting and qualifying companies\u003cbr/\u003e- Experience relationship building and influencing at the C-level of Fortune 500 customers\u003cbr/\u003e- Experience using Salesforce\u003cbr/\u003e- At least 5 years of experience in benefits sales, working directly with employers, consultants and benefit brokers and 3+ years selling to companies with over 15,000 employees","business_category":"healthcare","city":"Virtual Location - Colorado","company_name":"Amazon.com Services LLC - A57","country_code":"USA","description":"Application deadline: Mar 1, 2026\u003cbr/\u003e\u003cbr/\u003eAbout Amazon One Medical\u003cbr/\u003eAmazon One Medical offers convenient access to One Medical providers for employers through unlimited on-demand virtual care, remote primary care, and in-person visits in 20+ MSA's. Our advanced primary care model promotes wellness and prevention with integrated chronic, behavioral, pediatric, and acute care support. Prestigious employers such as NASDAQ, PwC, Airbnb, and Pinterest consider us core to their benefits strategy.\u003cbr/\u003e\u003cbr/\u003eThe Opportunity\u003cbr/\u003eWe are seeking a National Accounts Sales, Principal for our Western region who will be responsible for bringing in business and managing deals with our largest and most strategic client prospects - 15,000 employees or more. Over the last decade One Medical has established relationships with employer groups nationally, and we are now seeing the results - companies who provide One Medical as a part of their benefits package have healthier employees. As we enter our next chapter, we want to scale these initiatives and broaden our reach nationally. Reporting to the Head of Sales, you will work cross-functionally with a diverse set of internal and external stakeholders and develop and drive sales strategy for large employer groups.\u003cbr/\u003e\u003cbr/\u003eAs a natural storyteller you will paint a compelling picture of One Medical’s vision and strategy that motivates others into action and use your consultative approach to articulate our strategy in a way that clients and prospects can easily relate. You consistently exceed your quota, and continue to push yourself and motivate those around you, acting as a mentor to more junior members of Amazon One Medical. You enjoy leveraging formal and informal networks built from previous experience as well as your industry knowledge to anticipate future population health management trends. You will set objectives and targets that align with One Medical’s organizational goals, while taking on new challenges with a sense of urgency, energy, and enthusiasm.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eRepresent One Medical and interact with major clients nationally\u003cbr/\u003eActively prospect, build relationships and secure deals with large accounts with more than 15,000 eligible employees\u003cbr/\u003eCoordinating with internal stakeholders and managing proposals\u003cbr/\u003eBuild a territory and define metrics and milestones that align with broader organizational goals\u003cbr/\u003eForecast deal flow and architect and negotiate creative deals and partnerships\u003cbr/\u003eProvide market-level feedback to help inform product roadmap; act as the voice of the customer\u003cbr/\u003eWork closely with internal teams, including account management, marketing, finance, legal and others, to ensure client success and performance\u003cbr/\u003eCollaborate with corporate leadership to meet or exceed quota and annual growth\u003cbr/\u003eLeverage relationships with consultants, brokers, and other professional networks to strengthen awareness of One Medical products and services\u003cbr/\u003eCollaborate with other members of the sales team and broader Amazon Health Services organization to support in-person activities in specific MSA's","department_cost_center":null,"description_short":"About Amazon One MedicalAmazon One Medical offers convenient access to One Medical providers for employers through unlimited on-demand virtual care, remote primary care, and in-person visits in 20+ MSA's.","display_distance":null,"id":"c08543a9-8054-4422-9b05-b2fa0e82ecde","id_icims":"3126543","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Sales/Account Management","job_function_id":null,"job_path":"/en/jobs/3126543/national-acct-sales-principal-amazon-one-medical","job_schedule_type":"full-time","location":"US, CO, Virtual Location - Colorado","locations":["{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Virtual Contact Center-az\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Virtual Contact Center-az\",\"coordinates\":\"33.44825,-112.07581\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arizona, USA\",\"location\":\"US, AZ, Virtual Contact Center-az\",\"region\":\"AZ\",\"buildingCodeList\":[\"VCCAZ\"]}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Virtual Location - Washington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Virtual Location - Washington\",\"coordinates\":\"47.03954,-122.89165\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Washington, USA\",\"location\":\"US, WA, Virtual Location - Washington\",\"region\":\"WA\",\"buildingCodeList\":[\"VIR\"]}","{\"normalizedStateName\":\"Oregon\",\"normalizedCountryCode\":\"USA\",\"city\":\"Virtual Location - Oregon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OR, Virtual Location - Oregon\",\"coordinates\":\"44.93326,-123.04382\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Oregon, USA\",\"location\":\"US, OR, Virtual Location - Oregon\",\"region\":\"OR\",\"buildingCodeList\":[\"VIR\"]}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Virtual Contact Center-ca\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Virtual Contact Center-ca\",\"coordinates\":\"38.57944,-121.49086\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"California, USA\",\"location\":\"US, CA, Virtual Contact Center-ca\",\"region\":\"CA\",\"buildingCodeList\":[\"VCCCA\"]}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Virtual Location - Colorado\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Virtual Location - Colorado\",\"coordinates\":\"39.74001,-104.99203\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Colorado, USA\",\"location\":\"US, CO, Virtual Location - Colorado\",\"region\":\"CO\",\"buildingCodeList\":[\"VIR\"]}"],"normalized_location":"Colorado, USA","optional_search_labels":[],"posted_date":"November 14, 2025","preferred_qualifications":"- Experience in strategy development\u003cbr/\u003e- Experience identifying, developing, negotiating, and closing opportunities across a wide spectrum of customer engagement levels\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eThe base salary range for this position is listed below. For salaried roles, your Amazon package will include listed sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003ca href=\"https://amazon.jobs/en/benefits/us-benefits-and-stock\"\u003ehttps://amazon.jobs/en/benefits/us-benefits-and-stock\u003c/a\u003e.\u003cbr\u003e\u003cbr\u003eColorado $134,600 - $182,100 annually\u003cbr\u003eNational $121,100 - $200,300 annually","primary_search_label":"healthcare.one-medical","source_system":"JobCreator","state":"CO","title":"National Acct Sales, Principal, Amazon One Medical","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3126543/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"one-medical","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of Microsoft Excel experience\u003cbr/\u003e- Bachelor's degree in Business Administration, Finance, Economics, Computer Science, Engineering, or related field\u003cbr/\u003e- Experience with sales CRM tools such as Salesforce or similar software\u003cbr/\u003e- Experience defining, refining and implementing sales processes, procedures and policies or equivalent\u003cbr/\u003e- Prior sales compensation experience - Experience with sales ICM tools such as Varicent, Xactly, or similar software","business_category":"aws","city":"Dallas","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Application deadline: Feb 28, 2026\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the leading cloud provider, providing virtualized infrastructure, storage, networking, messaging, and many other services to customers all over the world. AWS runs a globally distributed environment, operating at massive levels of scale and is growing at a staggering pace in terms of revenue, customers, people and complexity. Businesses, educational institutions, governments and non-profits depend on AWS for secure cloud services and solutions.\u003cbr/\u003e\u003cbr/\u003eThe Amazon Web Services (AWS) Global Sales Compensation (GSC) Operations team is seeking a Sales Compensation Systems Analyst to join our operations team. As part of the GSC Operations team, you will be responsible for supporting the day-to-day administration of the Varicent ICM sales compensation system for sales incentive-eligible employees globally. Objectives for this role will include driving operational process improvements in compensation, quota management, compensation adjustments, quarterly payouts, compensation plan administration, and improving the scalability of our program tools. \u003cbr/\u003e   \u003cbr/\u003eThis role requires working with global business owners in HR, Legal, Sales, Finance, Sales Operations, Revenue, Segmentation, Product \u0026 Technology, and our Business Intelligence team to ensure the proper plan design, calculation, delivery, and execution of sales commissions. Cross-team coordination, time management, and excellent communication skills are essential. It is key that we pay employees on time and accurately.  \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe ideal candidate has a proven track record for rolling up their sleeves, maintaining a high level of ownership and accountability and delivering best-in-class support to their internal and external customers.\u003cbr/\u003e\u003cbr/\u003eSupport the day-to-day administration of sales compensation including: \u003cbr/\u003e - Validates data; quantifies impact through data analysis and communicates proposed resolutions and timelines to leadership.\u003cbr/\u003e- Identifies operational risks and engages necessary stakeholders to frame issues and the desired end states\u003cbr/\u003e- Communicates effectively with technical teams on root causes of issues and business requirements. \u003cbr/\u003e - User acceptance testing (UAT) for process and system updates.\u003cbr/\u003e- Assist with the distribution of incentive compensation plans, including plan set up, quota shifts, revenue adjustments, etc..\u003cbr/\u003e- Ensuring all compensation methodologies, policies, procedures and governance are followed.\u003cbr/\u003e- Collaborate with internal stakeholders including, HR, Tax, and Legal to ensure all compensation methodologies, policies, and procedures are maintained in production\u003cbr/\u003e- Support the global quarterly commission payout process including manual compensation adjustments, calculations and approval process\u003cbr/\u003e- Create mechanisms to help improve efficiency of processes. \u003cbr/\u003e- Strong Excel \u0026 SQL skills preferred.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eAbout Sales, Marketing and Global Services (SMGS)\u003cbr/\u003e\u003cbr/\u003eAWS Sales, Marketing, and Global Services (SMGS) is responsible for driving revenue, adoption, and growth from the largest and fastest growing small- and mid-market accounts to enterprise-level customers including public sector.","department_cost_center":null,"description_short":"Amazon Web Services (AWS) is the leading cloud provider, providing virtualized infrastructure, storage, networking, messaging, and many other services to customers all over the world. AWS runs a globally","display_distance":null,"id":"c5ce7df3-9f4a-462f-8944-a974007dbaf6","id_icims":"3088495","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Sales Operations Job Family","job_function_id":null,"job_path":"/en/jobs/3088495/sales-compensation-systems-analyst-amazon-web-services","job_schedule_type":"full-time","location":"US, TX, Dallas","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS17\"],\"normalizedCityName\":\"Arlington\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA58\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Atlanta\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Atlanta\",\"coordinates\":\"33.74831,-84.39111\",\"normalizedCountyName\":\"Fulton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Atlanta, Georgia, USA\",\"location\":\"US, GA, Atlanta\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL11\"],\"normalizedCityName\":\"Atlanta\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Dallas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Dallas\",\"coordinates\":\"32.77823,-96.7951\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Dallas, Texas, USA\",\"location\":\"US, TX, Dallas\",\"region\":\"TX\",\"buildingCodeList\":[\"DFW11\"],\"normalizedCityName\":\"Dallas\"}"],"normalized_location":"Dallas, Texas, USA","optional_search_labels":[],"posted_date":"September 19, 2025","preferred_qualifications":"- 5+ years of finance, business management and sales operations experience\u003cbr/\u003e- Experience working within a high-growth, technology company\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eThe base salary range for this position is listed below. For salaried roles, your Amazon package will include listed sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003ca href=\"https://amazon.jobs/en/benefits/us-benefits-and-stock\"\u003ehttps://amazon.jobs/en/benefits/us-benefits-and-stock\u003c/a\u003e.\u003cbr\u003e\u003cbr\u003eColorado $88,100 - $154,100 annually\u003cbr\u003eNational $79,300 - $169,500 annually","primary_search_label":"aws.team-sales-primary","source_system":"JobCreator","state":"TX","title":"Sales Compensation Systems Analyst, Amazon Web Services","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3088495/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sales-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of Windows Server technologies: AD, DFS, Print Services, SCCM experience\u003cbr/\u003e- 2+ years of troubleshooting in a multi-user high availability environment experience\u003cbr/\u003e- 2+ years of PC repair, troubleshooting, deployment and liquidation experience\u003cbr/\u003e- 1+ years of IT client, server, and network service delivery experience\u003cbr/\u003e- 2+ years of networking (such as DNS, DHCP, SSL, OSI Model, and TCP/IP) experience\u003cbr/\u003e- 2+ years of corporate setting Windows, Mac or Linux Operating systems support experience\u003cbr/\u003e- 2+ years of supporting and maintaining a corporate network environment experience\u003cbr/\u003e- High school or equivalent diploma","business_category":"ecp","city":"Virtual Location - New York","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Application deadline: Feb 28, 2026\u003cbr/\u003e\u003cbr/\u003eOne Medical is a primary care solution challenging the industry status quo by making quality care more affordable, accessible and enjoyable. But this isn’t your average doctor’s office. We’re on a mission to transform healthcare, which means improving the experience for everyone involved - from patients and providers to employers and health networks. Our seamless in-office and 24/7 virtual care services, on-site labs, and programs for preventive care, chronic care management, common illnesses and mental health concerns have been delighting people for the past fifteen years.\u003cbr/\u003e\u003cbr/\u003eIn February 2023 we marked a milestone when One Medical joined Amazon. Together, we look to deliver exceptional health care to more consumers, employers, care team members, and health networks to achieve better health outcomes. As we continue to grow and seek to impact more lives, we’re building a diverse, driven and empathetic team, while working hard to cultivate an environment where everyone can thrive.\u003cbr/\u003e\u003cbr/\u003eWe’re looking for a passionate IT Support Associate to ensure that our clinical teams, administrators, and corporate staff have the IT support they need to perform their jobs efficiently. \u003cbr/\u003e\u003cbr/\u003eIn this role, you will report directly to the IT Manager, providing technical assistance and troubleshooting for internal users across our nationwide network of medical offices. As part of the One Medical IT Technical Services Team, your main responsibility will be supporting the phone, chat, and ticket support queues, resolving technical issues, and ensuring seamless IT operations.  \u003cbr/\u003e\u003cbr/\u003eThis position offers the opportunity to tackle a variety of technical challenges while working alongside a dedicated and mission-driven team. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eDeliver exceptional IT support to One Medical employees. \u003cbr/\u003e\u003cbr/\u003eThis role is for coverage for afterhours support, 9pm to 9am EST, weekends, and holidays. \u003cbr/\u003e\u003cbr/\u003e• Serve as the first point of contact for One Medical users, documenting support calls and resolutions using our ticketing system. \u003cbr/\u003e• Respond to and troubleshoot support IT requests via phone, chat and ticketing system, ensuring timely and efficient support. \u003cbr/\u003e• Collaborate with a dedicated IT support team to diagnose and resolve technical issues. \u003cbr/\u003e• Provide remote support to employees, ensuring all incidents are addressed in a professional, timely and efficient manner. \u003cbr/\u003e• Install and configure hardware/software issues across Windows, macOS and Chrome OS environments. \u003cbr/\u003e• Observe and ensure compliance with security and system configuration standards as well as HIPAA regulations. \u003cbr/\u003e\u003cbr/\u003e• Contribute to and maintain the IT knowledge base, ensuring documentation is accurate and up to date. \u003cbr/\u003e• Assist in workflow improvements. \u003cbr/\u003e\u003cbr/\u003e• Adherence to shift schedules and timeliness are key requirements.\u003cbr/\u003e• Willingness to work flexible shifts and scheduling, weekends, and holidays.\u003cbr/\u003e• Must be willing and able to occasionally come to Amazon corporate sites with 24 hours notice.","department_cost_center":null,"description_short":"One Medical is a primary care solution challenging the industry status quo by making quality care more affordable, accessible and enjoyable. But this isn’t your average doctor’s office. We’re on a mission","display_distance":null,"id":"3db504e7-90cf-415b-a5c0-aeda29b6580b","id_icims":"3142979","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Technical Services","job_function_id":null,"job_path":"/en/jobs/3142979/it-support-engineer-i-afterhours-support-aom-one-medical-it-support","job_schedule_type":"full-time","location":"US, NY, Virtual Location - New York","locations":["{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"Virtual Location - New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, Virtual Location - New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, Virtual Location - New York\",\"region\":\"NY\",\"buildingCodeList\":[\"VNY\"],\"normalizedCityName\":\"New York\"}","{\"normalizedCountryCode\":\"USA\",\"city\":\"Virtual\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, Virtual\",\"coordinates\":\"38.89036,-77.03196\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"USA\",\"location\":\"US, Virtual\",\"region\":\"\",\"buildingCodeList\":[\"VIR\"]}"],"normalized_location":"New York, New York, USA","optional_search_labels":[],"posted_date":"December 15, 2025","preferred_qualifications":"- 2+ years of computer networking experience\u003cbr/\u003e- Experience supporting video conference and teleconference equipment\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, ,  - 25.00 - 41.00 USD hourly\u003cbr/\u003eUSA, NY, Virtual Location - New York - 25.00 - 41.00 USD hourly","primary_search_label":"ecp.engine","source_system":"JobCreator","state":"NY","title":"IT Support Engineer I - Afterhours Support (AOM), One Medical IT Support","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3142979/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"engine","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of program or project management experience\u003cbr/\u003e- Experience using data and metrics to determine and drive improvements\u003cbr/\u003e- Experience working cross functionally with tech and non-tech teams\u003cbr/\u003e- Experience leading and implementing large scale, process-related Change Management initiatives, preferably in retail operations and/or supply chain.\u003cbr/\u003e- Retail Change experience preferably in retail operations, purchasing or operational finance\u003cbr/\u003e- Ability to look at big picture to determine holistic Change Management implications of multiple sub-projects\u003cbr/\u003e- Strong verbal and written communication skills including a demonstrated strength in presenting complex concepts and ideas to a variety of audiences\u003cbr/\u003e- Demonstrated ability to build relationships and collaborate effectively in a matrixed environment with many different Change entities across the organization\u003cbr/\u003e- Comfort with ambiguity and ability to respond quickly and appropriately to shifting priorities\u003cbr/\u003e- A passion for advocating for our Team Members, their needs and the experience they have with our systems\u003cbr/\u003e- Previous success building consensus amongst groups with differing points of view\u003cbr/\u003e- Experience with Change process re-engineering\u003cbr/\u003e- Ability to travel to various stores and regions up to 20% at times","business_category":"worldwide-grocery-stores","city":"Austin","company_name":"Amazon.com Services LLC - A57","country_code":"USA","description":"Application deadline: Feb 28, 2026\u003cbr/\u003e\u003cbr/\u003eReports to:  Senior TL, Business Process Improvement of Change Enablement\u003cbr/\u003e\u003cbr/\u003eThe Business Integration Lead will lead the Change Management efforts within World Wide Grocery Stores. They will play a key role in ensuring key strategic initiatives meet the change and project objectives on time and on budget by increasing Team Member speed of adoption. This position will work on several projects and change deliverables simultaneously and ensure timely completion of all project goals. The Business Integration Lead will work with leadership to identify change requirements and provide guidance to, the Change Enablement TMs assigned to create actionable deliverables based on Change Management assessments and plans. They will also create and/or provide input to deliverables working closely with project, training, and communications resources.\u003cbr/\u003e\u003cbr/\u003eWhile the Change Integration Lead does not have direct supervisory responsibility, this person must be comfortable working in a matrixed environment, and acting as a coach to global, OA and store leaders helping them in their roles as leaders and sponsors of change. This position will be responsible for identifying, understanding and facilitating Change process change leading to single Change practices across OAs where appropriate.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tServe as the lead Change expert for assigned business areas\u003cbr/\u003e•\tWork with internal Team, business partners, and key Stakeholders to develop a Change Management strategy for each major sub-project. This would include Change Impact Summaries, Communication and Training Plans as well post-assessment activities to facilitate successful adoption of new initiatives \u003cbr/\u003e•\tBecome an expert in multiple Change areas to facilitate understanding of Change requirements and operational decisions needed as well as facilitate agreement on companywide processes in support of project or program goals.\u003cbr/\u003e•\tDevelop strategic, collaborative partnerships with regional business partners to understand their business needs and priorities in support of Change Management activities\u003cbr/\u003e•\tCollaborate with Change Process Analyst on assigned projects to understand the Change Management impact of process changes and incorporate into action plans\u003cbr/\u003e•\tExecute Change Management plans and activities in support of change and adoption activities\u003cbr/\u003e•\tCreate communication and training collateral at times on own and at times with communication and/or training expert support\u003cbr/\u003e•\tSupport and coach managers and leaders in their change sponsorship role\u003cbr/\u003e•\tPresent Change Management information and updates to a variety of audiences including Steering Committees and Regional and Global Leadership groups\u003cbr/\u003e•\tCollaborate with business partners on systems deployment plans and coordinate successful execution of rollout schedules\u003cbr/\u003e•\tEscalate Change Management related risks as appropriate","department_cost_center":null,"description_short":"Reports to:  Senior TL, Business Process Improvement of Change EnablementThe Business Integration Lead will lead the Change Management efforts within World Wide Grocery Stores. They will play a key role","display_distance":null,"id":"34ff392a-4181-4b47-87b7-025229cd0584","id_icims":"3114377","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Program Management","job_function_id":null,"job_path":"/en/jobs/3114377/business-integration-lead-operations-for-worldwide-physical-grocery-stores","job_schedule_type":"full-time","location":"US, TX, Austin","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"WFM50092\"],\"normalizedCityName\":\"Austin\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA53\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS19\"],\"normalizedCityName\":\"Arlington\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN32\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"Illinois\",\"normalizedCountryCode\":\"USA\",\"city\":\"Chicago\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, IL, Chicago\",\"coordinates\":\"41.88425,-87.63245\",\"normalizedCountyName\":\"Cook\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Chicago, Illinois, USA\",\"location\":\"US, IL, Chicago\",\"region\":\"IL\",\"buildingCodeList\":[\"ORD11\"],\"normalizedCityName\":\"Chicago\"}"],"normalized_location":"Austin, Texas, USA","optional_search_labels":[],"posted_date":"October 23, 2025","preferred_qualifications":"- Prosci certification or comparable change management certification preferred\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $66,800/year in our lowest geographic market up to $142,800/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"worldwide-grocery-stores.team-whole-foods-market","source_system":"JobCreator","state":"TX","title":"Business Integration Lead, Operations for Worldwide Physical Grocery Stores","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3114377/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-whole-foods-market","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in computer science, electrical engineering, automation engineering, or equivalent, or 4+ years of PLC programming or automation engineering experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- 4+ years of process or production environment related PLC-controlled automation and issue diagnosis experience\u003cbr/\u003e- 4+ years of robotics work cells and control systems experience\u003cbr/\u003e- 4+ years of Siemens, Allen-Bradley or Codesys Ladder Logic and structure programming experience\u003cbr/\u003e- 4+ years of electrical theory, robotics, controls components, and automated equipment experience","business_category":"fulfillment-ops","city":"Thornton","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Application deadline: Mar 1, 2026\u003cbr/\u003e\u003cbr/\u003eOperations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every day. The Reliability \u0026 Maintenance Engineering (RME) team are the business partners that work tirelessly behind the scenes to make it happen. We drive continuous improvement, and maintain all the robotics and material handling equipment (MHE) to ensure our customers are met with the Amazon smile. Come join us on our journey!\u003cbr/\u003e\u003cbr/\u003eAbout the Role:\u003cbr/\u003eAs a Senior Automation Engineer, you will play a crucial role in maximizing equipment reliability and operational performance in our fulfillment centers by providing proactive controls automation and technical support. Your expertise will be essential in troubleshooting complex control systems, analyzing performance metrics, and driving continuous improvement initiatives. You'll mentor junior engineers and lead cross-functional teams to optimize material handling equipment (MHE) systems, implement innovative projects, and develop system design improvements to enhance site throughput. You'll work with state-of-the-art technology, including conveyors, sortation systems, scanners, cameras, print and apply systems, and SCADA devices and programs. Through your technical leadership and design optimization efforts, you'll directly contribute to ensuring our customers receive their orders with Amazon's signature speed and accuracy while building team capabilities and driving operational excellence.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities include, but are not limited to:\u003cbr/\u003e- You will apply Subject Matter Expertise (SME) on troubleshooting and dive deeps for engineering issues, supporting automation engineers to investigate the root cause and planning actions to eliminate/mitigate the downtime of critical assets\u003cbr/\u003e- You will collaborate with building Operations, Operations Engineering teams, FC Start-up Team, AFT Software teams, ACES team, and Safety to support MHE systems optimization and project implementation\u003cbr/\u003e- You will understand, maintain and troubleshoot material handling control systems, including PLC/PC controllers and industrial networks such as Ethernet, ControlNet, DeviceNet, Profibus, motor control systems, servo drives, frequency drives, and electrical distribution systems\u003cbr/\u003e-  You will monitor MHE metrics and partner with maintenance/operations to address system performance issues and provide analysis across all operations\u003cbr/\u003e-  You will provide escalation support to automation engineers, during and after business hours, troubleshooting locally and remotely, to ensure that all hardware or controls software within the building is repaired on time","department_cost_center":null,"description_short":"Operations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every","display_distance":null,"id":"71c8fc9c-4787-4eb4-83ca-a1687f0dbe53","id_icims":"3139065","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3139065/senior-automation-engineer-amazon-den3-rme","job_schedule_type":"full-time","location":"US, CO, Thornton","locations":["{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Thornton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Thornton\",\"coordinates\":\"39.8705,-104.98552\",\"normalizedCountyName\":\"Adams\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Thornton, Colorado, USA\",\"location\":\"US, CO, Thornton\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN3\"],\"normalizedCityName\":\"Thornton\"}"],"normalized_location":"Thornton, Colorado, USA","optional_search_labels":["operations.team-reliability-maintenance-engineering-na"],"posted_date":"December  8, 2025","preferred_qualifications":"- Experience as a mentor, tech lead or leading an engineering team\u003cbr/\u003e- Experience identifying, maintaining, troubleshooting, and modifying Motor Controls including motor starters, Variable Frequency Drives, DC drives, and standard electrical components\u003cbr/\u003e- Experience with preventive maintenance procedures, industrial electrical, industrial controls, and industrial electronics \u0026 robotics\u003cbr/\u003e- Experience interpreting and modifying mechanical and electrical drawings\u003cbr/\u003e- 3+ years of SCADA systems and KPI's experience, or Associate's degree\u003cbr/\u003e- - Experience with programming software such as RSLogix5000, Studio 5000, FT View, and other controls software platforms\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Thornton - 114,000.00 - 148,200.00 USD annually","primary_search_label":"fulfillment-ops.team-engineering-it","source_system":"JobCreator","state":"CO","title":"Senior Automation Engineer, Amazon DEN3 RME","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3139065/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-engineering-it","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}