{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team","business_category":"ecp","city":"Hyderabad","company_name":"ADCI HYD 13 SEZ","country_code":"IND","description":"Are you passionate about enabling millions of customers around the world to buy anything, anywhere, anytime?\u003cbr/\u003e\u003cbr/\u003eAmazon's ORDERING TECH HUB is now expanding to Hyderabad. This powerhouse is set to build the next generation of core ordering systems, including refund intelligence, shaping the entire post-click journey.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOrdering stands at the heart of Amazon retail, guiding the journey from purchase to delivery to resolution, and this new site will play a pivotal role in its evolution. We, the Ordering team, need founding members of software development engineers team, able to dive deep into abstract problems and come up with innovative designs to help us continuously make our platform ready for our current and future challenges.","department_cost_center":null,"description_short":"Are you passionate about enabling millions of customers around the world to buy anything, anywhere, anytime?Amazon's ORDERING TECH HUB is now expanding to Hyderabad. This powerhouse is set to build the","display_distance":null,"id":"7746960e-70ee-4c7d-b34c-5d62e33cdf8c","id_icims":"3139788","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3139788/sr-software-development-engineer-ordering","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD13\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":[],"posted_date":"December  9, 2025","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"ecp.team-ecommerce-services","source_system":"JobCreator","state":"TS","title":"Sr. Software Development Engineer, Ordering","university_job":null,"updated_time":"2 minutes","url_next_step":"https://account.amazon.com/jobs/3139788/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-ecommerce-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Available to commence an internship between January and September 2026. Yes, our start dates are flexible! You should then be available up to 6 months, full time (40h/week).\u003cbr/\u003e- Fluent written and verbal communication in German (Level - C1 or higher).\u003cbr/\u003e- Fluent written and verbal communication in English (Level - C1 or higher).\u003cbr/\u003e- Advanced knowledge of Microsoft Excel (e.g. macros, pivots, lookups, VBA).\u003cbr/\u003e- You must have the right to work in the country of employment.\u003cbr/\u003e- You will be based in München for the duration of the internship. A relocation package may be offered, subject to an eligibility criterion.","business_category":"studentprograms","city":"Munich","company_name":"Amazon EU SARL (Germany Branch) - D70","country_code":"DEU","description":"Amazon Operations is the backbone of the Amazon customer experience. With over 50 fulfillment centers, hundreds of delivery stations, and tens of thousands of employees, the team works together to efficiently deliver items to customers. In the fulfillment centers, millions of items are picked and packed annually, while delivery teams work to get orders to customers on time. Safety is the top priority, and the operations culture is defined by teamwork, diversity, and a shared work ethic that keeps the business running smoothly. The team takes pride in delivering the quality service Amazon is known for globally.\u003cbr/\u003e\u003cbr/\u003eNote: You must have the right to work in the country of employment by the start date.\u003cbr/\u003e\u003cbr/\u003eHow often can you say that your work changes the world? At Amazon, we work hard, have fun and make history! Join us to drive innovations both within finance and business. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAmazon is looking for ambitious, curious and versatile individuals to join our unique world as interns. Our Amazon EU internship will provide you with an exceptional opportunity to experience a fast-paced, dynamic and internationally diverse environment; it will boost your resume, and provide a superb introduction to our daily responsibilities. We are looking for a highly driven, entrepreneurial, analytical and customer-obsessed Business Developer Intern. You will join the team before the launch of a new service offering and will contribute to the development of a strong pipeline, and to collecting market segment and customer insights to improve the product and delight the Amazon customers. You are the ideal candidate if:\u003cbr/\u003e\u003cbr/\u003e* You are excited by contributing to launching and help developing a new business\u003cbr/\u003e\u003cbr/\u003e* You love to identify and interact with current and potential future customers, listen to their needs, and work to find the best solutions for them\u003cbr/\u003e\u003cbr/\u003e* You are a self-starter, and can juggle multiple priorities to make things happen in a fast-paced, dynamic, and often highly ambiguous environment\u003cbr/\u003e\u003cbr/\u003e* You are able to help manage the relationship with partners and prospects, and meet and exceed program goals.\u003cbr/\u003e\u003cbr/\u003e* You are able to translate customer needs into product requirements\u003cbr/\u003e\u003cbr/\u003e* You can easily shift from strategic thinking to rolling up your sleeves and executing, in order to deliver results\u003cbr/\u003e\u003cbr/\u003e* This role might require moderate domestic travel (max. 25%).\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities:\u003cbr/\u003e\u003cbr/\u003e* Deliver Results: Identify market segment opportunities for our new service offering.\u003cbr/\u003e\u003cbr/\u003e* Customer relationship management: Building and maintaining strong, trustful relationship with our potential future customers\u003cbr/\u003e\u003cbr/\u003e* Cross-functional collaboration: Relay market segment needs and requirements back to internal Amazon teams including Product Management and Tech teams\u003cbr/\u003e\u003cbr/\u003e* Dive deep: Measure performance, articulate root-cause analysis, and link to specific improvement areas\u003cbr/\u003e\u003cbr/\u003e* Invent and Simplify: Analyze current purchasing processes and evaluate opportunities for solutions to improve end user experiences, reduce costs, and accelerate organization performance\u003cbr/\u003e\u003cbr/\u003eKey Responsibilities:\u003cbr/\u003e•  Analyze financial data and trends to drive cost optimization and operational efficiency \u003cbr/\u003e•  Develop financial reports, forecasts, and KPI dashboards to support strategic decision-making \u003cbr/\u003e•  Perform financial assessments that inform business solutions and enhance customer value \u003cbr/\u003e•  Implement process automation and data quality improvements \u003cbr/\u003e•  Collaborate with stakeholders across teams while building your professional network\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour paid 6-month internship includes: \u003cbr/\u003e\u003cbr/\u003e•  Mentorship: we care about your career aspirations and strive to assign projects based on your interests. You can learn and be curious with access to unlimited virtual trainings on project management, personal brand, communication skills and many more.\u003cbr/\u003e•  Extra perks for Amazonians such as: exclusive Amazon discount; Gym membership discount; Beta testing on new Amazon products; Free mental health, legal, and financial support for you and your family.\u003cbr/\u003e•  Get involved: we have with over 13 Amazon Affinity Groups you can join and become an ally to a cause close to your heart (sustainability, diversity, LGBTQ+, mental and/or physical disabilities, local community initiatives, etc.) \u003cbr/\u003e•  Taking ownership of your career: because when you succeed, we all win. A successful internship, could lead to a full-time (graduate role) after finishing your university studies.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003e•  Intern Community: Join a network of fellow interns, where you'll build lasting connections through collaborative projects and social events. Engage with like-minded individuals in specialized interest groups, from sustainability to innovation, expanding your professional network and perspective.\u003cbr/\u003e•  Amazon Community: Immerse yourself in Amazon's diverse workplace culture, collaborating with professionals across various roles and experience levels to gain invaluable insights and mentorship opportunities.\u003cbr/\u003e•  Support: Benefit from comprehensive program support, including dedicated mentorship, regular office hours, and IT and HR assistance, ensuring you have the resources needed to succeed.\u003cbr/\u003e•  Learning Sessions: Accelerate your professional development through exclusive training sessions, access to Amazon's learning platforms, and direct interaction with industry experts, preparing you for future career success.\u003cbr/\u003e•  Opportunities: Excel in your internship to unlock potential pathways to full-time graduate roles or extended internship programs. Enjoy competitive compensation, relocation assistance, and comprehensive employee benefits while working hard, having fun and making history. \u003cbr/\u003e\u003cbr/\u003eEvery day will be filled with developing new skills and achieving personal growth. Interested? Submitting your application takes less than 10 minutes and cover letters are not required. You will just need to attach your CV and answer a questionnaire. Selected candidates will be invited to an online assessment. If successful, you’ll attend to two rounds of virtual interviews, which take place on the same day. Interviews consist of behavioural questions and a case study, focusing on our Leadership Principles. The entire recruitment process typically takes 3 to 4 weeks. Do note that the selection process and timelines are subject to change, and vary with role and location.\u003cbr/\u003e\u003cbr/\u003eEMEA Student Programs Team","department_cost_center":null,"description_short":"Amazon Operations is the backbone of the Amazon customer experience. With over 50 fulfillment centers, hundreds of delivery stations, and tens of thousands of employees, the team works together to efficiently","display_distance":null,"id":"915025ce-1819-45b2-ba04-5e16c49ce577","id_icims":"3155013","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Business/Merchant Development","job_function_id":null,"job_path":"/en/jobs/3155013/deu-business-development-intern-6-months-amazon-university-talent-acquisition","job_schedule_type":"full-time","location":"DE, BY, Munich","locations":["{\"normalizedStateName\":\"Bavaria\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Munich\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, BY, Munich\",\"coordinates\":\"48.13641,11.57754\",\"normalizedCountyName\":\"Munich\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Munich, Bavaria, DEU\",\"location\":\"DE, BY, Munich\",\"region\":\"BY\",\"buildingCodeList\":[\"MUC90\",\"MUC21\",\"UDE3\",\"MUC14\",\"MUC4\",\"UMU1\",\"MUC11\",\"MUC13\",\"MUC5\",\"OMU2\",\"ADA2\",\"MUC2\"],\"normalizedCityName\":\"Munich\"}"],"normalized_location":"Munich, Bavaria, DEU","optional_search_labels":["auta-ugnt"],"posted_date":"January  8, 2026","preferred_qualifications":"- Studies within Business, Economics, Engineering or similar fields.\u003cbr/\u003e- Knowledge in MS Office programs as Outlook, Excel and PowerPoint\u003cbr/\u003e- Excellent communication and teamwork skills, working effectively with others, driving your solutions to Deliver Results.\u003cbr/\u003e- Demonstrated curiosity, proactivity, and willingness to take on challenges in an ambiguous, fast-paced environment.\u003cbr/\u003e- Basic knowledge of and interest in AI.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"studentprograms.team-internships-for-students","source_system":"JobCreator","state":"BY","title":"DEU Business Development Intern - 6 Months, Amazon University Talent Acquisition","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3155013/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-internships-for-students","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- * 2+ years electrical, mechanical and/or controls relevant experience (degree or trade qualification preferred);\u003cbr/\u003e- * Ability to prioritize in a complex, fast-paced environment;\u003cbr/\u003e- * Valid EU driving license;\u003cbr/\u003e- * Note: This role involves covering 24x7 shift rotation.","business_category":"aws","city":"Västerås","company_name":"Amazon Data Services Sweden AB","country_code":"SWE","description":"We are currently seeking a Data Center Engineering Operations Technician to serve as a technical resource within our mission critical Data Center’s in Vasteras but also in other locations in Sweden. The position will help ensure overall availability and reliability to meet or exceed defined service levels of Data Center Engineering Operations. In this role you will have a positive involvement in both the maintenance of facilities and the improvement of efficiencies to help offer Amazon customer’s better value.\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services (AIS)\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Assisting in the operation and maintenance of all electrical, mechanical, fire/life safety equipment and HVAC equipment within the Data Center/Facility. This equipment supports mission-critical servers and must maintain better than 99.999% uptime.\u003cbr/\u003e- Assisting in the maintenance and monitoring of all Data Center systems to include incidents/events, problems, changes, monitoring, problem escalation/notification/resolution and all other aspects of Data Center support.\u003cbr/\u003e- Monitoring and troubleshooting all mechanical, electrical, HVAC systems, voice/data, cooling systems, fire/life safety equipment and generators.\u003cbr/\u003e- Providing assistance to contractor or data center engineers to ensure proper operation and maintenance of all facility equipment.\u003cbr/\u003e- Providing assistance to contractors or data center engineers to deploy new equipment, such as building racks, cabling, and other tasks as necessary.\u003cbr/\u003e- Performing site walk throughs to verify proper operation of Facility Equipment and Monitoring Systems. In addition to acting as a Facilities First Responder to critical events, you will be a part of the team supporting new data center facilities and existing data center facilities!\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e- Monitoring of all alarms and systems involved in the operation of power, cooling and fire suppression systems in the data center.\u003cbr/\u003e- Planning and coordinating vendor works on site to ensure equipment is maintained and uptime retained.\u003cbr/\u003e- Supporting other sites and teams during events and planned works.\u003cbr/\u003e- Carrying out rack power up and installation duties.\u003cbr/\u003e- Monitoring and facilitating new equipment handover.\u003cbr/\u003e- Supporting new hires and team members through knowledge share and development.\u003cbr/\u003e- Event response and drill participation.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.","department_cost_center":null,"description_short":"We are currently seeking a Data Center Engineering Operations Technician to serve as a technical resource within our mission critical Data Center’s in Vasteras but also in other locations in Sweden. The","display_distance":null,"id":"9a3170c0-608e-4a4f-b94b-4f9af6ae5962","id_icims":"3162245","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3162245/engineering-operations-technician-data-center-engineering-operations","job_schedule_type":"full-time","location":"SE, Västerås","locations":["{\"normalizedStateName\":\"Vastmanland County\",\"normalizedCountryCode\":\"SWE\",\"city\":\"Västerås\",\"countryIso3a\":\"SWE\",\"countryIso2a\":\"SE\",\"locationNonStemming\":\"Sweden, Västerås\",\"coordinates\":\"59.60959,16.54538\",\"normalizedCountyName\":\"Vasteras\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Sweden\",\"normalizedLocation\":\"Vasteras, Vastmanland County, SWE\",\"location\":\"SE, Västerås\",\"region\":\"\",\"buildingCodeList\":[\"ARN52\"],\"normalizedCityName\":\"Vasteras\"}"],"normalized_location":"Vasteras, Vastmanland County, SWE","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"January 20, 2026","preferred_qualifications":"- * Professional Certification in Electrical, Mechanical or Controls engineering.\u003cbr/\u003e- * Heavy industry or data center experience.\u003cbr/\u003e- * Understanding of basic electrical principles and systems.\u003cbr/\u003e- * Working knowledge of generic mechanical-room infrastructure such as chillers, Air Handling Units, and fan controls.\u003cbr/\u003e- * Working knowledge of backup generator systems.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-it-services","source_system":"JobCreator","state":null,"title":"Engineering Operations Technician , Data Center Engineering Operations","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3162245/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-it-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or above in a quantitative field such as statistics, mathematics, data science, business analytics, economics, finance, engineering, or computer science, or Bachelor's degree and 5+ years of professional or military experience\u003cbr/\u003e- 10+ years of working with Data \u0026 AI related technologies, including, but not limited to, AI/ML, GenAI, Analytics, Database, and/or Storage experience\u003cbr/\u003e- Experience building services using AWS products\u003cbr/\u003e- Experience with large language models (LLMs), prompt engineering, retrieval-augmented generation (RAG), fine-tuning, and agentic workflows.\u003cbr/\u003e- Proficiency in Python and experience with GenAI frameworks (LangChain, LlamaIndex, etc.) and model APIs.\u003cbr/\u003e- Experience participating in the sales lifecycle (directly or indirectly) for GenAI solutions.\u003cbr/\u003e- Experience in leading executive briefings and customer workshops focused on GenAI strategy, use case development, and prototype demonstrations.","business_category":"aws","city":"Arlington","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Application deadline: Mar 2, 2026\u003cbr/\u003e\u003cbr/\u003eDo you like creating innovative generative AI solutions that solve challenging problems? Are you passionate about building GenAI prototypes and architectures using the latest AWS cloud technologies to support defense missions?\u003cbr/\u003e  \u003cbr/\u003eAmazon Web Services is looking for a talented and technical GenAI Solutions Architect to help accelerate our business supporting defense customers. As a Sr. GenAI Solutions Architect on the DoD Solutions Architect team, you will architect, build, test, and deliver generative AI prototypes and production solutions for our defense customer's missions. This is an excellent opportunity to join Amazon's world class technical teams, working with some of the best and brightest engineers while also developing your skills and furthering your career within one of the most innovative and progressive technology companies.\u003cbr/\u003e  \u003cbr/\u003eAmazon Web Services (AWS) is looking for experienced and motivated GenAI practitioners who align with our Leadership Principles and possess a unique balance of technical depth in generative AI and strong interpersonal skills. You will partner with customers, AWS Sales and several other AWS teams to craft highly scalable, flexible and resilient GenAI architectures that address defense customer business problems and accelerate the adoption of AWS GenAI services. You will have the opportunity to help shape and execute a strategy to build mind share and broad use of AWS GenAI capabilities within the defense space. The ideal candidate must be self-motivated with a proven track record in building generative AI solutions as an engineer or architect. You should also have a demonstrated ability to think strategically about business, products, and technical challenges in the GenAI space.\u003cbr/\u003e  \u003cbr/\u003eWe are looking for someone who is passionate about:\u003cbr/\u003e  \u003cbr/\u003eBuilding scalable, secure, and innovative GenAI prototypes and production solutions using AWS services like Amazon Bedrock, Amazon SageMaker, Amazon Q, and other AWS GenAI capabilities that solve diverse and challenging problems across customers in the defense sector.\u003cbr/\u003e  \u003cbr/\u003eHands-on development of GenAI applications leveraging large language models (LLMs), retrieval-augmented generation (RAG), prompt engineering, fine-tuning, and agentic workflows.\u003cbr/\u003e  \u003cbr/\u003eArchitecting end-to-end GenAI solutions from prototype to production, including model selection, infrastructure design, security implementation, and operational excellence.\u003cbr/\u003e  \u003cbr/\u003eUsing out of the box thinking to challenge existing assumptions and design bold GenAI solutions that transform mission outcomes.\u003cbr/\u003e  \u003cbr/\u003eOptimizing GenAI processes using tools, repeatable solution patterns, infrastructure-as-code, and automation.\u003cbr/\u003e  \u003cbr/\u003eHaving a strong understanding of large scale GenAI architectures and implementation patterns. The ideal candidate will have past experience working as a GenAI engineer or architect, building production GenAI applications. You will enjoy keeping your existing technical skills honed and developing new ones, so you can make strong contributions to in-depth GenAI architecture discussions. You will regularly take part in deep-dive education and design exercises to create truly innovative GenAI solutions built on AWS.\u003cbr/\u003e  \u003cbr/\u003e**This position requires that the candidate selected be a US Citizen and obtain and maintain an active TS/SCI security clearance with polygraph.**\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eOwn the approach (business, organizational, technical) and ultimate success around specific GenAI projects, from prototype development through production deployment.\u003cbr/\u003e\u003cbr/\u003eBuild functional GenAI prototypes using AWS services (Amazon Bedrock, SageMaker, Lambda, Step Functions, etc.) to demonstrate art-of-the-possible for DoD customers.\u003cbr/\u003e\u003cbr/\u003eArchitect production-ready GenAI solutions that address security, scalability, cost optimization, and operational requirements for defense environments.\u003cbr/\u003e\u003cbr/\u003eDiscuss complex defense mission requirements and GenAI technical concepts with executives, line managers, data scientists, and mission operators.\u003cbr/\u003e\u003cbr/\u003eEngage with various AWS teams, including GenAI service teams, data \u0026 analytics, IoT, business development, marketing, partners and regional professional services organizations during pre and post sales cycle.\u003cbr/\u003e\u003cbr/\u003eEnsure customer success in ideating, prototyping, and launching GenAI solutions on the AWS platform.\u003cbr/\u003e\u003cbr/\u003eEducate customers on the value proposition of AWS GenAI services and participate in deep business discussions to ensure solutions are designed to capture business value and drive the intended success metrics.\u003cbr/\u003e\u003cbr/\u003eConduct hands-on workshop sessions to build GenAI prototypes and identify GenAI opportunities with our customers considering or already using AWS.\u003cbr/\u003e\u003cbr/\u003eDevelop and share GenAI reference architectures, implementation patterns, and best practices for enterprises building GenAI solutions.\u003cbr/\u003e\u003cbr/\u003eAuthor or otherwise contribute to AWS customer-facing publications such as whitepapers, blog posts, and technical guides focused on GenAI.\u003cbr/\u003e\u003cbr/\u003eBuild deep relationships with senior individuals within customers to enable them to be GenAI advocates.\u003cbr/\u003e\u003cbr/\u003eAct as a liaison between customers, account teams, services, data scientists, GenAI service teams, and support.\u003cbr/\u003e\u003cbr/\u003eContribute to the creation of best practices, packaged GenAI solutions, white papers, workshops, and reusable code artifacts.\u003cbr/\u003e","department_cost_center":null,"description_short":"Do you like creating innovative generative AI solutions that solve challenging problems? Are you passionate about building GenAI prototypes and architectures using the latest AWS cloud technologies to","display_distance":null,"id":"10f31b1f-d2c6-4d92-ba27-06f5b37949d9","id_icims":"3175355","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Solution Architect","job_function_id":null,"job_path":"/en/jobs/3175355/sr-genai-solutions-architect-dow","job_schedule_type":"full-time","location":"US, VA, Arlington","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS17\"],\"normalizedCityName\":\"Arlington\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD28\"],\"normalizedCityName\":\"Herndon\"}","{\"normalizedStateName\":\"North Carolina\",\"normalizedCountryCode\":\"USA\",\"city\":\"Raleigh\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NC, Raleigh\",\"coordinates\":\"35.78543,-78.6427\",\"normalizedCountyName\":\"Wake\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Raleigh, North Carolina, USA\",\"location\":\"US, NC, Raleigh\",\"region\":\"NC\",\"buildingCodeList\":[\"RDU11\"],\"normalizedCityName\":\"Raleigh\"}"],"normalized_location":"Arlington, Virginia, USA","optional_search_labels":[],"posted_date":"February  5, 2026","preferred_qualifications":"- Master's degree or above in a quantitative field such as statistics, mathematics, data science, business analytics, economics, finance, engineering, or computer science, or PhD\u003cbr/\u003e- Experience prioritizing competing demands, scoping large efforts, and negotiating timelines\u003cbr/\u003e- Experience with enterprise-scale infrastructure or development-based cloud programs/projects in a related industry\u003cbr/\u003e- Experience conveying complex technical concepts to both technical and business audiences\u003cbr/\u003e- Publications or presentations in recognized GenAI, NLP, or ML journals or conferences.\u003cbr/\u003e- Hands-on experience architecting and deploying production GenAI solutions in secure or regulated environments.\u003cbr/\u003e- Deep technical expertise with AWS GenAI services including Amazon Bedrock (Claude, Llama, Titan models), Amazon SageMaker JumpStart, Amazon Q, and related AWS services (Lambda, Step Functions, ECS/EKS, API Gateway).\u003cbr/\u003e- Experience with GenAI security patterns, responsible AI practices, and model governance.\u003cbr/\u003e- Ability to collaborate with global/enterprise account sales and delivery teams to drive adoption of GenAI Solutions into top accounts.\u003cbr/\u003e- Ability to think strategically about business, product, and technical problems in the GenAI space and develop strategic, data-driven approaches.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Denver - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, NC, Raleigh - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, VA, Arlington - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, VA, Herndon - 153,600.00 - 207,800.00 USD annually","primary_search_label":"aws.team-solutions-architect-primary","source_system":"JobCreator","state":"VA","title":"Sr. GenAI Solutions Architect, DoW","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3175355/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-solutions-architect-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of program or engagement management work leading other project managers to deliver a program with multiple and concurrent projects experience\u003cbr/\u003e- Experience in IT consulting/management with IT Transformation in a customer-facing role\u003cbr/\u003e- Experience in program or engagement management, leading other project managers to deliver a program with multiple and concurrent projects\u003cbr/\u003e- Current, active US Government Security Clearance of Top Secret or above\u003cbr/\u003e- Bachelor's degree in  Computer Science, Engineering, related field, or equivalent experience\u003cbr/\u003e- 7+ years in IT and/or Management Consulting, with at least 3 years in a people leadership role","business_category":"aws","city":"Arlington","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Application deadline: Mar 2, 2026\u003cbr/\u003e\u003cbr/\u003eThe Amazon Web Services Professional Services (ProServe) team is seeking an experienced Delivery Practice Manager (DPM) to join our ProServe Shared Delivery Team (SDT) at Amazon Web Services (AWS). In this role, you'll manage a team of ProServe Delivery Consultants while supporting AWS enterprise customers through transformative projects. You'll leverage your IT and/or Management Consulting background to serve as a strategic advisor to customers, partners, and internal AWS teams.\u003cbr/\u003e\u003cbr/\u003eAs a DPM you will be responsible for building and managing a team of Delivery Consultants and or Engagement Managers working with customers and partners to architect and implement innovative solutions. You’ll routinely engage with Director, C-level executives, and governing boards, whilst being responsible for opportunity capture and driving engagement delivery. You’ll work closely with partner teams; drive business development initiatives through thought leadership; provide portfolio guidance and oversight; and meet and exceed customer satisfaction targets. As a DPM you are primarily focused directly or through their teams, on understanding and defining business outcomes for customers by building trust, identifying applicable AWS Professional Services offerings, and creating proposals and SOW’s.\u003cbr/\u003e\u003cbr/\u003eYour experience gained leading teams within the technology sector, will equip you with the ability to optimize team performance through implementing tailored people development plans, ensuring your teams are aligned to customer needs, and have the skills and capacity to address customer outcomes. Possessing the ability to translate technical concepts into business value for customers and then talk in technical depth with teams, you will cultivate strong customer, Amazon Global Sales (AGS), and ProServe team relationships which enables exceptional business performance.  DPMs success is primarily measured by consistently delivering customer engagements by supporting sales through scoping technical requirements for an engagement, delivering engagements on time, within budget, and exceeding customer expectations. They will hold the Practice total utilization goal and be responsible for optimizing team performance.\u003cbr/\u003e \u003cbr/\u003eThe AWS Professional Services organization is a global team of experts that help customers realize their desired business outcomes when using the AWS Cloud. We work together with customer teams and the AWS Partner Network (APN) to execute enterprise cloud computing initiatives. Our team provides assistance through a collection of offerings which help customers achieve specific outcomes related to enterprise cloud adoption. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries.\u003cbr/\u003e\u003cbr/\u003eThis position requires that the candidate selected be a US Citizen and currently possess and maintain an active Top Secret security clearance.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs an experienced Professional Services Delivery Manager, you will be responsible for: \u003cbr/\u003e\u003cbr/\u003e-  Building and managing a high-performing team of Delivery Consultants\u003cbr/\u003e- Collaborating with Delivery Consultants, Engagement Managers, Account Executives, and Cloud Architects to deploy solutions and provide input on new features\u003cbr/\u003e- Developing and overseeing the implementation of innovative, forward-looking IT strategies for customers\u003cbr/\u003e- Managing practice P\u0026L, ensuring on-time and within-budget delivery of customer engagements\u003cbr/\u003e- Driving business development initiatives and exceed customer satisfaction targets\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences: AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job below, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture - Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth - We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance - We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. ","department_cost_center":null,"description_short":"The Amazon Web Services Professional Services (ProServe) team is seeking an experienced Delivery Practice Manager (DPM) to join our ProServe Shared Delivery Team (SDT) at Amazon Web Services (AWS). In","display_distance":null,"id":"5a501c79-f423-443a-854f-5951a144a13f","id_icims":"3132410","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Professional Services","job_function_id":null,"job_path":"/en/jobs/3132410/delivery-practice-manager-wwps-proserve","job_schedule_type":"full-time","location":"US, VA, Arlington","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS17\"],\"normalizedCityName\":\"Arlington\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD21\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Arlington, Virginia, USA","optional_search_labels":["aws-team-global-services-optional"],"posted_date":"November 25, 2025","preferred_qualifications":"- Experience with customer relationship management, especially C-suite level customer engagement\u003cbr/\u003e- Advanced technology  degree or AWS Professional level certifications (e.g., Solutions Architect  Professional, DevOps Engineer Professional) preferred\u003cbr/\u003e- Strong project  management and resource management capabilities\u003cbr/\u003e- Financial acumen with  P\u0026L management experience\u003cbr/\u003e- Ability to navigate  complex stakeholder relationships and drive change\u003cbr/\u003e- Sales and negotiation  skills for opportunity capture and proposal development\u003cbr/\u003e- Excellent communication, presentation, and negotiation skills with the ability to build and maintain C-level client relationships\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Denver - 169,000.00 - 228,600.00 USD annually\u003cbr/\u003eUSA, VA, Arlington - 169,000.00 - 228,600.00 USD annually\u003cbr/\u003eUSA, VA, Herndon - 169,000.00 - 228,600.00 USD annually","primary_search_label":"aws.team-us-security-clearance-jobs-primary","source_system":"JobCreator","state":"VA","title":"Delivery Practice Manager, WWPS ProServe","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3132410/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-us-security-clearance-jobs-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Aurora","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Application deadline: Mar 2, 2026\u003cbr/\u003e\u003cbr/\u003eOur WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager. In this role, you will lead a team of hourly workforce and will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e\u003cbr/\u003eOur Operation’s workflow has three major components: First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Support, mentor, and motivate your hourly workforce\u003cbr/\u003e* Manage safety, quality, productivity, and customer delivery promises\u003cbr/\u003e* Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e* Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e* Stand/walk for up to 12 hours during shifts\u003cbr/\u003e* Work in an environment where the noise level varies and can be loud\u003cbr/\u003e* Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e* Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e\u003cbr/\u003eOur fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Area Managers based on location preference and the business’ current openings.","department_cost_center":null,"description_short":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager.","display_distance":null,"id":"6e58d074-eb91-4829-9240-73d6be263f65","id_icims":"3173713","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3173713/area-manager-ii","job_schedule_type":"full-time","location":"US, CO, Aurora","locations":["{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Aurora\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Aurora\",\"coordinates\":\"39.70932,-104.81458\",\"normalizedCountyName\":\"Arapahoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Aurora, Colorado, USA\",\"location\":\"US, CO, Aurora\",\"region\":\"CO\",\"buildingCodeList\":[\"EIK2\"],\"normalizedCityName\":\"Aurora\"}"],"normalized_location":"Aurora, Colorado, USA","optional_search_labels":[],"posted_date":"February  4, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 20+ employees\u003cbr/\u003e- Experience with process improvements (Lean process, Kaizen, and/or Six Sigma)\u003cbr/\u003e- Excellent customer service, communication, and interpersonal skills\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Industry experience in: retail, F\u0026B, military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Aurora - 70,000.00 - 90,900.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"CO","title":"Area Manager II ","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3173713/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's Degree in Electrical Engineering, Mechanical Engineering, Engineering Technology, or Reliability Engineering, or 2+ years of Amazon RME (BB/3P) Full Time Exempt experience\u003cbr/\u003e- Work a flexible schedule including weekends, nights, and holidays\u003cbr/\u003e- 5+ years of industrial maintenance experience\u003cbr/\u003e- 4+ years of direct leadership/supervisory experience\u003cbr/\u003e- 4+ years of managing department spend and labor budgets, performing root cause analysis (RCA), and implementing continuous improvement (CI) experience\u003cbr/\u003e- 4+ years of managing, analyzing and communicating results to senior leadership experience\u003cbr/\u003e- 4+ years of Computerized Maintenance Management System program experience","business_category":"operations","city":"Sacramento","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Application deadline: Mar 2, 2026\u003cbr/\u003e\u003cbr/\u003eOperations is at the heart of Amazon's business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every day. The Reliability \u0026 Maintenance Engineering (RME) team are the business partners that work tirelessly behind the scenes to make it happen. We drive continuous improvement and maintain all the robotics and material handling equipment (MHE) to ensure our customers are met with the Amazon smile. Come join us on our journey!\u003cbr/\u003e\u003cbr/\u003eAbout the Role:\u003cbr/\u003eAs a Regional Maintenance Manager, you will transform workplace environments across multiple sites by leading maintenance operations throughout your region and developing the next generation of maintenance leaders. In this critical role, you'll oversee Maintenance Managers and their teams across multiple sites, develop strategic maintenance programs, and drive operational excellence across your regional footprint. You will blend strategic planning, financial management, and leadership development while navigating between managing preventative maintenance programs, coordinating with operations teams across multiple locations, and responding to emergencies that require quick, decisive action. You'll balance proactive planning with real-time problem resolution while fostering a culture of safety, innovation, and continuous improvement across your entire region.\u003cbr/\u003e\u003cbr/\u003eWhat Do We Offer? \u003cbr/\u003eAmazon offers competitive compensation packages including comprehensive healthcare benefits starting on Day 1, matching 401(k) program, and up to 20 weeks of paid parental leave. But wait, there's more: We provide lightweight fire-resistant daily wear and composite toe safety shoes for your safety!\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities include but are not limited to:\u003cbr/\u003e• You will provide leadership and mentorship to Maintenance Managers and their teams of Area Maintenance Managers, service technicians, and automation engineers across multiple sites, fostering professional growth and performance throughout your region\u003cbr/\u003e• You will develop and maintain comprehensive preventative maintenance programs, manage regional department budgets, and drive continuous improvement initiatives across all sites within your region\u003cbr/\u003e• You will ensure rigorous adherence to safety protocols and procedures across all operational sites while partnering with site Safety leadership to implement and audit safety programs regionally\u003cbr/\u003e• You will manage capital spending plans, facilitate cross-functional project planning, perform cost analysis, and coordinate external contractors while maintaining high-quality service standards across your regional network\u003cbr/\u003e• You will travel domestically up to 80% to support your regional sites, participate in network-level initiatives, provide hands-on guidance, and ensure consistent operational excellence across all locations\u003cbr/\u003e","department_cost_center":null,"description_short":"Operations is at the heart of Amazon's business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every","display_distance":null,"id":"f19a3514-fb87-4559-b856-2143be41514d","id_icims":"3166901","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3166901/regional-maintenance-manager","job_schedule_type":"full-time","location":"US, CA, Sacramento","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Renton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Renton\",\"coordinates\":\"47.47532,-122.20489\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Renton, Washington, USA\",\"location\":\"US, WA, Renton\",\"region\":\"WA\",\"buildingCodeList\":[\"SWA2\"],\"normalizedCityName\":\"Renton\"}","{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"Las Vegas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, Las Vegas\",\"coordinates\":\"36.17193,-115.14001\",\"normalizedCountyName\":\"Clark\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Las Vegas, Nevada, USA\",\"location\":\"US, NV, Las Vegas\",\"region\":\"NV\",\"buildingCodeList\":[\"SNV2\"],\"normalizedCityName\":\"Las Vegas\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sacramento\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Sacramento\",\"coordinates\":\"38.57944,-121.49085\",\"normalizedCountyName\":\"Sacramento\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sacramento, California, USA\",\"location\":\"US, CA, Sacramento\",\"region\":\"CA\",\"buildingCodeList\":[\"SCA5\"],\"normalizedCityName\":\"Sacramento\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"SCO1\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Irvine\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Irvine\",\"coordinates\":\"33.6873,-117.82591\",\"normalizedCountyName\":\"Orange\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Irvine, California, USA\",\"location\":\"US, CA, Irvine\",\"region\":\"CA\",\"buildingCodeList\":[\"SAX1\"],\"normalizedCityName\":\"Irvine\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Diego\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Diego\",\"coordinates\":\"32.71568,-117.16171\",\"normalizedCountyName\":\"San Diego\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Diego, California, USA\",\"location\":\"US, CA, San Diego\",\"region\":\"CA\",\"buildingCodeList\":[\"SCA4\"],\"normalizedCityName\":\"San Diego\"}","{\"normalizedStateName\":\"Utah\",\"normalizedCountryCode\":\"USA\",\"city\":\"SALT LAKE CITY\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, UT, SALT LAKE CITY\",\"coordinates\":\"40.76031,-111.88822\",\"normalizedCountyName\":\"Salt Lake\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Salt Lake City, Utah, USA\",\"location\":\"US, UT, SALT LAKE CITY\",\"region\":\"UT\",\"buildingCodeList\":[\"SUT3\"],\"normalizedCityName\":\"Salt Lake City\"}"],"normalized_location":"Sacramento, California, USA","optional_search_labels":[],"posted_date":"January 26, 2026","preferred_qualifications":"- Experience leading network level/multi-site maintenance organizations\u003cbr/\u003e- Professional Engineering registration\u003cbr/\u003e- Experience working with Material Handling Equipment (MHE) integrators\u003cbr/\u003e- Experience maintaining material handling equipment and integrated systems\u003cbr/\u003e- Experience in project management\u003cbr/\u003e- Experience with statistical analysis\u003cbr/\u003e- Master's degree, or Six Sigma Black Belt certification\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Sacramento - 123,300.00 - 166,800.00 USD annually","primary_search_label":"operations.team-reliability-maintenance-engineering","source_system":"JobCreator","state":"CA","title":"Regional Maintenance Manager ","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3166901/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-reliability-maintenance-engineering","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of technical infrastructure management experience\u003cbr/\u003e- Knowledge of best practices and emerging technologies, related to infrastructure (i.e. network, data center, hardware, software)\u003cbr/\u003e- Experience with varying scenarios of infrastructure builds\u003cbr/\u003e- 3+ years Outside Plant fiber deployment and troubleshooting","business_category":"aws","city":"Denver","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Application deadline: Mar 2, 2026\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services is looking for a Technical Infrastructure Program Manager (TIPM) to support and deploy one of the world’s largest and most complex telecommunication networks. The role is responsible for the execution of a strategic plan to improve the business processes and deployment of hyper-scaled cloud infrastructure - fiber networks, oversight of quality control systems, pre/post-inspections for design validation, driving vendor management, and stakeholder communication for delivery schedules and invoices forecasts. \u003cbr/\u003e\u003cbr/\u003eThis opportunity is on the Fiber Deployment team that is within the Global Connectivity Infrastructure Development - GCID - organization, which is responsible for planning, developing, and acquiring the physical network solutions that drive Amazon’s internal infrastructure and connect our services to the world.\u003cbr/\u003e\u003cbr/\u003eJob expects travel up to 60% of the year for Project based inspections.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eProgram management skills to monitor vendor delivery of physical infrastructure projects and delivering high quality fiber to make ready for circuit and data center turn-up. Technical skills of either fiber optic outside plant, process engineering, construction management, transport equipment, and quality control systems is required. \u003cbr/\u003e•\tReports to the Long-Haul Fiber Deployment Manager, and updates regularly with Fiber Deployment leadership through standardized reporting mechanisms\u003cbr/\u003e•\tServe as a key member of the GCID - Fiber Deployment team helping to drive overall Network Infrastructure strategy for long-haul circuits\u003cbr/\u003e•\tVendor management to deliver on time, measure progress, and rate through quality key performance indicators\u003cbr/\u003e•\tInterface with key internal stakeholders (e.g. Networking, Data Center Engineering, Technical Project Managers, Data Center Management, Security, Backbone) to obtain their requirements and drive vendors to adhere to key business requirements.\u003cbr/\u003e•\tDevelop a quality management program that tracks defects, mitigates risks, standardizes root cause analysis, and implements key performance measures to rate vendor success\u003cbr/\u003e•\tUnderstand the technical fiber requirements of our engineering teams and ensure the completed project meets these requirements\u003cbr/\u003e•\tUnderstand the technical components for the hardware and network connectivity to deploy a long-haul network with outside plant, Inline Amplifiers (ILA’s) and the power and security needs to light the network\u003cbr/\u003e•\tDetermining the DC/AC power supply (N+1, N+2, N+), regional power cord specifications, grounding requirements\u003cbr/\u003e•\tManage and track approved network plans with internal customers and stakeholders such as technical business developers, equipment vendors or construction vendors until the infrastructure is in service.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role oversees deployment of long haul fiber infrastructure, and iterative procedural changes. The candidate drives the delivery of the network connectivity and never settles for the high level answer. The candidate with dive into the details to understand the true blockers and work to resolve them. This may include travel to the field, generation of weekly reports, and updating standards and specifications for a global deployment team. This position requires onsite visits to physical locations and is not a remote job. Physical inspections and learning the technical standards for outside and inside fiber plant is required, with a strong emphasis on fiber characterization - OTDR, PMD, CMD, ILA hardware requirements and quality inspections. In addition this role drives process improvement activities from inception to adoption related to increasing the velocity for the long-haul team to light fiber. This includes communication with stakeholders to identify the critical activities and how to implement solutions. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe GCID Fiber Deployment team overseas the installation and quality of the AWS clouds' owned/leased conduit and fiber cable for terrestrial networks. Our mission is to deliver for our internal customers ahead of schedule, backed by a culture of deep technical acumen and can-do attitude. We are customer focused through our team approach to help each other deliver, incorporate radical evolution to simplify processes, and are attentive to detail to ensure a quality product.\u003cbr/\u003e\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"03f90918-ce44-42ff-8b79-7bbe002c913e","id_icims":"3175238","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Tech Infrastructure Prgrm Mgmt","job_function_id":null,"job_path":"/en/jobs/3175238/technical-infrastructure-program-manager-long-haul-fiber-deployment-gcid","job_schedule_type":"full-time","location":"US, CO, Denver","locations":["{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}"],"normalized_location":"Denver, Colorado, USA","optional_search_labels":["aws.team-ais","aws.team-neteng"],"posted_date":"February  5, 2026","preferred_qualifications":"- Experience with CRM tools like Salesforce\u003cbr/\u003e- Knowledge of one or more scripting languages (e.g., Python, Ruby, Perl)\u003cbr/\u003e- Experience with AI/ML technologies\u003cbr/\u003e- Knowledge of networking fundamentals\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Denver - 127,100.00 - 171,900.00 USD annually","primary_search_label":"aws.team-program-management-primary","source_system":"JobCreator","state":"CO","title":"Technical Infrastructure Program Manager - Long Haul, Fiber Deployment, GCID","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3175238/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-program-management-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Aurora","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Application deadline: Mar 2, 2026\u003cbr/\u003e\u003cbr/\u003eJob summary\u003cbr/\u003eOur WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Operations Manager. In this role, you will lead and develop a team of salaried and hourly talent. You will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. To achieve this, managers are expected to provide their team with the tools needed for success while driving improvements in productivity and efficiency through data-driven decisions and analytical problem-solving. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e   \u003cbr/\u003e  Our Operation’s workflow has three major components:  First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer.\u003cbr/\u003e \u003cbr/\u003e Key Responsibilities and Job Elements:\u003cbr/\u003e - Support, mentor, and motivate your salaried and hourly workforce\u003cbr/\u003e - Lead large-scope projects with site and regional impact\u003cbr/\u003e - Build and execute productivity plans through forecast reviews, determining productivity requirements, and partnering with other Leaders to load balance \u003cbr/\u003e - Manage safety, quality, productivity, and customer delivery promises \u003cbr/\u003e - Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e - Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e - Stand/walk for up to 12 hours during shifts \u003cbr/\u003e - Work in an environment where the noise level varies and can be loud\u003cbr/\u003e - Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e - Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e   Our fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Operations Managers based on location preference and the business’ current openings.  ","department_cost_center":null,"description_short":"Job summaryOur WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Operations","display_distance":null,"id":"e7ad2c18-cdbd-4253-9e22-88a3300547a0","id_icims":"3165141","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3165141/operations-manager","job_schedule_type":"full-time","location":"US, CO, Aurora","locations":["{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Aurora\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Aurora\",\"coordinates\":\"39.70932,-104.81458\",\"normalizedCountyName\":\"Arapahoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Aurora, Colorado, USA\",\"location\":\"US, CO, Aurora\",\"region\":\"CO\",\"buildingCodeList\":[\"EIK2\"],\"normalizedCityName\":\"Aurora\"}"],"normalized_location":"Aurora, Colorado, USA","optional_search_labels":[],"posted_date":"January 22, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 2+ salaried employees and 70+ indirect employees\u003cbr/\u003e- Experience scoping, leading, and implementing process improvements through: Lean process, Kaizen, and/or Six Sigma.\u003cbr/\u003e- Demonstrated problem solving skills and analytical skills\u003cbr/\u003e- Excellent customer service skills, communication skills and interpersonal skills\u003cbr/\u003e- Track record of meeting or exceeding department performance goals\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Experience in: military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production, or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Aurora - 91,000.00 - 136,500.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"CO","title":"Operations Manager","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3165141/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- 1+ years of Microsoft Office products and applications experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- 2+ years of reading blueprints and electrical schematics experience\u003cbr/\u003e- 2+ years of demonstrating safety standards experience\u003cbr/\u003e- 2+ years of troubleshooting and diagnostics of material handling equipment (MHE) experience\u003cbr/\u003e- 2+ years of conducting predictive and preventative maintenance procedures experience\u003cbr/\u003e- certification from Amazon's Mechatronics and Robotics Apprenticeship Program, or 2+ years of automated conveyor systems and controls experience","business_category":"operations","city":"Englewood","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Application deadline: Mar 3, 2026\u003cbr/\u003e\u003cbr/\u003eOperations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every day. Reliability Maintenance \u0026 Engineering (RME) are the business partners that work tirelessly behind the scenes to make it all happen. We drive continuous improvement and maintain all of the Robotics and Material Handling Equipment (MHE) to ensure our customers are met with the Amazon smile. Come join us on our journey!\u003cbr/\u003e\u003cbr/\u003eAbout the Role\u003cbr/\u003e\u003cbr/\u003eAs a Mechatronics \u0026 Robotics Technician, you will use your skills to support the Operations Maintenance team in repairing and maintaining material handling equipment and pneumatic systems throughout the building. You will have the opportunity to install, maintain, and repair automated packaging and distribution equipment. In addition to developing your skills, you will mentor junior technicians to grow in their roles.\u003cbr/\u003e\u003cbr/\u003eWhat Do We Offer?\u003cbr/\u003e\u003cbr/\u003eAmazon offers competitive compensation packages including comprehensive healthcare benefits starting on Day 1, matching 401(k) program, and up to 20 weeks of paid parental leave. But wait, there is more: We provide lightweight fire-resistant daily wear and composite toe safety shoes for your safety!\u003cbr/\u003e\u003cbr/\u003eHere is what you can expect with the Reliability \u0026 Maintenance Engineering (RME) selection process for Mechatronics \u0026 Robotics Technicians: (Timeframe: Approximately 30-days)\u003cbr/\u003e\u003cbr/\u003eStep 1: Congratulations! You successfully submitted your application!\u003cbr/\u003e\u003cbr/\u003eStep 2: Amazon Recruiting will review your application and invite the most qualified candidate to complete a pre-employment assessment.\u003cbr/\u003e\u003cbr/\u003eStep 3: If you meet the role qualifications, you will receive an invitation from Amazon Recruiting (do-not-reply@criteriacorp.com) to begin your Criteria assessment. You have 5 days to complete.\u003cbr/\u003e\u003cbr/\u003eStep 4: Once you successfully meet the pre-employment assessment requirements, you will be invited to complete a video interview. Your video interview invitation will be from HireVue (interviews@hirevue.com) and you will have 7 days to record your interview.\u003cbr/\u003e\u003cbr/\u003eStep 5: Your video interview will be reviewed by the Amazon Hiring Team and you will be notified of next steps via email within 5 business days.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities include, but are not limited to:\u003cbr/\u003e\u003cbr/\u003eYou will promote a safe working environment by following all safety procedures\u003cbr/\u003eYou will complete preventative maintenance routines with proper documentation\u003cbr/\u003eYou will troubleshoot electrical and mechanical problems related to all Material Handling Equipment (MHE) which includes belts, motors, photo-eyes, relays, and more\u003cbr/\u003eYou will maintain a positive working relationship across all of the Amazon Operations facility\u003cbr/\u003eYou must be able to move up to 49lbs, stand and walk during shifts lasting up to 12 hours, climb ladders and gangways safely, and without limitation, as well as perform regular bending, lifting, stretching, and reaching both below the waist and above the head\u003cbr/\u003e\u003cbr/\u003ePlease note that while we strive to accommodate employees' preferences for shift assignments, due to operational requirements and scheduling constraints, we cannot guarantee a specific shift assignment.","department_cost_center":null,"description_short":"Operations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every","display_distance":null,"id":"d3c900e5-5c0e-4592-a6af-781c655bb5db","id_icims":"3172365","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3172365/mechatronics-robotics-technician-reliability-maintenance-and-engineering","job_schedule_type":"full-time","location":"US, CO, Englewood","locations":["{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Englewood\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Englewood\",\"coordinates\":\"39.65464,-104.9935\",\"normalizedCountyName\":\"Arapahoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Englewood, Colorado, USA\",\"location\":\"US, CO, Englewood\",\"region\":\"CO\",\"buildingCodeList\":[\"SCO2\"],\"normalizedCityName\":\"Englewood\"}"],"normalized_location":"Englewood, Colorado, USA","optional_search_labels":["operations.team-reliability-maintenance-engineering-na"],"posted_date":"February  3, 2026","preferred_qualifications":"- Experience with robotic operation and maintenance\u003cbr/\u003e- 2+ years of electrical and electronic principles experience\u003cbr/\u003e- Associate's degree in Mechanical or Electrical\u003cbr/\u003e- 2+ years of Mechanical or Electrical apprenticeship experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below including the base pay rate plus the highest available shift differential which applies depending on the shift you select. As a total compensation company, you are eligible for additional earnings including overtime pay and performance bonuses. Final pay will be based on factors including shift selection and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Englewood - 35.00 - 37.00 USD hourly","primary_search_label":"operations.team-reliability-maintenance-engineering","source_system":"JobCreator","state":"CO","title":"Mechatronics \u0026 Robotics Technician , Reliability, Maintenance, and Engineering","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3172365/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-reliability-maintenance-engineering","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}