{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Studienabschluss\u003cbr/\u003e- Relevante Erfahrung in einer Managementrolle in Fertigung, Produktion, Vertriebslogistik, Einzelhandel oder Lebensmittelhandel\u003cbr/\u003e- Relevante Erfahrung in der Arbeit im Rahmen einer komplexen Stakeholderstruktur\u003cbr/\u003e- Fortgeschrittene Englisch- und Deutschkenntnisse in Wort und Schrift","business_category":"fulfillment-ops","city":"Contwig","company_name":"Amazon Logistik Dortmund GmbH","country_code":"DEU","description":"Der operative Geschäftsbereich ist das Herz von Amazon. Dieser wesentliche Teil unseres Unternehmens sorgt dafür, dass wir Bestellungen effizient versenden, damit unsere Kund:innen ihre Artikel rechtzeitig erhalten. Als Area Manager:in sorgst Du dafür, dass alle Abläufe an Deinem Standort so reibungslos wie möglich funktionieren, damit wir die Kundennachfrage erfüllen können. Du führst ein Team, das für die Sicherheit, Effizienz und erstklassige Qualität unserer Betriebsabläufe sorgt. Zusätzlich leitest Du eine Reihe von Projekten in unserem gesamten Netzwerk, um die Produktivität zu fördern. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eDeine Aufgaben und der Verantwortungsbereich: \u003cbr/\u003e\u003cbr/\u003eDu wirst die Leitung eines der wichtigsten Teams im Logistikzentrum übernehmen: Eingang, Einlagerung, Entnahme, Verpackung oder Versand. Zusammen mit den Kollegen sorgst Du für einen reibungslosen Ablauf der Workflows und erfüllst oder übertriffst die Erwartungen der Kunden. \u003cbr/\u003e\u003cbr/\u003eMit der Abteilung, die Du leitest, vertrauen wir Dir ein Mitarbeiterteam von etwa 80 bis 120 Mitarbeitern an. Du bist verantwortlich für die Schulung und Integration der Mitarbeiter, während Du gleichzeitig die Motivation und Entwicklung vorantreibst. Derweil stellst Du dank eines gesunden Urteilsvermögens sicher, dass ein Fortschritt erzielt und KPI-Ziele erreicht werden. \u003cbr/\u003e\u003cbr/\u003eGleichzeitig sorgst Du für Motivation, Engagement und Leistungsbereitschaft: \u003cbr/\u003e\u003cbr/\u003e  - Gewährleistung der Sicherheit Deines Teams am Arbeitsplatz und Einhaltung von Gesundheits- und Arbeitsschutzstandards\u003cbr/\u003e - Leitung eines funktionsübergreifende Teams, deren Aufgabe die Lösung operativer Probleme ist. \u003cbr/\u003e - Wahrung des hohen Niveau der Prozessqualität von Amazon. \u003cbr/\u003e- Beaufsichtigung von Projekten zur Verschlankung von Prozessen, Optimierung der Produktivität und Verbesserung der Servicequalität für Kund:innen in Deinem Verantwortungsbereich\u003cbr/\u003e- Analyse der Schichten laut Unternehmensvorgaben und Umsetzung von Maßnahmen zur Verbesserung unserer Operational Excellence\u003cbr/\u003e- Zusammenarbeit mit Kolleg:innen auf Führungsebene, um Schichtverfahren zu vereinheitlichen\u003cbr/\u003e\u003cbr/\u003eWir bieten:\u003cbr/\u003e- Einen unbefristeten Vertrag direkt mit Amazon\u003cbr/\u003e- Ein attraktives Vergütungspaket mit beschränkten Mitarbeiteraktien (Restricted Stock Units durch die Amazon.com, Inc.)\u003cbr/\u003e- Umzugspaket: Bei min. 80 km Entfernung vom Standort\u003cbr/\u003e- Eine kostenlose Lebens- und Erwerbsunfähigkeitsversicherung und Unterstützung bei der betrieblichen Altersvorsorge\u003cbr/\u003e- Mitarbeiterrabatte auf amazon.de sowie Amazon Extras (z.B. Rabatte in Reisen, Restaurants, Unterhaltung, Elektronik, Heim etc.)\u003cbr/\u003e- Pendlerleistungen: Kostenloses Parken, Kostenübernahme für das Deutschlandticket oder Bike Leasing-Angebote\u003cbr/\u003e- Familienbonus (Einmalzahlung für Eltern in Elternzeit)\u003cbr/\u003e- Vermittlungsservices für die Betreuung von Kindern, Senioren und Menschen mit besonderen Bedürfnissen\u003cbr/\u003e- Ein kostenloses Mitarbeiterhilfeprogramm (auch für Familienmitglieder) für eine Beratung bei beruflichen oder privaten Angelegenheiten\u003cbr/\u003e- Hervorragende Weiterentwicklungsmöglichkeiten in einem globalen Unternehmen\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eDu arbeitest im Schichtbetrieb an einem unserer Standorte und sorgst dafür, dass die dortigen Abläufe so produktiv wie möglich sind. Schwerpunkt Deiner Tätigkeit ist die Leitung und Förderung einer Sicherheitskultur sowie die Aufrechterhaltung der Qualität und der Leistungsstandards der Arbeitsschichten. Du beaufsichtigst außerdem die Prozessverbesserungen in Deinem Bereich und organisierst die Umsetzung. Ein typischer Arbeitstag kann ganz unterschiedlich aussehen und umfasst sowohl routinemäßiges Teammanagement und tägliche Betriebsaufgaben als auch Prozessverbesserung und weitreichende operative Aufgaben für den Eventualfall. Außerdem agierst Du als Vorbild und Mentor für neue Manager:innen.","department_cost_center":null,"description_short":"Der operative Geschäftsbereich ist das Herz von Amazon. Dieser wesentliche Teil unseres Unternehmens sorgt dafür, dass wir Bestellungen effizient versenden, damit unsere Kund:innen ihre Artikel rechtzeitig","display_distance":null,"id":"52d7db64-1258-4398-9a71-2591091a3645","id_icims":"3154346","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3154346/senior-operations-manager","job_schedule_type":"full-time","location":"DE, Contwig","locations":["{\"normalizedStateName\":\"Rhineland-Palatinate\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Contwig\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, Contwig\",\"coordinates\":\"49.24825,7.42892\",\"normalizedCountyName\":\"Südwestpfalz\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Contwig, Rhineland-Palatinate, DEU\",\"location\":\"DE, Contwig\",\"region\":\"\",\"buildingCodeList\":[\"SCN4\"],\"normalizedCityName\":\"Contwig\"}"],"normalized_location":"Contwig, Rhineland-Palatinate, DEU","optional_search_labels":["fulfillment-and-operations.fulfillment-center-mgmt-emea"],"posted_date":"January  7, 2026","preferred_qualifications":"- Weiterführender Studienabschluss (z. B. Master) in Ingenieurswesen, Lieferketten, Logistik oder Fertigung\u003cbr/\u003e- Erfahrung im Management von Drittparteibeziehungen\u003cbr/\u003e- Erfahrung in der Anwendung von Lean-, Six-Sigma- und Kaizen-Methoden\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":null,"title":"Senior Operations Manager","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3154346/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in financial analysis, retail buying, retail planning \u0026 allocation, product/project management, marketing, business development, consulting, negotiation or supply chain\u003cbr/\u003e- Experience in financial analysis, retail buying, retail planning \u0026 allocation, product/project management, marketing, business development, consulting, negotiation or supply chain. Advance Excel Skills","business_category":"retail","city":"Dubai","company_name":"Q-Express Documents Transport","country_code":"ARE","description":"We are seeking a results-oriented Instock Manager for the Other Hardlines Categories in GCC. The Instock Manager will be responsible for all aspects of the Instock role, including driving improved in-stock, inventory planning and forecasting. Additionally, you will drive initiatives to improve customer experience by working collaboratively across Retail, supply chain and operations. The ideal candidate will excel in scalable process improvement, analytics, written/verbal communication and be customer obsessed. The candidate will have proven experience delivering results by partnering with others and be comfortable leading and contributing across a range of topic outside of the core ISM responsibilities.\u003cbr/\u003e\u003cbr/\u003eAs Instock Manager, you will focus on delivering improvements at the GCC level, partnering with vendors and various functional teams and individuals at all levels of the organization to improve internal and external processes while continuously improving operational metrics. You will own the relationship of a set of Other Hardlines vendors and related long-term Supply Chain optimization goals, with the aim of reducing our overall cost to serve, contributing to the growth and scale of the category and to maximize the service level for our customers.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003e- Manage availability and inventory health including: improved in-stock rates, inventory planning and systematic forecasting for key categories\u003cbr/\u003e- Driving meaningful data driven solutions to solve complex supply chain problems\u003cbr/\u003e- Developing dashboards to enable better team efficiency through automation \u003cbr/\u003e- Create and run buying/forecasting scenarios and enable better buying decisions to ensure continuous improvement in the buying process\u003cbr/\u003e- Step changing the vendors’ operational performance by acting as their internal consultant on forecasting/buying/operations domain","department_cost_center":null,"description_short":"We are seeking a results-oriented Instock Manager for the Other Hardlines Categories in GCC. The Instock Manager will be responsible for all aspects of the Instock role, including driving improved in-stock,","display_distance":null,"id":"93084117-3f90-4708-9f03-0f2e1c2b9bef","id_icims":"3160803","is_intern":null,"is_manager":null,"job_category":"Buying, Planning, \u0026 Instock Management","job_family":"Amazon future builders program","job_function_id":null,"job_path":"/en/jobs/3160803/instock-manager-uae-national-ohl","job_schedule_type":"full-time","location":"AE, Dubai","locations":["{\"normalizedCountryCode\":\"ARE\",\"city\":\"Dubai\",\"countryIso3a\":\"ARE\",\"countryIso2a\":\"AE\",\"locationNonStemming\":\"United Arab Emirates, Dubai\",\"coordinates\":\"25.26951,55.30884\",\"normalizedCountyName\":\"Dubai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Arab Emirates\",\"normalizedLocation\":\"Dubai, ARE\",\"location\":\"AE, Dubai\",\"region\":\"\",\"buildingCodeList\":[\"DXB30\"],\"normalizedCityName\":\"Dubai\"}"],"normalized_location":"Dubai, ARE","optional_search_labels":[],"posted_date":"January 16, 2026","preferred_qualifications":"- · Experience with SQL is a plus · Experience with process improvement techniques such as Kaizen, Lean Manufacturing or Six Sigma is a plus\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"retail.team-consumables","source_system":"JobCreator","state":null,"title":"Instock Manager- UAE National, OHL","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3160803/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-consumables","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree","business_category":"amazon-business","city":"Hyderabad - Virtual","company_name":"Amazon Dev Center India - Hyderabad - A85","country_code":"IND","description":"This team enables automation at Amazon Robotics Fulfillment centers. This team serves Amazon Internal Fulfillment Technologies \u0026 Robotics teams by enabling automation, which includes real-time \u0026 offline (image/video) data auditing services. One of the key contributions of this team is supporting the fulfillment centers in maintaining inventory accuracy.\u003cbr/\u003e \u003cbr/\u003eAn Associate in this role is required to watch the video of the stowing action at a fulfillment center, understand it thoroughly and make best use of human judgement in combination with the tools and resources to indicate the activity captured in the video. They are expected to verify or mark the location of product through a tool while maintaining highest level of accuracy. This process helps in maintaining the fulfillment center's stow quality. This is an operational role. Under general supervision, the Associate performs precise and thorough video/image audits with high degree of accuracy and speed, thus aiding defect reduction.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe Associate has to watch several hundred videos in a shift and provide responses by following goals on accuracy (quality), speed (productivity) and right / acceptable practices. Associates are required to take breaks at the pre-defined slots and ensure 6.8 to 7 hours’ time per day is spent to answer the videos. Associates who are hired to work from home should maintain (1) dedicated workspace i.e., table, chair \u0026 sufficient lighting (2) workspace / work related data shouldn’t be accessed by anyone other than employee\u003cbr/\u003e\u003cbr/\u003eThe candidate is expected to demonstrate:\u003cbr/\u003e• Willingness to work in Non-tech role for contract duration of 6 months\u003cbr/\u003e• Ability to audit image/video/text based Jobs\u003cbr/\u003e• Ability to identify details from blurry, less sharp videos and provide correct response. Requires high level of attention \u0026 focus on screen\u003cbr/\u003e• Willingness to work on incremental targets/goals on quality \u0026 productivity\u003cbr/\u003e• Fast Pace of implementation \u0026 consistent performance\u003cbr/\u003e• Ability to work in rotational shifts (including night shifts), remote teams and exceptionally good team player\u003cbr/\u003e• Readiness to come to office for few days (when required, applicable for associates working from home)\u003cbr/\u003e• Willing to switch ON laptop camera while on virtual meetings.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAssociates work in 24x7 environment with rotational shifts. Associates would be working in a 9 hour shift, including pre-scheduled breaks. The shift timings would be subject to change every 3-4 months or as per business requirement. In case associate is working in night shift, night shift allowance will be provided as per applicable Amazon’s work policy.\u003cbr/\u003e\u003cbr/\u003eWeekly Offs: Rotational two-consecutive day off (it is a 5-day working week with 2 consecutive days off, not necessarily Saturday and Sunday) or as per business discretion.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eData Auditing Operations team provides human support to Amazon Fulfillment facilities with goal of enabling hands-free active stowing through visual audits on videos/images. Videos with brief duration (typically between 15 and 20seconds) are sent to Operations Team for humans to audit them with information on products being stored at fulfilment centers. For business use, these videos must be thoroughly reviewed and audited using best human judgement. The effectiveness of automated process will be increased by using videos that Associates have audited. This process helps maintaining stow quality at fulfillment center and Associate will be further evaluated for performance improvements/coaching.","department_cost_center":null,"description_short":"This team enables automation at Amazon Robotics Fulfillment centers. This team serves Amazon Internal Fulfillment Technologies \u0026 Robotics teams by enabling automation, which includes real-time \u0026 offline","display_distance":null,"id":"fe817786-fd01-4114-bb12-4960529e635a","id_icims":"3169256","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Machine Learning Data Operatio","job_function_id":null,"job_path":"/en/jobs/3169256/associate-ml-data-operations-go-ai-operations","job_schedule_type":"full-time","location":"IN, TS, Hyderabad - Virtual","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad - Virtual\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad - Virtual\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad - Virtual\",\"region\":\"TS\",\"buildingCodeList\":[\"VCCTSIND\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":[],"posted_date":"January 29, 2026","preferred_qualifications":"- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-business.no-team-listed","source_system":"JobCreator","state":"TS","title":"Associate, ML Data Operations, GO-AI Operations","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3169256/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Die Position wird am Standort in Essen besetzt\u003cbr/\u003e- Abgeschlossene technische Berufsausbildung, bevorzugt im elektrotechnischen Bereich, anerkannt durch die Industrie- und Handelskammer (IHK) oder Handwerkskammer (HWK) oder alternativ ein Nachweis eines erfolgreich abgeschlossen Hochschulstudium im Ingenieurwissenschaftlichen Bereich (Elektrotechnik oder artverwandt) einer deutschen Hochschule oder anerkannte ausländische Hochschulabschlüsse (BA, B. Sc., MA, M. Sc., Dipl.-Ing.)\u003cbr/\u003e- Zusätzlich zur Berufsausbildung, eine abgeschlossene Qualifikation als Industriemeister, Handwerksmeister oder Staatlich Geprüfter/Anerkannter Techniker oder mehrjährige einschlägige Berufserfahrung im Bereich Elektrotechnik\u003cbr/\u003e- Praktische Erfahrung im Führen von Teams\u003cbr/\u003e- Erfahrung in der Automatisierung und Instandhaltung von Förderanlagen\u003cbr/\u003e- Fortgeschrittene Deutschkenntnisse in Wort und Schrift sowie gute Sprachkenntnisse in Englisch","business_category":"fulfillment-ops","city":"Essen","company_name":"Amazon Deutschland W5 Transport GmbH - I32","country_code":"DEU","description":"Für unser Verteilzentrum in Essen suchen wir ab sofort:\u003cbr/\u003e\u003cbr/\u003eMeister / Staatl. geprüfter Techniker / Senior Techniker Instandhaltung (Schwerpunkt Elektrotechnik) - all genders\u003cbr/\u003e\u003cbr/\u003eUnser Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) ist der Kern von Amazons Engagement für Innovation. Amazon entwickelt sich weiter und dieses Team sorgt dafür, dass dies auch die von uns verwendeten Technologien und Tools tun. \u003cbr/\u003e\u003cbr/\u003eAls Senior RME Technician hilfst Du uns, der Entwicklung einen Schritt voraus zu bleiben. Du setzt die neuesten Technologien ein und identifizierst neue, effiziente Arbeitsmethoden. In dieser Rolle achtest Du genau auf unsere Prozesse und trägst dazu bei, dass wir unsere höchsten Sicherheitsstandards befolgen und weiter erhöhen. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Best Practice und Unterstützen im Bedienen von Geräten und Anlagen mit den höchsten Sicherheitsstandards\u003cbr/\u003e- Verfolgen der Geräteleistung durch visuelle Prüfungen, zustandsorientierte Überwachung und vorbeugende Wartungsmaßnahmen und Einplanen zusätzlicher Wartung je nach Bedarf\u003cbr/\u003e- Verantwortung für das technische Team während seiner Schicht und dessen Unterstützung und Weiterentwicklung\u003cbr/\u003e- Lösung von Problemen an Anlagen, um Betriebsausfallzeiten zu reduzieren und die schnellstmögliche Abfertigung von Paketen zu ermöglichen\u003cbr/\u003e- Unterstützung bei der kontinuierlichen Verbesserung von Systemen und Standardisierung von Prozessen im ganzen EU-Netzwerk\u003cbr/\u003e\u003cbr/\u003eWir bieten:\u003cbr/\u003e- Einen unbefristeten Vertrag direkt mit Amazon.\u003cbr/\u003e- Ein attraktives Vergütungspaket und Mitarbeiterrabatte auf amazon.de sowie Amazon Extras (z.B. Rabatte für Reisen, Restaurants, Unterhaltung, Elektronik, Heim etc.)\u003cbr/\u003e- Hervorragende Weiterentwicklungsmöglichkeiten in einem globalen Unternehmen\u003cbr/\u003e- Pendlerleistungen \u003cbr/\u003e- Leistungen wie z.B. Unterstützung bei der betrieblichen Altersvorsorge und eine kostenlose Lebens- und Erwerbsunfähigkeitsversicherung.\u003cbr/\u003e- Vermittlungsservices für die Betreuung von Kindern, Senioren und Menschen mit besonderen Bedürfnissen\u003cbr/\u003e- Familienbonus (Einmalzahlung für Eltern in Elternzeit).\u003cbr/\u003e- Ein kostenloses Mitarbeiterhilfeprogramm (auch für Familienmitglieder) für eine Beratung bei beruflichen oder privaten Angelegenheiten.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eDu betreust die Instandhaltung der Anlagen und technischen Systeme innerhalb einer Schicht und sorgst dafür, dass alle Mitarbeitenden die erforderlichen Werkzeuge zur Verfügung haben und diese einwandfrei funktionieren. Das beinhaltet die Überwachung von Prozessen, damit Vorschriften und Richtlinien befolgt werden, ebenso wie die Gewährleistung der Durchführung vorbeugender Wartungsmaßnahmen, um die Betriebszeit unserer Anlagen zu maximieren.\u003cbr/\u003eDurch Deine Beobachtungen während der Schichtarbeit machst Du Verbesserungsvorschläge, um unsere Systeme noch effizienter und produktiver zu gestalten, und setzt diese Verbesserungen EU-weit um. Außerdem nutzt Du Tools wie SCADA zur Überwachung von Prozessen, um deren Leistungsfähigkeit zu gewährleisten, und unterstützt administrative Aufgaben in enger Zusammenarbeit mit Deinen Führungskräften.\u003cbr/\u003eDu arbeitest vor Ort in einem unserer Verteilzentren. \u003cbr/\u003e\u003cbr/\u003eDu arbeitest in Schichtmodellen, die Nächte und Wochenenden umfassen können. Mit den Kenntnissen und Erfahrungen, die Du sammelst, wirst Du Dich zu weiteren Führungspositionen weiterentwickeln. \u003cbr/\u003e\u003cbr/\u003eDas Logistiknetzwerk in der Region besteht aus mehreren Standorten, bei denen gelegentlich Unterstützung an einem nahegelegenen Standort erforderlich sein kann.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eUnser Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) sorgt dafür, dass unsere Geräte und Ausstattung jederzeit optimal funktionieren. Wir sind ein Team von Techniker:innen und Ingenieur:innen, das aus hervorragenden Teamplayern besteht und von erfahrenen Führungskräften geleitet wird. Wir arbeiten gemeinsam daran, die Geräte in unserem gesamten globalen Netzwerk von Fulfillment-Centern zu warten, zu reparieren und ihre Fehler zu beheben. ","department_cost_center":null,"description_short":"Für unser Verteilzentrum in Essen suchen wir ab sofort:Meister / Staatl. geprüfter Techniker / Senior Techniker Instandhaltung (Schwerpunkt Elektrotechnik) - all gendersUnser Wartungs- und Instandhaltungsteam","display_distance":null,"id":"b5f08cdc-8756-4f30-b836-d2f39e101d73","id_icims":"3171545","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Real Estate/facilities","job_function_id":null,"job_path":"/en/jobs/3171545/meister-staatl-geprufter-techniker-senior-techniker-instandhaltung-all-genders","job_schedule_type":"full-time","location":"DE, NW, Essen","locations":["{\"normalizedStateName\":\"North-Rhine-Westphalia\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Bochum\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, NW, Bochum\",\"coordinates\":\"51.48803,7.21398\",\"normalizedCountyName\":\"Bochum\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Bochum, North-Rhine-Westphalia, DEU\",\"location\":\"DE, NW, Bochum\",\"region\":\"NW\",\"buildingCodeList\":[\"DNF3\",\"DNW1\",\"DTMA\",\"VEAA\"],\"normalizedCityName\":\"Bochum\"}","{\"normalizedStateName\":\"North-Rhine-Westphalia\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Essen\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, NW, Essen\",\"coordinates\":\"51.45183,7.01108\",\"normalizedCountyName\":\"Essen\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Essen, North-Rhine-Westphalia, DEU\",\"location\":\"DE, NW, Essen\",\"region\":\"NW\",\"buildingCodeList\":[\"DNW8\"],\"normalizedCityName\":\"Essen\"}","{\"normalizedStateName\":\"North-Rhine-Westphalia\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Wuppertal\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, NW, Wuppertal\",\"coordinates\":\"51.27165,7.19677\",\"normalizedCountyName\":\"Wuppertal\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Wuppertal, North-Rhine-Westphalia, DEU\",\"location\":\"DE, NW, Wuppertal\",\"region\":\"NW\",\"buildingCodeList\":[\"DNX2\"],\"normalizedCityName\":\"Wuppertal\"}","{\"normalizedStateName\":\"North-Rhine-Westphalia\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Duisburg\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, NW, Duisburg\",\"coordinates\":\"51.43147,6.76362\",\"normalizedCountyName\":\"Duisburg\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Duisburg, North-Rhine-Westphalia, DEU\",\"location\":\"DE, NW, Duisburg\",\"region\":\"NW\",\"buildingCodeList\":[\"VETA\",\"HNX4\",\"VESG\",\"PDEX\",\"VEKK\",\"DNW4\",\"VEWH\",\"VESE\",\"XDEC\",\"VENB\"],\"normalizedCityName\":\"Duisburg\"}"],"normalized_location":"Essen, North-Rhine-Westphalia, DEU","optional_search_labels":["ops.lander-emea-rme-reliability"],"posted_date":"February  2, 2026","preferred_qualifications":"- Erfahrung in der Betreuung von Fremdfirmen\u003cbr/\u003e- Verständnis von SPS-basierten Steuersystemen und gesetzlichen Compliance-Anforderungen\u003cbr/\u003e- Erfahrung im Gebrauch von computergesteuerten Wartungsmanagementsystemen, um proaktive Wartungsmaßnahmen zu planen und reaktive Maßnahmen aufzuzeichnen\u003cbr/\u003e- Studienabschluss, vorzugsweise in einem technischen Fachgebiet oder in Betriebswirtschaft\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":"NW","title":"Meister / Staatl. geprüfter Techniker / Senior Techniker Instandhaltung (all genders)","university_job":null,"updated_time":"23 minutes","url_next_step":"https://account.amazon.com/jobs/3171545/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience working and communicating with multiple stakeholders, C-level executives and cross functional teams or equivalent\u003cbr/\u003e- Knowledge of Excel (Pivot Tables, VLookUps) at an advanced level and SQL\u003cbr/\u003e- Experience working with fast-moving, high-performance teams and driving innovative solutions tailored to unique business environments\u003cbr/\u003e- - 10+ 2 degree","business_category":"transportation-and-logistics","city":"Virtual","company_name":"ADCI - Uttar Pradesh - F26","country_code":"IND","description":"TOC (Transportation Operation Center) is the central command and control center for ‘Transportation Execution’ across the Amazon Supply Chain network supporting multiple geographies like NA, India and EU. It    ensures hassle free, timely pick-up and delivery of freight from   vendors  to Amazon fulfillment centers (FC) and from Amazon FCs to   carrier hubs.  In case of any exceptions, TOC steps in to resolve the   issue and keeps  all the stakeholders informed on the proceedings. Along   with this  tactical problem solving TOC is also charged with   understanding trends  in network exceptions and then automating   processes or proposing process  changes to streamline operations. This   second aspect involves network  monitoring and significant analysis of   network data.\r\u003cbr/\u003e  Overall, TOC  plays a critical role in ensuring the   smooth functioning of Amazon  transportation and thereby has a direct   impact on Amazon’s ability to  serve its customers on time.\r\u003cbr/\u003e  Purview of a Trans Ops Specialist\r\u003cbr/\u003e     A Trans Ops Specialist at TOC facilitates flow of information  between   different stakeholders (Trans Carriers/Hubs/Warehouses) and  resolves  any  potential issues that impacts customer experience and  business   continuity. Trans Ops Specialist at TOC works across two verticals – Inbound and Outbound operations. \r\u003cbr/\u003e     Inbound Operations deals with Vendor/Carrier/FC relationship,   ensuring  that the freight is picked-up on time and is delivered at FC   as per the  given appointment. Trans Ops Specialist on Inbound addresses   any  potential issues occurring during the lifecycle of pick-up to   delivery.\r\u003cbr/\u003e   Outbound Operations deals with FC/Carrier/Carrier Hub   relationship,  ensuring that the truck leaves the FC in order to   delivery customer  orders as per promise. Trans Ops Specialist    on Outbound addresses any potential issues occurring during the    lifecycle of freight leaving the FC and reaching customer premises.\r\u003cbr/\u003e\r\u003cbr/\u003e  A Trans Ops Specialist    provides timely resolution to the issue in hand by researching and    querying internal tools and by taking real-time decisions. An ideal    candidate should be able to understand the requirements/be able to    analyze data and notice trends and be able to drive Customer Experience    without compromising on time. The candidate should have the basic    understanding of Logistics and should be able to communicate clearly in    the written and oral form. Trans Ops Specialist should be able to   ideate  process improvements and should have the zeal to drive them to    conclusion. \r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003eResponsibilities include, but are not limited to:\r\u003cbr/\u003e   \r\u003cbr/\u003e     ·         Communication with external customers (Carriers,    Vendors/Suppliers) and internal customers (Retail, Finance, Software    Support, Fulfillment Centers)\r\u003cbr/\u003e  ·         Ability to pull data from    numerous databases (using Excel, Access, SQL and/or other data    management systems) and to perform ad hoc reporting and analysis as    needed is a plus.\r\u003cbr/\u003e  ·         Develop and/or understand performance metrics to assist with driving business results.\r\u003cbr/\u003e     ·         Ability to scope out business and functional requirements    for the Amazon technology teams who create and enhance the software    systems and tools are used by TOC.\r\u003cbr/\u003e  ·         Must be able to    quickly understand the business impact of the trends and make decisions    that make sense based on available data.\r\u003cbr/\u003e  ·         Must be able  to   systematically escalate problems or variance in the information and   data  to the relevant owners and teams and follow through on the   resolutions  to ensure they are delivered.\r\u003cbr/\u003e  ·         Work within   various time  constraints to meet critical business needs, while   measuring and  identifying activities performed.\r\u003cbr/\u003e  ·           Excellent  communication, both verbal and written as one may be required   to create a  narrative outlining weekly findings and the variances to   goals, and  present these finding in a review forum.\r\u003cbr/\u003e - Providing real-time customer experience by working in 24*7      operating environment.\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003eA day in the life\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003eAbout the hiring group\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003eJob responsibilities\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003eA day in the life\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003eAbout the hiring group\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003eJob responsibilities\r\u003cbr/\u003e\r\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e Communication with external customers (Carriers, Vendors/Suppliers) and internal customers (Retail, Finance, Software Support, Fulfillment Centers)\u003cbr/\u003e· Ability to pull data from numerous databases (using Excel, Access, SQL and/or other data management systems) and to perform ad hoc reporting and analysis as needed is a plus.\u003cbr/\u003e· Develop and/or understand performance metrics to assist with driving business results.\u003cbr/\u003e· Ability to scope out business and functional requirements for the Amazon technology teams who create and enhance the software systems and tools are used by TOC.\u003cbr/\u003e· Must be able to quickly understand the business impact of the trends and make decisions that make sense based on available data.\u003cbr/\u003e· Must be able to systematically escalate problems or variance in the information and data to the relevant owners and teams and follow through on the resolutions to ensure they are delivered.\u003cbr/\u003e· Work within various time constraints to meet critical business needs, while measuring and identifying activities performed.\u003cbr/\u003e· Excellent communication, both verbal and written as one may be required to create a narrative outlining weekly findings and the variances to goals, and present these finding in a review forum.\u003cbr/\u003e\u003cbr/\u003eProviding real-time customer experience by working in 24*7 operating environment.","department_cost_center":null,"description_short":"TOC (Transportation Operation Center) is the central command and control center for ‘Transportation Execution’ across the Amazon Supply Chain network supporting multiple geographies like NA, India and","display_distance":null,"id":"cc976038-b99a-4590-8c47-008346dcca2a","id_icims":"3174708","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Cust. Experience Qualit Ops","job_function_id":null,"job_path":"/en/jobs/3174708/transportation-representative-av","job_schedule_type":"full-time","location":"IN, UP, Virtual","locations":["{\"normalizedStateName\":\"Uttar Pradesh\",\"normalizedCountryCode\":\"IND\",\"city\":\"Virtual\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, UP, Virtual\",\"coordinates\":\"26.85471,80.92135\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Uttar Pradesh, IND\",\"location\":\"IN, UP, Virtual\",\"region\":\"UP\",\"buildingCodeList\":[\"VCC15\"]}","{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Virtual\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Virtual\",\"coordinates\":\"17.3949,78.47081\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Telangana, IND\",\"location\":\"IN, TS, Virtual\",\"region\":\"TS\",\"buildingCodeList\":[\"VCC13\"]}"],"normalized_location":"Uttar Pradesh, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"February  5, 2026","preferred_qualifications":"- Knowledge of Six Sigma, Lean manufacturing efforts, transportation and logistics, or fulfillment and distribution centers\u003cbr/\u003e- Knowledge of and proficiency in Excel and SQL\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-fulfillment-transportation","source_system":"JobCreator","state":"UP","title":"Transportation Representative, AV","university_job":null,"updated_time":"26 minutes","url_next_step":"https://account.amazon.com/jobs/3174708/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-transportation","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"•\tSignificant experience of program or project management\u003cbr/\u003e•\tSignificant experience developing real estate strategies, working in space planning, occupancy planning, program management or customer experience\u003cbr/\u003e","business_category":"finance","city":"Cape Town","company_name":"Amazon Development Centre (South Africa) (Proprietary) Limited","country_code":"ZAF","description":"Work hard, have fun, make history. That's what we do every day at Amazon. Global Real Estate and Facilities (GREF) in the Europe, Middle East, and Africa (EMEA) region manages an extensive corporate office portfolio encompassing approximately 10 million rentable square feet (RSF) spread over 43 countries, 86 cities, and 139 buildings. Currently, GREF's EMEA operations are organized into nine distinct areas to efficiently serve its diverse customer base, including various business teams, leaders, and vendors who utilize Amazon's corporate offices. Looking ahead to 2025, GREF plans to restructure its services to align more closely with major Amazon organizations such as AWS, Stores, Devices, and FGBS. This strategic realignment will consolidate the existing nine areas into five geographical regions or \"Geos,\" mirroring the operational and reporting structures of Amazon's key business units.\u003cbr/\u003e\u003cbr/\u003eAmazon's GREF team is seeking a Portfolio Manager, a leader who will be expected to align real estate strategy to business needs in partnership with key GREF Stakeholders and maintain a customer centric approach. The role will partner with all Amazon teams and functions such as PP, PR, TRAD (Talent Research \u0026 Development), along with internal GREF teams, such as Global Business Partnering, Space and Occupancy planning, and Design and Construction, to support the implementation of workplace design, space, and strategic needs for the Geo in order to support business requirements. This role will support GEO 4: Sub-Saharan Africa, Israel, Mediterranean, which will oversee 7 countries, 9 cities, 13 buildings and 1.6MM RSF. This position requires the candidate to be based within this specific geo, facilitating direct and efficient support for GREF's operations in the region.\u003cbr/\u003e\u003cbr/\u003eThe optimal candidate is an experienced and engaging professional who will excel within an entrepreneurial culture – providing vision, leadership, and communication – not afraid to dive deep into details and take ownership. They should also understand the nuance of being approachable and consultative– providing direction/recommendations and fostering transparent relationships. The candidate must be able to balance frugality with creativity in offering solutions and approach problem-solving with an emphasis on root cause. An ideal candidate is able to navigate high level of ambiguity and demonstrate a bias for action, taking calculated risks in a fast-paced environment. \u003cbr/\u003e\u003cbr/\u003eThis position is office-based; however, Amazon encourages open communication about unique needs for flexible arrangements.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tDevelop and lead the implementation of strategic initiatives to support business requirements\u003cbr/\u003e•\tWrite documents and provide writing support in line with Amazon standards \u003cbr/\u003e•\tSupporting in person and remote meetings with internal GREF stakeholders and customers\u003cbr/\u003e•\tCollaborate with global business partnering and business leaders to understand their real estate and portfolio needs, ensuring these requirements are accurately captured and addressed\u003cbr/\u003e•\tCollaborate with a variety of stakeholders, including but not limited to, Amazon Financial Planning \u0026 Analysis (FP\u0026A), Finance Leaders, and PXT to validate headcount data (i.e., forecasted demand)\u003cbr/\u003e•\tMaintain clear and consistent communication with business units, providing updates and addressing any concerns or questions related to real estate and portfolio matters\u003cbr/\u003e•\tWork in a matrix reporting structure, encompassing both dotted and hard reporting lines \u003cbr/\u003e•\tCross functionally engage and coordinate with Regional Portfolio Strategist \u003cbr/\u003e","department_cost_center":null,"description_short":"Work hard, have fun, make history. That's what we do every day at Amazon. Global Real Estate and Facilities (GREF) in the Europe, Middle East, and Africa (EMEA) region manages an extensive corporate office","display_distance":null,"id":"e5f75094-2c29-4723-8e5c-100a0816e7af","id_icims":"3014993","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3014993/portfolio-manager-sub-saharan-africa-israel-mediterranean-gref-regional-portfolio-management-rpm-emea","job_schedule_type":"full-time","location":"ZA, Cape Town","locations":["{\"normalizedStateName\":\"Western Cape\",\"normalizedCountryCode\":\"ZAF\",\"city\":\"Cape Town\",\"countryIso3a\":\"ZAF\",\"countryIso2a\":\"ZA\",\"locationNonStemming\":\"South Africa, Cape Town\",\"coordinates\":\"-33.91909,18.42198\",\"normalizedCountyName\":\"Cape Town\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"South Africa\",\"normalizedLocation\":\"Cape Town, Western Cape, ZAF\",\"location\":\"ZA, Cape Town\",\"region\":\"\",\"buildingCodeList\":[\"CPT14\"],\"normalizedCityName\":\"Cape Town\"}"],"normalized_location":"Cape Town, Western Cape, ZAF","optional_search_labels":[],"posted_date":"June 20, 2025","preferred_qualifications":"•\tExperience using data and metrics to determine and drive improvements\u003cbr/\u003e•\tExperience owning program strategy, end-to-end delivery, and communicating results to senior leadership\u003cbr/\u003e•\tCustomer-experience focused; consistently exceeding expectations and prioritizing customer needs\u003cbr/\u003e•\tExhibit excellence in reporting; capable of synthesizing complex information into clear, actionable insights\u003cbr/\u003e•\tCommunicates effectively with stakeholders at all levels, providing regular updates and maintaining transparency\u003cbr/\u003e•\tWhile independent and self-driven, values collaboration, working effectively with cross-functional teams to achieve common goals\u003cbr/\u003e•\tProblem-solving mindset: actively seeking opportunities to identify and address areas for improvement\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer, and we value your passion to discover, invent, simplify and build. We welcome applications from all members of society irrespective of age, sex, disability, sexual orientation, race, religion or belief. Amazon is strongly committed to diversity within its community and especially welcomes applications from South African citizens who are members of designated groups who may contribute to Employment Equity within the workplace and the further diversification of ideas. In this regard, the relevant laws and principles associated with Employment Equity will be considered when appointing potential candidates. We are required by law to verify your ability to work lawfully in South Africa. Amazon requires that you submit a copy of either your identity document or your passport and any applicable work permit if you are a foreign national, along with an updated curriculum vitae.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-no-team-listed","source_system":"JobCreator","state":null,"title":"Portfolio Manager – Sub-Saharan Africa, Israel, Mediterranean , GREF – Regional Portfolio Management (RPM) EMEA","university_job":null,"updated_time":"27 minutes","url_next_step":"https://account.amazon.com/jobs/3014993/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience with data visualization using Tableau, Quicksight, or similar tools\u003cbr/\u003e- Experience with one or more industry analytics visualization tools (e.g. Excel, Tableau, QuickSight, MicroStrategy, PowerBI) and statistical methods (e.g. t-test, Chi-squared)\u003cbr/\u003e- Experience with scripting language (e.g., Python, Java, or R)","business_category":"finance","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"About the Organization: Amazon is a US-based multinational electronic commerce company headquartered in Seattle, Washington. Amazon.com started as an online bookstore, but soon diversified into many other categories, with a vision to be earth's most customer-centric company \u0026 to build a place where people can come to find and discover anything they might want to buy online. \u003cbr/\u003e\u003cbr/\u003eAbout the role: Amazon's Finance Operations, Accounting \u0026 Analysis (FOAA) team is a fast-paced, team-focused, dynamic environment and delivering great experiences for our customers is top priority. FOAA is seeking a Business Intelligence Engineer to support our Amazon Music team.\u003cbr/\u003eAs an Amazon Business Intelligence Engineer you will be working in one of the world's largest and most complex data warehouse environments. You should have deep experience in the design, creation, management, and business use of large datasets. You should have excellent business and communication skills to be able to work with business owners to develop and define key business questions, and to build data sets that answer those questions. You should be good at designing, implementing, and operating stable, scalable, low cost solutions to flow data from production systems into the data warehouse and into end-user facing applications. You should be able to work with business customers in understanding the business requirements and implementing reporting solutions. \u003cbr/\u003eThe person will need to effectively communicate across all levels and be self-motivated to raise the bar on deriving insights from analytics and identify opportunities to delight the customers. Above all you should be passionate about bringing large datasets together to answer business questions and drive change.\u003cbr/\u003e \u003cbr/\u003eThis person will own the production and delivery of suite of analytics reports and dashboards used by the organization to make key business decisions. This will involve: \u003cbr/\u003e1) Delivery of standardized performance metrics for global customers and stakeholders providing operational bandwidth to Amazon music teams to focus on business partnering initiatives. \u003cbr/\u003e2) Partner with existing BI leader in executing defined roadmap of projects. \u003cbr/\u003e3) Provide ad-hoc support to Amazon music finance and business services for SQL report creation, modification and optimization. \u003cbr/\u003e4) Debug report issues, unblock workflows and communicate with other teams and stakeholders by providing regular status updates.\u003cbr/\u003e\u003cbr/\u003eTools used include: \u003cbr/\u003e1. SQL (Oracle and Redshift) \u003cbr/\u003e2. ETL tools (internal) \u003cbr/\u003e3. Excel \u003cbr/\u003e4. Tableau \u003cbr/\u003e5. Report scheduling tools (internal) ","department_cost_center":null,"description_short":"About the Organization: Amazon is a US-based multinational electronic commerce company headquartered in Seattle, Washington. Amazon.com started as an online bookstore, but soon diversified into many other","display_distance":null,"id":"34f971a1-0aaf-41d9-9e87-d2c86665c523","id_icims":"3167227","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Business Intel Engineer","job_function_id":null,"job_path":"/en/jobs/3167227/business-intelligence-engineer-bie-foaa","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR13\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"January 27, 2026","preferred_qualifications":"- Master's degree, or Advanced technical degree\u003cbr/\u003e- Knowledge of data modeling and data pipeline design\u003cbr/\u003e- Experience with statistical analysis, co-relation analysis\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-accounting","source_system":"JobCreator","state":"KA","title":"Business Intelligence Engineer (BIE), FOAA","university_job":null,"updated_time":"27 minutes","url_next_step":"https://account.amazon.com/jobs/3167227/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-accounting","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in a quantitative/technical field such as computer science, engineering, statistics\u003cbr/\u003e- Experience with SQL","business_category":"operations","city":"Mumbai","company_name":"ASSPL - Maharashtra - C32","country_code":"IND","description":"About the Company Amazon, a global leader in e-commerce and technology, is seeking a detail-oriented Transportation Representative Associate to join our dynamic logistics team.\u003cbr/\u003eJob Summary The Transportation Representative Associate serves as the crucial liaison between Amazon, SWA Shippers, stations, and delivery partners. This role is responsible for coordinating shipment operations, managing stakeholder communications, and ensuring efficient delivery execution while maintaining service excellence.\u003cbr/\u003e\u003cbr/\u003eDaily Operations\u003cbr/\u003e•\tMonitor real-time tracking IDs for pending deliveries\u003cbr/\u003e•\tCoordinate with stations for shipment rescue operations\u003cbr/\u003e•\tCollect and communicate station feedback to shippers\u003cbr/\u003e•\tProcess shipper requests for specific tracking IDs\u003cbr/\u003e•\tGenerate and share performance reports\u003cbr/\u003e•\tHandle time-sensitive escalations\u003cbr/\u003e\u003cbr/\u003eRequired Qualifications\u003cbr/\u003e•\tExcellent communication skills, both written and verbal\u003cbr/\u003e•\tStrong time-management and organizational abilities\u003cbr/\u003e•\tAnalytical mindset with problem-solving capabilities\u003cbr/\u003e•\tProficiency in Microsoft Office Suite\u003cbr/\u003e•\tAbility to work in a fast-paced environment\u003cbr/\u003e•\tStrong attention to detail\u003cbr/\u003ePreferred Qualifications\u003cbr/\u003e•\tPrevious experience in logistics or transportation\u003cbr/\u003e•\tBackground in customer service or stakeholder management\u003cbr/\u003e•\tExperience with shipping/tracking systems\u003cbr/\u003e•\tKnowledge of supply chain operations\u003cbr/\u003e\u003cbr/\u003eSkills \u0026 Competencies\u003cbr/\u003e•\tProfessional communication\u003cbr/\u003e•\tStakeholder management\u003cbr/\u003e•\tProblem-solving\u003cbr/\u003e•\tTime management\u003cbr/\u003e•\tData analysis\u003cbr/\u003e•\tProcess improvement\u003cbr/\u003e•\tMulti-tasking\u003cbr/\u003e•\tEscalation management\u003cbr/\u003e\u003cbr/\u003eWork Environment\u003cbr/\u003e•\tFast-paced, dynamic logistics environment\u003cbr/\u003e•\tMay require flexible working hours\u003cbr/\u003e•\tTeam-oriented atmosphere\u003cbr/\u003eInterested candidates should demonstrate a strong commitment to operational excellence and possess the ability to thrive in a metrics-driven environment while maintaining strong relationships with multiple stakeholders.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey Responsibilities\u003cbr/\u003e•\tMonitor and enhance delivery performance through active coordination with stations and shippers\u003cbr/\u003e•\tManage real-time tracking of pending deliveries and implement rescue operations as needed\u003cbr/\u003e•\tExecute standard operational tasks based on shipper requests following established SOPs\u003cbr/\u003e•\tFacilitate clear communication channels between multiple stakeholders\u003cbr/\u003e•\tGenerate and distribute regular performance reports\u003cbr/\u003e•\tHandle escalations through appropriate channels\u003cbr/\u003e•\tIdentify trends and propose process improvements\u003cbr/\u003e•\tMaintain performance metrics at or above target levels","department_cost_center":null,"description_short":"About the Company Amazon, a global leader in e-commerce and technology, is seeking a detail-oriented Transportation Representative Associate to join our dynamic logistics team.Job Summary The Transportation","display_distance":null,"id":"a46283cb-69d0-4b18-b942-75862ecbbb12","id_icims":"3145454","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3145454/transportation-specialist-i-swa","job_schedule_type":"full-time","location":"IN, MH, Mumbai","locations":["{\"normalizedStateName\":\"Maharashtra\",\"normalizedCountryCode\":\"IND\",\"city\":\"Mumbai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, MH, Mumbai\",\"coordinates\":\"18.94018,72.83484\",\"normalizedCountyName\":\"Mumbai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Mumbai, Maharashtra, IND\",\"location\":\"IN, MH, Mumbai\",\"region\":\"MH\",\"buildingCodeList\":[\"BOM14\"],\"normalizedCityName\":\"Mumbai\"}"],"normalized_location":"Mumbai, Maharashtra, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"December 18, 2025","preferred_qualifications":"- Experience with Excel\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"operations.team-last-mile-org","source_system":"JobCreator","state":"MH","title":"Transportation Specialist I, SWA","university_job":null,"updated_time":"31 minutes","url_next_step":"https://account.amazon.com/jobs/3145454/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-org","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Must be 18 years of age or older\u003cbr/\u003e- Education Requirements (must meet one):\u003cbr/\u003e- o Currently enrolled in Bachelor's degree or above in Computer Science, Computer Engineering, Data Science, Information Systems, or related STEM fields [degrees can be updated based on regional variations]\u003cbr/\u003e- o Completed Bachelor's or Graduate degree in specified fields\u003cbr/\u003e- Expected graduation between October 2026 - September 2029\u003cbr/\u003e- Demonstrated experience with at least one general-purpose programming language such as Java, Python, C++, C#, Go, Rust, or TypeScript","business_category":"studentprograms","city":"Cambridge","company_name":"Evi Technologies Limited","country_code":"GBR","description":"Do you want to solve real customer problems through innovative technology? Do you enjoy working on scalable services in a collaborative team environment? Do you want to see your code directly impact millions of customers worldwide?\u003cbr/\u003eAt Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. Customer obsession is part of our company DNA, which has made us one of the world's most beloved brands.\u003cbr/\u003eOur Software Development Engineer (SDE) interns use modern technology to solve complex problems while seeing their work's impact first-hand. The challenges SDE interns solve at Amazon are meaningful and influence millions of customers, sellers, and products globally. We seek individuals passionate about creating new products, features, and services while managing ambiguity in an environment where development cycles are measured in weeks, not years. \u003cbr/\u003eAt Amazon, we believe in ownership at every level. As an SDE intern, you'll own the entire lifecycle of your code - from design through deployment and ongoing operations. This ownership mindset, combined with our commitment to operational excellence, ensures we deliver the highest quality solutions for our customers.\u003cbr/\u003eWe're looking for curious minds who think big and want to define tomorrow's technology. At Amazon, you'll grow into the high-impact engineer you know you can be, supported by a culture of learning and mentorship. Every day brings exciting new challenges and opportunities for personal growth.\u003cbr/\u003e\u003cbr/\u003eAmazon internships across all seasons are full-time positions, and interns should expect to work in office, Monday-Friday, up to 40 hours per week typically between 8am-5pm. Specific team norms around working hours will be communicated by your manager. Interns should not have conflicts such as classes or other employment during the Amazon work-day. Applicants should have a minimum of one quarter/semester/trimester remaining in their studies after their internship concludes.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tCollaborate and communicate effectively with experienced cross-disciplinary Amazonians to design, build, and operate innovative products and services that delight our customers, while participating in technical discussions to drive solutions forward.\u003cbr/\u003e•\tDesign and develop scalable solutions using cloud-native architectures and microservices in a large distributed computing environment.\u003cbr/\u003e•\tParticipate in code reviews and contribute to technical documentation.\u003cbr/\u003e•\tBuild and maintain resilient distributed systems that are scalable, fault-tolerant, and cost-effective.\u003cbr/\u003e•\tLeverage and contribute to the development of GenAI and AI-powered tools to enhance development productivity while staying current with emerging technologies. \u003cbr/\u003e•\tWrite clean, maintainable code following best practices and design patterns.\u003cbr/\u003e•\tWork in an agile environment practicing CI/CD principles while participating in operational responsibilities including on-call duties.\u003cbr/\u003e•\tDemonstrate operational excellence through monitoring, troubleshooting, and resolving production issues.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs an intern, you will be matched to a manager and a mentor and will have the opportunity to influence the evolution of Amazon technology and lead critical projects early in your career. \u003cbr/\u003e\u003cbr/\u003eThe team requires an internship duration of 3 to 6 months.\u003cbr/\u003e\u003cbr/\u003eIn addition to working on an impactful project, you will have the opportunity to engage with Amazonians for both personal and professional development, expand your network, and participate in activities with other interns throughout your internship. No matter the location of your internship, we give you the tools to own your project and learn in a real-world setting.\u003cbr/\u003e","department_cost_center":null,"description_short":"Do you want to solve real customer problems through innovative technology? Do you enjoy working on scalable services in a collaborative team environment? Do you want to see your code directly impact millions","display_distance":null,"id":"59d49929-a43f-4665-8b51-f31f67b04d66","id_icims":"3149786","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3149786/software-dev-intern-embedded-development-linux","job_schedule_type":"full-time","location":"GB, Cambridge","locations":["{\"normalizedStateName\":\"England\",\"normalizedCountryCode\":\"GBR\",\"city\":\"Cambridge\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, Cambridge\",\"coordinates\":\"52.20992,0.11161\",\"normalizedCountyName\":\"Cambridgeshire\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"Cambridge, England, GBR\",\"location\":\"GB, Cambridge\",\"region\":\"\",\"buildingCodeList\":[\"CBG12\"],\"normalizedCityName\":\"Cambridge\"}"],"normalized_location":"Cambridge, England, GBR","optional_search_labels":[],"posted_date":"December 29, 2025","preferred_qualifications":"- Previous technical internship(s) or demonstrated project experience\u003cbr/\u003e- Experience with one or more of the following:\u003cbr/\u003e- o AI tools for development productivity\u003cbr/\u003e- o Cloud platforms (preferably AWS)\u003cbr/\u003e- o Database systems (SQL and NoSQL)\u003cbr/\u003e- o Contributing to open-source projects\u003cbr/\u003e- o Version control systems\u003cbr/\u003e- o Debugging and troubleshooting complex systems\u003cbr/\u003e- Strong problem-solving and analytical skills\u003cbr/\u003e- Excellent written and verbal communication skills\u003cbr/\u003e- Demonstrated ability to learn and adapt to new technologies quickly\u003cbr/\u003e- Basic understanding of software development lifecycle (SDLC)\u003cbr/\u003e- Experience with Linux, System Integration, Networking, Operating Systems Kernels, Multi-threading, or Microprocessors and/or microcontrollers\u003cbr/\u003e- Experience with C, C++, Embedded Development, Firmware, Device Driver, Linux, ARM, Bare-Metal, or Kernel\u003cbr/\u003e- Experience with Linux: Firmware, Shell Scripting, Scripting Efficiency, or Linux, and C++.\u003cbr/\u003e- Experience with Networking: C, Firmware, Hardware, Memory Management, Computer Architecture, Computer Architecture, or Operating Systems\u003cbr/\u003e- Demonstrated experience one or more of the following:\u003cbr/\u003e- o Data structures implementation\u003cbr/\u003e- o Basic algorithm development\u003cbr/\u003e- o Object-oriented design principles\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"studentprograms.team-internships-for-students","source_system":"JobCreator","state":null,"title":"Software Dev Intern - Embedded Development (Linux)","university_job":null,"updated_time":"34 minutes","url_next_step":"https://account.amazon.com/jobs/3149786/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-internships-for-students","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in a relevant field or equivalent work experience\u003cbr/\u003e- Demonstrated experience in effectively defining optimal data creation strategies and executing them\u003cbr/\u003e- 2+ years of experience in ML data operations, with a strong understanding of data annotation/ML workflows and concepts\u003cbr/\u003e- Outstanding customer communication and management skills, especially in technical consultation\u003cbr/\u003e- Ability to translate complex technical concepts into tactical applications","business_category":"amazon-artificial-general-intelligence","city":"Hyderabad","company_name":"ADCI HYD 16 SEZ","country_code":"IND","description":"As a Data Solutions Lead, you'll be the trusted advisor for our AGI-DS scientists, providing expert consultation on ML/Gen AI data collections and managing customer relationships. You'll drive business value through technical advisory and partnership building, creating and managing workstreams that delight our customers and deliver meaningful change for the models that back them.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eDrive and document effective ML/GenAI solutions for customer requests, transforming complex research objectives into clear, actionable data collection requirements\u003cbr/\u003eCoordinate across teams to ensure seamless delivery and stakeholder alignment\u003cbr/\u003eOwn relationships with customer scientists, becoming their go-to partner for ML data solutions\u003cbr/\u003eProvide consultation on ML workflow capabilities, helping customers maximize value\u003cbr/\u003eMonitor and optimize collection health metrics to ensure customer success\u003cbr/\u003eDrive customer adoption through providing technical value and the provision of an exemplary customer experience.\u003cbr/\u003e\u003cbr/\u003eYou'll also:\u003cbr/\u003eGuide customers on workflow feasibility and data collection best practices\u003cbr/\u003eCollaborate with implementation teams to define and validate technical requirements\u003cbr/\u003eEvaluate scalability of annotation scenarios and provide strategic recommendations\u003cbr/\u003eInfluence technical documentation and guidelines","department_cost_center":null,"description_short":"As a Data Solutions Lead, you'll be the trusted advisor for our AGI-DS scientists, providing expert consultation on ML/Gen AI data collections and managing customer relationships. You'll drive business","display_distance":null,"id":"86473a91-f092-4033-a77d-89eacbf31211","id_icims":"3168686","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Technical Account Management","job_function_id":null,"job_path":"/en/jobs/3168686/data-solutions-lead-data-collection-excellence","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD16\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":["alexa-and-amazon-devices.team-hardware-development-job-family"],"posted_date":"January 28, 2026","preferred_qualifications":"- Bachelor's degree in Computer Science, Business or a related field\u003cbr/\u003e- Experience in project management\u003cbr/\u003e- Working knowledge of JSON, Command Line, and Python\u003cbr/\u003e- Technical account management experience\u003cbr/\u003e- Background in customer success or solution consulting\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":"TS","title":"Data Solutions Lead, Data Collection Excellence","university_job":null,"updated_time":"36 minutes","url_next_step":"https://account.amazon.com/jobs/3168686/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}