{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"retail","city":"Chennai","company_name":"ADCI MAA 15 SEZ","country_code":"IND","description":"We are looking for passionate and talented software engineers who have experience building innovative, critical, high volume applications that customers love. This is a high visibility team where you will get a chance to make a positive impact on customer experience.\u003cbr/\u003e\u003cbr/\u003eThe Amazon Emerging Payments Tech Team’s vision is to delight our customers with the best payment experience in the world! To achieve this vision, we are in search of a talented technical engineer and craftsman who builds robust software that scales as well as client-facing features which are intuitive and simple to use.\u003cbr/\u003e\u003cbr/\u003eOur team takes a world view of payments for all of Amazon and builds highly customized and seamless payment experiences for our global customers. This focus on geography and customer requires working on different technologies \u0026 back-end systems in order to meet the needs of our customers. Our back-end systems are always available and guarantee that our customer’s orders are never lost and always processed even when downstream services are down.\u003cbr/\u003eOur team is highly motivated and in need of a engineer who can take the technical reigns of the team and steer them in the direction of our vision.\u003cbr/\u003eYou are a technical leader and craftsman with a proven track record of successful delivery. You are someone who will enjoy the challenge of working on complex and highly disparate technologies – from front-end Android development to back-end highly distributed systems. You are security-conscious and continually analyze software for potential threats to safeguard customer trust. You are interested in a high growth career opportunity and enjoy building software that brings smiles to our customers\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e· Work with the team to help solve business problems.\u003cbr/\u003e· Design, implement, test, deploy and maintain innovative software solutions to transform service performance, durability, cost, and security.\u003cbr/\u003e· Use software engineering best practices to ensure a high standard of quality for all of the team deliverables.\u003cbr/\u003e· Write high quality distributed system software.\u003cbr/\u003e· Work in an agile, startup-like development environment, where you are always working on the most important stuff.","department_cost_center":null,"description_short":"We are looking for passionate and talented software engineers who have experience building innovative, critical, high volume applications that customers love. This is a high visibility team where you will","display_distance":null,"id":"e067267d-ff8c-4ab4-92ad-b13ab59d9711","id_icims":"3141145","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3141145/software-development-engineer-amet-payments-amet-payments","job_schedule_type":"full-time","location":"IN, TN, Chennai","locations":["{\"normalizedStateName\":\"Tamil Nadu\",\"normalizedCountryCode\":\"IND\",\"city\":\"Chennai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TN, Chennai\",\"coordinates\":\"13.08404,80.28274\",\"normalizedCountyName\":\"Chennai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Chennai, Tamil Nadu, IND\",\"location\":\"IN, TN, Chennai\",\"region\":\"TN\",\"buildingCodeList\":[\"MAA15\"],\"normalizedCityName\":\"Chennai\"}"],"normalized_location":"Chennai, Tamil Nadu, IND","optional_search_labels":[],"posted_date":"December 11, 2025","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"retail.team-icb-in","source_system":"JobCreator","state":"TN","title":"Software Development Engineer, AMET Payments, AMET Payments","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3141145/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-icb-in","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"    5+ years of experience directly related to mission critical facilities or data center infrastructure, Bachelor’s degree in Mechanical/Electrical Engineering or relevant discipline preferred\u003cbr/\u003e    3+ years of commissioning experience\u003cbr/\u003e    Certification or training specific to NETA, ASHRAE, or Commissioning specific education courses\u003cbr/\u003e    Ability and willingness to travel domestic and internationally for approximately 50% of the time\u003cbr/\u003e    Required to provide personal transportation for meetings and job visits away from the office; reimbursed.","business_category":"aws","city":"Zaragoza","company_name":"Amazon Data Services Spain, S.L.","country_code":"ESP","description":"Amazon Web Services (AWS) provides a highly reliable, scalable, low-cost infrastructure platform in the cloud that powers hundreds of thousands of businesses in 190 countries around the world. To meet the growing demand for AWS cloud computing capacity in EMEA (Europe, Middle East and Africa) we are now looking for a Commissioning Engineer to join the team.\u003cbr/\u003e\u003cbr/\u003eAre you experienced in Critical Infrastructure Commissioning? As a Data Center Commissioning Engineer (CxE), you will be part of highly creative, efficient team tasked with tackling fascinating and challenging problems building and supporting the operations of AWS owned data centres, and Colocation facilities . The AWS Commissioning team (ACx) understands, evaluates, defines and manages the expectations of construction quality in accordance to engineering designs to meet the customer requirements. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eYou will be responsible for supporting vendors, contractors and other teams involved in the construction and commissioning of various systems such as:\u003cbr/\u003e\u003cbr/\u003e-Medium and low voltage power systems\u003cbr/\u003e-Generators\u003cbr/\u003e-UPS\u003cbr/\u003e-HVAC\u003cbr/\u003e-Chilled Water Systems\u003cbr/\u003e-Building Management systems (BMS)\u003cbr/\u003e-Electrical Power Monitoring Systems (EPMS)\u003cbr/\u003e-Testing and balancing\u003cbr/\u003e-Pumps and Hydronic systems\u003cbr/\u003e\u003cbr/\u003eThe CxE shall provide multi-discipline input into the scheduling, test script development, designing, and planning of projects. In addition, the CxE will be required to review component submittal packages, lead Factory Witness Testing (FWT), perform system level and integrated system testing. During commissioning, the CxE will continuously audit activities to ensure compliance with environmental, quality, and safety requirements. Additionally, the individual will be responsible for comprehensive weekly reporting of status of all ongoing projects and lessons learned to continually improve the quality of our program. This position will include coverage of multiple inflight projects.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services (AIS)\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eThe AWS Data Center Commissioning Team (ACx) is a wholly independent business within the DCGS organization. This team of veteran professional Electrical Engineers, Mechanical Engineers, Controls Engineers, Architectural Engineers, Project Managers, Operators and seasoned Amazonians are uniquely positioned to provide deeply detailed engineering and operational review and testing of equipment designs, operational functionality and construction practices. We are focused on ensuring the rapid delivery of a quality product while maintaining full transparency, recording metrics of manufacturer/contractor/equipment issues pre-PFHO, and identifying opportunities for all our peers and customers.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.","department_cost_center":null,"description_short":"Amazon Web Services (AWS) provides a highly reliable, scalable, low-cost infrastructure platform in the cloud that powers hundreds of thousands of businesses in 190 countries around the world. To meet","display_distance":null,"id":"c210bbab-0b18-4ae6-9e11-7a28d0c3403a","id_icims":"3080252","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Infrastructure Eng","job_function_id":null,"job_path":"/en/jobs/3080252/commissioning-engineer-commissioning","job_schedule_type":"full-time","location":"ES, Zaragoza","locations":["{\"normalizedStateName\":\"Aragon\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Zaragoza\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, Zaragoza\",\"coordinates\":\"41.65184,-0.8811\",\"normalizedCountyName\":\"Zaragoza\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Zaragoza, Aragon, ESP\",\"location\":\"ES, Zaragoza\",\"region\":\"\",\"buildingCodeList\":[\"ZAZ60\"],\"normalizedCityName\":\"Zaragoza\"}"],"normalized_location":"Zaragoza, Aragon, ESP","optional_search_labels":["aws.team-dcpd-optional","aws.team-dc"],"posted_date":"September 11, 2025","preferred_qualifications":"    Advanced knowledge Microsoft Office Suite - Word, Excel, Outlook required; advanced knowledge of SharePoint (or similar) preferred.\u003cbr/\u003e    Effective communication skills, detail oriented, highly organized, and able to work in high stress environments to maintain calm and respectful interaction with multiple teams\u003cbr/\u003e    Advance knowledge of mechanical, electrical, and controls systems for critical infrastructures\u003cbr/\u003e    Ability to read and edit construction documents (design drawings, control diagrams, specifications, etc.)\u003cbr/\u003e    Experience developing and executing test procedures for mechanical or electrical systems/components based on design intent and approved equipment submittals\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-support","source_system":"JobCreator","state":null,"title":"Commissioning Engineer, Commissioning","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3080252/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of business development, partnership management, or sourcing new business experience\u003cbr/\u003e- 3+ years of developing, negotiating and executing business agreements experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Experience with sales CRM tools such as Salesforce or similar software\u003cbr/\u003e- Experience in setting up and managing a sales pipeline","business_category":"operations","city":"Bengaluru","company_name":"ASSPL - Karnataka - B56","country_code":"IND","description":"As a part of IN Amazon Air Cargo (IN ACAR) team, the candidate will be responsible for leading business strategy, identifying new sources of business development (BSA, Charters, Door-to-Door solutions). The candidate will interact with internal (Air-haul, Legal, Finance, Compliance) and external stakeholders (Shippers, Carriers, Forwarders, Customers). Key activities include unlocking new international sectors for charter business, identifying new customers for Door-to-Door freight handling solutions, developing short and long term vision for IN ACAR by building narrative documents and aligning leadership, driving business and working within various time constraints to meet critical business needs.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will have :\u003cbr/\u003e\u003cbr/\u003e1. Strong sales and business development skills for a 0-to-1 business. \u003cbr/\u003e2. Keen understanding of the air cargo industry and its stakeholders\u003cbr/\u003e3. Ability to build relationships with key decision-makers\u003cbr/\u003e4. Can-do attitude and an ability to solve problems independently with limited guidance\u003cbr/\u003e\u003cbr/\u003eThis is an individual contributor role. If you are a highly motivated with a passion for the transportation industry, we encourage you to apply for this exciting opportunity. Individuals with prior experience in managing air freight solutions will be preferred.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eLead transportation planning basis requirements from 3P customers and work with relevant stakeholders to develop effective operational plan\u003cbr/\u003eSell air-haul services to all types of shippers in cargo industry such as freight forwarders, GSAs, airlines.\u003cbr/\u003eContinual, tactical communication with external customers (Vendors, Carrier) and internal customers (Operations, Finance, Legal, FinOps)\u003cbr/\u003eTrack and report sales performance metrics at required cadence\u003cbr/\u003eGenerate leads and qualify prospects, conduct sales presentations and close deals, build relationships with key decision-makers at enterprise shippers\u003cbr/\u003eWork within various time constraints to meet critical business needs, while measuring and identifying activities performed and ensuring service requirements are met.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eIN ACAR is an entrepreneurial business where we externalize Amazon air-haul services on dedicated aircraft to 3P shippers. We aim to become a trusted, innovative and established air-haul service partner in India, built on Amazon’s world-class logistics network, delivery experience and customer service. We partner with retailers of all sizes to bring speed and reliability to their operations and unlock more sales.","department_cost_center":null,"description_short":"As a part of IN Amazon Air Cargo (IN ACAR) team, the candidate will be responsible for leading business strategy, identifying new sources of business development (BSA, Charters, Door-to-Door solutions).","display_distance":null,"id":"4caf6f02-a7a5-4e3b-bae8-bc5e5e974811","id_icims":"3163152","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Business/Merchant Development","job_function_id":null,"job_path":"/en/jobs/3163152/business-development-manager-amazon-air-cargo-india","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"PNNT\",\"TBL5\",\"BLR23\",\"TBI4\",\"BLR37\",\"BLR2\",\"TBA5\",\"UBL94\",\"KSZ6\",\"TBC4\",\"TBK1\",\"UBEB\",\"UBLH\",\"PNB8\",\"KSRF\",\"PBLC\",\"PMMZ\",\"TBI6\",\"TBQ1\",\"TBA7\",\"TBL3\",\"BLR264\",\"BLR21\",\"PMYH\",\"TBU8\",\"PBLL\",\"UBL4\",\"TBT4\",\"HBB93\",\"TBF3\",\"UBL92\",\"UBRH\",\"HKR5\",\"TBH2\",\"TBA9\",\"PBLJ\",\"TBH9\",\"TBQ5\",\"PMOJ\",\"BLR56\",\"UBLF\",\"KSRH\",\"HBRA\",\"TBI2\",\"TBF7\",\"SBLY\",\"PMQG\",\"TBF1\",\"TBI8\",\"BLX6\",\"PKHU\",\"HKR3\",\"UMYH\",\"IRDS\",\"PMYL\",\"TBN6\",\"IPCU\",\"TBU6\",\"PMYF\",\"HBL8\",\"PNB6\",\"TBC2\",\"BLR18\",\"TBL1\",\"PNBE\",\"TBJ8\",\"BLR252\",\"TBL7\",\"TBA3\",\"TBU1\",\"IRDF\",\"TBK7\",\"BLT5\",\"TBH6\",\"TBM4\",\"PNB3\",\"LBL1\",\"PNJ1\",\"UMYI\",\"PMQC\",\"IRXG\",\"TBH7\",\"BLR14\",\"IRDE\",\"TBT9\",\"TBJ1\",\"LKA2\",\"PNSJ\",\"PMMW\",\"PISK\",\"TBK5\",\"BLR13\",\"PMYK\",\"TBH8\",\"TBU2\",\"PMQA\",\"PBL2\",\"TBF9\",\"TBC9\",\"UMYJ\",\"KERO\",\"IPCV\",\"TBI7\",\"UBRN\",\"TBI1\",\"TBN4\",\"HKR4\",\"HBL9\",\"BLR39\",\"TBA4\",\"TBJ6\",\"UBRM\",\"TBN5\",\"PICL\",\"TBS8\",\"PMYJ\",\"PNBG\",\"BLR1\",\"TBF8\",\"PMQB\",\"PNBS\",\"PBA2\",\"TBH1\",\"UBL91\",\"TBV1\",\"TBF2\",\"TBQ3\",\"KSRG\",\"PMOI\",\"TBK6\",\"TBT8\",\"PNBY\",\"BLR260\",\"TBA6\",\"TBC3\",\"BLR22\",\"TBF4\",\"TBJ9\",\"PMYG\",\"TBQ2\",\"TBI5\",\"UBEC\",\"TBU7\",\"BLR253\",\"PNBD\",\"TBC1\",\"TBI3\",\"TBQ4\",\"TBL6\",\"TBK2\",\"PMOK\",\"TBJ7\",\"KSZ5\",\"UBL1\",\"TBU5\",\"TBF6\",\"BLR38\",\"TBH3\",\"BLR34\",\"PBLD\",\"PMQL\",\"TBM1\",\"WBLA\",\"BNG91\",\"PMMR\",\"TBV2\",\"TBK4\",\"KSRI\",\"MBL1\",\"IPCI\",\"UBRO\",\"PNNU\",\"PMYI\",\"TBU3\",\"PNB9\",\"BLR255\",\"TBC5\",\"TBJ5\",\"TBU9\",\"BLR12\",\"TBL4\",\"BLR31\",\"TBM3\",\"TBN7\",\"LKA1\",\"TBJ2\",\"UBO8\",\"UBL40\",\"SBLU\",\"HNR1\",\"HKR1\",\"TBC8\",\"PNBK\",\"PMNZ\",\"HKA2\",\"TBA1\",\"TBJ3\",\"TBJ4\",\"TBK8\",\"BLR27\",\"PMML\",\"KJM45\",\"TBA2\",\"TBI9\",\"TBH5\",\"HKR2\",\"PNO2\",\"UMYG\",\"QRRA\",\"TBL2\",\"TBP1\",\"YAM91\",\"BLR254\",\"BLR26\",\"TBC6\",\"BLRS\",\"IRDN\",\"TBL8\",\"UMYF\",\"HBE4\",\"BLR11\",\"UMYL\",\"TBH4\",\"TBL9\",\"PNB7\",\"TBA8\",\"TBU4\",\"BLR55\",\"TBF5\",\"TBQ6\",\"PBLB\",\"PBLH\",\"TBK3\",\"TBM2\",\"TBK9\",\"BNG92\",\"UBLG\",\"HKA3\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"January 21, 2026","preferred_qualifications":"- Experience interpreting data and making business recommendations\u003cbr/\u003e- Experience in online advertising or high-tech products/services\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"operations.team-last-mile-org","source_system":"JobCreator","state":"KA","title":"Business Development Manager, Amazon Air Cargo, India","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3163152/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-org","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of professional or military experience\u003cbr/\u003e- Experience structuring and negotiating complex agreements and leading cross-functional groups to orchestrate and successfully complete deals\u003cbr/\u003e- Experience with sales CRM tools such as Salesforce or similar software","business_category":"operations","city":"Bengaluru","company_name":"ASSPL - Karnataka - B56","country_code":"IND","description":"As a part of IN Amazon Air Cargo (IN ACAR) team, the candidate will be responsible for leading business strategy, identifying new sources of business development (BSA, Charters, Door-to-Door solutions). The candidate will interact with internal (Air-haul, Legal, Finance, Compliance) and external stakeholders (Shippers, Carriers, Forwarders, Customers). Key activities include unlocking new international sectors for charter business, identifying new customers for Door-to-Door freight handling solutions, developing short and long term vision for IN ACAR by building narrative documents and aligning leadership, driving business and working within various time constraints to meet critical business needs.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will have :\u003cbr/\u003e\u003cbr/\u003e1. Strong sales and business development skills for a 0-to-1 business. \u003cbr/\u003e2. Keen understanding of the air cargo industry and its stakeholders\u003cbr/\u003e3. Ability to build relationships with key decision-makers\u003cbr/\u003e4. Can-do attitude and an ability to solve problems independently with limited guidance\u003cbr/\u003e\u003cbr/\u003eThis is an individual contributor role. If you are a highly motivated with a passion for the transportation industry, we encourage you to apply for this exciting opportunity. Individuals with prior experience in managing air freight solutions will be preferred.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eLead transportation planning basis requirements from 3P customers and work with relevant stakeholders to develop effective operational plan\u003cbr/\u003eSell air-haul services to all types of shippers in cargo industry such as freight forwarders, GSAs, airlines.\u003cbr/\u003eContinual, tactical communication with external customers (Vendors, Carrier) and internal customers (Operations, Finance, Legal, FinOps)\u003cbr/\u003eTrack and report sales performance metrics at required cadence\u003cbr/\u003eGenerate leads and qualify prospects, conduct sales presentations and close deals, build relationships with key decision-makers at enterprise shippers\u003cbr/\u003eWork within various time constraints to meet critical business needs, while measuring and identifying activities performed and ensuring service requirements are met.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eIN ACAR is an entrepreneurial business where we externalize Amazon air-haul services on dedicated aircraft to 3P shippers. We aim to become a trusted, innovative and established air-haul service partner in India, built on Amazon’s world-class logistics network, delivery experience and customer service. We partner with retailers of all sizes to bring speed and reliability to their operations and unlock more sales.","department_cost_center":null,"description_short":"As a part of IN Amazon Air Cargo (IN ACAR) team, the candidate will be responsible for leading business strategy, identifying new sources of business development (BSA, Charters, Door-to-Door solutions).","display_distance":null,"id":"2ddcf71c-54a1-42d0-ad8b-d3c90e526826","id_icims":"3167408","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Business/Merchant Development","job_function_id":null,"job_path":"/en/jobs/3167408/sr-business-development-manager-amazon-air-cargo-india","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"PNNT\",\"TBL5\",\"BLR23\",\"TBI4\",\"BLR37\",\"BLR2\",\"TBA5\",\"UBL94\",\"KSZ6\",\"TBC4\",\"TBK1\",\"UBEB\",\"UBLH\",\"PNB8\",\"KSRF\",\"PBLC\",\"PMMZ\",\"TBI6\",\"TBQ1\",\"TBA7\",\"TBL3\",\"BLR264\",\"BLR21\",\"PMYH\",\"TBU8\",\"PBLL\",\"UBL4\",\"TBT4\",\"HBB93\",\"TBF3\",\"UBL92\",\"UBRH\",\"HKR5\",\"TBH2\",\"TBA9\",\"PBLJ\",\"TBH9\",\"TBQ5\",\"PMOJ\",\"BLR56\",\"UBLF\",\"KSRH\",\"HBRA\",\"TBI2\",\"TBF7\",\"SBLY\",\"PMQG\",\"TBF1\",\"TBI8\",\"BLX6\",\"PKHU\",\"HKR3\",\"UMYH\",\"IRDS\",\"PMYL\",\"TBN6\",\"IPCU\",\"TBU6\",\"PMYF\",\"HBL8\",\"PNB6\",\"TBC2\",\"BLR18\",\"TBL1\",\"PNBE\",\"TBJ8\",\"BLR252\",\"TBL7\",\"TBA3\",\"TBU1\",\"IRDF\",\"TBK7\",\"BLT5\",\"TBH6\",\"TBM4\",\"PNB3\",\"LBL1\",\"PNJ1\",\"UMYI\",\"PMQC\",\"IRXG\",\"TBH7\",\"BLR14\",\"IRDE\",\"TBT9\",\"TBJ1\",\"LKA2\",\"PNSJ\",\"PMMW\",\"PISK\",\"TBK5\",\"BLR13\",\"PMYK\",\"TBH8\",\"TBU2\",\"PMQA\",\"PBL2\",\"TBF9\",\"TBC9\",\"UMYJ\",\"KERO\",\"IPCV\",\"TBI7\",\"UBRN\",\"TBI1\",\"TBN4\",\"HKR4\",\"HBL9\",\"BLR39\",\"TBA4\",\"TBJ6\",\"UBRM\",\"TBN5\",\"PICL\",\"TBS8\",\"PMYJ\",\"PNBG\",\"BLR1\",\"TBF8\",\"PMQB\",\"PNBS\",\"PBA2\",\"TBH1\",\"UBL91\",\"TBV1\",\"TBF2\",\"TBQ3\",\"KSRG\",\"PMOI\",\"TBK6\",\"TBT8\",\"PNBY\",\"BLR260\",\"TBA6\",\"TBC3\",\"BLR22\",\"TBF4\",\"TBJ9\",\"PMYG\",\"TBQ2\",\"TBI5\",\"UBEC\",\"TBU7\",\"BLR253\",\"PNBD\",\"TBC1\",\"TBI3\",\"TBQ4\",\"TBL6\",\"TBK2\",\"PMOK\",\"TBJ7\",\"KSZ5\",\"UBL1\",\"TBU5\",\"TBF6\",\"BLR38\",\"TBH3\",\"BLR34\",\"PBLD\",\"PMQL\",\"TBM1\",\"WBLA\",\"BNG91\",\"PMMR\",\"TBV2\",\"TBK4\",\"KSRI\",\"MBL1\",\"IPCI\",\"UBRO\",\"PNNU\",\"PMYI\",\"TBU3\",\"PNB9\",\"BLR255\",\"TBC5\",\"TBJ5\",\"TBU9\",\"BLR12\",\"TBL4\",\"BLR31\",\"TBM3\",\"TBN7\",\"LKA1\",\"TBJ2\",\"UBO8\",\"UBL40\",\"SBLU\",\"HNR1\",\"HKR1\",\"TBC8\",\"PNBK\",\"PMNZ\",\"HKA2\",\"TBA1\",\"TBJ3\",\"TBJ4\",\"TBK8\",\"BLR27\",\"PMML\",\"KJM45\",\"TBA2\",\"TBI9\",\"TBH5\",\"HKR2\",\"PNO2\",\"UMYG\",\"QRRA\",\"TBL2\",\"TBP1\",\"YAM91\",\"BLR254\",\"BLR26\",\"TBC6\",\"BLRS\",\"IRDN\",\"TBL8\",\"UMYF\",\"HBE4\",\"BLR11\",\"UMYL\",\"TBH4\",\"TBL9\",\"PNB7\",\"TBA8\",\"TBU4\",\"BLR55\",\"TBF5\",\"TBQ6\",\"PBLB\",\"PBLH\",\"TBK3\",\"TBM2\",\"TBK9\",\"BNG92\",\"UBLG\",\"HKA3\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"January 27, 2026","preferred_qualifications":"- Experience influencing multiple stakeholders and leading cross functional teams across geographies and business units\u003cbr/\u003e- Experience working with technical and product stakeholders to define requirements, prioritize features, and influence product roadmaps\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"operations.team-last-mile-org","source_system":"JobCreator","state":"KA","title":"Sr. Business Development Manager, Amazon Air Cargo, India","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3167408/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-org","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- Experience in courier industry\u003cbr/\u003e- Experience in logistics\u003cbr/\u003e- Experience with Microsoft Office products and applications","business_category":"fulfillment-ops","city":"Dubai","company_name":"Q-Express Documents Transport","country_code":"ARE","description":"Role Overview: As a Direct Imports Logistics Coordinator, you will be responsible for managing and coordinating international shipments from origin to final delivery at Amazon Fulfillment Centers. This role requires strong attention to detail, excellent communication skills, and the ability to work in a fast-paced environment while maintaining high standards of operational excellence.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey Responsibilities: • Monitor and track Direct Imports shipments across all transportation legs (origin, port to port, destination, and final mile delivery) • Coordinate with multiple stakeholders including freight forwarders, customs brokers, trade compliance teams, and fulfillment centers • Identify and resolve shipment issues proactively to minimize delays and ensure customer commitments • Maintain and analyze key performance metrics for Direct Imports operations • Create and distribute regular reports on critical DI metrics to leadership • Implement process improvements to enhance operational efficiency • Ensure compliance with international shipping regulations and Amazon's standards","department_cost_center":null,"description_short":"Role Overview: As a Direct Imports Logistics Coordinator, you will be responsible for managing and coordinating international shipments from origin to final delivery at Amazon Fulfillment Centers. This","display_distance":null,"id":"e95c88eb-aedc-4c4e-81d1-f0e353e09e6d","id_icims":"3161929","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Administrative Support","job_function_id":null,"job_path":"/en/jobs/3161929/logistics-coordinator-direct-imports","job_schedule_type":"full-time","location":"AE, Dubai","locations":["{\"normalizedCountryCode\":\"ARE\",\"city\":\"Dubai\",\"countryIso3a\":\"ARE\",\"countryIso2a\":\"AE\",\"locationNonStemming\":\"United Arab Emirates, Dubai\",\"coordinates\":\"25.26951,55.30884\",\"normalizedCountyName\":\"Dubai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Arab Emirates\",\"normalizedLocation\":\"Dubai, ARE\",\"location\":\"AE, Dubai\",\"region\":\"\",\"buildingCodeList\":[\"DXB3\"],\"normalizedCityName\":\"Dubai\"}"],"normalized_location":"Dubai, ARE","optional_search_labels":[],"posted_date":"January 21, 2026","preferred_qualifications":"- Experience in an operational role\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-global-specialty-fulfillment","source_system":"JobCreator","state":null,"title":"Logistics Coordinator, Direct Imports","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3161929/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-specialty-fulfillment","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Ahmedabad","company_name":"ASSPL - Gujarat","country_code":"IND","description":" Summary: The Operations Manager has complete responsibility for End to end FC operations in her/his function along with a) Building level cost efficiencies at a Six sigma level deliverables b) Running Regional/National level key Initiatives c) ensuring Quality  and Building Health d) eam development and diverse employee engagement at FC interfacing with all support functions \u003cbr/\u003e \u003cbr/\u003e Responsibilities: \u003cbr/\u003e   - Ensure      a safe work environment for all associates\u003cbr/\u003e - Lead      and supervise a team of Area Managers, TL's as Direct reportees supported by PAs and Associates in Outbound      Operations\u003cbr/\u003e - Responsible      for the overall Safety, Quality, Productivity and Delivery performance of      Outbound Operations\u003cbr/\u003e - Strategic      planning and forecasting; appraise performance; resolve problems; and      address staffing needs \u003cbr/\u003e - Review      the work forecasts and determine productivity requirements to produce/deliver during the day to meet the overall building objectives. \u003cbr/\u003e- Ensuring Building heath and inventory metrics with best in class quality metrics \u003cbr/\u003e-Ensure BM rates and OP2 throughput deliverables \u003cbr/\u003e-Interfacing well with other OM's. Taking up cross functionally the adoption of best practices.\u003cbr/\u003e - Proactively      identify and lead process improvement initiatives\u003cbr/\u003e - Learn      and understand the system interventions for order processing. Apprise      teams down the line of new process implementation and control measures      required.\u003cbr/\u003e - Lead      ART (Annual Sale) events from capacity planning perspective and prepare Man, Material , Machine in its perspectives.\u003cbr/\u003e - Carryout      machine (resources) planning periodically and remove/reduce capacity      constraints if any in coordination with Resource planning and Finance teams.\u003cbr/\u003e- Ensure best practices in people management and accountable for FC's compliance, Connections and scorecards.\u003cbr/\u003e- Manage People and team development\u003cbr/\u003e- Understand Flex levers , take up new Amazon technicalities associated with the role's requirements and Amazon ERP systems.\u003cbr/\u003e- Create leaders and talent pipeline. Good stake holder management and project management skills\u003cbr/\u003e- Do cross functional and cross mile interfacing and take up for the best practices and initiatives \u003cbr/\u003eEducation requirements- Preferably and Engineer/MBA with an experience of 6-10 years +\u003cbr/\u003e    \u003cbr/\u003eAbout the team\u003cbr/\u003e\u003cbr/\u003eA team of Area Managers and Team Leads\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e Responsibilities: \u003cbr/\u003e   - Ensure      a safe work environment for all associates\u003cbr/\u003e - Lead      and supervise a team of Area Managers, TL's as Direct reportees supported by PAs and Associates in Outbound      Operations\u003cbr/\u003e - Responsible      for the overall Safety, Quality, Productivity and Delivery performance of      Outbound Operations\u003cbr/\u003e - Strategic      planning and forecasting; appraise performance; resolve problems; and      address staffing needs \u003cbr/\u003e - Review      the work forecasts and determine productivity requirements to produce/deliver during the day to meet the overall building objectives. \u003cbr/\u003e- Ensuring Building heath and inventory metrics with best in class quality metrics \u003cbr/\u003e-Ensure BM rates and OP2 throughput deliverables \u003cbr/\u003e-Interfacing well with other OM's. Taking up cross functionally the adoption of best practices.\u003cbr/\u003e - Proactively      identify and lead process improvement initiatives\u003cbr/\u003e - Learn      and understand the system interventions for order processing. Apprise      teams down the line of new process implementation and control measures      required.\u003cbr/\u003e - Lead      ART (Annual Sale) events from capacity planning perspective and prepare Man, Material , Machine in its perspectives.\u003cbr/\u003e - Carryout      machine (resources) planning periodically and remove/reduce capacity      constraints if any in coordination with Resource planning and Finance teams.\u003cbr/\u003e- Ensure best practices in people management and accountable for FC's compliance, Connections and scorecards.\u003cbr/\u003e- Manage People and team development\u003cbr/\u003e- Understand Flex levers , take up new Amazon technicalities associated with the role's requirements and Amazon ERP systems.\u003cbr/\u003e- Create leaders and talent pipeline. Good stake holder management and project management skills\u003cbr/\u003e- Do cross functional and cross mile interfacing and take up for the best practices and initiatives \u003cbr/\u003eEducation requirements- Preferably and Engineer/MBA with an experience of 6-10 years +\u003cbr/\u003e    \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout the team\u003cbr/\u003e\u003cbr/\u003eA team of Area Managers and Team Leads","department_cost_center":null,"description_short":" Summary: The Operations Manager has complete responsibility for End to end FC operations in her/his function along with a) Building level cost efficiencies at a Six sigma level deliverables b) Running","display_distance":null,"id":"bd4b7bd7-7987-4854-8bb4-9aed6176938e","id_icims":"3170384","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3170384/operations-manager-west-amd2","job_schedule_type":"full-time","location":"IN, GJ, Ahmedabad","locations":["{\"normalizedStateName\":\"Gujarat\",\"normalizedCountryCode\":\"IND\",\"city\":\"Ahmedabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, GJ, Ahmedabad\",\"coordinates\":\"23.02778,72.60032\",\"normalizedCountyName\":\"Ahmedabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Ahmedabad, Gujarat, IND\",\"location\":\"IN, GJ, Ahmedabad\",\"region\":\"GJ\",\"buildingCodeList\":[\"AMD2\"],\"normalizedCityName\":\"Ahmedabad\"}"],"normalized_location":"Ahmedabad, Gujarat, IND","optional_search_labels":["wwas"],"posted_date":"January 30, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-global-specialty-fulfillment","source_system":"JobCreator","state":"GJ","title":"Operations Manager, West-AMD2","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3170384/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-specialty-fulfillment","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent","business_category":"fulfillment-ops","city":"Bengaluru","company_name":"ASSPL - Karnataka","country_code":"IND","description":"At Amazon, we strive to be Earth’s most customer-centric company where people can find and discover anything they want to buy online. We hire the world’s brightest minds, offering them an environment in which they can relentlessly improve the experience for customers. Innovation and creativity are built into the DNA of the company and are encouraged at all levels of employment. Every day we solve complex technical and business problems with ingenuity and simplicity. We’re making history and the good news is we’ve only just begun \u003cbr/\u003eAmazon Operations is looking for a talented, innovative, hands-on and customer-obsessed Program Manager for managing Inbound Supply Chain charter. Candidate must be detail oriented, have superior verbal and written communication skills, strong organizational skills and should be able to juggle multiple tasks at once. Ideal candidate must exhibit strong analytical skills and have proficiency in following tools: Advanced Excel and SQL (optional). This job requires the candidate to constantly hit the ground running and ability to learn quickly.\u003cbr/\u003e\u003cbr/\u003eIn terms of Amazon Program Manager Role Guideline, the incumbent should display the following for this role:\u003cbr/\u003e1. Manage moderate-to-complex initiatives, deliver key solutions, significant improvements, new mechanisms, or deprecating processes that are no longer needed. These efforts require work with multiple teams in and/or across organizations.\u003cbr/\u003e2. Understanding the interdependencies of the business problems you help solve (e.g., aligned workflows, customer requirements, process limitations, legal or compliance requirements, program support, etc.) and influence team priorities through data-driven contributions.\u003cbr/\u003e3. Communicates ideas effectively, verbally and in writing, to a wide range of audiences including Senior Managers and Directors. Partner successfully with customers, stakeholders, and engineering teams.\u003cbr/\u003e4. Proactively identify risks and bring them to the attention of team and stakeholders with plans for mitigation before they become roadblocks\u003cbr/\u003e5. Judiciously add, refine, and remove procedures. Increase the productivity and effectiveness of the teams by applying project management best practices\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e-Manage inbound appointment experience for vendors and sellers including planning, scheduling and configurations. \u003cbr/\u003e-Identify levers for reducing inbound lead time and drive process changes across Inbound Supply chain.\u003cbr/\u003e-Work with key stake holders across various functions to define and launch a program.","department_cost_center":null,"description_short":"At Amazon, we strive to be Earth’s most customer-centric company where people can find and discover anything they want to buy online. We hire the world’s brightest minds, offering them an environment in","display_distance":null,"id":"b8cd9dec-719f-49ea-8cf1-b4b39a520def","id_icims":"3169328","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3169328/program-manager-inbound-supply-chain-inbound-supply-chain","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR37\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"January 29, 2026","preferred_qualifications":"- 2+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-global-specialty-fulfillment","source_system":"JobCreator","state":"KA","title":"Program Manager  - Inbound Supply Chain, Inbound Supply Chain","university_job":null,"updated_time":"24 minutes","url_next_step":"https://account.amazon.com/jobs/3169328/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-specialty-fulfillment","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- Work 40 hours/week, and overtime as required","business_category":"operations-team","city":"Alexandria","company_name":"Souq.com for E-Commerce LLC","country_code":"EGY","description":"Amazon.com strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online. By giving customers more of what they want - low prices, vast selection, and convenience - Amazon.com continues to grow and evolve as a world-class e-commerce platform. Amazon's evolution from Web site to e-commerce partner to development platform is driven by the spirit of innovation that is part of the company's DNA. The world's brightest technology minds come to Amazon.com to research and develop technology that improves the lives of shoppers and sellers around the world.\u003cbr/\u003e\u003cbr/\u003eAre you ready to champion outstanding customer service, Amazon style?\u003cbr/\u003e\u003cbr/\u003eAre you up for creating solutions and solving tomorrow’s problems today?\u003cbr/\u003e\u003cbr/\u003eThen we have an opportunity just for you!\u003cbr/\u003e\u003cbr/\u003eWe’re seeking a Channel Team Lead to join our dynamic Delivery Stations. Our teams stow deliveries, pick products, package them up and ship them out: each of these groups have played their part in taking us where we are today.\u003cbr/\u003e\u003cbr/\u003eIn these facilities we’re building the future of customer service, as we work towards becoming Earth’s most customer-centric company. This is your chance to make history with us.\u003cbr/\u003e\u003cbr/\u003e- You’ll need to safeguard your team’s safety, promoting Amazon’s Health and Safety standards,\u003cbr/\u003e- You’ll lead cross-functional teams, tasked with solving operational problems,\u003cbr/\u003e- You’ll uphold Amazon’s high standards of process quality,\u003cbr/\u003e- You’ll maintain inventory accuracy,\u003cbr/\u003e- You’ll strive to improve and streamline processes,\u003cbr/\u003e- You’ll actively share and promote best practices with your colleagues and network\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eCore responsibilities will include:\u003cbr/\u003e• Help to solve logistics and supply chain challenges through data analysis, innovation and process optimization \u003cbr/\u003ereate and cultivate a safe working environment by identifying safety opportunities across your work area\u003cbr/\u003e• Manage and train our Associates to help deliver the best service for our customers\u003cbr/\u003e• Ensure that customer orders are fulfilled in line with quality and safety guidelines\u003cbr/\u003e• Continuously provide critical shift related information to front line management and operators ","department_cost_center":null,"description_short":"Amazon.com strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online. By giving customers more of what they want - low prices, vast","display_distance":null,"id":"c9aceb60-328a-4c51-b9df-d9882d0849c3","id_icims":"3167476","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3167476/last-mile-operations-supervisor-eg-amzl","job_schedule_type":"full-time","location":"EG, Alexandria","locations":["{\"normalizedCountryCode\":\"EGY\",\"city\":\"Alexandria\",\"countryIso3a\":\"EGY\",\"countryIso2a\":\"EG\",\"locationNonStemming\":\"Egypt, Alexandria\",\"coordinates\":\"31.2105,29.91253\",\"normalizedCountyName\":\"Alexandria\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Egypt\",\"normalizedLocation\":\"Alexandria, EGY\",\"location\":\"EG, Alexandria\",\"region\":\"\",\"buildingCodeList\":[\"XAL5\",\"DEX5\",\"DEX9\",\"XAL4\",\"DXA2\",\"ALY40\",\"TNG3\",\"XAL3\",\"DXA5\",\"ALY2\"],\"normalizedCityName\":\"Alexandria\"}"],"normalized_location":"Alexandria, EGY","optional_search_labels":["ops.lander-mena"],"posted_date":"January 27, 2026","preferred_qualifications":"- 1+ years of Microsoft Office products and applications experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"operations-team.transportation-operations-management","source_system":"JobCreator","state":null,"title":"Last Mile Operations Supervisor, EG - AMZL","university_job":null,"updated_time":"24 minutes","url_next_step":"https://account.amazon.com/jobs/3167476/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"transportation-operations-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Must be a graduate in any stream\u003cbr/\u003e- Working knowledge of MS Office\u003cbr/\u003e- Strong written and verbal communication.\u003cbr/\u003e- Attention to detail \u0026 flexible to work in various workflows.\u003cbr/\u003e- Open to learn new tools and technologies.\u003cbr/\u003e- Willingness to work on repetitive work on day to day basis.","business_category":"alexa-and-amazon-devices","city":"Chennai","company_name":"ADCI MAA 15 SEZ","country_code":"IND","description":"A Content Associate is typically responsible for managing and validating digital content within FireTV catalog. Their primary responsibilities include verifying accuracy of the errors, removing duplicates, and classifying errors according to established Standard Operating Procedures to improve ML. The individual should exercise sound judgment and highlight observations about daily operations and tools with their supervisors. They are expected to adhere to standard operation procedure and maintain high level of attention to detail, in order to ensure the best possible customer experience on FireTV devices.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Content Management: Maintain and update the digital content catalog to ensure accuracy and relevance.\u003cbr/\u003e- Data Entry \u0026 Reporting: Input and manage metadata for various content types, ensuring consistency and adherence to standards. Keep a track on all the activities performed for the day.\u003cbr/\u003e- Collaboration: Work within team and take ownership in various activities. Actively participate in calibration, team hurdles and share suggestions.\u003cbr/\u003e- Problem identification: Give attention to the daily process and share the challenges with supervisors for improvement.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDigi-Flex primarily focuses on providing highest quality content experience for digital programs across the globe. We believe high-quality content and service will help us earn the trust and loyalty of customers.","department_cost_center":null,"description_short":"A Content Associate is typically responsible for managing and validating digital content within FireTV catalog. Their primary responsibilities include verifying accuracy of the errors, removing duplicates,","display_distance":null,"id":"efba327e-2880-4b2e-99eb-3ab684e997db","id_icims":"3162793","is_intern":null,"is_manager":null,"job_category":"Editorial, Writing, \u0026 Content Management","job_family":"Editorial","job_function_id":null,"job_path":"/en/jobs/3162793/digital-content-associate-firetv","job_schedule_type":"full-time","location":"IN, TN, Chennai","locations":["{\"normalizedStateName\":\"Tamil Nadu\",\"normalizedCountryCode\":\"IND\",\"city\":\"Chennai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TN, Chennai\",\"coordinates\":\"13.08404,80.28274\",\"normalizedCountyName\":\"Chennai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Chennai, Tamil Nadu, IND\",\"location\":\"IN, TN, Chennai\",\"region\":\"TN\",\"buildingCodeList\":[\"MAA15\"],\"normalizedCityName\":\"Chennai\"}"],"normalized_location":"Chennai, Tamil Nadu, IND","optional_search_labels":[],"posted_date":"January 20, 2026","preferred_qualifications":"- Highly passionate about Digital content specially Movies/Shows/Series.\u003cbr/\u003e- Active user of OTT platforms.\u003cbr/\u003e- Familiarity with global movies/TV shows sources like IMDb.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"alexa-and-amazon-devices.team-kindle-ereader","source_system":"JobCreator","state":"TN","title":"Digital Content Associate, FireTV","university_job":null,"updated_time":"30 minutes","url_next_step":"https://account.amazon.com/jobs/3162793/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-kindle-ereader","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Must be a graduate in any stream\u003cbr/\u003e- Working knowledge of MS Office\u003cbr/\u003e- Strong written and verbal communication.\u003cbr/\u003e- Attention to detail \u0026 flexible to work in various workflows.\u003cbr/\u003e- Open to learn new tools and technologies.\u003cbr/\u003e- Willingness to work on repetitive work on day to day basis.","business_category":"alexa-and-amazon-devices","city":"Chennai","company_name":"ADCI MAA 15 SEZ","country_code":"IND","description":"A Content Associate is typically responsible for managing and validating digital content within FireTV catalog. Their primary responsibilities include verifying accuracy of the errors, removing duplicates, and classifying errors according to established Standard Operating Procedures to improve ML. The individual should exercise sound judgment and highlight observations about daily operations and tools with their supervisors. They are expected to adhere to standard operation procedure and maintain high level of attention to detail, in order to ensure the best possible customer experience on FireTV devices.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Content Management: Maintain and update the digital content catalog to ensure accuracy and relevance.\u003cbr/\u003e- Data Entry \u0026 Reporting: Input and manage metadata for various content types, ensuring consistency and adherence to standards. Keep a track on all the activities performed for the day.\u003cbr/\u003e- Collaboration: Work within team and take ownership in various activities. Actively participate in calibration, team hurdles and share suggestions.\u003cbr/\u003e- Problem identification: Give attention to the daily process and share the challenges with supervisors for improvement.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDigi-Flex primarily focuses on providing highest quality content experience for digital programs across the globe. We believe high-quality content and service will help us earn the trust and loyalty of customers.","department_cost_center":null,"description_short":"A Content Associate is typically responsible for managing and validating digital content within FireTV catalog. Their primary responsibilities include verifying accuracy of the errors, removing duplicates,","display_distance":null,"id":"9f7d5a42-55cf-47db-920b-79c5628628fa","id_icims":"3163422","is_intern":null,"is_manager":null,"job_category":"Editorial, Writing, \u0026 Content Management","job_family":"Editorial","job_function_id":null,"job_path":"/en/jobs/3163422/digital-content-associate-firetv","job_schedule_type":"full-time","location":"IN, TN, Chennai","locations":["{\"normalizedStateName\":\"Tamil Nadu\",\"normalizedCountryCode\":\"IND\",\"city\":\"Chennai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TN, Chennai\",\"coordinates\":\"13.08404,80.28274\",\"normalizedCountyName\":\"Chennai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Chennai, Tamil Nadu, IND\",\"location\":\"IN, TN, Chennai\",\"region\":\"TN\",\"buildingCodeList\":[\"MAA15\"],\"normalizedCityName\":\"Chennai\"}"],"normalized_location":"Chennai, Tamil Nadu, IND","optional_search_labels":[],"posted_date":"January 21, 2026","preferred_qualifications":"- Highly passionate about Digital content specially Movies/Shows/Series.\u003cbr/\u003e- Active user of OTT platforms.\u003cbr/\u003e- Familiarity with global movies/TV shows sources like IMDb.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"alexa-and-amazon-devices.team-kindle-ereader","source_system":"JobCreator","state":"TN","title":"Digital Content Associate, FireTV","university_job":null,"updated_time":"30 minutes","url_next_step":"https://account.amazon.com/jobs/3163422/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-kindle-ereader","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}