{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Experience with network hardware: copper and optical fiber cabling, switches, routers\u003cbr/\u003e- 18+ months of experience in data center or critical environment or similar technical roles: Computer Hardware Repair, Infrastructure Cabling, Network Deployment, Data Center Operations\u003cbr/\u003e- 18+ months of experience with fiber handling and fiber installation processes","business_category":"aws","city":"Mesa","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Transform network infrastructure by joining our dynamic team! You'll be at the forefront of developing innovative solutions that drive network stability and scalability, using your technical expertise to create automated systems that power global technological advancement. \u003cbr/\u003e \u003cbr/\u003eNetwork Install Technicians will collaborate with cross-functional teams, troubleshoot complex technical scenarios, and implement strategic solutions that keep our network running seamlessly. Expect to engage in hands-on technical work that requires creativity, precision, and a passion for technological innovation. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Moving and implementing large enterprise equipment \u003cbr/\u003e\u003cbr/\u003e- Installing Fiber and Copper cabling and patching cabling between equipment \u003cbr/\u003e\u003cbr/\u003e- Ensuring proper safety and security standards are maintained during cabling and rack installation, \u003cbr/\u003e\u003cbr/\u003e- Following well established hardware installation procedures and break-fix activities \u003cbr/\u003e\u003cbr/\u003e- Safely using material handling tools and equipment \u003cbr/\u003e\u003cbr/\u003e- Traveling within and outside of the regional work area is required. \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e\u003cbr/\u003e- All physical requirements are expected with reasonable accommodations: \u003cbr/\u003e\u003cbr/\u003e- Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds \u003cbr/\u003e\u003cbr/\u003e- Ability to work in an environment that operates 24/7 with an ability to participate in primary responder rotation and provide after-hours support as needed \u003cbr/\u003e\u003cbr/\u003e- Working in cramped and/or elevated and/or noisy environments \u003cbr/\u003e\u003cbr/\u003e- Bending, lifting, stretching, reaching, standing and walking for up to 8+ hours a day \u003cbr/\u003e\u003cbr/\u003e- Ascending and descending ladders, stairs, and gangways safely and without limitation \u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Transform network infrastructure by joining our dynamic team! You'll be at the forefront of developing innovative solutions that drive network stability and scalability, using your technical expertise","display_distance":null,"id":"bff3181f-7a01-419a-b1df-f07cbaeeffc9","id_icims":"3153483","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3153483/network-installation-technician","job_schedule_type":"full-time","location":"US, AZ, Mesa","locations":["{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Mesa\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Mesa\",\"coordinates\":\"33.41704,-111.83146\",\"normalizedCountyName\":\"Maricopa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Mesa, Arizona, USA\",\"location\":\"US, AZ, Mesa\",\"region\":\"AZ\",\"buildingCodeList\":[\"PHX53\"],\"normalizedCityName\":\"Mesa\"}"],"normalized_location":"Mesa, Arizona, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"January  6, 2026","preferred_qualifications":"- Experience in a data center or other critical environment\u003cbr/\u003e- Bachelor's degree or equivalent professional or military experience in an IT-related field (e.g. computer science, network engineering, etc.)\u003cbr/\u003e- Certifications in a relevant field (CCENT, Network+, CCNA)\u003cbr/\u003e- Behavioral interviewing and hiring experience\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, AZ, Mesa - 30.00 - 54.00 USD hourly","primary_search_label":"aws.team-it-services","source_system":"JobCreator","state":"AZ","title":"Network Installation Technician ","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3153483/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-it-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"operations","city":"Mexico City","company_name":"Servicios Comerciales Amazon Mexico S. de R.L. de C.V.","country_code":"MEX","description":"We are seeking a highly skilled and motivated software engineer to join our team in the commercial real estate industry. In this role, you will work at a global scale to solve real-world challenges that will transform Amazon’s approach to Industrial Real Estate in ways we can’t even image yet. You will by applying tools in workflow automation, geospatial intelligence and mapping, and artificial intelligence. You will work closely with a team of experts to develop and implement innovative technology solutions that will revolutionize the way our stakeholders conduct business.\u003cbr/\u003e\u003cbr/\u003eThis is a fantastic opportunity for a strong software engineer looking to make a significant impact in the commercial real estate industry. You will have the chance to work on innovative technology solutions that will transform the way our clients do business. We offer competitive compensation, comprehensive benefits, and a dynamic work environment where you will be challenged and rewarded for your contributions. We invent every day. We are Global Realty Technologies and we will give you the tools and support you need to invent with us in ways that are rewarding, fulfilling and fun. If you are a strong developer with a passion for innovation, we encourage you to apply today.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e- Lead, mentor, challenge and grow other software engineers on the team\u003cbr/\u003e - Develop and implement software solutions that leverage workflow automation, geospatial intelligence and mapping, and artificial intelligence to improve our clients' business processes\u003cbr/\u003e - Collaborate with cross-functional teams to design, develop, and deploy innovative software solutions that meet our clients' needs\u003cbr/\u003e - Actively engage and participate in software architecture and design reviews\u003cbr/\u003e - Maintain and enhance existing software applications to ensure they meet the evolving needs of the business\u003cbr/\u003e - Write clean, efficient, and well-documented code that adheres to industry best practices\u003cbr/\u003e - Participate in code reviews and provide constructive feedback to peers\u003cbr/\u003e - Stay up-to-date with emerging technologies and industry trends to ensure our software solutions remain at the forefront of the industry\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eGlobal Realty Tech manages software tools to centralize data about what buildings Amazon launches. Since inception, these tools have grown to encompass Amazon's worldwide operations (outside physical stores): we now cover thousands of active new launches, retrofit, and lease-related projects. We create global standards for managing data related to these capital projects.\u003cbr/\u003e\u003cbr/\u003eInclusive team culture \u003cbr/\u003eAt Amazon we embrace our differences and we are committed to furthering our culture of inclusion. We host annual and ongoing learning experiences. Amazon’s culture of inclusion is reinforced within our Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust\u003cbr/\u003e\u003cbr/\u003eWork Life Balance \u003cbr/\u003eWe believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfillment. We offer flexibility in working hours and encourage you to find your own balance between your work and personal lives.\u003cbr/\u003e\u003cbr/\u003eMentorship\u0026 Career Growth \u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded professional. ","department_cost_center":null,"description_short":"We are seeking a highly skilled and motivated software engineer to join our team in the commercial real estate industry. In this role, you will work at a global scale to solve real-world challenges that","display_distance":null,"id":"55a91371-792f-4131-a652-d2a860531432","id_icims":"3125764","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3125764/software-development-engineer-global-realty-technology","job_schedule_type":"full-time","location":"MX, DIF, Mexico City","locations":["{\"normalizedStateName\":\"Mexico City\",\"normalizedCountryCode\":\"MEX\",\"city\":\"Mexico City\",\"countryIso3a\":\"MEX\",\"countryIso2a\":\"MX\",\"locationNonStemming\":\"Mexico, DIF, Mexico City\",\"coordinates\":\"19.43195,-99.13315\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Mexico\",\"normalizedLocation\":\"Mexico City, Mexico City, MEX\",\"location\":\"MX, DIF, Mexico City\",\"region\":\"DIF\",\"buildingCodeList\":[\"MEX16\"],\"normalizedCityName\":\"Mexico City\"}"],"normalized_location":"Mexico City, Mexico City, MEX","optional_search_labels":["fulfillment-operations.wwre-roles","mx-stores","mexico-sde"],"posted_date":"November 12, 2025","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"operations.team-technology","source_system":"JobCreator","state":"DIF","title":"Software Development Engineer, Global Realty Technology","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3125764/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-technology","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 7+ years of industrial maintenance experience\u003cbr/\u003e- 7+ years of leading organizations with 100 or more employees experience\u003cbr/\u003e- 7+ years of senior leadership development and talent management experience\u003cbr/\u003e- 10+ years of direct leadership/supervisory experience\u003cbr/\u003e- 7+ years of managing department spend and labor budgets, performing root cause analysis (RCA), and implementing continuous improvement (CI) experience\u003cbr/\u003e- 7+ years of managing, analyzing and communicating results to senior leadership experience\u003cbr/\u003e- Bachelor's Degree in Electrical Engineering, Mechanical Engineering, Engineering Technology, or Reliability Engineering, or 2+ years of Amazon RME (BB/3P) Full Time Exempt experience","business_category":"fulfillment-ops","city":"Irving","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon's North America Reliability Maintenance \u0026 Engineering (RME) team needs a dynamic Regional Maintenance Manager to lead our operations. This key position will drive safety initiatives and guide field teams in developing effective decision-making tools for site managers. You'll evaluate Fulfillment Center RME departments' performance and implement proven practices to improve reliability metrics. Your mission: champion workplace safety, maximize equipment uptime, and optimize operational costs in our fast-paced fulfillment network.\u003cbr/\u003eThe ideal candidate brings extensive expertise in facilities maintenance, workplace safety, and data-driven leadership. Experience with Material Handling Equipment (MHE) systems, packaging automation, distribution processes, and storage systems is valuable. We need a self-starter who excels at managing multiple complex projects while building strong relationships across all organizational levels. The role requires oversight of maintenance acceptance for large-scale projects and the ability to provide technical leadership to facilities maintenance teams.\u003cbr/\u003e\u003cbr/\u003eKey Responsibilities\u003cbr/\u003e•\tChampion safety standards and drive team compliance\u003cbr/\u003e•\tLead and mentor field-based Facilities Managers to expand and improve Amazon's North American Fulfillment Network\u003cbr/\u003e•\tDrive maintenance excellence through innovation, documentation, standardization, and safety practices\u003cbr/\u003e•\tGuide senior leadership on maintenance and equipment end of life (EOL) decisions using ROI analysis\u003cbr/\u003e•\tOversee budget development, execution, and capital planning\u003cbr/\u003e•\tManage vendor relationships and maximize network economies of scale\u003cbr/\u003e•\tMonitor and audit maintenance execution and safety practices across sites\u003cbr/\u003e•\tCoordinate maintenance teams across North America\u003cbr/\u003e•\tDevelop and manage contract documents, including RFPs and purchase orders\u003cbr/\u003e•\tSupport Fulfillment Center General Managers in facilities management\u003cbr/\u003e•\tRecruit and hire exceptional talent for Facilities Maintenance roles\u003cbr/\u003e•\tBuild a world-class facilities maintenance organization\u003cbr/\u003e•\tRelocate as needed for Amazon's business needs\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon's North America Reliability Maintenance \u0026 Engineering (RME) team needs a dynamic Regional Maintenance Manager to lead our operations. This key position will drive safety initiatives and guide field","display_distance":null,"id":"995af28d-9936-4fb7-9d1d-d769910aca88","id_icims":"3170611","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3170611/sr-regional-rme-manager-ixd-rme","job_schedule_type":"full-time","location":"US, TX, Irving","locations":["{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Memphis\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Memphis\",\"coordinates\":\"35.14976,-90.04925\",\"normalizedCountyName\":\"Shelby\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Memphis, Tennessee, USA\",\"location\":\"US, TN, Memphis\",\"region\":\"TN\",\"buildingCodeList\":[\"VUED\",\"XSP1\",\"WFM480\",\"XME4\",\"MEM1\",\"DTN9\",\"LAJ2\",\"DNA4\",\"MEM400\",\"MEM5\",\"HME1\",\"MHG1\",\"KMEM\",\"MEM252\",\"DTN2\",\"DEM1\",\"VUVA\",\"XMEM\",\"DTN4\",\"XME1\",\"MEM4\",\"NQA400\",\"HME2\"],\"normalizedCityName\":\"Memphis\"}","{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Goodyear\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Goodyear\",\"coordinates\":\"33.4363,-112.35831\",\"normalizedCountyName\":\"Maricopa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Goodyear, Arizona, USA\",\"location\":\"US, AZ, Goodyear\",\"region\":\"AZ\",\"buildingCodeList\":[\"DPX6\",\"QXY4\",\"PHX5\",\"IUTE\",\"XTU1\",\"QZZ9\",\"AZA2\",\"XPH6\",\"GEU5\",\"GYR1\",\"GYR2\",\"FFZ72\"],\"normalizedCityName\":\"Goodyear\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Desert Hot Springs\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Desert Hot Springs\",\"coordinates\":\"33.96145,-116.51024\",\"normalizedCountyName\":\"Riverside\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Desert Hot Springs, California, USA\",\"location\":\"US, CA, Desert Hot Springs\",\"region\":\"CA\",\"buildingCodeList\":[\"DAX6\",\"PSP3\"],\"normalizedCityName\":\"Desert Hot Springs\"}","{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Phoenix\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Phoenix\",\"coordinates\":\"33.44825,-112.0758\",\"normalizedCountyName\":\"Maricopa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Phoenix, Arizona, USA\",\"location\":\"US, AZ, Phoenix\",\"region\":\"AZ\",\"buildingCodeList\":[\"PHX101\",\"CMKT6\",\"ZPX7\",\"PHX3\",\"LALT2\",\"FFZ61\",\"LPX4\",\"PHX102\",\"PHX60\",\"PHX801\",\"LALT3\",\"PCA1\",\"GYR3\",\"PHX30\",\"PPX1\",\"ONM217\",\"PHX250\",\"HPX2\",\"PHX402\",\"FFZ80\",\"DAZ2\",\"DPX5\",\"VXAZ\",\"PHX100\",\"PHX62\",\"KPHX1\",\"DPX2\",\"PHX73\",\"PHX68\",\"PHX54\",\"ONM113\",\"TFC1\",\"PHX052\",\"PHX55\",\"PHX251\",\"LPX5\",\"OSW9\",\"FFZ81\",\"VUKC\",\"FFZ71\",\"LALT7\",\"UAZ1\",\"PHX131\",\"ZPH1\",\"ONM103\",\"ZPX9\",\"ZPX3\",\"LALT4\",\"PHX20\",\"PHX51\",\"AZA5\",\"WFM788\",\"KRB3\",\"FFZ70\",\"PHX78\",\"HPX9\",\"VUDS\",\"WFM476\",\"AZA6\",\"DPX8\",\"ONM105\",\"WFM172\",\"MBE8\",\"TUS1\",\"DTU8\",\"XUSH\",\"ZPH2\",\"DTU6\",\"XPH2\",\"PHX6\",\"PHX40\",\"LPX1\",\"PHX7\",\"PHX120\",\"SDL1\",\"LALT6\",\"ADS63\",\"PHX41\",\"PHX72\",\"AZA4\",\"PHX50\",\"FFZ82\",\"LPVM\",\"ONM111\",\"PHX750\",\"PHX31\",\"SAZ1\",\"FFZ60\",\"GEU4\"],\"normalizedCityName\":\"Phoenix\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Irving\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Irving\",\"coordinates\":\"32.81352,-96.95532\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Irving, Texas, USA\",\"location\":\"US, TX, Irving\",\"region\":\"TX\",\"buildingCodeList\":[\"WFM627\",\"DFW30\",\"DFW8\",\"CDA1\",\"DFW16\",\"ELRS14\",\"DFW9\",\"DFW2\",\"SFW4\",\"DFW1\",\"LDA6\",\"ADZTX\",\"DFW20\",\"DFW90\",\"RBD5\",\"DFW52\"],\"normalizedCityName\":\"Irving\"}"],"normalized_location":"Irving, Texas, USA","optional_search_labels":[],"posted_date":"January 30, 2026","preferred_qualifications":"- Master's degree, or Six Sigma Black Belt certification\u003cbr/\u003e- Professional Engineering registration\u003cbr/\u003e- Knowledge of statistical analysis\u003cbr/\u003e- Experience leading multi-site maintenance organizations\u003cbr/\u003e- Experience maintaining material handling equipment and integrated systems\u003cbr/\u003e- Experience working with Material Handling Equipment (MHE) integrators\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, AZ, GOODYEAR - 157,100.00 - 212,600.00 USD annually\u003cbr/\u003eUSA, AZ, Goodyear - 157,100.00 - 212,600.00 USD annually\u003cbr/\u003eUSA, AZ, Phoenix - 157,100.00 - 212,600.00 USD annually\u003cbr/\u003eUSA, CA, Desert Hot Springs - 157,100.00 - 212,600.00 USD annually\u003cbr/\u003eUSA, TN, Memphis - 141,400.00 - 191,300.00 USD annually\u003cbr/\u003eUSA, TN, Memphis - 157,100.00 - 212,600.00 USD annually\u003cbr/\u003eUSA, TX, Irving - 157,100.00 - 212,600.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"TX","title":"Sr. Regional RME Manager, IXD RME","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3170611/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent work experience\u003cbr/\u003e- Experience with analog, digital, and high-speed circuit design\u003cbr/\u003e- 4+ years experience of PCB layout using industry standard PCB design suites.\u003cbr/\u003e- Experience with high current density designs.\u003cbr/\u003e- Experience managing multiple projects in parallel.","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon Leo will serve people and organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eAs a PCB Layout Engineer, you will participate in the definition and implementation of multiple spacecraft subsystems. This individual will contribute in all phases of system design and production. You must bring a combination of PCB design, assembly, test and fabrication knowledge, cross team functional interdependence, and demonstrable design process experience to the position. You will have the opportunity to work with multiple technical teams at Amazon in different locations. You should be comfortable with a high degree of ambiguity and relish the idea of solving problems that haven't been solved at scale before. Along the way, we guarantee that you will learn a lot, have fun and make a positive impact on millions of people.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement: Due to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eCreate the physical layout of a PCB from concept to fabrication using Cadence Allegro or Mentor Xpedition in a highly collaborative design environment.","department_cost_center":null,"description_short":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to","display_distance":null,"id":"b3dfdf4b-169d-437d-ae72-7fd1061948e6","id_icims":"3130982","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/3130982/pcb-layout-engineer-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS13\"],\"normalizedCityName\":\"Austin\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sunnyvale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Sunnyvale\",\"coordinates\":\"37.37188,-122.03751\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sunnyvale, California, USA\",\"location\":\"US, CA, Sunnyvale\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC10\"],\"normalizedCityName\":\"Sunnyvale\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA129\"],\"normalizedCityName\":\"Redmond\"}","{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK14\"],\"normalizedCityName\":\"New York\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Diego\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Diego\",\"coordinates\":\"32.71568,-117.16171\",\"normalizedCountyName\":\"San Diego\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Diego, California, USA\",\"location\":\"US, CA, San Diego\",\"region\":\"CA\",\"buildingCodeList\":[\"SAN13\"],\"normalizedCityName\":\"San Diego\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":["alexa-and-amazon-devices.team-hardware-development-job-family"],"posted_date":"November 21, 2025","preferred_qualifications":"- 7+ years of analog or RF layout design experience\u003cbr/\u003e- Experience in design for Aerospace Class 3\u003cbr/\u003e- Experience as a technical lead for small teams of PCB layout engineers.\u003cbr/\u003e- Experience with CAM350 and BluePrint\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, San Diego - 126,300.00 - 164,800.00 USD annually\u003cbr/\u003eUSA, CA, Sunnyvale - 134,900.00 - 185,000.00 USD annually\u003cbr/\u003eUSA, NY, New York - 129,100.00 - 185,000.00 USD annually\u003cbr/\u003eUSA, TX, Austin - 117,300.00 - 160,000.00 USD annually\u003cbr/\u003eUSA, WA, Redmond - 117,300.00 - 160,000.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"PCB Layout Engineer, Amazon Leo","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/3130982/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"• Bachelor’s degree in Mechanical Engineering, Electrical Engineering, Construction Management, or an equivalent engineering science or 12 years of relevant construction experience in lieu of a degree.\u003cbr/\u003e• 8+ years of experience in construction management of large, complex projects involving large-scale mechanical, electrical, and plumbing (MEP) plants.\u003cbr/\u003e• 6+ years of general contractor and vendor management experience (request for proposals, bidding, change orders, quality control, and RFI and submittal tracking) associated with construction and project execution.","business_category":"aws","city":"Canton","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe Data Center Construction Manager will be responsible for construction project management and oversight of construction related activities as they relate to new builds or general capital projects which includes the ownership of the project scope, quality, schedule, and budget.\u003cbr/\u003e\u003cbr/\u003eSome of the typical daily tasks of the Construction Manager:\u003cbr/\u003eDirect interface with construction general contractors during the bidding, award, execution, and project closeout/punch list phases.\u003cbr/\u003eConduct negotiations with general contractors and evaluate bids/proposals with detail and accuracy.\u003cbr/\u003eCreate construction project scope and request for proposals.\u003cbr/\u003eFinancial analysis of construction.\u003cbr/\u003eConstruction project management for specific initiatives aimed at increasing the resiliency of our data centers.\u003cbr/\u003eConstructability reviews of electrical and mechanical designs associated with the construction of new data centers or optimization of existing data centers.\u003cbr/\u003eConstruction document management including submittal review, RFI’s, change orders, and invoicing.\u003cbr/\u003eConstruction project quality control.\u003cbr/\u003eRecord and report key construction metrics to team members and management.\u003cbr/\u003eDrive teams to perform troubleshooting and root-cause failure analysis associated with equipment failures.\u003cbr/\u003eBe a leader within the group as well as within internal and external teams that support the data center.\u003cbr/\u003eAble to read and interpret construction specifications and drawings for all disciplines.\u003cbr/\u003eDefine data center system-level architecture, specify/document performance and equipment requirements, create/communicate conceptual designs, and create/maintain project documentation.\u003cbr/\u003eExperience with large scale technical operations or large-scale compute farms.\u003cbr/\u003eKnowledge of building codes and regulations including Life Safety, BOCA, NFPA, NEC, and OSHA.\u003cbr/\u003eExperience in controls and commissioning of large scale projects.\u003cbr/\u003eExperience with power management and power monitoring systems.\u003cbr/\u003eCertifications such as Professional Engineer (PE), LEED, and/or Certified Construction Manager (CCM)\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003e**Why AWS**\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003e*Diverse Experiences*\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003e*Work/Life Balance*\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003e*Inclusive Team Culture*\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003e*Mentorship and Career Growth*\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003e#DCCD_AMER ","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"da465aac-7edc-47f9-9099-a52c26db9ddb","id_icims":"2990295","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/2990295/construction-manager","job_schedule_type":"full-time","location":"US, MS, Canton","locations":["{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Canton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Canton\",\"coordinates\":\"32.61258,-90.03472\",\"normalizedCountyName\":\"Madison\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Canton, Mississippi, USA\",\"location\":\"US, MS, Canton\",\"region\":\"MS\",\"buildingCodeList\":[\"JAN100\"],\"normalizedCityName\":\"Canton\"}"],"normalized_location":"Canton, Mississippi, USA","optional_search_labels":["aws.team-ais"],"posted_date":"May 22, 2025","preferred_qualifications":"* Understand data center system-level architecture and electrical engineering principles, including switch gear, UPS, transformers, circuit breakers, breaker coordination studies, and switchgear sequence of operation.\u003cbr/\u003e* Understand data center system-level architecture and mechanical engineering principles for cooling systems. Able to read and interpret construction specifications and drawings for all disciplines.\u003cbr/\u003e* Able to value engineer, and find creative and innovative solutions to reduce costs and duration with no impact on quality and reliability. Experience with design or construction of data centers, critical infrastructure, or large-scale MEP plants. Experience with systems, controls, commissioning, power management, and technical operations of data centers critical infrastructure, or large-scale MEP plants.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MS, Canton - 100,200.00 - 167,500.00 USD annually","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"MS","title":"Construction Manager","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/2990295/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience working in a data center or mission critical facility (example: hospital, military facility, public safety facility, etc.)\u003cbr/\u003e- Experience in construction or project management\u003cbr/\u003e- 2+ years of construction or project management experience\u003cbr/\u003e- Bachelor's degree in Electrical Engineering, Mechanical Engineering, or a related field, or 3+ years of construction or project management experience\u003cbr/\u003e- Bachelor's degree in Mechanical or Electrical Engineering, or 2+ years of construction or project management experience\u003cbr/\u003e- Experience updating and managing construction data including milestone dates, requests for information (RFI), design changes, and change orders.","business_category":"aws","city":"Atlanta","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAs a Data Center Project Engineer, you will be a part of a creative, diverse team tasked with solving fascinating problems constructing Amazon Data Centers.  Our data centers are industry examples of energy efficient, cost-effective designs.  You will work alongside partner teams such as Operations, Networking, Controls, Security, and Commissioning to build Data Centers that directly support our Customers.  \u003cbr/\u003e\u003cbr/\u003eAs our Data Center Project Engineer, you will support the teams that build some of the most interesting electrical and mechanical systems in the world.  You will be on the construction site, daily interacting with the construction managers and stakeholders and be directly responsible for supporting the fast, high-quality delivery of our data center construction.  The Data Center Project Engineer will be part of the onsite Construction Management team and will own the communication coordination with our vendors, information workflow, and coordination of document management including requests for information (RFI), change orders, report, and schedule updates.\u003cbr/\u003e  \u003cbr/\u003eAt Amazon, we are all Owners and leverage unique opportunities presented to us by owning everything from the design review to construction bidding to construction execution and final hand-off to our customers. We are a diverse, upbeat, creative, team of engineers and managers working on a daily basis to develop innovative data centers for our Customers.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe Data Center Project Engineer will be responsible for:\u003cbr/\u003e - Establishing communication and coordination across a data center region’s general contractors, stakeholders, and internal teams.  Example includes sending out region wide changes to construction trailer setup, COVID-19 testing procedures, or location to access documents.\u003cbr/\u003e - Develop and maintain a tracking system for design changes, RFI’s (requests for information), and change orders and dashboard and track this information for regional leadership review.  Include tracking status of priority and due dates.\u003cbr/\u003e - Requesting and reviewing MOPs (Method of Procedure) for proper detail, necessity, and risk. \u003cbr/\u003e - On-boarding new vendors for badging and orientation.\u003cbr/\u003e - Updating project management software with milestone dates, correspondence, and documents.\u003cbr/\u003e - Monitor delivery of owner furnished material to site.\u003cbr/\u003e - Compiling and storing construction data from vendors.\u003cbr/\u003e - Managing checklist including various checklists including substantial completion checks, safety, and quality.\u003cbr/\u003e   \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003e**Why AWS**\u003cbr/\u003e Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003e*Diverse Experiences*\u003cbr/\u003e Amazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003e*Work/Life Balance*\u003cbr/\u003e We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003e*Inclusive Team Culture*\u003cbr/\u003e Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003e*Mentorship and Career Growth*\u003cbr/\u003e We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"977e8dfd-2879-4daa-a00a-a1ba3ab435e9","id_icims":"3140846","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3140846/project-engineer-data-center-construction","job_schedule_type":"full-time","location":"US, GA, Atlanta","locations":["{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Atlanta\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Atlanta\",\"coordinates\":\"33.74831,-84.39111\",\"normalizedCountyName\":\"Fulton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Atlanta, Georgia, USA\",\"location\":\"US, GA, Atlanta\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL11\"],\"normalizedCityName\":\"Atlanta\"}"],"normalized_location":"Atlanta, Georgia, USA","optional_search_labels":["aws.team-dc","aws.team-ais","aws.team-dcpd-optional"],"posted_date":"December 10, 2025","preferred_qualifications":"- Knowledge of electrical systems in critical Data Center operations that include but are not limited to utility substation feeds, transformers, switchgear, VFI Class UPS, DRUPS, PDUs, ATS, STS, SLA/VRLA batteries and associated systems, diesel/gas turbine generators and related fuel systems, Surge Suppression, Active Harmonic Filtering, battery monitoring systems, branch circuit monitoring systems or SCADA systems\u003cbr/\u003e- Knowledge of mission critical systems (data centers, hospitals, power plants, military facilities, etc.)\u003cbr/\u003e- Experience in vendor negotiation and management for data center or upgrade construction contracts\u003cbr/\u003e- CFC license or PMI qualification (PMP, IPMA, IPMC)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, GA, Atlanta - 96,000.00 - 166,300.00 USD annually","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"GA","title":"Project Engineer, Data Center Construction","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/3140846/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma, or Bachelor's degree\u003cbr/\u003e- 2+ years' Security Operations experience in data center, logistics, manufacturing, retail or similar industries, to include access control systems, CCTV, and defense in depth strategies.\u003cbr/\u003e- Up to 25% USA travel.\u003cbr/\u003e- 2+ years’ experience in physical security project management.","business_category":"aws","city":"Canton","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Amazon Web Services (AWS) and Amazon.com serve customers and developers all over the world who rely on storage, compute, and other services that power Amazon’s consumer, digital and AWS businesses. Our customers trust us to handle their data with air-tight security. Customer data security is a given and a guarantee for our businesses.\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Physical Security team is looking for a highly talented and motivated Physical Security System Project Manager and Technology Expert to lead physical security projects. This position will be responsible for the management of data center physical security systems and projects. A successful candidate will be responsible for interpretation of Threat Assessments and AWS Physical Security Standards to assure the proper security mitigations are selected to meet the unique challenges in each area. You will be responsible for collaborating with AWS architectural and engineering teams to assure each data center meets the high standards AWS sets for physical security. After implementation, this position will be responsible for assuring local security teams have the technical knowledge and resources necessary to meet the physical security mission.\u003cbr/\u003e`\u003cbr/\u003e- Considered candidates should be at least 18 years old.\u003cbr/\u003e\u003cbr/\u003e- As this is a GovCloud region, selected candidate requires US Citizenship or equivalent status.\u003cbr/\u003e\u003cbr/\u003eEffective May 15, 2017, logical access to the AWS GovCloud region will be restricted to Amazon employees who are U.S. Citizens. (GovCloud may NOT be accessed from outside of the United States)\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Manage installation of approved physical security system hardware, including, but not limited to, access control devices, intrusion detection devices, CCTV, and other components of physical security systems.\u003cbr/\u003e- Design of physical security system for new construction, expansion and retrofit projects.\u003cbr/\u003e- Preparation of security design standards, typical drawings, and technical specification documents for projects for the purposes of pricing by approved vendors. Review and provide quality assurance of vendor quotes. Submission of complete and accurate vendor quote packages to the Infrastructure Technical Project Manager for inclusion in project requisitions.\u003cbr/\u003e- Project management of multiple, concurrent security system installation projects and vendors.\u003cbr/\u003e- Subject Matter Expert for physical security system testing and acceptance, and assuring operational readiness at project completion.\u003cbr/\u003e- Preparation and archiving of project close-out documentation.\u003cbr/\u003e- Reporting vendor performance metrics regarding system installation, service delivery, and equipment availability / reliability.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services (AIS)  owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. \u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Web Services (AWS) and Amazon.com serve customers and developers all over the world who rely on storage, compute, and other services that power Amazon’s consumer, digital and AWS businesses. Our","display_distance":null,"id":"bc306ff8-39b7-4661-8664-c29ea5d34cec","id_icims":"3118523","is_intern":null,"is_manager":null,"job_category":"Investigation \u0026 Loss Prevention","job_family":"Data Center Security","job_function_id":null,"job_path":"/en/jobs/3118523/physical-security-program-manager-dc-security-amer-c","job_schedule_type":"full-time","location":"US, MS, Canton","locations":["{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Canton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Canton\",\"coordinates\":\"32.61258,-90.03472\",\"normalizedCountyName\":\"Madison\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Canton, Mississippi, USA\",\"location\":\"US, MS, Canton\",\"region\":\"MS\",\"buildingCodeList\":[\"JAN100\"],\"normalizedCityName\":\"Canton\"}"],"normalized_location":"Canton, Mississippi, USA","optional_search_labels":["military","aws.team-security-optional","aws.team-dc","aws.team-ais"],"posted_date":"October 30, 2025","preferred_qualifications":"- Bachelor's degree or above\u003cbr/\u003e- Experience with AutoCAD, Revit, Bluebeam, and MS Office Suite\u003cbr/\u003e- Experience in design, implementation, support, and evaluation of security-focused tools and services\u003cbr/\u003e- 3+ years' experience working with design, installation, and integration of Access - Control/Intrusion Detection and CCTV Surveillance systems.\u003cbr/\u003e- PSP, CPP, PMP Certification.\u003cbr/\u003e- Ability to manage multiple medium and large scale projects that are complex in nature and ability to interpret program objectives, develop project schedules and manage adherence to established timetables.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $72,100/year in our lowest geographic market up to $154,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-program-management-primary","source_system":"JobCreator","state":"MS","title":"Physical Security Program Manager , DC Security AMER C","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3118523/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-program-management-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in construction of data center delivery (design, commissioning and construction), mission critical facilities, or equivalent industrial/manufacturing facility builds\u003cbr/\u003e- Experience constructing electrical engineering systems including large scale power distribution/generation gear and mechanical engineering systems including cooling systems\u003cbr/\u003e- Experience in construction management or construction program management of large, complex projects involving large-scale mechanical, electrical, and plumbing (MEP) plants\u003cbr/\u003e- Experience in project control (cost or schedule, or both) and formulating construction programmes, especially for infrastructure and mission critical projects both on-site and in preconstruction environments\u003cbr/\u003e- Bachelor's degree in Electrical Engineering, Mechanical Engineering, or a related field, or 5+ years of construction or project management experience","business_category":"aws","city":"Canton","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAs our Data Center Construction Manager (CM), you will be a part of a diverse, upbeat, and creative team tasked with solving fascinating problems constructing Amazon Data Centers. Our data centers are industry-leading examples of energy efficient and cost-effective designs. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Own project scope, quality, schedule, and budget for construction of new builds or general capital projects.\u003cbr/\u003e• Own construction project management and oversight of construction related activities.\u003cbr/\u003e• Work alongside partner teams such as Operations, Networking, Controls, Security, and Commissioning to build Data Centers that directly support our Customers.\u003cbr/\u003e• Be a leader in your specific discipline (construction management, building services, architectural, electrical or mechanical engineering).\u003cbr/\u003e• Represent Amazon’s owner’s representative on construction sites daily, as, interacting with construction trades. \u003cbr/\u003e• Be Amazon’s construction representative on multiple data centers building and capital improvement construction project sites from construction start through hand-off to operations.\u003cbr/\u003e• Direct interface with construction general contractors during the construction bidding, award, execution, punch-list, and closeout phases.\u003cbr/\u003e• Create construction project scope and request for proposals.\u003cbr/\u003e• Conduct negotiations with general contractors and evaluate bids and proposals with detail and accuracy.\u003cbr/\u003e• Manage and drive cost, schedule, and quality while managing construction contractors and vendors.\u003cbr/\u003e• Perform construction project management activities, including management of documents, submittals, RFIs, change orders, invoices, quality, scope, and schedule.\u003cbr/\u003e• Drive construction teams to troubleshoot and perform root-cause failure analysis on equipment failures.\u003cbr/\u003e• Support commissioning and integrated system testing and oversight.\u003cbr/\u003e• Support operations of installed facilities, including review of procedures, best practices, and maintenance initiatives.\u003cbr/\u003e• Support capital request creation.\u003cbr/\u003e• Analyze and report construction progress and financials.\u003cbr/\u003e• Record and report key construction metrics to team members and management.\u003cbr/\u003e• Contribute to construction initiatives aimed at improving construction efficiency and increasing data center resiliency.\u003cbr/\u003e• Provide constructability reviews for electrical and mechanical designs for new or optimization of existing data centers.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003e#DCCD_AMER ","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"f1041a87-972a-4a0e-a225-dfc251dbcf3a","id_icims":"3165173","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3165173/sr-construction-manager-data-center-construction","job_schedule_type":"full-time","location":"US, MS, Canton","locations":["{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Canton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Canton\",\"coordinates\":\"32.61258,-90.03472\",\"normalizedCountyName\":\"Madison\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Canton, Mississippi, USA\",\"location\":\"US, MS, Canton\",\"region\":\"MS\",\"buildingCodeList\":[\"JAN100\"],\"normalizedCityName\":\"Canton\"}"],"normalized_location":"Canton, Mississippi, USA","optional_search_labels":["aws.team-ais","aws.team-dcpd-optional","aws.team-dc"],"posted_date":"January 23, 2026","preferred_qualifications":"- Experience delivering multi-media environmental due diligence, permitting, and compliance projects with specific expertise in CWA 404 and NPDES permitting, groundwater protection, wastewater discharge, and natural and cultural resource evaluations\u003cbr/\u003e- Experience in Project Controls Standards subject matter, including Estimating, Cost Management, Cost Forecasting, Schedule Management, Progress Measurement, Change Management, Risk Management, WBS/CBS/SBS, Cash-Flow (VOWD), and Benchmarking\u003cbr/\u003e- Experience in environmental compliance and permitting, waste management, contractual, regulatory, and liability assessments, environmental permit evaluations and applications, EIAs and water discharge requirements\u003cbr/\u003e- Experience developing and implementing environmental compliance programs including regulated waste, water, and air regulations in accordance with applicable laws\u003cbr/\u003e- Bachelor's degree in Engineering\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MS, Canton - 125,400.00 - 187,300.00 USD annually","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"MS","title":"Sr. Construction Manager, Data Center Construction","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3165173/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Albuquerque","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager. In this role, you will lead a team of hourly workforce and will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e\u003cbr/\u003eOur Operation’s workflow has three major components: First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Support, mentor, and motivate your hourly workforce\u003cbr/\u003e* Manage safety, quality, productivity, and customer delivery promises\u003cbr/\u003e* Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e* Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e* Stand/walk for up to 12 hours during shifts\u003cbr/\u003e* Work in an environment where the noise level varies and can be loud\u003cbr/\u003e* Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e* Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e\u003cbr/\u003eOur fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Area Managers based on location preference and the business’ current openings.","department_cost_center":null,"description_short":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager.","display_distance":null,"id":"3614d69d-2315-40ff-98b4-b49a59d4e9b2","id_icims":"3170000","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3170000/area-manager-ii","job_schedule_type":"full-time","location":"US, NM, Albuquerque","locations":["{\"normalizedStateName\":\"New Mexico\",\"normalizedCountryCode\":\"USA\",\"city\":\"Albuquerque\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NM, Albuquerque\",\"coordinates\":\"35.08423,-106.64905\",\"normalizedCountyName\":\"Bernalillo\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Albuquerque, New Mexico, USA\",\"location\":\"US, NM, Albuquerque\",\"region\":\"NM\",\"buildingCodeList\":[\"ABQ1\"],\"normalizedCityName\":\"Albuquerque\"}"],"normalized_location":"Albuquerque, New Mexico, USA","optional_search_labels":[],"posted_date":"January 29, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 20+ employees\u003cbr/\u003e- Experience with process improvements (Lean process, Kaizen, and/or Six Sigma)\u003cbr/\u003e- Excellent customer service, communication, and interpersonal skills\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Industry experience in: retail, F\u0026B, military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NM, Albuquerque - 70,000.00 - 90,900.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"NM","title":"Area Manager II ","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3170000/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in construction of data center delivery (design, commissioning and construction), mission critical facilities, or equivalent industrial/manufacturing facility builds\u003cbr/\u003e- Bachelor's degree in Mechanical Engineering, Electrical Engineering, Construction Management or an equivalent engineering science\u003cbr/\u003e- 5+ years of construction management of large, complex projects involving large-scale mechanical, electrical and plumbing (MEP) plants experience\u003cbr/\u003e- 5+ years of general contractor and vendor management work (request for proposals, bidding, change orders, quality control, RFI/submittal tracking) associated with construction and project execution experience","business_category":"aws","city":"Canton","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAs our Data Center Construction Manager (CM)], you will be a part of a diverse, upbeat, and creative team tasked with solving fascinating problems constructing Amazon Data Centers. Our data centers are industry-leading examples of energy efficient and cost-effective designs. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Own project scope, quality, schedule, and budget for construction of new builds or general capital projects.\u003cbr/\u003e• Own construction project management and oversight of construction related activities.\u003cbr/\u003e• Work alongside partner teams such as Operations, Networking, Controls, Security, and Commissioning to build Data Centers that directly support our Customers.\u003cbr/\u003e• Be a leader in your specific discipline (construction management, building services, architectural, electrical or mechanical engineering).\u003cbr/\u003e• Represent Amazon’s owner’s representative on construction sites daily, as, interacting with construction trades. \u003cbr/\u003e• Be Amazon’s construction representative on multiple data centers building and capital improvement construction project sites from construction start through hand-off to operations.\u003cbr/\u003e• Direct interface with construction general contractors during the construction bidding, award, execution, punch-list, and closeout phases.\u003cbr/\u003e• Create construction project scope and request for proposals.\u003cbr/\u003e• Conduct negotiations with general contractors and evaluate bids and proposals with detail and accuracy.\u003cbr/\u003e• Manage and drive cost, schedule, and quality while managing construction contractors and vendors.\u003cbr/\u003e• Perform construction project management activities, including management of documents, submittals, RFIs, change orders, invoices, quality, scope, and schedule.\u003cbr/\u003e• Drive construction teams to troubleshoot and perform root-cause failure analysis on equipment failures.\u003cbr/\u003e• Support commissioning and integrated system testing and oversight.\u003cbr/\u003e• Support operations of installed facilities, including review of procedures, best practices, and maintenance initiatives.\u003cbr/\u003e• Support capital request creation.\u003cbr/\u003e• Analyze and report construction progress and financials.\u003cbr/\u003e• Record and report key construction metrics to team members and management.\u003cbr/\u003e• Contribute to construction initiatives aimed at improving construction efficiency and increasing data center resiliency.\u003cbr/\u003e• Provide constructability reviews for electrical and mechanical designs for new or optimization of existing data centers.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003e#DCCD_AMER ","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"d9919339-7542-45ba-81e2-9312aa69250a","id_icims":"3123217","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3123217/sr-construction-manager-data-center-construction","job_schedule_type":"full-time","location":"US, MS, Canton","locations":["{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Canton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Canton\",\"coordinates\":\"32.61258,-90.03472\",\"normalizedCountyName\":\"Madison\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Canton, Mississippi, USA\",\"location\":\"US, MS, Canton\",\"region\":\"MS\",\"buildingCodeList\":[\"JAN100\"],\"normalizedCityName\":\"Canton\"}"],"normalized_location":"Canton, Mississippi, USA","optional_search_labels":["aws.team-ais","aws.team-dcpd-optional","aws.team-dc"],"posted_date":"November  7, 2025","preferred_qualifications":"- MS in Construction Management or Engineering (Mechanical, Electrical, Civil, Structural)\u003cbr/\u003e- 10+ Yrs. Exp in Construction Management of large-scale projects\u003cbr/\u003e- 10+ Yrs. Exp. Project Management and Vendor Management\u003cbr/\u003e- 5+ Yrs. Exp. In Data Center system-level architecture and electrical engineering principals\u003cbr/\u003e- 5+ Yrs. Exp. In Data Center system-level architecture and mechanical engineering principals\u003cbr/\u003e- Experience designing data centers or critical MEP infrastructure\u003cbr/\u003e- Certified as a Professional Engineer (PE), LEED, or Certified Construction Manager (CCM)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MS, Canton - 125,400.00 - 187,300.00 USD annually","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"MS","title":"Sr. Construction Manager, Data Center Construction","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3123217/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}