{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 4+ years of Information Technology (IT) experience, or Bachelor's degree in computer science, engineering, mathematics or equivalent\u003cbr/\u003e- 2+ years experience in participating in on-call rotations, and providing after-hours support in an environment that operates 24/7, Networking and Computer Hardware.\u003cbr/\u003e- 2+ years of experience managing people in a technical environment.","business_category":"aws","city":"New Albany","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is a fast paced technology company and a leader in the world of data centers. The position will help ensure overall availability and reliability to meet or exceed defined service levels of data center operations. We are currently expanding our infrastructure management team and are looking for technology managers with experience in people management, strong technical understanding and the drive and vision to take AWS Data Center Operations to the next level. \u003cbr/\u003e\u003cbr/\u003eThe successful candidate will have experience creating/devising strategies, mentoring people in all levels, sponsoring projects and proposing technical solutions. This position involves leading teams in hardware and network diagnostics followed by physical repair and includes participation in an on-call rotation. All candidates should be willing to work both independently and managing their teams effectively. Work prioritization, organizational skills, effective communication, and the ability to react quickly are critical to being successful. In addition to strong knowledge in Data Centers, hardware and network repair, candidates will create documentation, innovate solutions, participate in site-level project work, and fix complex problems within the Data Center Space. This team works in an environment that operates 24/7.\u003cbr/\u003e\u003cbr/\u003eEffective May 15, 2017, logical access to the AWS GovCloud region will be restricted to Amazon employees who are U.S. Citizens. (GovCloud may NOT be accessed from outside of the United States) \u003cbr/\u003e\u003cbr/\u003eThis role will maintain a schedule of Monday through Friday, Day Shift (~8 AM to 5 PM) OR Night Shift (~8PM-5AM). This role will also periodically have on-call manager responsibilities that will exist outside of standard working hours.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe successful candidate will be operationally responsible for a Data Center. Some high-level responsibilities include:\u003cbr/\u003e- Prioritize and assign trouble tickets to data center technicians and operators\u003cbr/\u003e- Manage the performance of a diverse team(s) of data center operation professionals with varying skills across different locations\u003cbr/\u003e- Developing Career Paths for the employees and to make updates in our internal tools.\u003cbr/\u003e- Recruit and train data technicians to ensure appropriate staffing levels\u003cbr/\u003e- Ensure effective and efficient management of day to day data center operations including queue management, 7/24 shift arrangement and hardware logistics\u003cbr/\u003e- Fast learn or act as the subject matter expert across all aspects in data center operations\u003cbr/\u003e- Ensure all operational KPIs and metrics are being measured and met\u003cbr/\u003e- Inspire and guide improvement in team process, technology innovation and automation\u003cbr/\u003e- Manage Large Scale Events (outages) and act as the call leader\u003cbr/\u003e- Manage and improve the work-flows and through-put for data centers operations\u003cbr/\u003e- Recommend, document, and oversee policies and procedures to meet industry best practices and to meet required SLAs \u003cbr/\u003e - Maintain the on-call schedule coordinating absence and vacations\u003cbr/\u003e- Be passionate about the quality and quantity of services being provided, and continuously strive to improve our Customer Experience\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003e\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. \u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"40714bb8-f144-45c4-87b4-86c70d51769e","id_icims":"3165574","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3165574/data-center-manager-night-shift","job_schedule_type":"full-time","location":"US, OH, New Albany","locations":["{\"normalizedStateName\":\"Ohio\",\"normalizedCountryCode\":\"USA\",\"city\":\"New Albany\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OH, New Albany\",\"coordinates\":\"40.08131,-82.80885\",\"normalizedCountyName\":\"Franklin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New Albany, Ohio, USA\",\"location\":\"US, OH, New Albany\",\"region\":\"OH\",\"buildingCodeList\":[\"CMH100\"],\"normalizedCityName\":\"New Albany\"}"],"normalized_location":"New Albany, Ohio, USA","optional_search_labels":[],"posted_date":"January 23, 2026","preferred_qualifications":"- Experience in technical writing in a relevant field\u003cbr/\u003e- Experience with system management tools and client/server environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, OH, New Albany - 78,400.00 - 137,300.00 USD annually","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"OH","title":"Data Center Manager, Night Shift","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3165574/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of building machine learning models for business application experience\u003cbr/\u003e- PhD, or Master's degree and 6+ years of applied research experience\u003cbr/\u003e- Experience programming in Java, C++, Python or related language\u003cbr/\u003e- Experience with neural deep learning methods and machine learning","business_category":"amazon-security","city":"Austin","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Security is seeking a Senior Applied Scientist to lead GenAI acceleration within the Secure Third Party Tools (S3T) organization. The S3T team has bold ambitions to re-imagine security products that serve Amazon's pace of innovation at our global scale.\u003cbr/\u003e\u003cbr/\u003eThis role will focus on leveraging large language models and agentic AI to transform third-party security risk management, automate complex vendor assessments, streamline controllership processes, and dramatically reduce assessment cycle times. You will drive builder efficiency and deliver bar-raising security engagements across Amazon.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003eOwn and drive end-to-end technical vision for large-scoped science initiatives focused on third-party security risk management, independently defining research agendas, success metrics, and multi-quarter roadmaps with minimal oversight.\u003cbr/\u003e\u003cbr/\u003ePioneer transformative approaches to automate third-party security review processes using state-of-the-art large language models, designing intelligent systems for vendor assessment document analysis, security questionnaire automation, risk signal extraction, and compliance decision support.\u003cbr/\u003e\u003cbr/\u003eArchitect and lead development of advanced GenAI and agentic frameworks including multi-agent orchestration, RAG pipelines, and autonomous workflows purpose-built for third-party risk evaluation, security documentation processing, and scalable vendor assessment at enterprise scale.\u003cbr/\u003e\u003cbr/\u003eBuild ML-powered risk intelligence capabilities that enhance third-party threat detection, vulnerability classification, and continuous monitoring throughout the vendor lifecycle.\u003cbr/\u003e\u003cbr/\u003eServe as strategic thought partner to senior leadership and business stakeholders, translating complex AI capabilities into high-impact third-party security solutions, influencing investment priorities, and delivering measurable risk reduction and operational efficiency.\u003cbr/\u003e\u003cbr/\u003ePartner with Software Engineering and Data Engineering as technical co-owner to deploy production-grade ML solutions that integrate seamlessly with existing third-party risk management workflows and scale across the organization.\u003cbr/\u003e\u003cbr/\u003eMentor and elevate scientists and engineers, establishing best practices for security-focused AI development while advancing the state of the art through applied research and publications.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eSecurity is central to maintaining customer trust and delivering delightful customer experiences. At Amazon, our Security organization is designed to drive bar-raising security engagements. Our vision is that Builders raise the Amazon security bar when they use our recommended tools and processes, with no overhead to their business.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon Security values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy Amazon Security?\u003cbr/\u003eAt Amazon, security is central to maintaining customer trust and delivering delightful customer experiences. Our organization is responsible for creating and maintaining a high bar for security across all of Amazon’s products and services. We offer talented security professionals the chance to accelerate their careers with opportunities to build experience in a wide variety of areas including cloud, devices, retail, entertainment, healthcare, operations, and physical stores.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eIn Amazon Security, it’s in our nature to learn and be curious. Ongoing DEI events and learning experiences inspire us to continue learning and to embrace our uniqueness. Addressing the toughest security challenges requires that we seek out and celebrate a diversity of ideas, perspectives, and voices.\u003cbr/\u003e\u003cbr/\u003eTraining \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, training, and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.","department_cost_center":null,"description_short":"Amazon Security is seeking a Senior Applied Scientist to lead GenAI acceleration within the Secure Third Party Tools (S3T) organization. The S3T team has bold ambitions to re-imagine security products","display_distance":null,"id":"b9e60a38-3856-4af8-a51a-cd51f6867389","id_icims":"3167813","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3167813/senior-applied-scientist-secure-3p-tools","job_schedule_type":"full-time","location":"US, TX, Austin","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS16\"],\"normalizedCityName\":\"Austin\"}"],"normalized_location":"Austin, Texas, USA","optional_search_labels":["aws.team-security-optional"],"posted_date":"January 27, 2026","preferred_qualifications":"- Experience with modeling tools such as R, scikit-learn, Spark MLLib, MxNet, Tensorflow, numpy, scipy etc.\u003cbr/\u003e- Experience with large scale distributed systems such as Hadoop, Spark etc.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Austin - 167,100.00 - 226,100.00 USD annually","primary_search_label":"amazon-security.no-team-list","source_system":"JobCreator","state":"TX","title":"Senior Applied Scientist, Secure 3P Tools","university_job":null,"updated_time":"38 minutes","url_next_step":"https://account.amazon.com/jobs/3167813/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-list","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language\u003cbr/\u003e- Experience with at least one of PKI (public key infrastructure), HSMs (Hardware Security Modules), Firmware Signing, Encryption, Cryptography, Key Management, or Secure Device Provisioning.\u003cbr/\u003e- EXPORT CONTROL REQUIREMENT: Due to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.","business_category":"amazon-security","city":"Herndon","company_name":"Amazon.com Services LLC","country_code":"USA","description":"We are open to hiring candidates to work out of one of the following locations:\u003cbr/\u003e\u003cbr/\u003eHerndon, VA, USA | Redmond, WA, USA\u003cbr/\u003e\u003cbr/\u003eLeo is an initiative to launch a constellation of Low Earth Orbit satellites that will provide low-latency, high-speed broadband network connectivity to unserved and underserved communities around the world. This role has a focus on building services to support our public key infrastructure including key management, cryptography, firmware signing, and secure device provisioning.\u003cbr/\u003e\u003cbr/\u003eTHE ROLE\u003cbr/\u003eHave you wanted an opportunity to develop software for an advanced satellite broadband telecom service? In this role you will build software for secure communications and strong authentication, enabling the confidentiality for our customers and security for our constellation. Our team drives the development, deployment, and operation of mission-critical security systems for the Leo constellation and customer terminals. We are looking for a Software Development Engineer interested in building services around public key infrastructure, certificate management, and identity management for Leo.\u003cbr/\u003e\u003cbr/\u003eEXPORT CONTROL REQUIREMENT\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWhat We Do\u003cbr/\u003eLeo Trust Services owns the creation and operation of services to protect customer data and Leo devices. Candidates for this role must have a background in one of the following: PKI (public key infrastructure), HSMs (Hardware Security Modules), Firmware Signing, Secure Boot, Encryption, Cryptography, Key Management, or Secure Device Provisioning.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon Security values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy Amazon Security?\u003cbr/\u003eAt Amazon, security is central to maintaining customer trust and delivering delightful customer experiences. Our organization is responsible for creating and maintaining a high bar for security across all of Amazon’s products and services. We offer talented security professionals the chance to accelerate their careers with opportunities to build experience in a wide variety of areas including cloud, devices, retail, entertainment, healthcare, operations, and physical stores.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eIn Amazon Security, it’s in our nature to learn and be curious. Ongoing DEI events and learning experiences inspire us to continue learning and to embrace our uniqueness. Addressing the toughest security challenges requires that we seek out and celebrate a diversity of ideas, perspectives, and voices.\u003cbr/\u003e\u003cbr/\u003eTraining \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, training, and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.","department_cost_center":null,"description_short":"We are open to hiring candidates to work out of one of the following locations:Herndon, VA, USA | Redmond, WA, USALeo is an initiative to launch a constellation of Low Earth Orbit satellites that will","display_distance":null,"id":"a24880ca-f7b4-4138-9906-d9006b835a63","id_icims":"3154604","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3154604/software-development-engineer-leo-trust-services","job_schedule_type":"full-time","location":"US, VA, Herndon","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA130\"],\"normalizedCityName\":\"Redmond\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD31\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Herndon, Virginia, USA","optional_search_labels":[],"posted_date":"January  7, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- Experience in Python and Java\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $129,300/year in our lowest geographic market up to $223,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"amazon-security.team-devices-security","source_system":"JobCreator","state":"VA","title":"Software Development Engineer, Leo Trust Services","university_job":null,"updated_time":"38 minutes","url_next_step":"https://account.amazon.com/jobs/3154604/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-devices-security","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of engineering team management experience\u003cbr/\u003e- 7+ years of engineering experience\u003cbr/\u003e- 8+ years of leading the definition and development of multi tier web services experience\u003cbr/\u003e- Knowledge of engineering practices and patterns for the full software/hardware/networks development life cycle, including coding standards, code reviews, source control management, build processes, testing, certification, and livesite operations\u003cbr/\u003e- Experience partnering with product or program management teams\u003cbr/\u003e- Experience designing or architecting (design patterns, reliability and scaling) of new and existing systems","business_category":"operations","city":"New York","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Ready to Shape the Future of E-commerce? Here’s Your Next Big Adventure!\u003cbr/\u003e\u003cbr/\u003eJoin Amazon’s Supply Chain Optimization Technologies (SCOT) – Long-Term Planning and Forecasting (LTPF) organization, where we’re transforming how millions of customers get what they want, when they want it. We are looking for a Software Development Manager to lead a high-impact engineering team tackling one of the most exciting challenges in tech: predicting customer demand and planning inventory and capacity across Amazon’s global fulfillment network.\u003cbr/\u003e\u003cbr/\u003eWe are a team that has fun at work while delivering meaningful customer, business, and environmental impact. This team builds and operates highly scalable, highly available services that power worldwide forecasting and long-term planning for customer demand, warehouse inventory, and fulfillment capacity. The systems you lead will improve forecasting accuracy, explainability, and alignment across millions of products, enabling better one-way-door decisions across Amazon’s planning horizons.\u003cbr/\u003e\u003cbr/\u003eAs an SDM in this space, you will work at the intersection of distributed systems, machine learning, and supply chain optimization, solving complex problems utilizing Amazon's massive data, sophisticated algorithms and cloud computation infrastructure (AWS). The scope includes reinventing the planning and forecasting systems to be immersive with Gen AI and bringing coherence to strategic decisions across demand, inventory, and cost-to-serve\u003cbr/\u003e\u003cbr/\u003eThe systems to be led by this role span four major business areas:\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eCustomer Demand Prediction – science-driven forecasting of worldwide customer demand\u003cbr/\u003eInventory Prediction – forecasting inventory units and costs, assessing current vs. ideal inventory aligned with demand\u003cbr/\u003eFulfillment Network Capacity \u0026 Topology Planning – planning hundreds of new fulfillment assets over a multi-year horizon, while managing retrofit and repurpose strategies across Amazon’s global network\u003cbr/\u003eConstraints Management – optimizing fulfillment network performance through capacity allocation, demand shaping levers, and channel balancing decisions that impact millions of customers, sellers, and Amazon’s financial outcomes\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs a Software Development Manager, you will:\u003cbr/\u003e\u003cbr/\u003eLead a 2-pizza engineering team owning topline demand forecasting, inventory volume and financial forecasting, and Capacity planning systems\u003cbr/\u003eManage day-to-day execution within an Agile/Scrum environment\u003cbr/\u003e\u003cbr/\u003eDevelop and mentor engineers, fostering strong career growth and engineering culture\u003cbr/\u003eBalance competing priorities while delivering both short-term business outcomes and long-term strategic platform investments\u003cbr/\u003ePartner closely with senior leaders, product, science, and operations teams to solve problems in ML, MLOps, optimization, and large-scale data systems\u003cbr/\u003eDrive architecture, system design, and engineering excellence across scalability, reliability, and operational readiness\u003cbr/\u003eDeliver step-change improvements while maintaining a high bar on customer trust and data correctness\u003cbr/\u003eDefine the long-term vision, strategy, and goals for your team\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eIn this role, you will become an expert in large scale machine learning, Artificial intelligence and optimization systems used in the management of the most sophisticated supply chain in the world while developing a deep understanding of Amazon's stores business. You will design and architect systems and expand your technical depth and breadth while defining and driving key aspects of the customer experience on Amazon.com. You will influence the design of our core fulfillment network across multiple organizations and drive decisions with billion-dollar impact to Amazon’s business.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe are the LTPF team under Supply Chain Optimization Technologies (SCOT). SCOT is the name of a complex group of systems designed to make the best decisions when it comes to forecasting, buying, placing, and shipping inventory. Functionally these teams work together to drive in-stock, drive placement, drive inventory removal and manage the customer experience. Long-Term Planning \u0026 Forecasting (LTPF) organization develops forecasting, optimization, and analytics products and services to plan Amazon's Topline, Inventory, and Fulfillment Capacity and Topology, including strategic decisions and Amazon policies to drive key business metrics. This means accelerating the Amazon flywheel by being the definitive source for accurate predictions and bridging of customer demand, inventory, and cube to enable optimization of decisions in the supply chain, and Optimizing inventory efficiency, capital allocation, network's topology, and fulfillment resources, aligning with our customer experience (CX) and cost-to-serve (CtS) goals","department_cost_center":null,"description_short":"Ready to Shape the Future of E-commerce? Here’s Your Next Big Adventure!Join Amazon’s Supply Chain Optimization Technologies (SCOT) – Long-Term Planning and Forecasting (LTPF) organization, where we’re","display_distance":null,"id":"6debb1d9-e7df-4728-b575-9edd464d4952","id_icims":"3182304","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3182304/software-development-manager-scot-ww-long-term-planning-and-forecasting","job_schedule_type":"full-time","location":"US, NY, New York","locations":["{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK36\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"New York, New York, USA","optional_search_labels":[],"posted_date":"February 17, 2026","preferred_qualifications":"- Experience in communicating with users, other technical teams, and senior leadership to collect requirements, describe software product features, technical designs, and product strategy\u003cbr/\u003e- Experience in recruiting, hiring, mentoring/coaching and managing teams of Software Engineers to improve their skills, and make them more effective, product software engineers\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, New York - 203,400.00 - 275,200.00 USD annually","primary_search_label":"operations.team-supply-chain-optimization","source_system":"JobCreator","state":"NY","title":"Software Development Manager, SCOT WW Long Term Planning and Forecasting","university_job":null,"updated_time":"44 minutes","url_next_step":"https://account.amazon.com/jobs/3182304/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-supply-chain-optimization","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Perris","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager. In this role, you will lead a team of hourly workforce and will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e\u003cbr/\u003eOur Operation’s workflow has three major components: First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Support, mentor, and motivate your hourly workforce\u003cbr/\u003e* Manage safety, quality, productivity, and customer delivery promises\u003cbr/\u003e* Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e* Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e* Stand/walk for up to 12 hours during shifts\u003cbr/\u003e* Work in an environment where the noise level varies and can be loud\u003cbr/\u003e* Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e* Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e\u003cbr/\u003eOur fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Area Managers based on location preference and the business’ current openings.","department_cost_center":null,"description_short":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager.","display_distance":null,"id":"1e94c9d4-5bad-4345-85a1-88f6ee89ff4a","id_icims":"3159575","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3159575/area-manager-ii","job_schedule_type":"full-time","location":"US, CA, Perris","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Perris\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Perris\",\"coordinates\":\"33.78241,-117.22834\",\"normalizedCountyName\":\"Riverside\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Perris, California, USA\",\"location\":\"US, CA, Perris\",\"region\":\"CA\",\"buildingCodeList\":[\"KRB4\"],\"normalizedCityName\":\"Perris\"}"],"normalized_location":"Perris, California, USA","optional_search_labels":[],"posted_date":"January 14, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 20+ employees\u003cbr/\u003e- Experience with process improvements (Lean process, Kaizen, and/or Six Sigma)\u003cbr/\u003e- Excellent customer service, communication, and interpersonal skills\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Industry experience in: retail, F\u0026B, military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Perris - 72,500.00 - 90,900.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"CA","title":"Area Manager II ","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3159575/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 4+ years of data engineering experience\u003cbr/\u003e- Experience with data modeling, warehousing and building ETL pipelines","business_category":"aws","city":"Melbourne","company_name":"Amazon Corporate Services Pty Ltd","country_code":"AUS","description":"As a Data Engineer, you will enable data-driven decision making within the Amazon Web Services (AWS) Data Center Infrastructure Operations organization.\u003cbr/\u003e\u003cbr/\u003eThe Infrastructure Operations Team is responsible for planning, implementing, monitoring and continuously improving the global Amazon Data Center infrastructure. The team supports all aspects of the Data Center based organizations, including but not limited to: Safety, Security, maintenance, daily operations, logistics, engineering and equipment management.\u003cbr/\u003e\u003cbr/\u003eYou should be passionate about working with huge data sets and be someone who is able to bring data sets together to answer business questions and drive growth. You will have an opportunity to work with big data and emerging technologies while driving business intelligence solutions end-to-end: business requirements, data modeling, ETL, metadata, reporting, and dash boarding.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe Business Intelligence Data Engineer will:\u003cbr/\u003e- Primarily supporting teams within the Infrastructure environment, but long term will have opportunities to support teams in the overall Amazon Web Services community.\u003cbr/\u003e- Build ETLs to ingest data into the data warehouse and datalake, as well as end-user facing reporting applications.\u003cbr/\u003e- Develop, implement and maintain the metrics and reports to enable decision support systems for the organization. This includes working with other teams to develop those metrics from their services.\u003cbr/\u003e- Partner with business customers and development teams to define analytics requirements and then deliver flexible, scalable, end-to-end solutions.\u003cbr/\u003e\u003cbr/\u003eHold or be able to attain an Australian Government Security Vetting Agency clearance (see https://www.agsva.gov.au/applicants/eligibility-and-suitability)\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.","department_cost_center":null,"description_short":"As a Data Engineer, you will enable data-driven decision making within the Amazon Web Services (AWS) Data Center Infrastructure Operations organization.The Infrastructure Operations Team is responsible","display_distance":null,"id":"c23f9de2-757f-4a6d-85c3-fce916078922","id_icims":"3131755","is_intern":null,"is_manager":null,"job_category":"Business Intelligence","job_family":"Data Engineering","job_function_id":null,"job_path":"/en/jobs/3131755/data-engineer","job_schedule_type":"full-time","location":"AU, VIC, Melbourne","locations":["{\"normalizedStateName\":\"New South Wales\",\"normalizedCountryCode\":\"AUS\",\"city\":\"Sydney\",\"countryIso3a\":\"AUS\",\"countryIso2a\":\"AU\",\"locationNonStemming\":\"Australia, NSW, Sydney\",\"coordinates\":\"-33.87073,151.20788\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Australia\",\"normalizedLocation\":\"Sydney, New South Wales, AUS\",\"location\":\"AU, NSW, Sydney\",\"region\":\"NSW\",\"buildingCodeList\":[\"SYD12\"],\"normalizedCityName\":\"Sydney\"}","{\"normalizedStateName\":\"Victoria\",\"normalizedCountryCode\":\"AUS\",\"city\":\"Melbourne\",\"countryIso3a\":\"AUS\",\"countryIso2a\":\"AU\",\"locationNonStemming\":\"Australia, VIC, Melbourne\",\"coordinates\":\"-37.81736,144.96755\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Australia\",\"normalizedLocation\":\"Melbourne, Victoria, AUS\",\"location\":\"AU, VIC, Melbourne\",\"region\":\"VIC\",\"buildingCodeList\":[\"MEL12\"],\"normalizedCityName\":\"Melbourne\"}"],"normalized_location":"Melbourne, Victoria, AUS","optional_search_labels":["aws.adc-australia"],"posted_date":"November 24, 2025","preferred_qualifications":"- Experience with AWS technologies like Redshift, S3, AWS Glue, EMR, Kinesis, FireHose, Lambda, and IAM roles and permissions\u003cbr/\u003e- Experience with big data technologies such as: Hadoop, Hive, Spark, EMR\u003cbr/\u003e\u003cbr/\u003eAcknowledgement of country:\u003cbr/\u003eIn the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.\u003cbr/\u003e\u003cbr/\u003eIDE statement:\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-us-security-clearance-jobs-primary","source_system":"JobCreator","state":"VIC","title":"Data Engineer","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3131755/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-us-security-clearance-jobs-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of Microsoft Office products and applications experience\u003cbr/\u003e- 2+ years of electrical and mechanical experience.\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends","business_category":"aws","city":"Umatilla","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e- Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"92739b5e-74cd-4987-b162-c96f5beeb446","id_icims":"3161307","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3161307/engineering-operations-technician-dcc-communities","job_schedule_type":"full-time","location":"US, OR, Umatilla","locations":["{\"normalizedStateName\":\"Oregon\",\"normalizedCountryCode\":\"USA\",\"city\":\"Umatilla\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OR, Umatilla\",\"coordinates\":\"45.91768,-119.34203\",\"normalizedCountyName\":\"Umatilla\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Umatilla, Oregon, USA\",\"location\":\"US, OR, Umatilla\",\"region\":\"OR\",\"buildingCodeList\":[\"PDX127\",\"PDX124\",\"PDX121\",\"PDX194\",\"PDT122\",\"PDT130\",\"PDT197\",\"PDX132\",\"PDX2\",\"PDT194\",\"PDX201\",\"PDX130\",\"PDX135\",\"PDX199\",\"PDT51\",\"PDX96\",\"PDX51\",\"PDT65\",\"PDX123\",\"PDX195\",\"PDX54\",\"PDT54\",\"PDX134\",\"PDX126\",\"PDX131\",\"PDX57\",\"PDX200\",\"PDT69\",\"PDT196\",\"PDX60\",\"PDT2\",\"PDX100\",\"PDX137\",\"PDX198\",\"PDX122\",\"PDX136\",\"PDX196\",\"PDX133\",\"PDT195\",\"PDX125\",\"PDX78\",\"PDX128\",\"PDX197\",\"PDT60\",\"PDX071\"],\"normalizedCityName\":\"Umatilla\"}"],"normalized_location":"Umatilla, Oregon, USA","optional_search_labels":["military","aws.team-dc","hourly","aws.team-ais"],"posted_date":"January 16, 2026","preferred_qualifications":"- 4+ years of data center engineering experience\u003cbr/\u003e- Bachelor's degree in Electrical Engineering, Mechanical Engineering, or a related field\u003cbr/\u003e- Experience in data center engineering\u003cbr/\u003e- Experience with reading and writing procedures, technical documents, and engineering drawings\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, OR, Umatilla - 37.00 - 65.00 USD hourly\u003cbr/\u003eUSA, WA, Attalia - 37.00 - 65.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"OR","title":"Engineering Operations Technician, DCC Communities ","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3161307/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of Microsoft Office products and applications experience\u003cbr/\u003e- 2+ years of electrical and mechanical experience.\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends","business_category":"aws","city":"Umatilla","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e- Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"c3a40edd-fe7a-4400-916a-1833385f1c43","id_icims":"3162849","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3162849/engineering-operations-technician-dcc-communities","job_schedule_type":"full-time","location":"US, OR, Umatilla","locations":["{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"Reno\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, Reno\",\"coordinates\":\"39.52766,-119.81353\",\"normalizedCountyName\":\"Washoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Reno, Nevada, USA\",\"location\":\"US, NV, Reno\",\"region\":\"NV\",\"buildingCodeList\":[\"HRN2\",\"WFM293\",\"LSM7\",\"RNO404\",\"RNO400\",\"SVMT43\",\"RNO2\",\"HRN1\",\"DLV3\",\"KRNO\",\"SVMT18\",\"SVMT44\",\"RNO403\",\"RNO4\",\"DRN1\",\"SNV4\",\"SVMT45\"],\"normalizedCityName\":\"Reno\"}","{\"normalizedStateName\":\"Oregon\",\"normalizedCountryCode\":\"USA\",\"city\":\"Boardman\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OR, Boardman\",\"coordinates\":\"45.83987,-119.70238\",\"normalizedCountyName\":\"Morrow\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Boardman, Oregon, USA\",\"location\":\"US, OR, Boardman\",\"region\":\"OR\",\"buildingCodeList\":[\"PDX344\",\"PDT1\",\"PDX189\",\"PDX62\",\"PDT62\",\"PDX161\",\"PDX158\",\"PDX113\",\"PDX28\",\"PDT59\",\"PDX59\",\"PDX330\",\"PDX190\",\"PDX315\",\"PDT50\",\"PDX329\",\"PDX342\",\"PDX93\",\"PDT181\",\"PDX202\",\"PDX108\",\"PDT203\",\"PDX50\",\"PDT112\",\"PDT91\",\"PDX111\",\"PDX156\",\"PDX325\",\"PDX165\",\"PDX91\",\"PDX168\",\"PDX187\",\"PDX97\",\"PDX332\",\"PDX21\",\"PDT178\",\"PDX24\",\"PDT102\",\"PDX319\",\"PDT68\",\"PDX166\",\"PDX53\",\"PDT154\",\"PDX167\",\"PDX323\",\"PDX55\",\"PDX348\",\"PDX171\",\"PDX334\",\"PDT52\",\"PDT66\",\"PDX99\",\"PDX20\",\"PDX79\",\"PDX26\",\"PDX180\",\"PDX339\",\"PDX324\",\"PDX25\",\"PDT173\",\"PDX64\",\"PDT179\",\"PDX186\",\"PDX333\",\"PDX109\",\"PDX157\",\"PDT204\",\"PDX176\",\"PDX1\",\"PDX349\",\"PDX343\",\"PDT110\",\"PDX170\",\"PDX29\",\"PDX92\",\"PDX328\",\"PDX159\",\"PDX114\",\"PDX160\",\"PDX61\",\"PDX191\",\"PDX193\",\"PDT61\",\"PDX326\",\"PDX112\",\"PDX331\",\"PDX58\",\"PDX345\",\"PDX174\",\"PDT202\",\"PDT58\",\"PDX188\",\"PDX77\",\"PDX172\",\"PDX341\",\"PDX347\",\"PDX316\",\"PDT90\",\"PDX90\",\"PDX310\",\"PDX155\",\"PDT4\",\"PDX203\",\"PDX178\",\"PDT56\",\"PDX56\",\"PDX181\",\"PDX335\",\"PDX27\",\"PDX338\",\"PDX162\",\"PDT170\",\"PDX68\",\"PDX23\",\"PDX105\",\"PDX205\",\"PDX321\",\"PDX106\",\"PDX22\",\"PDX336\",\"PDX322\",\"PDT53\",\"PDX320\",\"PDX318\",\"PDX337\",\"PDX52\",\"PDT55\",\"PDX169\",\"PDX107\",\"PDX66\",\"PDX85\",\"PDT171\",\"PDX070\",\"PDX164\",\"PDX116\",\"PDT109\",\"PDX110\",\"PDX163\",\"PDT64\",\"PDX317\",\"PDX340\",\"PDX179\",\"PDX4\",\"HES400\",\"PDX192\",\"PDX327\",\"PDX173\",\"PDX204\",\"PDX346\",\"PDX154\"],\"normalizedCityName\":\"Boardman\"}","{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sparks\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, Sparks\",\"coordinates\":\"39.54115,-119.74832\",\"normalizedCountyName\":\"Washoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sparks, Nevada, USA\",\"location\":\"US, NV, Sparks\",\"region\":\"NV\",\"buildingCodeList\":[\"RNO143\",\"RNO157\",\"RNO160\",\"VUGV\",\"RNO100\",\"RNO109\",\"RNO141\",\"SVMT19\",\"RNO147\",\"RNO102\",\"RNO150\",\"RNO153\",\"RNO159\",\"RNO106\",\"RNO155\",\"RNO110\",\"RNO154\",\"RNO101\",\"RNO107\",\"RNO145\",\"RNO144\",\"RNO158\",\"RNO25\",\"RNO111\",\"RNO108\",\"RNO140\",\"RNO146\",\"RNO156\",\"RNO105\",\"RNO152\",\"RNO104\",\"RNO149\",\"RNO151\",\"RNO103\",\"VUAY\",\"RNO142\",\"RNO148\"],\"normalizedCityName\":\"Sparks\"}","{\"normalizedStateName\":\"Oregon\",\"normalizedCountryCode\":\"USA\",\"city\":\"Umatilla\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OR, Umatilla\",\"coordinates\":\"45.91768,-119.34203\",\"normalizedCountyName\":\"Umatilla\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Umatilla, Oregon, USA\",\"location\":\"US, OR, Umatilla\",\"region\":\"OR\",\"buildingCodeList\":[\"PDX121\",\"PDT122\",\"PDX135\",\"PDT69\",\"PDX133\",\"PDX2\",\"PDX201\",\"PDX199\",\"PDT51\",\"PDX96\",\"PDX51\",\"PDX123\",\"PDX195\",\"PDX57\",\"PDT196\",\"PDX127\",\"PDX130\",\"PDX126\",\"PDX128\",\"PDT60\",\"PDX194\",\"PDT65\",\"PDX131\",\"PDX200\",\"PDT2\",\"PDX137\",\"PDX78\",\"PDX071\",\"PDT197\",\"PDX54\",\"PDT54\",\"PDX134\",\"PDX198\",\"PDX122\",\"PDX136\",\"PDX196\",\"PDT195\",\"PDX132\",\"PDT130\",\"PDX60\",\"PDX100\",\"PDX125\",\"PDX124\",\"PDT194\",\"PDX197\"],\"normalizedCityName\":\"Umatilla\"}","{\"normalizedStateName\":\"Oregon\",\"normalizedCountryCode\":\"USA\",\"city\":\"Hermiston\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OR, Hermiston\",\"coordinates\":\"45.84051,-119.28947\",\"normalizedCountyName\":\"Umatilla\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Hermiston, Oregon, USA\",\"location\":\"US, OR, Hermiston\",\"region\":\"OR\",\"buildingCodeList\":[\"PDX65\",\"PDX150\",\"PDX147\",\"PDX80\",\"PDX149\",\"PDT67\",\"PDX94\",\"PDX98\",\"PDX63\",\"PDX69\",\"PDX82\",\"PDX141\",\"PDX139\",\"PDX142\",\"LCK60\",\"PDX89\",\"PDX75\",\"PDX138\",\"PDX143\",\"PDX152\",\"PDX74\",\"PDX81\",\"PDX148\",\"PDX83\",\"PDX151\",\"PDX146\",\"PDX119\",\"PDX76\",\"PDX144\",\"PDX153\",\"PDX88\",\"PDX87\",\"PDX86\",\"PDX140\",\"PDX145\",\"PDX67\"],\"normalizedCityName\":\"Hermiston\"}"],"normalized_location":"Umatilla, Oregon, USA","optional_search_labels":["military","aws.team-dc","hourly","aws.team-ais"],"posted_date":"January 20, 2026","preferred_qualifications":"- 4+ years of data center engineering experience\u003cbr/\u003e- Bachelor's degree in Electrical Engineering, Mechanical Engineering, or a related field\u003cbr/\u003e- Experience in data center engineering\u003cbr/\u003e- Experience with reading and writing procedures, technical documents, and engineering drawings\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NV, Reno - 37.00 - 65.00 USD hourly\u003cbr/\u003eUSA, NV, SPARKS - 37.00 - 65.00 USD hourly\u003cbr/\u003eUSA, NV, Sparks - 37.00 - 65.00 USD hourly\u003cbr/\u003eUSA, OR, Boardman - 37.00 - 65.00 USD hourly\u003cbr/\u003eUSA, OR, Hermiston - 37.00 - 65.00 USD hourly\u003cbr/\u003eUSA, OR, Umatilla - 37.00 - 65.00 USD hourly\u003cbr/\u003eUSA, WA, Attalia - 37.00 - 65.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"OR","title":"Engineering Operations Technician, DCC Communities ","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3162849/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical, or 1+ years of data center or mission critical facilities (example: hospital, military facility, public safety facility, etc.) experience\u003cbr/\u003e- 1+ years of Microsoft Office products and applications experience\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Umatilla","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"53c395aa-6b6d-4eb1-8cbc-1383b163445b","id_icims":"3162704","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3162704/engineering-operations-technician-dcc-communities","job_schedule_type":"full-time","location":"US, OR, Umatilla","locations":["{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Canton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Canton\",\"coordinates\":\"32.61258,-90.03472\",\"normalizedCountyName\":\"Madison\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Canton, Mississippi, USA\",\"location\":\"US, MS, Canton\",\"region\":\"MS\",\"buildingCodeList\":[\"JAN300\",\"JAN100\",\"JAN200\",\"VCB3\",\"JAN312\",\"JAN301\",\"JAN150\",\"JAN310\",\"JAN1\",\"JAN304\",\"JAN350\",\"JAN311\"],\"normalizedCityName\":\"Canton\"}","{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sparks\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, Sparks\",\"coordinates\":\"39.54115,-119.74832\",\"normalizedCountyName\":\"Washoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sparks, Nevada, USA\",\"location\":\"US, NV, Sparks\",\"region\":\"NV\",\"buildingCodeList\":[\"RNO144\",\"RNO158\",\"RNO25\",\"RNO143\",\"RNO157\",\"RNO111\",\"RNO160\",\"VUGV\",\"RNO100\",\"RNO109\",\"RNO141\",\"RNO108\",\"SVMT19\",\"RNO147\",\"RNO102\",\"RNO140\",\"RNO146\",\"RNO150\",\"RNO156\",\"RNO153\",\"RNO159\",\"RNO105\",\"RNO152\",\"RNO104\",\"RNO149\",\"RNO151\",\"RNO49\",\"RNO103\",\"RNO106\",\"RNO155\",\"RNO110\",\"VUAY\",\"RNO154\",\"RNO101\",\"RNO107\",\"RNO142\",\"RNO145\",\"RNO148\"],\"normalizedCityName\":\"Sparks\"}","{\"normalizedStateName\":\"Oregon\",\"normalizedCountryCode\":\"USA\",\"city\":\"Umatilla\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OR, Umatilla\",\"coordinates\":\"45.91768,-119.34203\",\"normalizedCountyName\":\"Umatilla\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Umatilla, Oregon, USA\",\"location\":\"US, OR, Umatilla\",\"region\":\"OR\",\"buildingCodeList\":[\"PDX121\",\"PDT122\",\"PDT197\",\"PDX135\",\"PDX54\",\"PDT54\",\"PDX134\",\"PDT69\",\"PDX198\",\"PDX122\",\"PDX136\",\"PDX196\",\"PDX133\",\"PDT195\",\"PDX132\",\"PDX2\",\"PDX201\",\"PDX199\",\"PDT51\",\"PDX96\",\"PDX51\",\"PDX123\",\"PDX195\",\"PDX57\",\"PDT196\",\"PDX127\",\"PDT130\",\"PDX130\",\"PDX126\",\"PDX60\",\"PDX100\",\"PDX125\",\"PDX128\",\"PDT60\",\"PDX124\",\"PDX194\",\"PDT194\",\"PDT65\",\"PDX131\",\"PDX200\",\"PDT2\",\"PDX137\",\"PDX78\",\"PDX197\",\"PDX071\"],\"normalizedCityName\":\"Umatilla\"}","{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Fairless Hills\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Fairless Hills\",\"coordinates\":\"40.17334,-74.85369\",\"normalizedCountyName\":\"Bucks\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Fairless Hills, Pennsylvania, USA\",\"location\":\"US, PA, Fairless Hills\",\"region\":\"PA\",\"buildingCodeList\":[\"PNE106\",\"PNE110\",\"PNE105\",\"PNE108\",\"PNE109\",\"PNE103\",\"DPL4\",\"PNE112\",\"PNE100\",\"PNE102\",\"PNE113\",\"PNE111\",\"PNE107\",\"PNE101\",\"PNE104\"],\"normalizedCityName\":\"Fairless Hills\"}"],"normalized_location":"Umatilla, Oregon, USA","optional_search_labels":["aws.team-ais","aws.team-dc","hourly","military"],"posted_date":"January 20, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MS, Canton - 29.00 - 51.00 USD hourly\u003cbr/\u003eUSA, NV, SPARKS - 32.00 - 57.00 USD hourly\u003cbr/\u003eUSA, NV, Sparks - 31.00 - 55.00 USD hourly\u003cbr/\u003eUSA, NV, Sparks - 32.00 - 57.00 USD hourly\u003cbr/\u003eUSA, OR, Umatilla - 32.00 - 57.00 USD hourly\u003cbr/\u003eUSA, PA, FAIRLESS HILLS - 32.00 - 57.00 USD hourly\u003cbr/\u003eUSA, PA, Fairless Hills - 32.00 - 57.00 USD hourly\u003cbr/\u003eUSA, WA, Attalia - 32.00 - 57.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"OR","title":"Engineering Operations Technician, DCC Communities ","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3162704/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical, or 1+ years of data center or mission critical facilities (example: hospital, military facility, public safety facility, etc.) experience\u003cbr/\u003e- 1+ years experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Umatilla","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"83c647b5-3962-4d22-88be-62851e21c448","id_icims":"3161925","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3161925/engineering-operations-technician-dcc-communities","job_schedule_type":"full-time","location":"US, OR, Umatilla","locations":["{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"Reno\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, Reno\",\"coordinates\":\"39.52766,-119.81353\",\"normalizedCountyName\":\"Washoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Reno, Nevada, USA\",\"location\":\"US, NV, Reno\",\"region\":\"NV\",\"buildingCodeList\":[\"HRN2\",\"WFM293\",\"LSM7\",\"RNO404\",\"RNO400\",\"SVMT43\",\"RNO2\",\"HRN1\",\"DLV3\",\"KRNO\",\"SVMT18\",\"SVMT44\",\"RNO403\",\"RNO4\",\"DRN1\",\"SNV4\",\"SVMT45\"],\"normalizedCityName\":\"Reno\"}","{\"normalizedStateName\":\"Oregon\",\"normalizedCountryCode\":\"USA\",\"city\":\"Boardman\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OR, Boardman\",\"coordinates\":\"45.83987,-119.70238\",\"normalizedCountyName\":\"Morrow\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Boardman, Oregon, USA\",\"location\":\"US, OR, Boardman\",\"region\":\"OR\",\"buildingCodeList\":[\"PDX344\",\"PDT1\",\"PDX189\",\"PDX62\",\"PDT62\",\"PDX161\",\"PDX158\",\"PDX113\",\"PDX28\",\"PDT59\",\"PDX59\",\"PDX330\",\"PDX190\",\"PDX315\",\"PDT50\",\"PDX329\",\"PDX342\",\"PDX93\",\"PDT181\",\"PDX202\",\"PDX108\",\"PDT203\",\"PDX50\",\"PDT112\",\"PDT91\",\"PDX111\",\"PDX156\",\"PDX325\",\"PDX165\",\"PDX91\",\"PDX168\",\"PDX187\",\"PDX97\",\"PDX332\",\"PDX21\",\"PDT178\",\"PDX24\",\"PDT102\",\"PDX319\",\"PDT68\",\"PDX166\",\"PDX53\",\"PDT154\",\"PDX167\",\"PDX323\",\"PDX55\",\"PDX348\",\"PDX171\",\"PDX334\",\"PDT52\",\"PDT66\",\"PDX99\",\"PDX20\",\"PDX79\",\"PDX26\",\"PDX180\",\"PDX339\",\"PDX324\",\"PDX25\",\"PDT173\",\"PDX64\",\"PDT179\",\"PDX186\",\"PDX333\",\"PDX109\",\"PDX157\",\"PDT204\",\"PDX176\",\"PDX1\",\"PDX349\",\"PDX343\",\"PDT110\",\"PDX170\",\"PDX29\",\"PDX92\",\"PDX328\",\"PDX159\",\"PDX114\",\"PDX160\",\"PDX61\",\"PDX191\",\"PDX193\",\"PDT61\",\"PDX326\",\"PDX112\",\"PDX331\",\"PDX58\",\"PDX345\",\"PDX174\",\"PDT202\",\"PDT58\",\"PDX188\",\"PDX77\",\"PDX172\",\"PDX341\",\"PDX347\",\"PDX316\",\"PDT90\",\"PDX90\",\"PDX310\",\"PDX155\",\"PDT4\",\"PDX203\",\"PDX178\",\"PDT56\",\"PDX56\",\"PDX181\",\"PDX335\",\"PDX27\",\"PDX338\",\"PDX162\",\"PDT170\",\"PDX68\",\"PDX23\",\"PDX105\",\"PDX205\",\"PDX321\",\"PDX106\",\"PDX22\",\"PDX336\",\"PDX322\",\"PDT53\",\"PDX320\",\"PDX318\",\"PDX337\",\"PDX52\",\"PDT55\",\"PDX169\",\"PDX107\",\"PDX66\",\"PDX85\",\"PDT171\",\"PDX070\",\"PDX164\",\"PDX116\",\"PDT109\",\"PDX110\",\"PDX163\",\"PDT64\",\"PDX317\",\"PDX340\",\"PDX179\",\"PDX4\",\"HES400\",\"PDX192\",\"PDX327\",\"PDX173\",\"PDX204\",\"PDX346\",\"PDX154\"],\"normalizedCityName\":\"Boardman\"}","{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sparks\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, Sparks\",\"coordinates\":\"39.54115,-119.74832\",\"normalizedCountyName\":\"Washoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sparks, Nevada, USA\",\"location\":\"US, NV, Sparks\",\"region\":\"NV\",\"buildingCodeList\":[\"RNO143\",\"RNO157\",\"RNO160\",\"VUGV\",\"RNO100\",\"RNO109\",\"RNO141\",\"SVMT19\",\"RNO147\",\"RNO102\",\"RNO150\",\"RNO153\",\"RNO159\",\"RNO106\",\"RNO155\",\"RNO110\",\"RNO154\",\"RNO101\",\"RNO107\",\"RNO145\",\"RNO144\",\"RNO158\",\"RNO25\",\"RNO111\",\"RNO108\",\"RNO140\",\"RNO146\",\"RNO156\",\"RNO105\",\"RNO152\",\"RNO104\",\"RNO149\",\"RNO151\",\"RNO103\",\"VUAY\",\"RNO142\",\"RNO148\"],\"normalizedCityName\":\"Sparks\"}","{\"normalizedStateName\":\"Oregon\",\"normalizedCountryCode\":\"USA\",\"city\":\"Umatilla\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OR, Umatilla\",\"coordinates\":\"45.91768,-119.34203\",\"normalizedCountyName\":\"Umatilla\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Umatilla, Oregon, USA\",\"location\":\"US, OR, Umatilla\",\"region\":\"OR\",\"buildingCodeList\":[\"PDX121\",\"PDT122\",\"PDX135\",\"PDT69\",\"PDX133\",\"PDX2\",\"PDX201\",\"PDX199\",\"PDT51\",\"PDX96\",\"PDX51\",\"PDX123\",\"PDX195\",\"PDX57\",\"PDT196\",\"PDX127\",\"PDX130\",\"PDX126\",\"PDX128\",\"PDT60\",\"PDX194\",\"PDT65\",\"PDX131\",\"PDX200\",\"PDT2\",\"PDX137\",\"PDX78\",\"PDX071\",\"PDT197\",\"PDX54\",\"PDT54\",\"PDX134\",\"PDX198\",\"PDX122\",\"PDX136\",\"PDX196\",\"PDT195\",\"PDX132\",\"PDT130\",\"PDX60\",\"PDX100\",\"PDX125\",\"PDX124\",\"PDT194\",\"PDX197\"],\"normalizedCityName\":\"Umatilla\"}","{\"normalizedStateName\":\"Oregon\",\"normalizedCountryCode\":\"USA\",\"city\":\"Hermiston\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OR, Hermiston\",\"coordinates\":\"45.84051,-119.28947\",\"normalizedCountyName\":\"Umatilla\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Hermiston, Oregon, USA\",\"location\":\"US, OR, Hermiston\",\"region\":\"OR\",\"buildingCodeList\":[\"PDX65\",\"PDX150\",\"PDX147\",\"PDX80\",\"PDX149\",\"PDT67\",\"PDX94\",\"PDX98\",\"PDX63\",\"PDX69\",\"PDX82\",\"PDX141\",\"PDX139\",\"PDX142\",\"LCK60\",\"PDX89\",\"PDX75\",\"PDX138\",\"PDX143\",\"PDX152\",\"PDX74\",\"PDX81\",\"PDX148\",\"PDX83\",\"PDX151\",\"PDX146\",\"PDX119\",\"PDX76\",\"PDX144\",\"PDX153\",\"PDX88\",\"PDX87\",\"PDX86\",\"PDX140\",\"PDX145\",\"PDX67\"],\"normalizedCityName\":\"Hermiston\"}"],"normalized_location":"Umatilla, Oregon, USA","optional_search_labels":["aws.team-ais","aws.team-dc","hourly","military"],"posted_date":"January 20, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NV, Reno - 32.00 - 57.00 USD hourly\u003cbr/\u003eUSA, NV, SPARKS - 32.00 - 57.00 USD hourly\u003cbr/\u003eUSA, NV, Sparks - 32.00 - 57.00 USD hourly\u003cbr/\u003eUSA, OR, Boardman - 32.00 - 57.00 USD hourly\u003cbr/\u003eUSA, OR, Hermiston - 32.00 - 57.00 USD hourly\u003cbr/\u003eUSA, OR, Umatilla - 32.00 - 57.00 USD hourly\u003cbr/\u003eUSA, WA, Attalia - 32.00 - 57.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"OR","title":"Engineering Operations Technician, DCC Communities ","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3161925/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}