{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 2+ years of relevant work experience\u003cbr/\u003e- Experience in relevant work","business_category":"aws","city":"Fairless Hills","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAWS has the world’s largest cloud computing portfolio. As an Amazonian you will work in some of the most sophisticated, safe, and secure data centers in the world. Our Engineering Operations Technicians (EOT’s) help keep them that way by working with the brightest minds from around the globe to help test and implement the newest technology and work practices to meet the demands of a changing market.\u003cbr/\u003e\u003cbr/\u003eWe have a passion for learning and evolving, it’s how we have helped define ourselves as leaders in the industry. Let’s work hard, have fun, and make history!\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"403c5b83-2a40-4e37-b2df-3f59bbf2a8e6","id_icims":"3102603","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3102603/data-center-engineering-operations-technician-data-center-ops","job_schedule_type":"full-time","location":"US, PA, Fairless Hills","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Fairless Hills\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Fairless Hills\",\"coordinates\":\"40.17334,-74.85369\",\"normalizedCountyName\":\"Bucks\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Fairless Hills, Pennsylvania, USA\",\"location\":\"US, PA, Fairless Hills\",\"region\":\"PA\",\"buildingCodeList\":[\"PNE102\"],\"normalizedCityName\":\"Fairless Hills\"}"],"normalized_location":"Fairless Hills, Pennsylvania, USA","optional_search_labels":["military","aws.team-dc","hourly","aws.team-ais"],"posted_date":"October  6, 2025","preferred_qualifications":"- 2+ years of Microsoft Office including Outlook, Word, and Excel experience\u003cbr/\u003e- High school or equivalent\u003cbr/\u003e- Technical (Military/Trade School) training or 2+ years of electrical or mechanical, HVAC, fire system experience in a mission-critical infrastructure or equivalent experience in a relevant industry (for example: electrical or mechanical) 2+ years of electrical or mechanical experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $68,300/year in our lowest geographic market up to $152,700/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"PA","title":"Data Center Engineering Operations Technician, Data Center Ops","university_job":null,"updated_time":"1 minute","url_next_step":"https://account.amazon.com/jobs/3102603/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of Microsoft Office products and applications experience\u003cbr/\u003e- 3+ years of mission critical facilities (example: hospital, military facility, public safety facility, etc.) experience including industrial electrical and mechanical systems\u003cbr/\u003e- Experience with reading and writing procedures, technical documents, and engineering drawings","business_category":"aws","city":"Newalbany","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic Data Center Engineering Operations Team and become a critical architect of the infrastructure that powers global cloud computing. You'll play a pivotal role in maintaining the heartbeat of Amazon Web Services' physical infrastructure, ensuring seamless operations that support millions of customers worldwide. \u003cbr/\u003e\u003cbr/\u003eThe Data Center Chief Engineer (CE) is responsible for ensuring that all electrical, mechanical, and fire/life safety equipment within the data center is operating at peak efficiency. This involves planned preventative maintenance of equipment, daily corrective work, and emergency response. The CE serves as an expert technical resource interacting with onsite Engineering Operations Technicians (EOT) and any third-party vendors. They are expected to be a singular focal point for all facility operations within a given data center and to support AWS.  \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.  \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.  \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role.  \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position.  \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAct as the primary escalation point for all facilities-related issues. Oversee operation and management of routine and emergency services on a variety of critical systems such as switchgear, generators, UPS systems, power distribution equipment, chillers, cooling towers, computer room air handlers, building monitoring systems, etc. \u003cbr/\u003e\u003cbr/\u003ePerform root cause analysis of equipment failures and troubleshooting of facility within internal Service Level Agreements (SLA). \u003cbr/\u003e\u003cbr/\u003eProvide training and guidance to Engineering Operations Technicians and are responsible for working with Facility Manager (FM) to set team culture. \u003cbr/\u003e\u003cbr/\u003eCreate and deploy new standard practices for Engineering Operations Technicians, Chief Engineers, and vendor support teams \u003cbr/\u003e\u003cbr/\u003eMay assist in the building out of new facilities and assist in projects to increase current facility efficiency \u003cbr/\u003e\u003cbr/\u003eWorking outside of normal business hours for routine maintenance as required, including responding to out-of-hours emergency calls. \u003cbr/\u003e\u003cbr/\u003eCommunicate complex technical information to a non-technical audience. \u003cbr/\u003e\u003cbr/\u003eWork with IT managers and other business leaders to coordinate projects, manage capacity, and optimize plant safety, performance, reliability and efficiency \u003cbr/\u003e\u003cbr/\u003eEnsure all safety procedures are adhered to by vendor and Amazon staff \u003cbr/\u003e\u003cbr/\u003eEstablish building performance benchmarks, conduct analyses, and prepare reports on all aspects of the critical facility operations and maintenance. \u003cbr/\u003e\u003cbr/\u003eUtilize Microsoft Excel, Word, Outlook and other basic administrative tools to perform day-to-day tasks \u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodation: \u003cbr/\u003e\u003cbr/\u003eRegularly lift and/or move up to 39 pounds independently \u003cbr/\u003e\u003cbr/\u003eParticipate in group lifts for 40+ pounds \u003cbr/\u003e\u003cbr/\u003eMaintain balance and perform construction tasks while on a ladder \u003cbr/\u003e\u003cbr/\u003eRegularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position \u003cbr/\u003e\u003cbr/\u003eWork in an environment requiring provided ear protection \u003cbr/\u003e\u003cbr/\u003e \u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003eAbility to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003eWillingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003eTravel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003e\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic Data Center Engineering Operations Team and become a critical architect of the infrastructure that powers global cloud computing. You'll play a pivotal role in maintaining the heartbeat","display_distance":null,"id":"d52c1374-e73a-4548-adcc-f4de40061c3a","id_icims":"3153048","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3153048/data-center-chief-engineer-dceo","job_schedule_type":"full-time","location":"US, OH, Newalbany","locations":["{\"normalizedStateName\":\"Ohio\",\"normalizedCountryCode\":\"USA\",\"city\":\"Newalbany\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OH, Newalbany\",\"coordinates\":\"40.08131,-82.80885\",\"normalizedCountyName\":\"Franklin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New Albany, Ohio, USA\",\"location\":\"US, OH, Newalbany\",\"region\":\"OH\",\"buildingCodeList\":[\"CMH101\"],\"normalizedCityName\":\"New Albany\"}"],"normalized_location":"New Albany, Ohio, USA","optional_search_labels":["aws.team-dc","operations.team-infrastructure","military-na","military","military-leadership","aws.team-ais"],"posted_date":"January  6, 2026","preferred_qualifications":"- Experience in construction or project management\u003cbr/\u003e- Data center engineering operation experience\u003cbr/\u003e- Experience leading technical teams through daily operations and maintenance evolutions\u003cbr/\u003e- Must be able to work in an environment that involves walking, stooping, bending, and climbing to access equipment.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, OH, Newalbany - 96,000.00 - 166,300.00 USD annually","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"OH","title":"Data Center Chief Engineer , DCEO","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3153048/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- 2+ years experience in a management position with 5 or more direct reports\u003cbr/\u003e- 2+ years of relevant work experience in a data center or other mission critical environment with knowledge in UPS, Generators, HVAC, Evaporators and other critical infrastructure OR 7+ years of Technical (Military/Trade School) training and/or experience","business_category":"aws","city":"New Carlisle","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eWe are seeking an Data Center Facility Manager to serve as a technical resource and leader within Amazon data centers. The position will help ensure overall availability and reliability to meet or exceed defined service levels of data center operations. The Data Center Facility Manager is responsible for the overall operation and maintenance of all electrical, mechanical, and HVAC equipment within the data center. The Data Center Facility Manager will assist in maintaining a high reliability and performance while keeping operating costs in facilities at a minimum. This equipment supports mission-critical servers and must maintain better than 99.999% uptime.\u003cbr/\u003e\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot mission-critical data center facility equipment including electrical support equipment such as stand-by diesel generators and related fuel systems, 3 phase electrical systems that include but not limited to switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAC units, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire suppression systems, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e  -  Oversee all aspects of the data center's critical physical  infrastructure.  Ensure that all work performed within the space is done  to high quality and without impact to internal/external customers\u003cbr/\u003e  - Manage teams of 24x7 engineering technicians in all facets of their career\u003cbr/\u003e   - Engage in improvement projects, often requiring reaching out to a  variety of support teams, and drive them from conception to completion\u003cbr/\u003e  - Coordinates daily with a multitude of third party vendors ensuring adherence to contracted SLAs\u003cbr/\u003e  - Effectively and efficiently manage the operations budget and expenditures\u003cbr/\u003e   - Routinely operate as the afterhours on-call Data Center Facility  Manager for the data centers in the region.  This will include  responding to any issues within the data centers and managing the  investigation, mitigation, and recovery of the issue(s)\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs the Facility Manager, your role demonstrates a strong commitment to prioritizing the development and well-being of team members, as well as fostering diversity and inclusion. You will oversee all facets of the data center's critical infrastructure with a focus on continuous availability and optimal performance, while upholding high-quality standards and minimizing any impact on internal and external customers. Additionally, you will play a crucial role in process optimization, staff management, setting performance metrics, and driving continuous improvement initiatives, all while ensuring a supportive and inclusive work environment.\u003cbr/\u003e\u003cbr/\u003e- Manage teams of 24x7 engineering technicians: Prioritize and assign tasks, coach and create documentation, guide and train staff on best practices.\u003cbr/\u003e- Effectively and efficiently manage operations budget: Monitor and control expenditures, ensure optimal resource allocation.\u003cbr/\u003e- Engage in improvement projects: Drive projects from conception to completion, collaborate with support teams.\u003cbr/\u003e- Coordinate with third-party vendors: Ensure adherence to contracted service level agreements (SLAs).\u003cbr/\u003e- Communicate complex technical information: Adapt communication style for diverse stakeholders, including non-technical audiences.\u003cbr/\u003e- Respond to out-of-hours emergency calls: Address urgent issues that may arise outside regular working hours.\u003cbr/\u003e- Act as an escalation point for facilities-related issues: Oversee routine and emergency services, ensure safety procedures are followed.\u003cbr/\u003e- Deliver operational excellence: Prioritize team development and well-being while achieving operational goals.\u003cbr/\u003e- Foster a diverse and inclusive team culture: Empower team members to reach their full potential.\u003cbr/\u003e- Perform physical tasks: Lift and move objects of varying weights, walk job sites in different terrains while maintaining balance and safety.\u003cbr/\u003e- Promote accessible work environments: Support employees' diverse needs.\u003cbr/\u003e- Work in noisy environments when required: Utilize approved personal protective equipment (PPE).\u003cbr/\u003e- Support multiple locations/sites: Coordinate and manage operations across different sites.\u003cbr/\u003e- Provide on-site management for builders, five days a week. (No remote work)\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"1363d23f-e979-42fc-a39b-3d164d046ed3","id_icims":"3101333","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3101333/data-center-facility-manager-data-center-community","job_schedule_type":"full-time","location":"US, IN, New Carlisle","locations":["{\"normalizedStateName\":\"Indiana\",\"normalizedCountryCode\":\"USA\",\"city\":\"New Carlisle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, IN, New Carlisle\",\"coordinates\":\"41.70584,-86.51309\",\"normalizedCountyName\":\"St Joseph\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New Carlisle, Indiana, USA\",\"location\":\"US, IN, New Carlisle\",\"region\":\"IN\",\"buildingCodeList\":[\"SBN103\"],\"normalizedCityName\":\"New Carlisle\"}"],"normalized_location":"New Carlisle, Indiana, USA","optional_search_labels":["military","aws.team-dc","aws.team-ais"],"posted_date":"October  5, 2025","preferred_qualifications":"- Bachelor's degree in electrical or mechanical engineering, engineering technology or equivalent\u003cbr/\u003e- 3+ years experience in a management position with 5 or more direct reports\u003cbr/\u003e- 5+ years experience working in a data center or other mission critical environment with an emphasis on building and equipment operation\u003cbr/\u003e- An excellent understanding of the electrical and mechanical systems involved in critical data center operations including systems such as feeders, transformers, generators, switchgear, UPS systems, ATS units, PDU units, chillers, pumps, air handling units, and CRAHU units\u003cbr/\u003e- Strong verbal and written communication skills, technical writing or business justifications (white paper experience)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, IN, New Carlisle - 109,600.00 - 160,000.00 USD annually","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"IN","title":"Data Center Facility Manager, Data Center Community","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/3101333/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 4+ years of management experience\u003cbr/\u003e- Experience with large scale mechanical and power systems\u003cbr/\u003e- Bachelor's degree in Electrical Engineering, Mechanical Engineering, or a related field\u003cbr/\u003e- Knowledge of the electrical and mechanical systems involved in critical data center operations including systems such as feeders, transformers, generators, switchgear, UPS systems, ATS units, PDU units, chillers, pumps, air handling units, and CRAC units\u003cbr/\u003e- Experience hiring, developing, and managing high-performing technical teams","business_category":"aws","city":"Berwick","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eWe are seeking an experienced Data Center Engineering Operations (DCEO) Cluster Manager to oversee the operational excellence of multiple data centers within our regional infrastructure. This role combines technical leadership, operational management, and strategic planning to ensure optimal performance of our data center operations.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Lead and manage multiple data centers within a region, ensuring 24/7 operational reliability\u003cbr/\u003e• Develop and implement standard operating procedures (SOPs) for cluster operations\u003cbr/\u003e• Manage a team of data center facility managers, chief engineers, and technicians\u003cbr/\u003e• Coordinate with cross-functional teams on maintenance, upgrades, and expansion projects\u003cbr/\u003e• Monitor and optimize power usage effectiveness (PUE) and other key performance metrics\u003cbr/\u003e• Drive continuous improvement initiatives across cluster operations\u003cbr/\u003e• Ensure compliance with security protocols and industry standards\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"8d4ea22d-1961-4d56-9202-fa4f87de3810","id_icims":"3129020","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3129020/regional-dceo-manager-data-center-engg-ops","job_schedule_type":"full-time","location":"US, PA, Berwick","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Berwick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Berwick\",\"coordinates\":\"41.05089,-76.24352\",\"normalizedCountyName\":\"Columbia\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Berwick, Pennsylvania, USA\",\"location\":\"US, PA, Berwick\",\"region\":\"PA\",\"buildingCodeList\":[\"PHL100\"],\"normalizedCityName\":\"Berwick\"}"],"normalized_location":"Berwick, Pennsylvania, USA","optional_search_labels":["aws.team-dc","aws.team-ais","military"],"posted_date":"November 19, 2025","preferred_qualifications":"- Knowledge of building codes and regulations including Life Safety, BOCA, NFPA, NEC, and OSHA\u003cbr/\u003e- Experience with large-scale technical operations or large-scale compute farms\u003cbr/\u003e- Experience with process improvement techniques such as Kaizen, Lean Manufacturing or Six Sigma\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $137,900/year in our lowest geographic market up to $292,700/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"PA","title":"Regional DCEO Manager,  Data Center Engg Ops","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/3129020/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of program or project management experience\u003cbr/\u003e- 5+ years of supply chain experience\u003cbr/\u003e- Experience using data and metrics to determine and drive improvements\u003cbr/\u003e- Experience owning program strategy, end to end delivery, and communicating results to senior leadership","business_category":"retail","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Here at Amazon, we embrace our differences. We are committed to furthering our culture of diversity and inclusion of our teams within the organization.\u003cbr/\u003eHow do you get items to customers quickly, cost-effectively, and—most importantly—safely, in less than an hour? And how do you do it in a way that can scale? Our teams of hundreds of scientists, engineers, aerospace professionals, and futurists have been working hard to do just that! We are delivering to customers, and are excited for what’s to come. Check out more information about Prime Air on the About Amazon blog (https://www.aboutamazon.com/news/transportation/amazon-prime-air-delivery-drone-reveal-photos).\u003cbr/\u003eIf you are seeking an iterative environment where you can drive innovation, apply state-of-the-art technologies to solve real world delivery challenges, and provide benefits to customers, Prime Air is the place for you.\u003cbr/\u003eCome work on the Amazon Prime Air Team!\u003cbr/\u003e\u003cbr/\u003ePrime Air is seeking an experienced Sr. Global Commodity Manager to join our team. This is an exciting opportunity to be a part of a team that has a meaningful, measurable impact on company success.\u003cbr/\u003e\u003cbr/\u003eExport Control License: This position may require a deemed export control license for compliance with applicable laws and regulations. Placement is contingent on Amazon’s ability to apply for and obtain an export control license on your behalf.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tDesign and implement comprehensive supply chain and commodity strategies across multiple categories and regions, focusing on both strategic network optimization and tactical execution\u003cbr/\u003e\u003cbr/\u003e•\tLead complex initiatives autonomously, developing innovative solutions for undefined problems while managing cross-functional relationships with significant organizational impact\u003cbr/\u003e\u003cbr/\u003e•\tCreate and implement scalable processes that drive efficiency, optimize costs, and enhance supply chain resilience across the network\u003cbr/\u003e\u003cbr/\u003e•\tAnalyze market trends, pricing dynamics, and supply-demand patterns to identify opportunities and implement data-driven solutions that improve performance\u003cbr/\u003e\u003cbr/\u003e•\tInfluence and drive decisions across multiple stakeholder levels, spanning multiple organizations\u003cbr/\u003e•\tDevelop and maintain strategic relationships with internal teams and external suppliers, negotiating agreements and driving alignment to optimize productivity\u003cbr/\u003e•\tNavigate regulatory requirements and compliance issues, implementing risk mitigation strategies for long-term stability\u003cbr/\u003e•\tPresent strategic recommendations to senior leadership, clearly outlining trade-offs and impacts on competing metrics\u003cbr/\u003e•\tDrive best practices and standard work implementation across the organization, ensuring sustainable process improvements while balancing short-term delivery outputs with long-term strategic goals\u003cbr/\u003e•\tBe a Global Supply Chain advisor, facilitator, and integrator to internal stakeholders\u003cbr/\u003e","department_cost_center":null,"description_short":"Here at Amazon, we embrace our differences. We are committed to furthering our culture of diversity and inclusion of our teams within the organization.How do you get items to customers quickly, cost-effectively,","display_distance":null,"id":"589ff159-3d75-4a5a-81c8-dcc9b63daa8e","id_icims":"3040729","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Supply Chain Management","job_function_id":null,"job_path":"/en/jobs/3040729/sr-global-commodity-specialist-prime-air-global-commodity-management","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA109\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"July 22, 2025","preferred_qualifications":"- 2+ years of driving process improvements experience\u003cbr/\u003e- Master's degree, or MBA in business, operations, human resources, adult education, organizational development, instructional design or related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 115,400.00 - 160,000.00 USD annually","primary_search_label":"retail.team-global-prime-air","source_system":"JobCreator","state":"WA","title":"Sr Global Commodity Specialist, Prime Air- Global Commodity Management","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3040729/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-prime-air","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 4+ years of experience in programmatic advertising in a consultative role, providing hands-on customer service\u003cbr/\u003e- Experience in digital advertising and client facing roles\u003cbr/\u003e- Experience with annual brand and media planning\u003cbr/\u003e- Experience (technical and operational) with multiple domain areas of programmatic advertising technologies (DSP, RTB, bid shading, machine learning optimization, ad verification, ad tracking, ad attribution, bidding engines, second-price vs first-price auctions, pixel and tag managers, cookies, viewability, etc.)\u003cbr/\u003e- Experience in digital advertising and client facing roles with a focus on data analysis\u003cbr/\u003e- Experience owning relationships with programmatic decision makers\u003cbr/\u003e- Experience with annual brand planning and media planning\u003cbr/\u003e- Ability to effectively present to and confidently communicate with business-to-business (B2B) customers, including facilitating onboarding and training, or presenting plans to customer leadership (e.g. Head of Programmatic at an agency or advertiser)\u003cbr/\u003e- Bachelor’s degree in marketing, communications, or equivalent work experience\u003cbr/\u003e- Fluency in English","business_category":"advertising","city":"Culver City","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Ads is looking for a Programmatic Solutions Consultant to support customers using our demand-side platform, Amazon DSP.\u003cbr/\u003e\u003cbr/\u003eAs a Programmatic Solutions Consultant (PSC), you will manage the end-to-end experience of our enterprise customer, known as programmatic trading desks. You will drive success by developing customer expertise in our programmatic advertising DSP. The Programmatic Solutions Consultant has experience in advertising technology and the programmatic advertising domain, and is leveraging this expertise to help our customers meet and exceed their business objectives. In this customer-facing role, you will work closely with programmatic traders at agencies/advertisers, as well as Amazon Ads internal sales, product, and support teams to address customer needs.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Owning the relationship with programmatic trading desk managers, engaging with multiple customer organizational levels to understand business objectives\u003cbr/\u003e* Providing services such as onboarding, trade desk support plans, feature training, continuous product usage consultation, and industry best practices\u003cbr/\u003e* Analyzing and interpreting data to identify improvement areas, root causes, and formulate enablement and adoption recommendations\u003cbr/\u003e* Driving the evolution of Amazon DSP by assisting customers with product beta participation, capturing customer feedback, and collaborating closely with cross-functional Amazon teams (Product  Management, Engineering, Analytics, and Specialists)\u003cbr/\u003e* Defining and improving processes and tools for the Programmatic Solutions Consultant team to better serve customers\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eA typical PSC engagement with our customers could include onboarding new traders, delivering trainings on new product features, assisting a customer with a beta feature, consulting in business strategy and planning discussions, providing oversight in execution of campaign strategy, developing campaign optimization recommendations and monitoring their impact, conducting deep dives to determine root causes of issues and informing customers of the best course of action.\u003cbr/\u003e\u003cbr/\u003eYou will advocate for customer in internal forums, provide troubleshooting support and triage when needed, and simplify and propagate customer feedback to inform product and services design. PSCs operate as trusted advisors to customers every day, and ensure customers gradually develop into a proficient users of our DSP, who see Amazon DSP as their preferred means to their goals.\u003cbr/\u003e\u003cbr/\u003eYou will be passionate about understanding customer objectives, and address them using our book of services and engagement best practices, to drive adoption of Amazon technologies. Your ownership, curiosity, and domain knowledge will allow you to comprehensively understand the details of our offerings and be able to speak to these to our customers with passion, authority, empathy, and clarity.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Ads helps brands create experiences that delight customers and deliver meaningful results. With 300+ million worldwide active customer accounts, and first-party insights based on shopping, streaming and browsing signals, brands can craft relevant campaigns that enhance customer experiences. Our solutions on Amazon.com, services like Twitch, IMDb TV, Alexa, Amazon Music, and partnerships with third-party publishers and exchanges make Amazon Ads the ultimate amplifier for brands to reach the right audiences in the right places, both on and off Amazon. \u003cbr/\u003e\u003cbr/\u003eOur programmatic advertising platform, the Amazon Demand Side Platform (DSP), is becoming increasingly popular with major advertisers and agencies worldwide. We believe we understand e-commerce advertising better than anybody else and want to turn it into a science of its own that all users can leverage for their programmatic advertising.\u003cbr/\u003e\u003cbr/\u003eHere at Amazon Advertising, we embrace our differences. We are committed to furthering our culture of inclusion. We have 13 employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences. Amazon’s culture of inclusion is reinforced within our 14 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust. \u003cbr/\u003e\u003cbr/\u003eOur team puts a high value on work-life balance. We believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfilment. We offer flexibility in working hours and encourage you to find your own balance between your work and personal lives.\u003cbr/\u003e\u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded professional and enable them to take on more complex tasks in the future.","department_cost_center":null,"description_short":"Amazon Ads is looking for a Programmatic Solutions Consultant to support customers using our demand-side platform, Amazon DSP.As a Programmatic Solutions Consultant (PSC), you will manage the end-to-end","display_distance":null,"id":"1ba79755-149d-4da0-8564-da6a782586c5","id_icims":"3085658","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Account Management","job_function_id":null,"job_path":"/en/jobs/3085658/programmatic-solutions-consultant-psc-us","job_schedule_type":"full-time","location":"US, CA, Culver City","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Culver City\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Culver City\",\"coordinates\":\"34.02202,-118.39589\",\"normalizedCountyName\":\"Los Angeles\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Culver City, California, USA\",\"location\":\"US, CA, Culver City\",\"region\":\"CA\",\"buildingCodeList\":[\"LAX21\"],\"normalizedCityName\":\"Culver City\"}"],"normalized_location":"Culver City, California, USA","optional_search_labels":["advertising.team-sales"],"posted_date":"September 16, 2025","preferred_qualifications":"- Experience in e-commerce or online advertising\u003cbr/\u003e- Experience in omni-channel marketing, search engine marketing or search engine optimization\u003cbr/\u003e- Experience in digital analytics and/or DMP, CDP\u003cbr/\u003e- Vertical specialization (e.g. in entertainment, automotive, etc.) within programmatic advertising\u003cbr/\u003e- Proficient oral and written communication skills with ability to establish credibility with technical and non-technical business owners\u003cbr/\u003e- Organizational skills including prioritizing, scheduling, time management, and meeting deadlines\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Culver City - 72,600.00 - 119,700.00 USD annually","primary_search_label":"advertising.team-amazon-ads","source_system":"JobCreator","state":"CA","title":"Programmatic Solutions Consultant, PSC - US","university_job":null,"updated_time":"19 minutes","url_next_step":"https://account.amazon.com/jobs/3085658/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-ads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of manufacturing, process, industrial engineering experience\u003cbr/\u003e- 10+ years of engineering team management experience\u003cbr/\u003e- Bachelor's degree in Electronic Engineering, Computer Engineering, or a related field\u003cbr/\u003e- Experience in engineering team management\u003cbr/\u003e- Experience in manufacturing, process, or industrial engineering\u003cbr/\u003e- Experience developing and testing mechanical robotics equipment\u003cbr/\u003e- Experience in system-level integration\u003cbr/\u003e- Experience with DFx (cost, test, manufacturing)","business_category":"fulfillment-and-operations","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The Senior Manager of Hardware Development will lead the end-to-end design, development, validation, and industrialization of hardware platforms that enable Amazon’s next generation of last-mile delivery automation. This role owns the physical robot and vehicle-adjacent hardware systems that operate in complex, unstructured outdoor environments and directly impact customer experience, associate safety, and Amazon’s cost-to-serve.\u003cbr/\u003e\u003cbr/\u003eThis leader will manage multidisciplinary hardware teams spanning mechanical, electrical, thermal, compute, sensing, and manufacturing engineering, and will be accountable for translating business requirements into scalable, safety-certifiable hardware architectures. The role requires deep technical judgment to balance performance, reliability, safety, cost, and supply-chain resilience while operating under tight timelines from prototype through pilot and into high-volume production.\u003cbr/\u003e\u003cbr/\u003eThe Senior Manager will partner closely with autonomy, software, operations, safety, and supply-chain teams to ensure tight hardware–software co-design and smooth integration into Amazon’s broader last-mile technology ecosystem. They will drive design reviews, make one-way and two-way door decisions, own vendor strategy (including ODM/JDM and contract manufacturing), and establish robust validation and qualification processes across diverse operating conditions (weather, terrain, human interaction, and regulatory constraints).\u003cbr/\u003e\u003cbr/\u003eSuccess in this role means delivering hardware platforms that are not only technically excellent but also manufacturable at scale, serviceable in the field, and economically viable—enabling Amazon to safely deploy robotic delivery systems across cities, climates, and use cases while continuously improving reliability, safety metrics, and total cost of ownership.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eOwn end-to-end hardware delivery for last-mile delivery automation platforms, from architecture definition and prototype development through pilot deployment and high-volume production, ensuring performance, safety, reliability, cost, and scalability targets are met.\u003cbr/\u003e\u003cbr/\u003eLead and grow a multidisciplinary hardware organization, including mechanical, electrical, compute, sensing, thermal, reliability, and manufacturing engineering teams; set technical direction, operating mechanisms, and talent development plans.\u003cbr/\u003e\u003cbr/\u003eDefine hardware architecture and system tradeoffs, making high-judgment decisions across actuators, power systems, sensors, compute, structures, and thermal design to meet demanding outdoor ODD, safety certification, and autonomy requirements.\u003cbr/\u003e\u003cbr/\u003eDrive hardware–software co-design in close partnership with autonomy, perception, controls, and platform software teams to ensure seamless integration, clear ownership boundaries, and rapid iteration from lab to field.\u003cbr/\u003e\u003cbr/\u003eOwn vendor and supply-chain strategy, including ODM/JDM selection, contract manufacturing, component sourcing, and long-term cost-down roadmaps, while managing geopolitical, regulatory, and single-supplier risks.\u003cbr/\u003e\u003cbr/\u003eEstablish robust validation, verification, and qualification frameworks, covering environmental durability, reliability growth, safety, manufacturability, and serviceability across diverse weather, terrain, and human-interaction scenarios.\u003cbr/\u003e\u003cbr/\u003eLead safety-critical design and certification efforts, partnering with safety, legal, and regulatory teams to ensure compliance with applicable standards and to define Amazon-specific safety bars for operating in public spaces.\u003cbr/\u003e\u003cbr/\u003eOwn hardware cost and business outcomes, including BOM targets, yield, warranty exposure, field failure rates, and total cost of ownership, with clear mechanisms to link hardware decisions to Amazon’s cost-to-serve metrics.\u003cbr/\u003e\u003cbr/\u003eDrive cross-functional execution and alignment, coordinating with operations, deployment, field service, and last-mile technology teams to ensure hardware is operationally viable and scalable.\u003cbr/\u003e\u003cbr/\u003eRepresent hardware strategy at the executive level, clearly communicating tradeoffs, risks, milestones, and investment needs, and influencing roadmap and resourcing decisions across Amazon leadership.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Last Mile Delivery Automation Hardware team is responsible for building the physical platforms that enable safe, scalable, and cost-effective robotic delivery at Amazon. The team designs and delivers safety-critical hardware systems—including robots, compute and sensor platforms, power and actuation systems, and manufacturable mechanical architectures—that operate in complex, unstructured outdoor environments alongside customers, associates, and the public. Working closely with autonomy, software, operations, safety, and supply-chain partners, the team focuses on tight hardware–software co-design, rapid learning through pilots, and disciplined transition from prototype to high-volume production. Our mission is to turn robotics technology into reliable, serviceable products that can be deployed across cities, climates, and delivery use cases while continuously improving safety, customer experience, and Amazon’s cost to serve.","department_cost_center":null,"description_short":"The Senior Manager of Hardware Development will lead the end-to-end design, development, validation, and industrialization of hardware platforms that enable Amazon’s next generation of last-mile delivery","display_distance":null,"id":"654128f0-7d50-4086-b80e-0ea4efabc6d6","id_icims":"3151389","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/3151389/sr-manager-hardware-dev-last-mile-delivery-automation","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA94\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"January  2, 2026","preferred_qualifications":"- Master's degree in Mechanical or Electrical Engineering or a related field\u003cbr/\u003e- Knowledge of MS Excel, AutoCAD, MS Project, and software for technical document writing such as Visio, Word, or PowerPoint\u003cbr/\u003e- Experience in technical leadership of development, testing, and implementation of large-scale, complex technology projects\u003cbr/\u003e- Experience working as a technical lead\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Bellevue - 179,700.00 - 243,100.00 USD annually","primary_search_label":"fulfillment-and-operations.team-last-mile-delivery","source_system":"JobCreator","state":"WA","title":"Sr Manager, Hardware Dev, Last Mile Delivery Automation","university_job":null,"updated_time":"27 minutes","url_next_step":"https://account.amazon.com/jobs/3151389/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-delivery","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in finance, accounting, business, economics, engineering , analytics, mathematics, statistics or a related technical or quantitative field\u003cbr/\u003e- 3+ years of business or financial analysis experience\u003cbr/\u003e- 5+ years of Excel (including VBA, pivot tables, array functions, power pivots, etc.) and data visualization tools such as Tableau experience\u003cbr/\u003e- Experience defining requirements and using data and metrics to draw business insights\u003cbr/\u003e- Experience with data visualization using Tableau, Quicksight, or similar tools\u003cbr/\u003e- Experience with SQL\u003cbr/\u003e- Experience making business recommendations and influencing stakeholders","business_category":"alexa-and-amazon-devices","city":"Bellevue","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the capacity, flexibility, and performance to serve a wide range of customers, from individual households to schools, hospitals, businesses, government agencies, and other organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement: Due to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eThe Amazon Leo Electronic Supply Chain team is seeking a Business Analyst to lead development and implementation of improvements to our Business Intelligence and Visibility mechanisms.\u003cbr/\u003e\u003cbr/\u003eWorking closely with various internal teams, the Supply Chain Business Analyst will help develop and define the critical metrics for business operations, creating visibility dashboards, durable mechanisms, and executing one off queries and analyses to support business operations.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e-Coordinate with internal teams to define and document required metrics\u003cbr/\u003e-Work directly with suppliers to gather necessary data to develop and maintain data pipelines\u003cbr/\u003e-Partner with Business Intelligence Engineers to develop solutions to meet business intelligence requirements\u003cbr/\u003e-Develop, Publish, and Improve QuickSight dashboards to enhance visibility within the Kuiper Supply Chain\u003cbr/\u003e-Perform ongoing data validation checks to ensure that published data is accurate and actionable\u003cbr/\u003e-Support the Supply Chain team with training and act as a resource for team member questions as needed\u003cbr/\u003e-Proactively identify visibility needs for the Electronic Supply Chain leadership team\u003cbr/\u003e-Develop and publish a Electronic Supply Chain Business Intelligence roadmap and visibility framework to support long term planning and development.","department_cost_center":null,"description_short":"Amazon Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the","display_distance":null,"id":"58d37e08-c0b4-47c7-b16f-496bcceb48b0","id_icims":"3173336","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Planning/Development","job_function_id":null,"job_path":"/en/jobs/3173336/supply-chain-business-analyst-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA107\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":["devices-services.kuiper-prod-ops"],"posted_date":"February  3, 2026","preferred_qualifications":"- Master's degree in finance, accounting, business, economics, engineering , analytics, mathematics, statistics or a related technical or quantitative field\u003cbr/\u003e- Experience with QuickSight dashboard and visual creation\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Bellevue - 82,700.00 - 130,100.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Supply Chain Business Analyst, Amazon Leo","university_job":null,"updated_time":"33 minutes","url_next_step":"https://account.amazon.com/jobs/3173336/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Knowledge of statistics or other analytical techniques\u003cbr/\u003e- 6+ years experience in retail supply chain, vendor management, strategy consulting, or related fields\u003cbr/\u003e- 6+ years of proven track record of successfully leading and managing complex supply chain projects, preferably in a large-scale retail or e-commerce environment.\u003cbr/\u003e- Bachelor's degree in Supply Chain Management, Business Administration, or a related field.\u003cbr/\u003e- Demonstrated ability to set a strategy and manage multiple projects in a fast-paced environment - prioritization, planning and task delegation\u003cbr/\u003e- Strong analytical and problem-solving skills, with the ability to translate data insights into actionable supply chain strategies. Microsoft Excel and SQL preferred.\u003cbr/\u003e- Demonstrated ability to build and maintain strategic relationships with vendors and partners","business_category":"north-america-stores","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Are you ready to take your supply chain expertise to the next level? As an AVS Senior Strategic Supply Chain Manager, you will be at the forefront of strategic planning, execution, and optimization of Amazon's supply chain operations. In this influential role, you will lead high-impact projects and collaborate cross-functionally to drive business growth and deliver an exceptional customer experience. This position will work to continuously optimize operational metrics by working directly with a top tier Selling Partner (SP) and internal partner teams. The AVS Senior Strategic Supply Chain Manager serve as a key point of contact between Retail, Supply Chain, and Vendors and contribute to vendor-level operational strategy, annual negotiations, and opportunities to reduce cost and waste in the supply chain.\u003cbr/\u003e\u003cbr/\u003eJoin our dynamic team and play a pivotal role in shaping Amazon's supply chain operations to deliver exceptional customer experiences and drive business growth. Apply now to be a part of our innovative and forward-thinking supply chain management team!\u003cbr/\u003e\u003cbr/\u003eThe successful candidate must be highly organized, self-starting and possess strong data extraction and analytical capabilities. They must have proven successes in driving operational initiatives and demonstrate passion for the customer experience. They must be fearless but thoughtful in their pursuit of results and thrive in a high energy environment where tactical and strategic activities are expected to be driven in parallel. \u003cbr/\u003e \u003cbr/\u003eStrong candidates will have hands-on operations or inventory management experience and knowledge in fundamental business principles. Candidates must demonstrate the ability to succeed in managing a large catalog selection efficiently, identifying problems/finding solutions, and building/improving processes. The ideal candidate is able to lead and influence both internal and external teams in an ambiguous environment while maintaining a customer-centric philosophy.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e -Identifying and delivering improvement opportunities around demand and production planning\u003cbr/\u003e-Monitoring, analyzing and owning Vendor Key Performance Indicators such as: Out of Stock rate, Total Inbound lead time, confirmation rates, including presenting insights, themes and trends to Senior Leadership team.\u003cbr/\u003e-Strategically analyzing production and delivery lead-times, while optimizing operational excellence inputs such as EDI adoption, PO confirmations, efficient receive processes, and inventory placement.\u003cbr/\u003e- Spearheading initiatives to enhance cost structure and profitability, collaborating closely with partner teams to ensure successful execution.","department_cost_center":null,"description_short":"Are you ready to take your supply chain expertise to the next level? As an AVS Senior Strategic Supply Chain Manager, you will be at the forefront of strategic planning, execution, and optimization of","display_distance":null,"id":"ef775fb3-30d8-4a61-804c-40da4bd13dd5","id_icims":"3119250","is_intern":null,"is_manager":null,"job_category":"Buying, Planning, \u0026 Instock Management","job_family":"Buying/planning","job_function_id":null,"job_path":"/en/jobs/3119250/sr-strategic-supply-chain-mgr-amazon-vendor-services-consumables","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA71\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"October 31, 2025","preferred_qualifications":"- Experience with SQL\u003cbr/\u003e- MBA/Master's Degree\u003cbr/\u003e- Ability to problem solve creatively by adapting frameworks or existing best practices\u003cbr/\u003e- 3+ years of negotiations experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 121,200.00 - 163,900.00 USD annually","primary_search_label":"north-america-stores.consumables","source_system":"JobCreator","state":"WA","title":"Sr Strategic Supply Chain Mgr , Amazon Vendor Services - Consumables ","university_job":null,"updated_time":"34 minutes","url_next_step":"https://account.amazon.com/jobs/3119250/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"consumables","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent\u003cbr/\u003e- 2+ years of professional or military experience\u003cbr/\u003e- 2+ years of working with computers and Microsoft Office products and applications experience","business_category":"transportation-and-logistics","city":"Tempe","company_name":"Amazon.com Services LLC","country_code":"USA","description":"At Amazon, we’re working to be the most customer-centric company on Earth. Amazon’s North American Surface Transportation (NAST) Compliance Team is seeking a NAST Compliance Analyst to drive large scale projects, programs and technical initiatives within Amazon Middle Mile Transportation network.\u003cbr/\u003e\u003cbr/\u003eThis is an exciting space that is in the heart of North American Surface Transportation Safety \u0026 Compliance within Middle Mile. The team is comprised of subject matter experts who leverage transportation compliance administration with efforts to continually raise the bar on transportation services at Amazon.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Manage full lifecycle of complex cross-functional programs with considerable impact across multiple organizations.\u003cbr/\u003e• Build relationships with project stakeholders across key internal teams, stakeholder teams and external partners.\u003cbr/\u003e• Establish mechanisms that ensure highest levels of Amazon policies related to Department of Transportation regulations across our Middle Mile transportation network.\u003cbr/\u003e• Understand the deliverables of project stakeholders, critical path items, and effectively communicate status, potential risks, and delays.\u003cbr/\u003e• Be comfortable dealing with ambiguity and enjoy working on different problems every day.\u003cbr/\u003e• Develop, implement and govern KPI reporting for the portfolio of programs, providing visibility to the milestones and performance for all projects to the given stakeholders.\u003cbr/\u003e• Partner with teams across the business you support and beyond to source, allocate, and coordinate resources.\u003cbr/\u003e• Interact with 3rd party vendors to discuss performance metrics, service level agreements, contract negotiations, and daily workload volumes.\u003cbr/\u003e• Look for opportunities to improve program quality and operational excellence.\u003cbr/\u003e• Partner with other program managers to secure resources, scope efforts, and set project priorities and milestones.","department_cost_center":null,"description_short":"At Amazon, we’re working to be the most customer-centric company on Earth. Amazon’s North American Surface Transportation (NAST) Compliance Team is seeking a NAST Compliance Analyst to drive large scale","display_distance":null,"id":"eca3d181-c0d5-4c93-84cc-75c8569e92af","id_icims":"3173333","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Administrative Support","job_function_id":null,"job_path":"/en/jobs/3173333/compliance-analyst-north-american-surface-transportation-nast-compliance","job_schedule_type":"full-time","location":"US, AZ, Tempe","locations":["{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Tempe\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Tempe\",\"coordinates\":\"33.42554,-111.93722\",\"normalizedCountyName\":\"Maricopa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Tempe, Arizona, USA\",\"location\":\"US, AZ, Tempe\",\"region\":\"AZ\",\"buildingCodeList\":[\"AZA1\"],\"normalizedCityName\":\"Tempe\"}","{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Nashville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Nashville\",\"coordinates\":\"36.16792,-86.77798\",\"normalizedCountyName\":\"Davidson\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Nashville, Tennessee, USA\",\"location\":\"US, TN, Nashville\",\"region\":\"TN\",\"buildingCodeList\":[\"BNA12\"],\"normalizedCityName\":\"Nashville\"}","{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Atlanta\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Atlanta\",\"coordinates\":\"33.74831,-84.39111\",\"normalizedCountyName\":\"Fulton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Atlanta, Georgia, USA\",\"location\":\"US, GA, Atlanta\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL12\"],\"normalizedCityName\":\"Atlanta\"}"],"normalized_location":"Tempe, Arizona, USA","optional_search_labels":["hourly"],"posted_date":"February  3, 2026","preferred_qualifications":"- Knowledge of SQL\u003cbr/\u003e- 2+ years of data analysis and formula creation in Microsoft Excel experience\u003cbr/\u003e- Knowledge of a modern programming language (Ruby, Java, Python, or C#)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, AZ, Tempe - 23.00 - 34.00 USD hourly\u003cbr/\u003eUSA, GA, Atlanta - 23.00 - 34.00 USD hourly\u003cbr/\u003eUSA, TN, Nashville - 21.00 - 31.00 USD hourly","primary_search_label":"transportation-and-logistics.team-linehaul","source_system":"JobCreator","state":"AZ","title":"Compliance Analyst, North American Surface Transportation (NAST) Compliance","university_job":null,"updated_time":"34 minutes","url_next_step":"https://account.amazon.com/jobs/3173333/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-linehaul","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}