{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team","business_category":"entertainment","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"Join us in revolutionizing the future of Living Room device testing at Prime Video. Living Room Device Services (LRDS) enables automated testing across 800+ living room device types globally through our Device Farm infrastructure, providing programmatic control and remote access for Amazon teams worldwide. You'll be the technology leader developing AI-powered tools and AWS-based solutions that simplify test debugging, device access, and performance evaluation across our distributed device ecosystem.\u003cbr/\u003e\u003cbr/\u003eYou'll be at the forefront of building solutions for our Device Farm - a unique and sophisticated platform that enables automated testing across more than 800 devices across the hyper fragmented Living Room EcoSystem.\u003cbr/\u003e\u003cbr/\u003eYour impact will extend beyond just writing code - you'll be the bridge between our Device Farm customers and innovation, gathering valuable feedback and transforming it into enhanced features. Working with AWS technologies, you'll orchestrate a robust ecosystem of physical devices and virtual emulators, ensuring Prime Video delivers exceptional experiences to our Living Room Customers.\u003cbr/\u003e\u003cbr/\u003eIf you're passionate about solving complex problems, working with new innovative technology, and collaborating with global teams to shape the future of Living Room device testing, we want to hear from you. ","department_cost_center":null,"description_short":"Join us in revolutionizing the future of Living Room device testing at Prime Video. Living Room Device Services (LRDS) enables automated testing across 800+ living room device types globally through our","display_distance":null,"id":"5621536f-379c-4a86-9eec-4dbc2e65f000","id_icims":"3149019","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3149019/senior-software-development-engineer-prime-video-living-room-device-services","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR18\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"December 24, 2025","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"entertainment.team-primevideo","source_system":"JobCreator","state":"KA","title":"Senior Software Development Engineer, Prime Video, Living Room Device Services","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3149019/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-primevideo","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience managing efforts in developing data center focused projects of all sizes.\u003cbr/\u003e- 3+ Years experience in Data Center Engineering or Data Center Operations and 3+ Years experience in Construction Management     \u003cbr/\u003e- Strong verbal and written communication skills   and ability to maintain vendor relationships     \u003cbr/\u003e","business_category":"aws","city":"Dublin","company_name":"Amazon Data Services Ireland Limited","country_code":"IRL","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAt Amazon, we're working to be the most customer-centric company on earth! Amazon is a place where builders can build. We hire the world's brightest minds and offer them an environment in which they can invent and innovate to improve the experience for our customers. If you'd like to help us build, this is the job for you.   \u003cbr/\u003e   \u003cbr/\u003eWe are currently seeking an enthusiastic Data Center Project Manager to manage and deliver projects within Amazon data centers. You will be part of a highly creative, efficient team tasked with tackling challenging problems that come with delivering projects in a live data center. The Project Manager is ultimately  responsible for project oversight and review of all disciplines  including electrical,   mechanical, controls, and architectural. A  fundamental understanding of these systems is required, as the individual will be expected to   identify areas for improvement as well as act on data provided from other teams and organizations. Ideal  candidates will possess the ability identify and deploy innovative solutions to address operational challenges. This role requires both independent   contribution as well as the ability to work across stakeholder teams. The scope of projects will include but not limited to the improvement of electrical, mechanical, fire detection and building automation systems. The Project Manager is responsible for the overall direction, coordination, implementation,   control and completion of specific projects ensuring  consistency with company strategy, commitments and goals.    \u003cbr/\u003e\u003cbr/\u003eIf  you are passionate about the customer experience and you want to contribute to the operational  excellence of Amazon data centers then this may be the challenge  you’ve been looking for! \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Project  management and oversight of construction related activities within a live data center.\u003cbr/\u003e- Responsible for the delivery of the project scope, timeline, and budget.   \u003cbr/\u003e - Provide project management for specific initiatives aimed at increasing the resiliency of our data centers.   \u003cbr/\u003e - Electrical design and review of designs associated with the optimization of existing data centers.   \u003cbr/\u003e - Construction/project package drawing review.   \u003cbr/\u003e - Creation of project scope, request for proposals, and capital requests.   \u003cbr/\u003e - Total project quality including the oversight of the execution.   \u003cbr/\u003e - Recording and reporting key metrics to team members and management.   \u003cbr/\u003e - Concurrently managing multiple projects associated with existing data centers.   \u003cbr/\u003e - Operational support including review of procedures, best practices, and maintenance initiatives.   \u003cbr/\u003e - Drive teams to perform troubleshooting and root cause failure analysis associated with equipment or electrical failures.   \u003cbr/\u003e - Work with contractors and vendors to deliver efficient and high quality project turnovers.   \u003cbr/\u003e - Be a leader within the group as well as within internal and external teams that support the data center.   \u003cbr/\u003e - Travel to data center sites for engineering evaluations, electrical systems audits, and mechanical system   \u003cbr/\u003e - Strategic and tactical management of capacity delivery within their region.  \u003cbr/\u003e   \u003cbr/\u003eIn addition this individual must possess the following abilities:  \u003cbr/\u003e  - An ability and willingness to think outside of the box to find  creative and innovative solutions to reduce costs with no impact on quality and reliability.  \u003cbr/\u003e - The ability to perform complex business  case analysis to justify the project scope and present the justification  to management in a   high level review. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. ","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"6a76aad6-7574-442e-b5c6-c7469702213d","id_icims":"3021292","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3021292/data-center-electrical-mechanical-project-manager-critical-projects-implementation-cpi","job_schedule_type":"full-time","location":"IE, Dublin","locations":["{\"normalizedCountryCode\":\"IRL\",\"city\":\"Dublin\",\"countryIso3a\":\"IRL\",\"countryIso2a\":\"IE\",\"locationNonStemming\":\"Ireland, Dublin\",\"coordinates\":\"53.34807,-6.24827\",\"normalizedCountyName\":\"County Dublin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Ireland\",\"normalizedLocation\":\"Dublin, IRL\",\"location\":\"IE, Dublin\",\"region\":\"\",\"buildingCodeList\":[\"DUB54\"],\"normalizedCityName\":\"Dublin\"}"],"normalized_location":"Dublin, IRL","optional_search_labels":["aws.team-dc","aws.team-dcpd-optional"],"posted_date":"June 30, 2025","preferred_qualifications":"- College/Technical Degree or equivalent professional experience in  Engineering, or Technical Project Management. \u003cbr/\u003e- Direct and relevant experience in Data Center Engineering Operations, with a deep understanding of electrical and mechanical data center infrastructure     \u003cbr/\u003e- Track record for being detail-oriented with a demonstrated ability to self-motivate and follow-through on projects          \u003cbr/\u003e  \u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-support","source_system":"JobCreator","state":null,"title":"Data Center Electrical/Mechanical Project Manager, Critical Projects Implementation (CPI)","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3021292/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Abgeschlossene technische Berufsausbildung, anerkannt durch die Industrie- und Handelskammer (IHK) oder Handwerkskammer (HWK) oder Nachweis eines erfolgreich abgeschlossen Hochschulstudium im Ingenieurwissenschaftlichen Bereich (Maschinenbau / Elektrotechnik oder artverwandt) einer deutschen Hochschule oder anerkannte ausländische Hochschulabschlüsse (BA, B. Sc., MA, M. Sc., Dipl.-Ing.)\u003cbr/\u003e- Mindestens zweijährige Berufserfahrung in dem entsprechenden Handwerk\u003cbr/\u003e- Erfahrung in der Instandhaltung von industriellen Produktionsanlagen\u003cbr/\u003e- Fortgeschrittene Deutschkenntnisse in Wort und Schrift","business_category":"fulfillment-ops","city":"Frankenthal","company_name":"Amazon Logistik Frankenthal GmbH","country_code":"DEU","description":"Das Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) ist für unseren Betrieb von fundamentaler Bedeutung – es sorgt dafür, dass unsere technischen Systeme und Anlagen laufend funktionieren. Als Instandhaltungstechniker:in bist Du für die Wartung und Instandhaltung unserer förder- und haustechnischen Anlagen sowie Produktionsanlagen zuständig. Du hilfst, die höchsten Sicherheitsstandards im Arbeitsschutz zu gewährleisten und Maschinenausfallzeiten zu verhindern. Unser technisches Team stellt eine hohe Verfügbarkeit der technischen Anlagen sicher und verbessert die Qualität unserer Geräte.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Ausführung präventiver Wartungsmaßnahmen an einer breiten Vielfalt von Geräten an unseren Standorten\u003cbr/\u003e- Durchführung von Reparaturen und Fehlerdiagnosen\u003cbr/\u003e- Verwendung neuester Tools zur Maximierung der Geräteeffektivität\u003cbr/\u003e- Einhaltung aller Arbeitsschutzrichtlinien und -praktiken \u003cbr/\u003e- Unterstützung der Entwicklung und des beruflichen Fortschritts von Auszubildenden am Standort\u003cbr/\u003e- Arbeit an Projekten zur kontinuierlichen Verbesserung und Einführung von Best Practices an verschiedenen EU-Standorten\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAls Instandhaltungstechniker:in bist Du vor Ort in einem unserer Logistikzentren tätig, um schnell auf technische Störungen reagieren zu können. Du führst eine Reihe geplanter präventiver Wartungsmaßnahmen an Geräten durch, um für ihren sicheren Betrieb zu sorgen. Außerdem reagierst Du als Instandhaltungstechniker:in unverzüglich auf Störungen und Ausfälle. Du untersuchst die Ursachen, findest so schnell wie möglich Lösungen und wendest sie an.  Zudem machst Du Vorschläge für langfristige Verbesserungen.\u003cbr/\u003eIn Zusammenarbeit mit leitenden Kolleg:innen nimmst Du tägliche Wartungsaufgaben wahr und kommunizierst mit Dienstleistern, falls Du externe Expertise benötigst. Du arbeitest in rotierenden Schichten, damit wir rund um die Uhr unsere Standorte unterstützen – und dafür sorgen, dass Amazon weiterhin in dem Tempo liefern kann, für das wir bekannt sind. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eUnser Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) sorgt dafür, dass unsere Geräte und Ausstattung jederzeit optimal funktionieren. Wir sind ein Team von Techniker:innen und Ingenieur:innen, das aus hervorragenden Teamplayern besteht und von erfahrenen Führungskräften geleitet wird. Wir arbeiten gemeinsam daran, die Geräte in unserem gesamten globalen Netzwerk von Fulfillment-Centern zu warten, zu reparieren und ihre Fehler zu beheben. Einige unserer Mitarbeiter:innen sind Führungskräfte, die das Team bei der Arbeit an spannender, innovativer Technologie beaufsichtigen – die es teilweise nur bei Amazon gibt. Von der Installation automatisierter Verpackungssysteme bis hin zur Beaufsichtigung der allgemeinen Wartungsarbeiten eines Standorts sowie der Reparatur von für den Vertrieb wesentlichen Geräten wickelt unser Team einen Großteil der technischen Aufgaben bei Amazon ab. Unter anderem sorgt es auch dafür, dass Gebäude weiterhin den rechtlichen Auflagen entsprechen, damit alle sicher bleiben und unsere Standorte mit maximaler Effizienz betrieben werden. Es gibt zahlreiche Aufstiegschancen im RME-Team selbst ebenso wie im gesamten Amazon-Unternehmen. Alle unsere Aktivitäten sind darauf ausgerichtet, die Ausfallzeiten an Amazons wichtigsten Betriebsstandorten zu reduzieren, damit Kund:innen ihre Bestellungen rechtzeitig erhalten. Oft arbeiten wir früh morgens, spät abends oder in der Nachtschicht, um Wartungsarbeiten mit den geringstmöglichen Störungen vorzunehmen. Falls wir eine bessere Möglichkeit finden, eine bestimmte Aufgabe zu erledigen, verfügen wir über die Fertigkeiten und Gelegenheiten, vollständig neue Prozesse oder bahnbrechende Technologie wie Amazon Robotics oder unseren Complex Item Sorter einzuführen.","department_cost_center":null,"description_short":"Das Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) ist für unseren Betrieb von fundamentaler Bedeutung – es sorgt dafür, dass unsere technischen Systeme und","display_distance":null,"id":"1e0fb740-f3b8-4dd6-9eb7-9fab1ce34450","id_icims":"3178630","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/facilities","job_function_id":null,"job_path":"/en/jobs/3178630/elektriker-in-mechatroniker-in-instandhaltungstechniker-in-frankenthal","job_schedule_type":"full-time","location":"DE, RP, Frankenthal","locations":["{\"normalizedStateName\":\"Hesse\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Viernheim\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, RP, Viernheim\",\"coordinates\":\"49.53834,8.57711\",\"normalizedCountyName\":\"Bergstraße\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Viernheim, Hesse, DEU\",\"location\":\"DE, RP, Viernheim\",\"region\":\"RP\",\"buildingCodeList\":[\"DRP1\"],\"normalizedCityName\":\"Viernheim\"}","{\"normalizedStateName\":\"Rhineland-Palatinate\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Worms\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, Worms\",\"coordinates\":\"49.63049,8.36197\",\"normalizedCountyName\":\"Worms\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Worms, Rhineland-Palatinate, DEU\",\"location\":\"DE, Worms\",\"region\":\"\",\"buildingCodeList\":[\"VEQE\",\"DRP7\"],\"normalizedCityName\":\"Worms\"}","{\"normalizedStateName\":\"Rhineland-Palatinate\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Frankenthal\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, RP, Frankenthal\",\"coordinates\":\"49.53483,8.35066\",\"normalizedCountyName\":\"Frankenthal (Pfalz)\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Frankenthal (Pfalz), Rhineland-Palatinate, DEU\",\"location\":\"DE, RP, Frankenthal\",\"region\":\"RP\",\"buildingCodeList\":[\"FRA7\"],\"normalizedCityName\":\"Frankenthal (Pfalz)\"}","{\"normalizedStateName\":\"Baden-Wurttemberg\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Mannheim\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, Mannheim\",\"coordinates\":\"49.48443,8.46274\",\"normalizedCountyName\":\"Mannheim\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Mannheim, Baden-Wurttemberg, DEU\",\"location\":\"DE, Mannheim\",\"region\":\"\",\"buildingCodeList\":[\"NBW1\"],\"normalizedCityName\":\"Mannheim\"}"],"normalized_location":"Frankenthal (Pfalz), Rhineland-Palatinate, DEU","optional_search_labels":["ops.rme-technician","hourly","ops.lander-emea-rme-technician"],"posted_date":"February 11, 2026","preferred_qualifications":"- Erfahrung mit zustandsorientierter Überwachung\u003cbr/\u003e- Erfahrung in der Arbeit mit Druck- und Applikationsmaschinen\u003cbr/\u003e- Erfahrung in der Störungssuche und Wartung von Förder- oder Automationssystemen\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":"RP","title":"Elektriker:in/Mechatroniker:in/Instandhaltungstechniker:in  - Frankenthal","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3178630/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of analyzing and interpreting data with Redshift, Oracle, NoSQL etc. experience\u003cbr/\u003e- Experience with data visualization using Tableau, Quicksight, or similar tools\u003cbr/\u003e- Experience with data modeling, warehousing and building ETL pipelines\u003cbr/\u003e- Experience in Statistical Analysis packages such as R, SAS and Matlab\u003cbr/\u003e- Experience using SQL to pull data from a database or data warehouse and scripting experience (Python) to process data for modeling","business_category":"entertainment","city":"Bengaluru","company_name":"Amazon Digital Services Private Limited","country_code":"IND","description":"\"Amazon Music reimagines music listening by enabling customers to unlock millions of songs and thousands of curated playlists and stations with their voice. Amazon Music provides unlimited access to new releases and classic hits across iOS and Android mobile devices, PC, Mac, Echo, and Alexa-enabled devices including Fire TV and more. With Amazon Music, Prime members have access to ad-free listening of more than 75 million songs at no additional cost to their membership. Listeners can also enjoy the premium subscription service, Amazon Music Unlimited, which provides access to more than 75 million songs and the latest new releases. Amazon Music Unlimited customers also now have access to the highest-quality listening experience available, with more than 75 million songs available in High Definition (HD), more than 7 million songs in Ultra HD, and a growing catalog of spatial audio. Customers also have free access to an ad-supported selection of top playlists and stations on Amazon Music. All Amazon Music tiers now offer a wide selection of podcasts at no additional cost, and live streaming in partnership with Twitch. Engaging with music and culture has never been more natural, simple, and fun. For more information, visit amazonmusic.com or download the Amazon Music app.\u003cbr/\u003e\u003cbr/\u003eThe Data, Insights, Science and Optimization, Marketing \u0026 Growth (DISCO M\u0026G) team is looking for a BIE to join a team of Data Scientists, Analytics Leads, Business Intelligence Engineers and Data Engineers who analyze big data, provide analytics and insights as well as build models and algorithms that power \"Next Best Experience\" (NBX) marketing for personalized experiences. DISCO M\u0026G team focuses on accelerating Amazon Music customer growth by empowering Marketing \u0026 Growth teams to make sound, customer-centric decisions through data and insights. We build data pipelines, self-service analytics, insights and predictive models enabling acquisition, engagement and retention at scale with personalized customer touchpoints. In this role, you will lead the analytics and insights efforts for one of the Amazon Music Marketing. You will set the analytics roadmap and direction for the domain and work with stakeholders and partners to deliver self-service solutions, insights, learning white papers and models to advance our analytics and science offerings. The ideal candidate must be willing to effectively lead analytics solutions, prioritize across multiple stakeholders and projects and be ready to jump into a fast-paced, dynamic and fun environment.\"\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Lead analytics and insights efforts for one of Amazon Music Marketing domain\u003cbr/\u003e• Work as the internal lead analytics consultant for marketing teams and collaborate on long-term strategy together\u003cbr/\u003e• Define and deliver reporting and visualization that supports the analytical needs of internal business leaders\u003cbr/\u003e• Drive self-service solutions for senior business stakeholders informing marketing investment decisions\u003cbr/\u003e• Use analytical insights to help increase business and teams effectiveness against key strategic goals\u003cbr/\u003e• Build a thorough understanding of the streaming music industry, the subscription business model, and key internal partners across Prime, Amazon devices, media and entertainment businesses\u003cbr/\u003e• Partner with analytics and science teams across Amazon entertainment and subscription businesses\u003cbr/\u003e• Educate and evangelize across internal teams on analytics, insights and measurement by writing whitepapers and knowledge documentation and delivering learning sessions\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Data, Insights, Science and Optimization, Marketing \u0026 Growth (DISCO M\u0026G) team is looking for a BIE to join a team of Data Scientists, Analytics Leads, Business Intelligence Engineers and Data Engineers who analyze big data, provide analytics and insights as well as build models and algorithms that power “Next Best Experience” (NBX) marketing for personalized experiences. DISCO M\u0026G team focuses on accelerating Amazon Music customer growth by empowering Marketing \u0026 Growth teams to make sound, customer-centric decisions through data and insights. ","department_cost_center":null,"description_short":"\"Amazon Music reimagines music listening by enabling customers to unlock millions of songs and thousands of curated playlists and stations with their voice. Amazon Music provides unlimited access to new","display_distance":null,"id":"18902c3f-ec63-4b29-98fc-82d4f7e223b1","id_icims":"3169265","is_intern":null,"is_manager":null,"job_category":"Business Intelligence","job_family":"Business Intel Engineer","job_function_id":null,"job_path":"/en/jobs/3169265/bie-ii-amazon-music-disco","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR26\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"January 29, 2026","preferred_qualifications":"- Experience with AWS solutions such as EC2, DynamoDB, S3, and Redshift\u003cbr/\u003e- Experience in data mining, ETL, etc. and using databases in a business environment with large-scale, complex datasets\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"entertainment.team-music","source_system":"JobCreator","state":"KA","title":"BIE II, Amazon Music - DISCO ","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3169265/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-music","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Erfahrung im Umgang mit Kundenanfragen per Telefon und E-Mail\u003cbr/\u003e- Erfahrung in einer Rolle im administrativen Support, einschließlich Zusammenarbeit mit internen oder externen Teams\u003cbr/\u003e- Erfahrung in der Problemlösung in Bezug auf Kundenanfragen ebenso wie interne Prozesse\u003cbr/\u003e- Fortgeschrittene Deutschkenntnisse\u003cbr/\u003e- Fortgeschrittene Englischkenntnisse","business_category":"operations-team","city":"Wenden","company_name":"Amazon Deutschland E8 Transport GmbH","country_code":"DEU","description":"Die nachfolgende Stelle ist für 12 Monate befristet, mit der Möglichkeit zur Verlängerung.\u003cbr/\u003e\u003cbr/\u003e*Dieser Job ist ausschließlich vor Ort zu leisten.Die tägliche Arbeitszeit ist von 11:00 bis 19:15 Uhr (Schichtwechsel von Montag-Freitag; Dienstag- Samstag)\u003cbr/\u003e\u003cbr/\u003eSelbst die effizientesten Prozesse erfordern Vorbereitung für den Fall unvorhergesehener Umstände. Die Delivery Station Liaison Agents von Amazon sind direkt mit unseren Kund:innen in Kontakt. Sie sorgen dafür, dass verpasste Lieferungen erfolgreich zugestellt und Kundenanfragen effektiv bearbeitet werden. Was unsere Kund:innen auch brauchen – Du gehst zeitnah auf ihre Anfragen ein und sorgst für ein reibungsloses Kundenerlebnis.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKontaktieren von Kund:innen\u003cbr/\u003eUntersuchung und Lösung von Lieferproblemen, falls erforderlich in Zusammenarbeit mit unseren Logistikteams und Lieferpartnern\u003cbr/\u003eFührung von täglichen, wöchentlichen und monatlichen Aufzeichnungen über den Status von Kundenanfragen\u003cbr/\u003eEinhaltung von Arbeitsanweisungen und Schutz von Kundendaten\u003cbr/\u003eUnterstützung bei der internen Kommunikation, einschließlich mit Präsentationen, und Beiträge zu Programmen für die kontinuierliche Verbesserung und das interne Engagement\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eDu arbeitest in einem unserer Last-Mile-Verteilzentren, das Amazons modernste Technologien umfasst. Während des Versands und der Lieferung von Bestellungen kommunizierst Du je nach Bedarf mit unseren Logistikzentren sowie unseren Partnern, Lieferfirmen und Kund:innen, wenn sie Hilfe oder Informationen benötigen. Müssen Kund:innen Lieferungen umplanen, benachrichtigst Du unsere Lieferpartner entsprechend. Lieferprobleme, die Dir auffallen, löst Du unverzüglich, damit unsere Kund:innen jedes Mal ein großartiges Erlebnis genießen, ohne Amazon kontaktieren zu müssen.\u003cbr/\u003eDu arbeitest im Herzen der Logistik von Amazon und entwickelst das erforderliche Fachkönnen in sowohl Logistik als auch ausgezeichnetem Kundenservice, mit dem sich Amazon von anderen abhebt. Du bist tagtäglich mit unseren Kund:innen in Kontakt und nutzt Dein eingehendes Verständnis unserer Lieferketten sowie Deine Kenntnisse lokaler Lieferwege und Lager.","department_cost_center":null,"description_short":"Die nachfolgende Stelle ist für 12 Monate befristet, mit der Möglichkeit zur Verlängerung.*Dieser Job ist ausschließlich vor Ort zu leisten.Die tägliche Arbeitszeit ist von 11:00 bis 19:15 Uhr (Schichtwechsel","display_distance":null,"id":"39301e67-d1e4-41f5-a888-0e89b8e30222","id_icims":"3150622","is_intern":null,"is_manager":null,"job_category":"Customer Service","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3150622/cs-delivery-station-liaison-delivery-station-liaison","job_schedule_type":"full-time","location":"DE, NW, Wenden","locations":["{\"normalizedStateName\":\"North-Rhine-Westphalia\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Wenden\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, NW, Wenden\",\"coordinates\":\"50.9663,7.87176\",\"normalizedCountyName\":\"Olpe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Wenden, North-Rhine-Westphalia, DEU\",\"location\":\"DE, NW, Wenden\",\"region\":\"NW\",\"buildingCodeList\":[\"DNX3\"],\"normalizedCityName\":\"Wenden\"}"],"normalized_location":"Wenden, North-Rhine-Westphalia, DEU","optional_search_labels":["advertising.team-customer-service-ops","ops.lander.teamlead-emea"],"posted_date":"December 31, 2025","preferred_qualifications":"- Erfahrung in der Kommunikation mit Kolleg:innen in Führungspositionen\u003cbr/\u003e- Berufserfahrung in einem dynamischen Umfeld\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"operations-team.transportation-operations-management","source_system":"JobCreator","state":"NW","title":"CS Delivery Station Liaison, Delivery Station Liaison","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3150622/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"transportation-operations-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":" - Ability to work in cramped and/or elevated locations with or without reasonable accommodation\u003cbr/\u003e - Technical training (Military or trade school) or relevant experience \u003cbr/\u003e - Strong verbal and written communication skills, proficiency with Microsoft Office products (Excel, Word) and web-based operational tools\u003cbr/\u003e","business_category":"aws","city":"Thames Valley","company_name":"Amazon Data Services UK Limited","country_code":"GBR","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon is seeking a collaborative electrical maintenance professional for our Amazon Web Services Team. \u003cbr/\u003eThis engineering operations technician position serves as the on-site maintenance technician and operator for an AWS data centre. \u003cbr/\u003eThe Data Centre Engineering Operations Technician (EOT) is responsible for operating and maintaining all electrical, mechanical, emergency generator, and fire/life safety equipment within the data centre. The EOT serves as a technical resource to support Amazon within its data centres. Data centre equipment that supports mission-critical servers must maintain better than 99.999% uptime. EOT’s are also tasked with driving innovation while reducing operational costs in the facilities.\u003cbr/\u003e\u003cbr/\u003eEOT’s are Amazon’s front line responders for hands-on electrical and mechanical equipment troubleshooting and operation. This equipment includes, but is not limited to, stand-by diesel generators, switchboards/switch-gears, UPS’s, PDU’s, AHU’s, pumps, motors, VFD’s, and building automation systems. They provide 24/7 shift coverage which could include 12 hour shifts, rotating shifts, 3, 4, or 5 day work weeks, and may change based on the needs of the business.\u003cbr/\u003e\u003cbr/\u003eResponsibilities:\u003cbr/\u003e - Operate and maintain mechanical and electrical equipment\u003cbr/\u003e - Troubleshooting of facility and rack-level events within internal SLAs\u003cbr/\u003e - Perform limited maintenance tasks to include: filter changes, HVAC PMs, rack power installs, rack PDU, and rack ATS replacements\u003cbr/\u003e - Provide support to Data Centre Operations technicians\u003cbr/\u003e - Perform root cause analysis of equipment failures\u003cbr/\u003e - Ensure all safety procedures are adhered to while performing work\u003cbr/\u003e - Take daily operational readings of all mechanical and electrical equipment through routine rounds/log taking (temperatures, voltages, currents, etc.)\u003cbr/\u003e - Utilise internal CMMS to manage building workflows and spare part inventory\u003cbr/\u003e - Supervise contractors who perform servicing or preventive maintenance\u003cbr/\u003e - Respond to off hour emergency calls per on call rotation for any one of the region’s sites\u003cbr/\u003e - Fully comply with all physical security procedures and policies\u003cbr/\u003e\u003cbr/\u003eTo be considered for this job you will need to be a UK national and able to obtain and maintain a UK Government Security Clearance. Further details found here: https://www.gov.uk/government/publications/united-kingdom-security-vetting-clearance-levels","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"26d6c9d1-05cf-4fa6-b35a-ab799cf45de4","id_icims":"3089647","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3089647/engineering-operation-technician-infraops-dceo","job_schedule_type":"full-time","location":"GB, POST-BER, Thames Valley","locations":["{\"normalizedStateName\":\"Berkshire\",\"normalizedCountryCode\":\"GBR\",\"city\":\"Thames Valley\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, POST-BER, Thames Valley\",\"coordinates\":\"51.42,-0.98\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"Thames Valley, Berkshire, GBR\",\"location\":\"GB, POST-BER, Thames Valley\",\"region\":\"POST-BER\",\"buildingCodeList\":[\"LHR30\"],\"normalizedCityName\":\"Thames Valley\"}"],"normalized_location":"Thames Valley, Berkshire, GBR","optional_search_labels":["military-emea","aws.team-uk-launches-optional","aws.team-dc","military-operations","aws.team-uk-optional"],"posted_date":"September 22, 2025","preferred_qualifications":"- 4+ years of Data Centre Engineering Experience and a degree in Electrical Engineering, Mechanical Engineering or relevant discipline\u003cbr/\u003e- Fundamental knowledge of network design and layout as well as low voltage (copper/ fibre) cabling. Familiar with BMS and EPMS control systems and data collection/trending and proficient with maintenance management software\u003cbr/\u003e- All candidates must possess a valid driver's license, their own vehicle, and will need to pass a driving record check to operate company vehicles. Travel between sites/locations during the workday may occur. \u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-public-sector","source_system":"JobCreator","state":"POST-BER","title":"Engineering Operation Technician, InfraOps DCEO","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3089647/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-public-sector","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"global-corporate","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"Are you passionate about enabling millions of customers around to world buy anything, anywhere, anytime? Can you work on large cross-team projects? Do you want to take the best e-commerce platform in the world to the next level?\r\u003cbr/\u003e\r\u003cbr/\u003eWe, the Multi company ordering platform(MCOP) team, need a strong Software Development Engineer to enable our multi-year large initiatives. You will design, architect and innovative technology solutions    that will reduce time to market, standardize execution and scale for    expansion globally. You will build,   operate and play a key role in the  evolution of our platform to solve   the world's most complex technical  challenges in Information  extraction,  Large-scale computing,  Distributed systems, Web  applications, Data  mining, Scalability,  Security, and Algorithms to  name a few. You’ll  strive for simplicity,  and demonstrate significant  creativity and high  judgment. \r\u003cbr/\u003e \r\u003cbr/\u003e\r\u003cbr/\u003eThe  job is simple: make  everything available to everyone all the time at   the best possible  price. The requirements are almost as simple - we’re   looking for  leaders and trailblazers who aren’t afraid of tackling   massive scale,  layered complexity and ambiguous requirements to empower   our customers  to shop the World. No two features are ever the same  and  our customers  are hungry for every single one!\r\u003cbr/\u003e\r\u003cbr/\u003eWhat to expect day-to-day:\r\u003cbr/\u003e · Facilitate the design of the architecture of these distributed and highly scalable systems.\r\u003cbr/\u003e · Solve complex problems through data, rapidly.\r\u003cbr/\u003e · Design and develop state of the art software systems that address these complex and ambiguous problems.\r\u003cbr/\u003e    · Own the inputs and the business outcome through cultivating a   culture  of relentless auditing and metric monitoring, automatically   where  possible. \r\u003cbr/\u003e \r\u003cbr/\u003e Amazon is an Equal Opportunity-Affirmative   Action  Employer – Minority / Female / Disability / Veteran / Gender   Identity /  Sexual Orientation","department_cost_center":null,"description_short":"Are you passionate about enabling millions of customers around to world buy anything, anywhere, anytime? Can you work on large cross-team projects? Do you want to take the best e-commerce platform in the","display_distance":null,"id":"6859157c-5350-41e7-801e-b7599bcc9659","id_icims":"3083303","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3083303/software-dev-engineer-ii-mcop","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR22\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"September 15, 2025","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"global-corporate.no-team-listed","source_system":"JobCreator","state":"KA","title":"Software Dev Engineer II, MCOP","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3083303/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":" - Commutable to the Thames Valley Region\u003cbr/\u003e - Ability to work in cramped and/or elevated locations with or without reasonable accommodation\u003cbr/\u003e - Able to relocate for up to 1 year for specialised training to prepare for a deployment location in a new data centre region.\u003cbr/\u003e - Technical training (Military or trade school) or relevant experience \u003cbr/\u003e - Strong verbal and written communication skills\u003cbr/\u003e - Proficient with Microsoft Office products (Excel, Word) and web-based operational tools\u003cbr/\u003e - Familiar with BMS and EPMS control systems and data collection/trending\u003cbr/\u003e - Proficient with maintenance management software\u003cbr/\u003e","business_category":"aws","city":"Thames Valley","company_name":"Amazon Data Services UK Limited","country_code":"GBR","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon is seeking a collaborative electrical maintenance professional for our Amazon Web Services Team.\u003cbr/\u003eThis engineering operations technician position serves as the on-site maintenance technician and operator for an AWS data centre.\u003cbr/\u003eThe Data Centre Engineering Operations Technician (EOT) is responsible for operating and maintaining all electrical, mechanical, emergency generator, and fire/life safety equipment within the data centre. The EOT serves as a technical resource to support Amazon within its data centres. Data centre equipment that supports mission-critical servers must maintain better than 99.999% uptime. EOT’s are also tasked with driving innovation while reducing operational costs in the facilities.\u003cbr/\u003e\u003cbr/\u003eEOT’s are Amazon’s front line responders for hands-on electrical and mechanical equipment troubleshooting and operation. This equipment includes, but is not limited to, stand-by diesel generators, switchboards/switch-gears, UPS’s, PDU’s, AHU’s, pumps, motors, VFD’s, and building automation systems. This role will not require shift work.\u003cbr/\u003e\u003cbr/\u003eResponsibilities:\u003cbr/\u003e- Operate and maintain mechanical and electrical equipment\u003cbr/\u003e- Troubleshooting of facility and rack-level events within internal SLAs\u003cbr/\u003e- Perform limited maintenance tasks to include: filter changes, HVAC PMs, rack power installs, rack PDU, and rack ATS replacements\u003cbr/\u003e- Provide support to Data Centre Operations technicians\u003cbr/\u003e- Perform root cause analysis of equipment failures\u003cbr/\u003e- Ensure all safety procedures are adhered to while performing work\u003cbr/\u003e- Take daily operational readings of all mechanical and electrical equipment through routine rounds/log taking (temperatures, voltages, currents, etc.)\u003cbr/\u003e- Utilise internal CMMS to manage building workflows and spare part inventory\u003cbr/\u003e- Supervise contractors who perform servicing or preventive maintenance\u003cbr/\u003e- Respond to off hour emergency calls per on call rotation for any one of the region’s sites\u003cbr/\u003e- Fully comply with all physical security procedures and policies\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eHere at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and we host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences. Amazon’s culture of inclusion is reinforced within our 16 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.\u003cbr/\u003eBasic qualifications\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e• Ability to work in cramped and/or elevated locations with or without reasonable accommodation\u003cbr/\u003e• Technical training (Military or trade school) or relevant experience\u003cbr/\u003e• Strong verbal and written communication skills, proficiency with Microsoft Office products (Excel, Word) and web-based operational tools\u003cbr/\u003ePreferred qualifications\u003cbr/\u003e\u003cbr/\u003e• 4+ years of Data Centre Engineering Experience and a degree in Electrical Engineering, Mechanical Engineering or relevant discipline\u003cbr/\u003e• Fundamental knowledge of network design and layout as well as low voltage (copper/ fibre) cabling. Familiar with BMS and EPMS control systems and data collection/trending and proficient with maintenance management software\u003cbr/\u003e• Travel between sites/locations during the workday may occur.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (https://www.amazon.jobs/en/privacy_page) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eYou will need to be a UK national and able to obtain and maintain a UK Government Security Clearance. Further details found here: https://www.gov.uk/government/publications/united-kingdom-security-vetting-clearance-levels","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"9662d149-1215-44ea-992c-f7bd0877224a","id_icims":"3071683","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3071683/engineering-operations-technician-infraops-cluster-operations","job_schedule_type":"full-time","location":"GB, POST-BER, Thames Valley","locations":["{\"normalizedStateName\":\"England\",\"normalizedCountryCode\":\"GBR\",\"city\":\"Bracknell\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, POST-BER, Bracknell\",\"coordinates\":\"51.41811,-0.75627\",\"normalizedCountyName\":\"Berkshire\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"Bracknell, England, GBR\",\"location\":\"GB, POST-BER, Bracknell\",\"region\":\"POST-BER\",\"buildingCodeList\":[\"DRG3\"],\"normalizedCityName\":\"Bracknell\"}","{\"normalizedStateName\":\"Berkshire\",\"normalizedCountryCode\":\"GBR\",\"city\":\"Thames Valley\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, POST-BER, Thames Valley\",\"coordinates\":\"51.42,-0.98\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"Thames Valley, Berkshire, GBR\",\"location\":\"GB, POST-BER, Thames Valley\",\"region\":\"POST-BER\",\"buildingCodeList\":[\"LHR30\"],\"normalizedCityName\":\"Thames Valley\"}"],"normalized_location":"Thames Valley, Berkshire, GBR","optional_search_labels":["aws.team-uk-launches-optional","amazon-cleared-jobs"],"posted_date":"September  3, 2025","preferred_qualifications":"• 4+ years of Data Centre Engineering Experience\r\u003cbr/\u003e• Degree in Electrical Engineering, Mechanical Engineering or relevant discipline\r\u003cbr/\u003e• Fundamental knowledge of network design and layout as well as low voltage (copper/ fibre) cabling.\r\u003cbr/\u003e•All candidates must possess a valid driver's license, their own vehicle, and will need to pass a driving record check to operate company vehicles. Travel between sites/locations during the workday may occur.\r\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-public-sector","source_system":"JobCreator","state":"POST-BER","title":"Engineering Operations Technician, InfraOps Cluster Operations","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3071683/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-public-sector","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"\u003cbr/\u003e - Ability to work in cramped and/or elevated locations with or without reasonable accommodation\u003cbr/\u003e - Technical training (Military or trade school) or relevant experience \u003cbr/\u003e - Strong verbal and written communication skills, proficiency with Microsoft Office products (Excel, Word) and web-based operational tools\u003cbr/\u003e","business_category":"aws","city":"Thames Valley","company_name":"Amazon Data Services UK Limited","country_code":"GBR","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon is seeking a collaborative electrical maintenance professional for our Amazon Web Services Team.\u003cbr/\u003e\u003cbr/\u003eThis engineering operations technician position serves as the on-site maintenance technician and operator for an AWS data centre.\u003cbr/\u003e\u003cbr/\u003eThe Data Centre Engineering Operations Technician (EOT) is responsible for operating and maintaining all electrical, mechanical, emergency generator, and fire/life safety equipment within the data centre. The EOT serves as a technical resource to support Amazon within its data centres. Data centre equipment that supports mission-critical servers must maintain better than 99.999% uptime. EOT’s are also tasked with driving innovation while reducing operational costs in the facilities.\u003cbr/\u003e\u003cbr/\u003eEOT’s are Amazon’s front line responders for hands-on electrical and mechanical equipment troubleshooting and operation. This equipment includes, but is not limited to, stand-by diesel generators, switchboards/switch-gears, UPS’s, PDU’s, AHU’s, pumps, motors, VFD’s, and building automation systems. They provide 24/7 shift coverage which could include 12 hour shifts, rotating shifts, 3, 4, or 5 day work weeks, and may change based on the needs of the business.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eResponsibilities:\u003cbr/\u003e- Operate and maintain mechanical and electrical equipment\u003cbr/\u003e- Troubleshooting of facility and rack-level events within internal SLAs\u003cbr/\u003e- Perform limited maintenance tasks to include: filter changes, HVAC PMs, rack power installs, rack PDU, and rack ATS replacements\u003cbr/\u003e- Provide support to Data Centre Operations technicians\u003cbr/\u003e- Perform root cause analysis of equipment failures\u003cbr/\u003e- Ensure all safety procedures are adhered to while performing work\u003cbr/\u003e- Able to work a 12 hour shift (rotating 3 and 4 day work weeks days or nights)\u003cbr/\u003e- Take daily operational readings of all mechanical and electrical equipment through routine rounds/log taking (temperatures, voltages, currents, etc.)\u003cbr/\u003e- Utilise internal CMMS to manage building workflows and spare part inventory\u003cbr/\u003e- Supervise contractors who perform servicing or preventive maintenance\u003cbr/\u003e- Respond to off hour emergency calls per on call rotation for any one of the region’s sites\u003cbr/\u003e- Fully comply with all physical security procedures and policies\u003cbr/\u003e- This position will involve a night shift.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eBasic qualifications\u003cbr/\u003e• Commutable to the Thames Valley Region/ Ability to work in cramped and/or elevated locations with or without reasonable accommodation\u003cbr/\u003e• Technical training (Military or trade school) or relevant experience\u003cbr/\u003e• Strong verbal and written communication skills. \u003cbr/\u003e• Proficient with Microsoft Office products (Excel, Word) and web-based operational tools. Familiar with BMS and EPMS control systems and data collection/trending. Proficient with maintenance management software\u003cbr/\u003e\u003cbr/\u003ePreferred qualifications\u003cbr/\u003e• 4+ years of Data Centre Engineering Experience and Degree in Electrical Engineering, Mechanical Engineering or relevant discipline\u003cbr/\u003e• Fundamental knowledge of network design and layout as well as low voltage (copper/ fibre) cabling.\u003cbr/\u003e• Travel between sites/locations during the workday may occur.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (https://www.amazon.jobs/en/privacy_page) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eHere at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and we host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences. Amazon’s culture of inclusion is reinforced within our 16 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"246a742e-7a34-4c44-bdef-1a8595c330a1","id_icims":"3071678","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3071678/engineering-operation-technician-infraops-dceo","job_schedule_type":"full-time","location":"GB, POST-BER, Thames Valley","locations":["{\"normalizedStateName\":\"Berkshire\",\"normalizedCountryCode\":\"GBR\",\"city\":\"Thames Valley\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, POST-BER, Thames Valley\",\"coordinates\":\"51.42,-0.98\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"Thames Valley, Berkshire, GBR\",\"location\":\"GB, POST-BER, Thames Valley\",\"region\":\"POST-BER\",\"buildingCodeList\":[\"LHR30\"],\"normalizedCityName\":\"Thames Valley\"}"],"normalized_location":"Thames Valley, Berkshire, GBR","optional_search_labels":["military-emea","aws.team-uk-launches-optional","aws.team-dc","military-operations","aws.team-uk-optional"],"posted_date":"September  3, 2025","preferred_qualifications":"• 4+ years of Data Centre Engineering Experience and a degree in Electrical Engineering, Mechanical Engineering or relevant discipline\u003cbr/\u003e• Fundamental knowledge of network design and layout as well as low voltage (copper/ fibre) cabling. Familiar with BMS and EPMS control systems and data collection/trending and proficient with maintenance management software\u003cbr/\u003e•All candidates must possess a valid driver's license, their own vehicle, and will need to pass a driving record check to operate company vehicles. Travel between sites/locations during the workday may occur. \u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-public-sector","source_system":"JobCreator","state":"POST-BER","title":"Engineering Operation Technician, InfraOps DCEO","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3071678/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-public-sector","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"    5+ years of experience directly related to mission critical facilities or data center infrastructure, Bachelor’s degree in Mechanical/Electrical Engineering or relevant discipline preferred\u003cbr/\u003e    3+ years of commissioning experience\u003cbr/\u003e    Certification or training specific to NETA, ASHRAE, or Commissioning specific education courses\u003cbr/\u003e    Ability and willingness to travel domestic and internationally for approximately 50% of the time\u003cbr/\u003e    Required to provide personal transportation for meetings and job visits away from the office; reimbursed.","business_category":"aws","city":"Zaragoza","company_name":"Amazon Data Services Spain, S.L.","country_code":"ESP","description":"Amazon Web Services (AWS) provides a highly reliable, scalable, low-cost infrastructure platform in the cloud that powers hundreds of thousands of businesses in 190 countries around the world. To meet the growing demand for AWS cloud computing capacity in EMEA (Europe, Middle East and Africa) we are now looking for a Commissioning Engineer to join the team.\u003cbr/\u003e\u003cbr/\u003eAre you experienced in Critical Infrastructure Commissioning? As a Data Center Commissioning Engineer (CxE), you will be part of highly creative, efficient team tasked with tackling fascinating and challenging problems building and supporting the operations of AWS owned data centres, and Colocation facilities . The AWS Commissioning team (ACx) understands, evaluates, defines and manages the expectations of construction quality in accordance to engineering designs to meet the customer requirements. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eYou will be responsible for supporting vendors, contractors and other teams involved in the construction and commissioning of various systems such as:\u003cbr/\u003e\u003cbr/\u003e-Medium and low voltage power systems\u003cbr/\u003e-Generators\u003cbr/\u003e-UPS\u003cbr/\u003e-HVAC\u003cbr/\u003e-Chilled Water Systems\u003cbr/\u003e-Building Management systems (BMS)\u003cbr/\u003e-Electrical Power Monitoring Systems (EPMS)\u003cbr/\u003e-Testing and balancing\u003cbr/\u003e-Pumps and Hydronic systems\u003cbr/\u003e\u003cbr/\u003eThe CxE shall provide multi-discipline input into the scheduling, test script development, designing, and planning of projects. In addition, the CxE will be required to review component submittal packages, lead Factory Witness Testing (FWT), perform system level and integrated system testing. During commissioning, the CxE will continuously audit activities to ensure compliance with environmental, quality, and safety requirements. Additionally, the individual will be responsible for comprehensive weekly reporting of status of all ongoing projects and lessons learned to continually improve the quality of our program. This position will include coverage of multiple inflight projects.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services (AIS)\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eThe AWS Data Center Commissioning Team (ACx) is a wholly independent business within the DCGS organization. This team of veteran professional Electrical Engineers, Mechanical Engineers, Controls Engineers, Architectural Engineers, Project Managers, Operators and seasoned Amazonians are uniquely positioned to provide deeply detailed engineering and operational review and testing of equipment designs, operational functionality and construction practices. We are focused on ensuring the rapid delivery of a quality product while maintaining full transparency, recording metrics of manufacturer/contractor/equipment issues pre-PFHO, and identifying opportunities for all our peers and customers.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.","department_cost_center":null,"description_short":"Amazon Web Services (AWS) provides a highly reliable, scalable, low-cost infrastructure platform in the cloud that powers hundreds of thousands of businesses in 190 countries around the world. To meet","display_distance":null,"id":"c210bbab-0b18-4ae6-9e11-7a28d0c3403a","id_icims":"3080252","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Infrastructure Eng","job_function_id":null,"job_path":"/en/jobs/3080252/commissioning-engineer-commissioning","job_schedule_type":"full-time","location":"ES, Zaragoza","locations":["{\"normalizedStateName\":\"Aragon\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Zaragoza\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, Zaragoza\",\"coordinates\":\"41.65184,-0.8811\",\"normalizedCountyName\":\"Zaragoza\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Zaragoza, Aragon, ESP\",\"location\":\"ES, Zaragoza\",\"region\":\"\",\"buildingCodeList\":[\"ZAZ60\"],\"normalizedCityName\":\"Zaragoza\"}"],"normalized_location":"Zaragoza, Aragon, ESP","optional_search_labels":["aws.team-dcpd-optional","aws.team-dc"],"posted_date":"September 11, 2025","preferred_qualifications":"    Advanced knowledge Microsoft Office Suite - Word, Excel, Outlook required; advanced knowledge of SharePoint (or similar) preferred.\u003cbr/\u003e    Effective communication skills, detail oriented, highly organized, and able to work in high stress environments to maintain calm and respectful interaction with multiple teams\u003cbr/\u003e    Advance knowledge of mechanical, electrical, and controls systems for critical infrastructures\u003cbr/\u003e    Ability to read and edit construction documents (design drawings, control diagrams, specifications, etc.)\u003cbr/\u003e    Experience developing and executing test procedures for mechanical or electrical systems/components based on design intent and approved equipment submittals\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-support","source_system":"JobCreator","state":null,"title":"Commissioning Engineer, Commissioning","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3080252/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}