{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 1+ years of Microsoft Office products and applications experience\u003cbr/\u003e- 1+ years of electrical or mechanical experience\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends","business_category":"aws","city":"Sparks","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"1bc0b541-df4f-4e33-a427-eaa07be8e86e","id_icims":"3169296","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3169296/engineering-operations-technician-dcc-communities","job_schedule_type":"full-time","location":"US, NV, Sparks","locations":["{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sparks\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, Sparks\",\"coordinates\":\"39.54115,-119.74832\",\"normalizedCountyName\":\"Washoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sparks, Nevada, USA\",\"location\":\"US, NV, Sparks\",\"region\":\"NV\",\"buildingCodeList\":[\"RNO100\"],\"normalizedCityName\":\"Sparks\"}"],"normalized_location":"Sparks, Nevada, USA","optional_search_labels":["aws.team-ais","aws.team-dc","hourly","military"],"posted_date":"January 29, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Technical (Military/Trade School) training\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NV, Sparks - 31.00 - 55.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"NV","title":"Engineering Operations Technician, DCC Communities ","university_job":null,"updated_time":"3 minutes","url_next_step":"https://account.amazon.com/jobs/3169296/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of developing, negotiating and executing business agreements experience\u003cbr/\u003e- 5+ years of professional or military experience\u003cbr/\u003e- 5+ years of Go-To-Market, Business Development, Sales, or Consulting experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Experience developing strategies that influence leadership decisions at the organizational level\u003cbr/\u003e- Experience explaining complex technical concepts to various business and technical audiences\u003cbr/\u003e- Experience presenting to both technical and non-technical executive audiences","business_category":"amazon-business","city":"Arlington","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Come be a part of a rapidly expanding $35B global business. At Amazon Business, we set out every day to innovate and disrupt the status quo. We stand at the intersection of tech and retail in the B2B space developing innovative purchasing and procurement solutions to help businesses and organizations re-imagine buying. Bring your insight, imagination and a healthy disregard for the impossible. Join us in building and celebrating the value of Amazon Business to buyers and sellers of all sizes, unlocking our potential worldwide.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Define and execute on a contracted spend market development plan and ensure it's in line with the Amazon Business strategic direction, in partnership with key internal stakeholders (e.g. sales teams, service teams, marketing, partner team, contracts, legal, support, etc.).\u003cbr/\u003e• Define and size segments, identify and engage key customers, and identify and engage key partners including defense contractors and system integrators to formulate deal strategy.\u003cbr/\u003e• Support business development pipeline by engaging with key prospects and partners.\u003cbr/\u003e• Understand the technical requirements of our customers and work closely with the internal development teams to guide the direction of our product offerings to meet customer mission requirements.\u003cbr/\u003e• Understand the use of Salesforce.com and other internal Amazon systems.\u003cbr/\u003e• Present business reviews to the senior management team regarding progress and roadblocks to expanding planned/contracted/RFX spend across the Federal market. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eIn this role, you will identify opportunities for US Federal customers and their contractor community to adopt Amazon Business as a capability that promotes competition with every purchase, and highlight credentialed (small, women owned, veteran, AbilityOne, etc.) sellers and their products. Daily focus will be on identifying opportunities and driving pipeline with both the US Federal Program and Prime Contractors and their sub-contractors.","department_cost_center":null,"description_short":"Come be a part of a rapidly expanding $35B global business. At Amazon Business, we set out every day to innovate and disrupt the status quo. We stand at the intersection of tech and retail in the B2B space","display_distance":null,"id":"fcc63325-19b5-4b33-92f0-7af10a39d24a","id_icims":"3153531","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Business/Merchant Development","job_function_id":null,"job_path":"/en/jobs/3153531/capture-manager-federal-amazon-business-managed-spend-solutions","job_schedule_type":"full-time","location":"US, VA, Arlington","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS19\"],\"normalizedCityName\":\"Arlington\"}"],"normalized_location":"Arlington, Virginia, USA","optional_search_labels":[],"posted_date":"January  6, 2026","preferred_qualifications":"- Experience interpreting data and making business recommendations\u003cbr/\u003e- Experience identifying, negotiating, and executing complex legal agreements\u003cbr/\u003e- Experience developing, leading, negotiating and executing corporate and/or business transactions\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Arlington - 147,900.00 - 200,100.00 USD annually","primary_search_label":"amazon-business.no-team-listed","source_system":"JobCreator","state":"VA","title":"Capture Manager - Federal, Amazon Business - Managed Spend Solutions","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/3153531/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Knowledge of the primary aws services (ec2, elb, rds, route53 \u0026 s3)\u003cbr/\u003e- Experience implementing AWS services in a variety of distributed computing environments\u003cbr/\u003e- Bachelor's degree in engineering, computer science or equivalent\u003cbr/\u003e- 3+ years of cloud computing technologies experience\u003cbr/\u003e- 3+ years of design/implementation/operations/consulting with distributed applications experience\u003cbr/\u003e- 1+ years of software development, or 2+ years of software development experience\u003cbr/\u003e- Current, active US Government Security Clearance of TS/SCI with Polygraph","business_category":"aws","city":"Jessup","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"The Amazon Web Services Professional Services (ProServe) team is seeking a skilled Delivery Consultant to join our team at Amazon Web Services (AWS). In this role, you'll work closely with customers to design, implement, and manage AWS solutions that meet their technical requirements and business objectives. You'll be a key player in driving customer success through their cloud journey, providing technical expertise and best practices throughout the project lifecycle. Possessing a deep understanding of AWS products and services, as a Delivery Consultant you will be proficient in architecting complex, scalable, and secure solutions tailored to meet the specific needs of each customer. You’ll work closely with stakeholders to gather requirements, assess current infrastructure, and propose effective migration strategies to AWS. As trusted advisors to our customers, providing guidance on industry trends, emerging technologies, and innovative solutions, you will be responsible for leading the implementation process, ensuring adherence to best practices, optimizing performance, and managing risks throughout the project. \u003cbr/\u003e \u003cbr/\u003eThe AWS Professional Services organization is a global team of experts that help customers realize their desired business outcomes when using the AWS Cloud. We work together with customer teams and the AWS Partner Network (APN) to execute enterprise cloud computing initiatives. Our team provides assistance through a collection of offerings which help customers achieve specific outcomes related to enterprise cloud adoption. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries.\u003cbr/\u003e\u003cbr/\u003eThis position requires that the candidate selected must currently possess and maintain an active TS/SCI security clearance with polygraph. The position further requires the candidate to opt into a commensurate clearance for each government agency for which they perform AWS work.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs an experienced technology professional, you will be responsible for: \u003cbr/\u003e-Designing and implementing complex, scalable, and secure AWS solutions tailored to customer needs\u003cbr/\u003e-Providing technical guidance and troubleshooting support throughout project delivery\u003cbr/\u003e-Collaborating with stakeholders to gather requirements and propose effective migration strategies\u003cbr/\u003e-Acting as a trusted advisor to customers on industry trends and emerging technologies\u003cbr/\u003e-Sharing knowledge within the organization through mentoring, training, and creating reusable artifacts\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences - AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job below, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS? - Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture - Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth - We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance - We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.","department_cost_center":null,"description_short":"The Amazon Web Services Professional Services (ProServe) team is seeking a skilled Delivery Consultant to join our team at Amazon Web Services (AWS). In this role, you'll work closely with customers to","display_distance":null,"id":"e8bfa971-60c7-4a23-a004-269104c9e860","id_icims":"3112739","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Professional Services","job_function_id":null,"job_path":"/en/jobs/3112739/delivery-consultant-wwps-proserve","job_schedule_type":"full-time","location":"US, MD, Jessup","locations":["{\"normalizedStateName\":\"Maryland\",\"normalizedCountryCode\":\"USA\",\"city\":\"Jessup\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MD, Jessup\",\"coordinates\":\"39.15512,-76.79892\",\"normalizedCountyName\":\"Howard\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Jessup, Maryland, USA\",\"location\":\"US, MD, Jessup\",\"region\":\"MD\",\"buildingCodeList\":[\"BWI24\"],\"normalizedCityName\":\"Jessup\"}"],"normalized_location":"Jessup, Maryland, USA","optional_search_labels":["amazon-cleared-jobs"],"posted_date":"October 21, 2025","preferred_qualifications":"- Experience coding, scripting, automating in at least one language (e.g., Python, C, C++, Java, Ruby, or PowerShell)\u003cbr/\u003e- 5+ years of infrastructure architecture, database architecture and networking experience\u003cbr/\u003e- Experience in IT development or implementation/consulting in the software or Internet industries\u003cbr/\u003e- AWS experience preferred, with proficiency in a wide range of AWS services (e.g., EC2, S3, RDS, Lambda, IAM, VPC, CloudFormation)\u003cbr/\u003e- AWS Professional level certifications (e.g., Solutions Architect Professional, DevOps Engineer Professional) preferred\u003cbr/\u003e- Strong communication skills with the ability to explain technical concepts to both technical and non-technical audiences\u003cbr/\u003e- Understanding of Federal Government application, server, and network security requirements such as ICD 503, FISMA and FedRAMP.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MD, Jessup - 131,300.00 - 177,600.00 USD annually","primary_search_label":"aws.team-pro-serv","source_system":"JobCreator","state":"MD","title":"Delivery Consultant, WWPS ProServe","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3112739/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-pro-serv","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of finance or a related analytical field experience\u003cbr/\u003e- Knowledge of Microsoft Office products and applications (esp. MS Excel, Word) at an advanced level\u003cbr/\u003e- 3+ years of people management experience","business_category":"finance","city":"Pune","company_name":"ADCI - Maharashtra - D80","country_code":"IND","description":"Are you energized by transforming challenges into opportunities and building solutions that scale? This role offers the chance to lead a high-performing team while directly impacting Amazon's profitability in a fast-paced, dynamic environment.\u003cbr/\u003eAs a leader in this position, you'll develop long-term, scalable solutions that drive measurable business results. You'll guide your team through complex problems, foster innovation, and create systems that deliver lasting value. This role provides opportunities for rapid professional growth and the ability to make a meaningful difference across the organization.\u003cbr/\u003eIf you thrive on strategic thinking, enjoy mentoring others, and are passionate about creating sustainable impact, we want to hear from you.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities include:\u003cbr/\u003eA) Lead and Structure High-Performing Audit Teams: Lead audit teams across Pune and Bangalore locations, establishing organizational structures and frameworks that enable the team to solve complex problems and consistently deliver results.\u003cbr/\u003eB) Design and Operationalize New Recovery Audits: Build new recovery audit programs from the ground up by partnering with internal stakeholders, operationalize developed audit methodologies, and conduct rigorous reviews of audit findings while maintaining the highest quality standards.\u003cbr/\u003eC) Drive Process Improvement and Optimization Initiatives: Lead process improvement projects that enhance financial controls and optimize team productivity, identifying opportunities for automation and efficiency gains.\u003cbr/\u003eD) Conduct Strategic Business Reviews: Deliver monthly and quarterly business reviews with comprehensive data analysis, facilitate review sessions with business leaders, and ensure timely follow-through on action items and strategic decisions.\u003cbr/\u003eE) Provide Financial Analysis and Strategic Recommendations: Perform ad-hoc business analysis and financial modeling to support strategic decision-making, presenting actionable recommendations to senior management on planned initiatives and future opportunities.\u003cbr/\u003eF) Elevate Talent Acquisition Standards: Actively participate in recruiting efforts, continuously raising the bar for talent acquisition to build the internal audit team.\u003cbr/\u003eG) Lead Cross-Functional Strategic Initiatives: Drive cross-functional systems and process improvement initiatives, participating in strategic projects and special assignments that advance organizational objectives.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eGlobal Financial Audit is a Finance Operations function. Operating with internal and external teams, we identify and recover missed billing, underpayments, overpayments, and savings opportunities across Amazon's diverse spend categories —including Product Spend related to procurement and sales for online and physical Stores, as well as Non-Product Spend covering construction, transportation, subsidiaries, and corporate operations. We partner closely with upstream technology and process-owning teams to drive systemic improvements through root cause analysis and defect identification, working to prevent issues before they occur.","department_cost_center":null,"description_short":"Are you energized by transforming challenges into opportunities and building solutions that scale? This role offers the chance to lead a high-performing team while directly impacting Amazon's profitability","display_distance":null,"id":"51bf28bc-6386-4220-bfa7-b821645b5a0e","id_icims":"3161828","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/Planning","job_function_id":null,"job_path":"/en/jobs/3161828/manager-iii-finance-global-financial-audit","job_schedule_type":"full-time","location":"IN, MH, Pune","locations":["{\"normalizedStateName\":\"Maharashtra\",\"normalizedCountryCode\":\"IND\",\"city\":\"Pune\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, MH, Pune\",\"coordinates\":\"18.50419,73.85286\",\"normalizedCountyName\":\"Pune\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Pune, Maharashtra, IND\",\"location\":\"IN, MH, Pune\",\"region\":\"MH\",\"buildingCodeList\":[\"PNQ18\"],\"normalizedCityName\":\"Pune\"}"],"normalized_location":"Pune, Maharashtra, IND","optional_search_labels":[],"posted_date":"January 19, 2026","preferred_qualifications":"- Experience in auditing, risk management, compliance, program management, or quality management systems\u003cbr/\u003e- Knowledge of Six Sigma defect reduction techniques (Lean, etc.)\u003cbr/\u003e- Experience working with or evaluating AI systems\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-finops","source_system":"JobCreator","state":"MH","title":"Manager III, Finance, Global Financial Audit","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3161828/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-finops","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- 5+ years of program or project management experience\u003cbr/\u003e- Experience using data and metrics to determine and drive improvements\u003cbr/\u003e- Experience owning program strategy, end to end delivery, and communicating results to senior leadership\u003cbr/\u003e- Experience implementing repeatable processes and driving automation or standardization\u003cbr/\u003e- Experience in complex problem solving, and working in a tight schedule environment\u003cbr/\u003e- Experience working cross functionally with tech and non-tech teams","business_category":"transportation-and-logistics","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Air (AIR) is looking for a Senior Program Manager (Sr. PM) with excellent communication skills (verbal and written) and a record of delivering results who will own and execute strategic, ambiguous, and cross-functional projects across the Global Strategic Programs and Initiatives (GSPI) organization. The team is comprised of leaders who are passionate about building the roadmap to enable AIR to scale the business, drive innovation, and accelerate sustainability through operational excellence, standardization, exploratory projects, and strategic program creation/management.\u003cbr/\u003e\u003cbr/\u003eThe Sr. PM will enable implementation of Program Management Office (PMO) best practices, scope and create large projects, track project timelines, and develop mechanisms for communicating to senior management on status, risks, and business challenges. The Sr. PM will own implementing and governing a common set of PMO processes and supporting tools for managing the AIR portfolio of high visibility programs to enable efficient operating rhythm for the AIR organization, including: managing executive business reviews, cross-team coordination, and executive presentation.\u003cbr/\u003e\u003cbr/\u003eThis role requires strong program management fundamentals, but differs from traditional PM roles. It is essential for this Sr. PM to operate comfortably in ambiguity, be able to develop solutions and execute on them independently, and seamlessly move between strategic and tactical work. We are looking for a self-starter who can build structure where none exists; communicate effectively (written and verbal); and build strong relationships to Earn Trust across executive leaders and multiple stakeholder groups. If you seek this fast-paced Day One environment, come work on the AIR team!\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Manage cross-functional teams, and plan/organize/execute complex projects/programs across multiple organizations (Operations, Tech, Finance, Third Party Vendors, etc.) to enable the launch of new products and processes.\u003cbr/\u003e- Partner with key functional stakeholders across the company to lead, support, and influence new business initiatives.\u003cbr/\u003e- Build strong partnerships with operational leaders to identify the impact of new business initiatives.\u003cbr/\u003e- Innovate to improve project scope/execution to improve customer outcomes and decrease the end-to-end supply chain cost.\u003cbr/\u003e- Escalate risks in the project plan to the relevant owners and teams.\u003cbr/\u003e- Navigate through ambiguity.\u003cbr/\u003e- Manage and coordinate multiple project assignments simultaneously in a fast-paced, deadline-driven environment, accepting ownership and accountability of the cross-functional processes, and delivering on commitments.\u003cbr/\u003e- Track end-to-end project status and incorporate new metrics to transition the project to the normal operations.\u003cbr/\u003e- Own the planning, organization, and execution of complex projects across multiple organizations and stakeholders, including development of Program Management Office (PMO) processes.\u003cbr/\u003e- Own multiple business narrative reports, simultaneously. \u003cbr/\u003e- Create and build new tools and processes with both tech and non tech resources. \u003cbr/\u003e- Potential to travel 15% per year.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Global Strategic Programs and Initiatives (GSPI) team is comprised of leaders who work in a highly ambiguous and autonomous environment. GSPI strives to deliver results within three main pillars: program management, operational excellence/standardization, and exploratory projects. ","department_cost_center":null,"description_short":"Amazon Air (AIR) is looking for a Senior Program Manager (Sr. PM) with excellent communication skills (verbal and written) and a record of delivering results who will own and execute strategic, ambiguous,","display_distance":null,"id":"2dc8852a-830e-4f69-bf3e-2b91eb83d826","id_icims":"3055165","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Program Management","job_function_id":null,"job_path":"/en/jobs/3055165/senior-program-manager-amazon-air-pmo-air-supply-chain-and-analytics","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA82\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"August  8, 2025","preferred_qualifications":"- Master's degree\u003cbr/\u003e- 5+ years of driving process improvements experience\u003cbr/\u003e- Knowledge of Excel at an intermediate level (e.g., pivot tables \u0026 charts, multiple criteria lookups, nested logical/IF formulas, data cleansing, array formulas, etc.)\u003cbr/\u003e- PMP certificate\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $104,100/year in our lowest geographic market up to $185,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"transportation-and-logistics.team-airplanes","source_system":"JobCreator","state":"WA","title":"Senior Program Manager, Amazon Air PMO, AIR Supply Chain and Analytics","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3055165/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-airplanes","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- 5+ years of program or project management experience\u003cbr/\u003e- Experience using data and metrics to determine and drive improvements\u003cbr/\u003e- Experience owning program strategy, end to end delivery, and communicating results to senior leadership\u003cbr/\u003e- Experience implementing repeatable processes and driving automation or standardization\u003cbr/\u003e- Experience in complex problem solving, and working in a tight schedule environment\u003cbr/\u003e- Experience working cross functionally with tech and non-tech teams","business_category":"transportation-and-logistics","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Air (AIR) is seeking a Senior Program Manager to lead complex, enterprise-level initiatives across the Global Strategic Programs and Initiatives (GSPI) team. This role is highly cross-functional and regularly engages senior and executive leaders to align priorities, manage dependencies, and drive execution across multiple organizations.\u003cbr/\u003e\u003cbr/\u003eThe Senior Program Manager will own high-visibility, ambiguous initiatives critical to Amazon Air’s ability to scale, innovate, and operate efficiently. This role is responsible for independently defining program structure, scoping and executing large cross-functional projects, managing tradeoffs and risks, and establishing PMO best practices, processes, and tools to govern AIR’s portfolio of strategic programs. The Sr. PM will create and maintain an effective operating rhythm by tracking timelines and metrics, coordinating across teams, and enabling executive decision-making through clear written narratives, executive business reviews, and senior leadership communications.\u003cbr/\u003e\u003cbr/\u003eThis role requires strong program management fundamentals and comfort operating in ambiguity. The Sr. PM will independently develop and execute solutions, move seamlessly between strategic and tactical work, and build structure where none exists. Success in this role requires clear written and verbal communication and the ability to earn trust with executive leaders and diverse stakeholder groups in a fast-paced, Day One environment.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Manage cross-functional teams, and plan/organize/execute complex projects/programs across multiple organizations (Operations, Tech, Finance, Third Party Vendors, etc.) to enable the launch of new products and processes.\u003cbr/\u003e- Partner with key functional stakeholders across the company to lead, support, and influence new business initiatives.\u003cbr/\u003e- Build strong partnerships with operational leaders to identify the impact of new business initiatives.\u003cbr/\u003e- Innovate to improve project scope/execution to improve customer outcomes and decrease the end-to-end supply chain cost.\u003cbr/\u003e- Escalate risks in the project plan to the relevant owners and teams.\u003cbr/\u003e- Navigate through ambiguity.\u003cbr/\u003e- Manage and coordinate multiple project assignments simultaneously in a fast-paced, deadline-driven environment, accepting ownership and accountability of the cross-functional processes, and delivering on commitments.\u003cbr/\u003e- Track end-to-end project status and incorporate new metrics to transition the project to the normal operations.\u003cbr/\u003e- Own the planning, organization, and execution of complex projects across multiple organizations and stakeholders, including development of Program Management Office (PMO) processes.\u003cbr/\u003e- Own multiple business narrative reports, simultaneously. \u003cbr/\u003e- Create and build new tools and processes with both tech and non tech resources. \u003cbr/\u003e- Potential to travel 15% per year.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour day will be a dynamic blend of strategic thinking and tactical execution. You'll navigate complex program landscapes, engaging with leaders across Operations, Technology, Finance, and external partnerships. Expect to craft compelling narratives, design innovative program frameworks, and orchestrate collaborative solutions that drive meaningful organizational change.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Global Strategic Programs and Initiatives (GSPI) team is comprised of leaders who work in a highly ambiguous and autonomous environment. GSPI strives to deliver results within three main pillars: program management, operational excellence/standardization, and exploratory projects. ","department_cost_center":null,"description_short":"Amazon Air (AIR) is seeking a Senior Program Manager to lead complex, enterprise-level initiatives across the Global Strategic Programs and Initiatives (GSPI) team. This role is highly cross-functional","display_distance":null,"id":"ed4c0197-2f45-4765-aaa1-2ffb9ff0b4db","id_icims":"3150799","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Program Management","job_function_id":null,"job_path":"/en/jobs/3150799/senior-program-manager-strategic-programs-air-supply-chain-and-analytics","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA82\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"December 31, 2025","preferred_qualifications":"- Master's degree\u003cbr/\u003e- 5+ years of driving process improvements experience\u003cbr/\u003e- Knowledge of Excel at an intermediate level (e.g., pivot tables \u0026 charts, multiple criteria lookups, nested logical/IF formulas, data cleansing, array formulas, etc.)\u003cbr/\u003e- PMP certificate\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $104,100/year in our lowest geographic market up to $185,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"transportation-and-logistics.team-airplanes","source_system":"JobCreator","state":"WA","title":"Senior Program Manager, Strategic Programs, AIR Supply Chain and Analytics","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3150799/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-airplanes","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of technical infrastructure management experience\u003cbr/\u003e- Knowledge of best practices and emerging technologies, related to infrastructure (i.e. network, data center, hardware, software)\u003cbr/\u003e- Experience with varying scenarios of infrastructure builds","business_category":"aws","city":"Umatilla","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services has an immediate opening for a Technical Program Manager, Infrastructure to support data center infrastructure expansion. The TPM will lead cross functional teams to drive regional data center build projects, from inception through design, implementation, testing, and deployment.\u003cbr/\u003e \u003cbr/\u003eThe ideal candidate will be an exceptionally strong communicator, both written and verbally, and possess 3+ years experience in tactical project management of highly technical initiatives, as well as  strategic  program management. Experience in managing data center  infrastructure  deployments is a plus. A Bachelor's Degree or additional technical  experience is required. Candidates possessing a background in architecture/design, mechanical/electrical engineering,   software/hardware engineering, data center infrastructure/operations, and/or construction, who have transitioned to a program management   discipline will have a distinct advantage.\u003cbr/\u003e \u003cbr/\u003eCandidate must be comfortable managing remote project delivery teams, and possess the ability to facilitate technical whiteboard sessions to troubleshoot project implementation issues, and remove barriers to project success. Being able to stand up cross-functional teams, establish trust with a variety of stakeholders across multiple time zones, manage capital budgets, eliminate non-value-add activity, design solutions, remove blockers, and find creative ways to accelerate project delivery is a must. \u003cbr/\u003e \u003cbr/\u003eThe TPM will be fully competent in a variety of project management tools, methodologies and techniques for all phases of the project lifecycle and exhibit demonstrated proficiency in core project management disciplines including scope, schedule, budget, resources, quality and risk management, reporting and metric development/tracking. Other requirements include proficiency with MS Office, MS Project and MS SharePoint. Experience with Tableau, Smartsheets, SQL and systems integration a plus. \u003cbr/\u003e\u003cbr/\u003eThis position requires 10% Travel (Domestic and International trips to AWS Data Center Clusters).\u003cbr/\u003e \u003cbr/\u003eIf you meet these qualifications, exude passion, and enjoy the challenges of deploying highly technical and innovative projects at massive scale, this job is for you!\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAbout AWS\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. \u003cbr/\u003e\u003cbr/\u003e#DCPD_Delivery","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"727f100b-51c7-4c1a-9718-5c9a6fcdb532","id_icims":"3166622","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Tech Infrastructure Prgrm Mgmt","job_function_id":null,"job_path":"/en/jobs/3166622/aws-technical-program-manager-infrastructure-us-west","job_schedule_type":"full-time","location":"US, OR, Umatilla","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA84\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Oregon\",\"normalizedCountryCode\":\"USA\",\"city\":\"Umatilla\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OR, Umatilla\",\"coordinates\":\"45.91768,-119.34203\",\"normalizedCountyName\":\"Umatilla\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Umatilla, Oregon, USA\",\"location\":\"US, OR, Umatilla\",\"region\":\"OR\",\"buildingCodeList\":[\"PDX2\"],\"normalizedCityName\":\"Umatilla\"}"],"normalized_location":"Umatilla, Oregon, USA","optional_search_labels":["aws.team-product-program-management","aws.team-ais","aws.team-dcpd-optional","aws.team-dc"],"posted_date":"January 26, 2026","preferred_qualifications":"- Master's degree\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, OR, Umatilla - 127,100.00 - 171,900.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 127,100.00 - 171,900.00 USD annually","primary_search_label":"aws.team-program-management-primary","source_system":"JobCreator","state":"OR","title":"AWS Technical Program Manager, Infrastructure, US West","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3166622/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-program-management-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 6+ years of professional non-internship marketing experience\u003cbr/\u003e- Experience using data and metrics to drive improvements\u003cbr/\u003e- Experience with Excel or Tableau (data manipulation, macros, charts and pivot tables)\u003cbr/\u003e- Experience building, executing and scaling cross-functional marketing programs\u003cbr/\u003e- Experience communicating results to senior leadership\u003cbr/\u003e- Experience using Microsoft Excel to manipulate and analyze data","business_category":"subsidiaries","city":"Madison","company_name":"Zappos.com LLC","country_code":"USA","description":"Zappos is seeking a strategic Head of Lifecycle Marketing to lead and evolve our global email and push notification programs, while driving growth for our mobile app. This role will be instrumental in boosting revenue and enhancing customer engagement through world-class marketing experiences.\u003cbr/\u003eThe Head of Lifecycle Marketing will develop and own the strategic vision for Zappos' lifecycle marketing initiatives, leading a team that includes an established email marketing manager. They will partner with the CRM team to architect customer journey strategies and oversee the evolution of our personalization and automation capabilities. As the business owner of Zappos' App, they will drive the mobile growth strategy while partnering with cross-functional teams to enhance the customer experience. They will own channel performance metrics, strategic planning, and the channel roadmap, advocating for innovations that drive long-term growth. The right candidate will bring strategic vision, analytical depth, and cross-functional leadership skills to transform our customer engagement programs.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Define and drive comprehensive strategic vision for email, push notifications, and app channels aligned with Zappos' business goals and growth targets\u003cbr/\u003e• Lead strategic planning and goal-setting across channels, providing executive-level insights and recommendations\u003cbr/\u003e• Architect next-generation personalization and automation strategies to enhance customer lifetime value\u003cbr/\u003e• Drive innovation in our mobile app strategy, leading cross-functional initiatives to accelerate growth\u003cbr/\u003e• Champion technology investments and platform enhancements to enable advanced capabilities\u003cbr/\u003e• Design framework for measuring and optimizing channel performance and customer engagement\u003cbr/\u003e• Develop strategic partnerships across CRM, Product, Tech, and Creative to drive transformation initiatives\u003cbr/\u003e• Guide the evolution of our lifecycle marketing program through strategic testing and optimization\u003cbr/\u003e• Lead stakeholder management and executive communication of strategic initiatives and results\u003cbr/\u003e• Mentor and develop team members while fostering a culture of innovation and customer obsession","department_cost_center":null,"description_short":"Zappos is seeking a strategic Head of Lifecycle Marketing to lead and evolve our global email and push notification programs, while driving growth for our mobile app. This role will be instrumental in","display_distance":null,"id":"1df2a46a-6100-4cb2-b989-e726e37cebc2","id_icims":"3154033","is_intern":null,"is_manager":null,"job_category":"Marketing \u0026 PR","job_family":"Marketing","job_function_id":null,"job_path":"/en/jobs/3154033/head-of-lifecycle-marketing-zappos","job_schedule_type":"full-time","location":"US, WI, Madison","locations":["{\"normalizedStateName\":\"Wisconsin\",\"normalizedCountryCode\":\"USA\",\"city\":\"Madison\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WI, Madison\",\"coordinates\":\"43.07313,-89.38644\",\"normalizedCountyName\":\"Dane\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Madison, Wisconsin, USA\",\"location\":\"US, WI, Madison\",\"region\":\"WI\",\"buildingCodeList\":[\"MSN4\"],\"normalizedCityName\":\"Madison\"}","{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK94\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"Madison, Wisconsin, USA","optional_search_labels":[],"posted_date":"January  7, 2026","preferred_qualifications":"- Experience creating and executing integrated marketing lead generation campaigns using tactics that include live or virtual events, webinars, email, lead nurture programs, and CRM/sales insights\u003cbr/\u003e- Experience with Salesforce and Tableau\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, New York - 137,900.00 - 186,500.00 USD annually\u003cbr/\u003eUSA, WI, Madison - 125,400.00 - 169,600.00 USD annually","primary_search_label":"subsidiaries.team-zappos","source_system":"JobCreator","state":"WI","title":"Head of Lifecycle Marketing, Zappos","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3154033/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-zappos","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"advertising","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join Amazon Ads' Insights Measurement Team - Shape the Future of Advertising !\u003cbr/\u003eAre you ready to be at the forefront of innovation in one of Amazon's fastest-growing businesses? The Amazon Advertising Insights Measurement team is seeking exceptional software development engineers to drive our mission of revolutionizing advertising effectiveness. Our team is pivotal in measuring the impact of advertising insights, enhancing sales team productivity through relevancy, and optimizing insight creation process.\u003cbr/\u003e\u003cbr/\u003eAs a key member of our team, you'll:\u003cbr/\u003e• Architect and implement innovative solutions that power our large-scale advertising ecosystem\u003cbr/\u003e• Own the full software development lifecycle, from design to deployment, utilizing cloud technologies and microservices architecture\u003cbr/\u003e• Collaborate with elite professionals across various disciplines(e.g., Data Engineers, Data Scientists, and Product Managers) to deliver on behalf of customers.\u003cbr/\u003e• Drive process improvements and embody Amazon's leadership principles\u003cbr/\u003e• Shape the technical vision and strategy of our products\u003cbr/\u003e\u003cbr/\u003eIf you're passionate about solving complex problems, working with big data, and making a significant impact in the advertising technology space, we want to hear from you. Join us in transforming the future of advertising at Amazon!\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eBe heavily involved with design and product teams to understand needs, propose features, create early prototypes and transform them into exciting experiences.\u003cbr/\u003e\u003cbr/\u003ePropose innovative tools, frameworks, automations and processes that are used by the entire services team for development.\u003cbr/\u003e\u003cbr/\u003eWrite clean, maintainable code and perform peer code-reviews.\u003cbr/\u003e\u003cbr/\u003eDeep-dive into client or server systems to optimize for performance, maintainability, scalability, extensibility as needed.\u003cbr/\u003e\u003cbr/\u003eMentor your team members to promote engineering excellence\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAs part of the Sales Technology team our goal is to deliver best-in-class products and data solutions to improve the effectiveness of Amazon Advertising's sales teams worldwide. We are building sales enablement products for Amazon Advertising front line sales team.","department_cost_center":null,"description_short":"Join Amazon Ads' Insights Measurement Team - Shape the Future of Advertising !Are you ready to be at the forefront of innovation in one of Amazon's fastest-growing businesses? The Amazon Advertising Insights","display_distance":null,"id":"bfed0bf2-e712-4fed-970e-b9307a4770a6","id_icims":"3017263","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3017263/software-development-engineer-ad-sales","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York City\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York City\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York City\",\"region\":\"NY\",\"buildingCodeList\":[\"LUWS\"],\"normalizedCityName\":\"New York\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SHK5\",\"IBF4\",\"SEA43\",\"SEA88\",\"SEA57\",\"SEA109\",\"ONM125\",\"SEA91\",\"ATBP18\",\"SEA910\",\"UWA2\",\"SEA33R\",\"SEA26\",\"LBV2\",\"METR7\",\"BFI33\",\"UWA4\",\"SEA141\",\"SEA28\",\"LBV4\",\"WFM761\",\"JSE5\",\"LUM9\",\"SEA55\",\"SEA41\",\"SEA1\",\"SEA69\",\"ONM127\",\"SEA60\",\"SEA74\",\"ISE1\",\"DSW9\",\"PSE\",\"ATBP23\",\"QDS1\",\"SEA38\",\"SEA76\",\"LJG6\",\"SHK3\",\"WFM216\",\"SEA98\",\"SEA45\",\"DCA53\",\"LFC1\",\"SEA116\",\"MAB6\",\"CPA2\",\"ASL1\",\"SEA86\",\"SEA70\",\"SEA19\",\"LUM5\",\"WFM103\",\"LUM2\",\"SOD5\",\"SEA134\",\"SOD4\",\"FSE1\",\"LWA2\",\"SEA48\",\"PSL1\",\"ONM234\",\"ISG2\",\"SEA801\",\"DWX3\",\"ISE3\",\"SEA33\",\"SEA4\",\"ONM135\",\"SEA63\",\"BFI99\",\"JSE4\",\"LUM1\",\"CPA3\",\"SEA62\",\"CPA4\",\"SEA68\",\"SEA3\",\"WFM524\",\"TFC2\",\"T001\",\"ONM126\",\"SEA53\",\"DSE9\",\"ATBP24\",\"SEA81\",\"SEA72\",\"SEA59\",\"COL1\",\"SEA78\",\"BLU1\",\"METR2\",\"WFM59\",\"SEA24\",\"HUS1\",\"SHK4\",\"CWA42\",\"ATBP20\",\"DWA8\",\"LWES\",\"LBV3\",\"R004\",\"PUP\",\"UWA3\",\"SEA73\",\"CPA1\",\"SHK6\",\"IBF5\",\"SEA190\",\"SEA42\",\"SEA25\",\"SSE1\",\"DEV2\",\"SEA39\",\"DSW8\",\"SEA9\",\"MAE1\",\"KRA1\",\"IBF3\",\"ATBP22\",\"CWA2\",\"ONM124\",\"SEA44\",\"ATBP17\",\"SEA90\",\"WFM630\",\"HDG13\",\"SEA71\",\"ISE9\",\"SEA58\",\"ISE7\",\"SEA32\",\"SHK2\",\"SEA77\",\"MAB7\",\"XBF2\",\"ONM122\",\"LRSQ\",\"SEA2\",\"SEA01\",\"SEA54\",\"WFM755\",\"SEA23\",\"SEA29\",\"ATBP5\",\"T002\",\"PKD1\",\"FSE3\",\"SEA61\",\"SEA83\",\"ATBP10\",\"ONM232\",\"DTS2\",\"DWX8\",\"ONM128\",\"SEA89\",\"SEA803\",\"JSE1\",\"WFM604\",\"LUM4\",\"HCS8\",\"SEA51\",\"MAC8\",\"SEA20\",\"SEA65\",\"ATBP12\",\"SEA18\",\"SEA95\",\"SEA804\",\"SEA22\",\"LUM3\",\"SEA36\",\"METR4\",\"ISE6\",\"SEA47\",\"ZSE1\",\"CRP1\",\"DWX7\",\"SEA40\",\"IBF1\",\"SOD1\",\"PSE3\",\"SEA46\",\"SEA37\",\"SEA401\",\"SEA84\",\"BWA1\",\"XXX0\",\"SEA102\",\"R097\",\"SEA75\",\"METR5\",\"WFM275\",\"SEA27\",\"DSW4\",\"SHK7\",\"SEA21\",\"SEA02\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["advertising.team-software-development"],"posted_date":"June 24, 2025","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, New York City - 158,100.00 - 213,800.00 USD annually\u003cbr/\u003eUSA, OR, Corvallis - 143,700.00 - 194,400.00 USD annually\u003cbr/\u003eUSA, WA, SEATTLE - 143,700.00 - 194,400.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 143,700.00 - 194,400.00 USD annually","primary_search_label":"advertising.team-amazon-ads","source_system":"JobCreator","state":"WA","title":"Software Development Engineer, Ad Sales","university_job":null,"updated_time":"19 minutes","url_next_step":"https://account.amazon.com/jobs/3017263/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-ads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Champlain","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Job summary\u003cbr/\u003eThis position requires in-role training at an operating site which will be up to 12+ weeks in duration. \u003cbr/\u003e\u003cbr/\u003eThis training will be located 50+ miles away from the home site location. All travel accommodations for training will be booked and paid for by\u003cbr/\u003eAmazon.\u003cbr/\u003e\u003cbr/\u003eOur WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Operations Manager. In this role, you will lead and develop a team of salaried and hourly talent. You will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. To achieve this, managers are expected to provide their team with the tools needed for success while driving improvements in productivity and efficiency through data-driven decisions and analytical problem-solving. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e   \u003cbr/\u003e  Our Operation’s workflow has three major components:  First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer.\u003cbr/\u003e \u003cbr/\u003e Key Responsibilities and Job Elements:\u003cbr/\u003e - Support, mentor, and motivate your salaried and hourly workforce\u003cbr/\u003e - Lead large-scope projects with site and regional impact\u003cbr/\u003e - Build and execute productivity plans through forecast reviews, determining productivity requirements, and partnering with other Leaders to load balance \u003cbr/\u003e - Manage safety, quality, productivity, and customer delivery promises \u003cbr/\u003e - Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e - Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e - Stand/walk for up to 12 hours during shifts \u003cbr/\u003e - Work in an environment where the noise level varies and can be loud\u003cbr/\u003e - Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e - Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e- Work a flexible schedule (weekends and/or overnight shifts)\u003cbr/\u003e   Our fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Operations Managers based on location preference and the business’ current openings.  ","department_cost_center":null,"description_short":"Job summaryThis position requires in-role training at an operating site which will be up to 12+ weeks in duration. This training will be located 50+ miles away from the home site location. All travel accommodations","display_distance":null,"id":"87d0bf04-ebad-4b0f-87ab-6c52cb5e35c4","id_icims":"3150806","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3150806/operations-manager-champlain-ny","job_schedule_type":"full-time","location":"US, NY, Champlain","locations":["{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"Champlain\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, Champlain\",\"coordinates\":\"44.98616,-73.44604\",\"normalizedCountyName\":\"Clinton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Champlain, New York, USA\",\"location\":\"US, NY, Champlain\",\"region\":\"NY\",\"buildingCodeList\":[\"WNY5\"],\"normalizedCityName\":\"Champlain\"}"],"normalized_location":"Champlain, New York, USA","optional_search_labels":[],"posted_date":"December 31, 2025","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 2+ salaried employees and 70+ indirect employees\u003cbr/\u003e- Experience scoping, leading, and implementing process improvements through: Lean process, Kaizen, and/or Six Sigma.\u003cbr/\u003e- Demonstrated problem solving skills and analytical skills\u003cbr/\u003e- Excellent customer service skills, communication skills and interpersonal skills\u003cbr/\u003e- Track record of meeting or exceeding department performance goals\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Experience in: military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production, or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, CHAMPLAIN - 91,000.00 - 136,500.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"NY","title":"Operations Manager - Champlain - NY","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3150806/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}