{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 2+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-and-operations","city":"Bellingham","company_name":"Amazon.com Services LLC","country_code":"USA","description":"External job description\u003cbr/\u003eOur WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager. In this role, you will lead a team of hourly workforce and will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003eOur Operation’s workflow has three major components: First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer.\u003cbr/\u003e\u003cbr/\u003eOur fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Area Managers based on location preference and the business’ current openings.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey Responsibilities and Job Elements:\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e- Support, mentor, and motivate your hourly workforce\u003cbr/\u003e\u003cbr/\u003e- Manage safety, quality, productivity, and customer delivery promises\u003cbr/\u003e\u003cbr/\u003e- Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e\u003cbr/\u003e- Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e\u003cbr/\u003e- Stand/walk for up to 12 hours during shifts\u003cbr/\u003e\u003cbr/\u003e- Work in an environment where the noise level varies and can be loud\u003cbr/\u003e\u003cbr/\u003e- Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e\u003cbr/\u003e- Continuously climb and descend stairs (applies to sites with stairs)","department_cost_center":null,"description_short":"External job descriptionOur WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our","display_distance":null,"id":"3e68e01a-f029-48c6-8300-122e4f74e6b8","id_icims":"3151385","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3151385/area-manager","job_schedule_type":"full-time","location":"US, MA, Bellingham","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellingham\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Bellingham\",\"coordinates\":\"42.08713,-71.4747\",\"normalizedCountyName\":\"Norfolk\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellingham, Massachusetts, USA\",\"location\":\"US, MA, Bellingham\",\"region\":\"MA\",\"buildingCodeList\":[\"DCB8\"],\"normalizedCityName\":\"Bellingham\"}"],"normalized_location":"Bellingham, Massachusetts, USA","optional_search_labels":[],"posted_date":"January  2, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $70,000/year in our lowest geographic market up to $100,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"fulfillment-and-operations.team-last-mile-delivery","source_system":"JobCreator","state":"MA","title":"Area Manager","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3151385/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-delivery","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of Windows Server technologies: AD, DFS, Print Services, SCCM experience\u003cbr/\u003e- 2+ years of troubleshooting in a multi-user high availability environment experience\u003cbr/\u003e- 2+ years of PC repair, troubleshooting, deployment and liquidation experience\u003cbr/\u003e- 1+ years of IT client, server, and network service delivery experience\u003cbr/\u003e- 2+ years of networking (such as DNS, DHCP, SSL, OSI Model, and TCP/IP) experience\u003cbr/\u003e- 2+ years of corporate setting Windows, Mac or Linux Operating systems support experience\u003cbr/\u003e- 2+ years of supporting and maintaining a corporate network environment experience\u003cbr/\u003e- High school or equivalent diploma","business_category":"ecp","city":"Virtual Location - Utah","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Application deadline: Feb 3, 2026\u003cbr/\u003e\u003cbr/\u003eOne Medical is a primary care solution challenging the industry status quo by making quality care more affordable, accessible and enjoyable. But this isn’t your average doctor’s office. We’re on a mission to transform healthcare, which means improving the experience for everyone involved - from patients and providers to employers and health networks. Our seamless in-office and 24/7 virtual care services, on-site labs, and programs for preventive care, chronic care management, common illnesses and mental health concerns have been delighting people for the past fifteen years.\u003cbr/\u003e\u003cbr/\u003eIn February 2023 we marked a milestone when One Medical joined Amazon. Together, we look to deliver exceptional health care to more consumers, employers, care team members, and health networks to achieve better health outcomes. As we continue to grow and seek to impact more lives, we’re building a diverse, driven and empathetic team, while working hard to cultivate an environment where everyone can thrive.\u003cbr/\u003e\u003cbr/\u003eWe’re looking for a passionate IT Support Associate to ensure that our clinical teams, administrators, and corporate staff have the IT support they need to perform their jobs efficiently. \u003cbr/\u003e\u003cbr/\u003eIn this role, you will report directly to the IT Manager, providing technical assistance and troubleshooting for internal users across our nationwide network of medical offices. As part of the One Medical IT Technical Services Team, your main responsibility will be supporting the phone, chat, and ticket support queues, resolving technical issues, and ensuring seamless IT operations.  \u003cbr/\u003e\u003cbr/\u003eThis position offers the opportunity to tackle a variety of technical challenges while working alongside a dedicated and mission-driven team. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eDeliver exceptional IT support to One Medical employees. \u003cbr/\u003e\u003cbr/\u003eThis role is for coverage for afterhours support, 9pm to 9am EST, weekends, and holidays. \u003cbr/\u003e\u003cbr/\u003e• Serve as the first point of contact for One Medical users, documenting support calls and resolutions using our ticketing system. \u003cbr/\u003e• Respond to and troubleshoot support IT requests via phone, chat and ticketing system, ensuring timely and efficient support. \u003cbr/\u003e• Collaborate with a dedicated IT support team to diagnose and resolve technical issues. \u003cbr/\u003e• Provide remote support to employees, ensuring all incidents are addressed in a professional, timely and efficient manner. \u003cbr/\u003e• Install and configure hardware/software issues across Windows, macOS and Chrome OS environments. \u003cbr/\u003e• Observe and ensure compliance with security and system configuration standards as well as HIPAA regulations. \u003cbr/\u003e\u003cbr/\u003e• Contribute to and maintain the IT knowledge base, ensuring documentation is accurate and up to date. \u003cbr/\u003e• Assist in workflow improvements. \u003cbr/\u003e\u003cbr/\u003e• Adherence to shift schedules and timeliness are key requirements.\u003cbr/\u003e• Willingness to work flexible shifts and scheduling, weekends, and holidays.\u003cbr/\u003e• Must be willing and able to occasionally come to Amazon corporate sites with 24 hours notice.","department_cost_center":null,"description_short":"One Medical is a primary care solution challenging the industry status quo by making quality care more affordable, accessible and enjoyable. But this isn’t your average doctor’s office. We’re on a mission","display_distance":null,"id":"e79df17e-101a-46f4-afc4-52e228f977a6","id_icims":"3142994","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Technical Services","job_function_id":null,"job_path":"/en/jobs/3142994/it-support-engineer-i-afterhours-aom-one-medical-it-support","job_schedule_type":"full-time","location":"US, UT, Virtual Location - Utah","locations":["{\"normalizedStateName\":\"Utah\",\"normalizedCountryCode\":\"USA\",\"city\":\"Virtual Location - Utah\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, UT, Virtual Location - Utah\",\"coordinates\":\"40.76031,-111.88822\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Utah, USA\",\"location\":\"US, UT, Virtual Location - Utah\",\"region\":\"UT\",\"buildingCodeList\":[\"VIR\"]}","{\"normalizedCountryCode\":\"USA\",\"city\":\"Virtual\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, Virtual\",\"coordinates\":\"38.89036,-77.03196\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"USA\",\"location\":\"US, Virtual\",\"region\":\"\",\"buildingCodeList\":[\"VIR\"]}"],"normalized_location":"Utah, USA","optional_search_labels":[],"posted_date":"December 15, 2025","preferred_qualifications":"- 2+ years of computer networking experience\u003cbr/\u003e- Experience supporting video conference and teleconference equipment\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, ,  - 25.00 - 41.00 USD hourly\u003cbr/\u003eUSA, UT, Virtual Location - Utah - 25.00 - 41.00 USD hourly","primary_search_label":"ecp.engine","source_system":"JobCreator","state":"UT","title":"IT Support Engineer I - Afterhours (AOM), One Medical IT Support","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3142994/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"engine","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical, or 1+ years of data center or mission critical facilities (example: hospital, military facility, public safety facility, etc.) experience\u003cbr/\u003e- 1+ years experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Umatilla","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"c87ad480-055e-44e8-b605-fbc6abaa30f2","id_icims":"3161277","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3161277/engineering-operations-technician-dcc-communities","job_schedule_type":"full-time","location":"US, OR, Umatilla","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Philadelphia\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Philadelphia\",\"coordinates\":\"39.95222,-75.16218\",\"normalizedCountyName\":\"Philadelphia\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Philadelphia, Pennsylvania, USA\",\"location\":\"US, PA, Philadelphia\",\"region\":\"PA\",\"buildingCodeList\":[\"DLH5\",\"ZPA1\",\"PPP1\",\"PPH4\",\"DPP4\",\"PAS1\",\"DDP2\",\"PPH2\",\"DPP2\",\"DLH3\",\"ZPL1\",\"LPH1\",\"TTN1\",\"UPA3\",\"ZPL3\",\"PHL50\",\"PHL400\",\"PHL800\",\"MAE9\",\"RTAD9\",\"CSS1\",\"DDP8\",\"DGI5\",\"UPA1\",\"ZPL7\",\"ARA1\",\"PHL420\",\"LSOS\",\"PEH1\",\"WFM10922\",\"DDP9\",\"DDP3\",\"WFM112\",\"ABE6\",\"RTAD52\",\"PPH3\",\"DGI9\",\"WFM514\",\"SPA1\",\"DDP1\",\"DPH8\",\"LPN2\",\"DPP5\",\"PPH1\",\"PEH2\",\"ZPL6\",\"CBP1\",\"XAB8\",\"R088\",\"ZPL4\",\"PHL60\",\"PHL51\",\"DPH1\",\"MAK5\",\"SLT1\",\"PEN1\",\"ZPL5\"],\"normalizedCityName\":\"Philadelphia\"}","{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"Reno\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, Reno\",\"coordinates\":\"39.52766,-119.81353\",\"normalizedCountyName\":\"Washoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Reno, Nevada, USA\",\"location\":\"US, NV, Reno\",\"region\":\"NV\",\"buildingCodeList\":[\"HRN2\",\"WFM293\",\"LSM7\",\"RNO404\",\"RNO400\",\"SVMT43\",\"RNO2\",\"HRN1\",\"DLV3\",\"KRNO\",\"SVMT18\",\"SVMT44\",\"RNO403\",\"RNO4\",\"DRN1\",\"SNV4\",\"SVMT45\"],\"normalizedCityName\":\"Reno\"}","{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Atlanta\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Atlanta\",\"coordinates\":\"33.74831,-84.39111\",\"normalizedCountyName\":\"Fulton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Atlanta, Georgia, USA\",\"location\":\"US, GA, Atlanta\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL52\",\"LAT2\",\"ATL66\",\"ATL21\",\"ATL140\",\"DAT4\",\"ATL23\",\"ATL50\",\"GST2\",\"UGA2\",\"ZAT6\",\"R077\",\"HAT1\",\"DAT6\",\"ATL02\",\"ONM145\",\"ATL11\",\"LMER\",\"XATL9\",\"ATL62\",\"ATL58\",\"ATL61\",\"ATL75\",\"ONM144\",\"ATL12\",\"CGG1\",\"LAT4\",\"WFM094\",\"ATL801\",\"HGA9\",\"TRU1\",\"LAL2\",\"GST1\",\"ONM151\",\"WFM206\",\"KATL\",\"ATL19\",\"DAT3\",\"ONM148\",\"LAT1\",\"GST3\",\"ATL22\",\"EMR1\",\"FTY3\",\"ATL34\",\"GST5\",\"ATL53\",\"ZAT3\",\"FAD1\",\"ATL55\",\"WFM650\",\"ATL77\",\"XAT2\",\"MGE8\",\"GWC1\",\"GAT1\",\"DFT4\",\"ATL84\",\"WFM196\",\"WFM697\",\"WFM136\",\"ATL200\",\"ATL74\",\"FTY9\",\"ATL01\",\"ONM288\",\"LAT7\",\"XAT3\",\"WFM342\",\"ATL63\",\"JAL1\",\"R042\",\"DGE8\",\"PDK2\",\"ONM147\",\"ZPN1\",\"WFC24\",\"ATL175\",\"GST4\",\"ATLY\"],\"normalizedCityName\":\"Atlanta\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD653\",\"IAD28\",\"IAD168\",\"DCA52\",\"IAD549\",\"IAD166\",\"IAD848\",\"IAD547\",\"IAD739\",\"IAD651\",\"IAD940\",\"IAD657\",\"IAD660\",\"IAD992\",\"IAD21\",\"IAD993\",\"IAD656\",\"IAD655\",\"IAD769\",\"IAD8\",\"IAD31\",\"IAD548\",\"IAD736\",\"IAD905\",\"IAD21R\",\"IAD654\",\"IAD650\",\"IAD165\",\"IAD991\",\"IAD500\",\"IAD658\",\"IAD546\",\"IAD990\",\"IAD960\",\"IAD659\",\"IAD869\",\"IAD652\",\"IAD545\",\"IAD737\",\"IAD980\",\"IAD167\"],\"normalizedCityName\":\"Herndon\"}","{\"normalizedStateName\":\"Oregon\",\"normalizedCountryCode\":\"USA\",\"city\":\"Umatilla\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OR, Umatilla\",\"coordinates\":\"45.91768,-119.34203\",\"normalizedCountyName\":\"Umatilla\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Umatilla, Oregon, USA\",\"location\":\"US, OR, Umatilla\",\"region\":\"OR\",\"buildingCodeList\":[\"PDX121\",\"PDT122\",\"PDX135\",\"PDT69\",\"PDX133\",\"PDX2\",\"PDX201\",\"PDX199\",\"PDT51\",\"PDX96\",\"PDX51\",\"PDX123\",\"PDX195\",\"PDX57\",\"PDT196\",\"PDX127\",\"PDX130\",\"PDX126\",\"PDX128\",\"PDT60\",\"PDX194\",\"PDT65\",\"PDX131\",\"PDX200\",\"PDT2\",\"PDX137\",\"PDX78\",\"PDX071\",\"PDT197\",\"PDX54\",\"PDT54\",\"PDX134\",\"PDX198\",\"PDX122\",\"PDX136\",\"PDX196\",\"PDT195\",\"PDX132\",\"PDT130\",\"PDX60\",\"PDX100\",\"PDX125\",\"PDX124\",\"PDT194\",\"PDX197\"],\"normalizedCityName\":\"Umatilla\"}","{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Jackson\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Jackson\",\"coordinates\":\"32.29896,-90.18044\",\"normalizedCountyName\":\"Hinds\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Jackson, Mississippi, USA\",\"location\":\"US, MS, Jackson\",\"region\":\"MS\",\"buildingCodeList\":[\"HKS401\",\"QBB1\",\"WFM486\",\"LJKN\",\"WMS1\",\"HKS400\",\"JAN120\",\"JAN900\"],\"normalizedCityName\":\"Jackson\"}"],"normalized_location":"Umatilla, Oregon, USA","optional_search_labels":["aws.team-ais","aws.team-dc","hourly","military"],"posted_date":"January 16, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, GA, Atlanta - 31.00 - 55.00 USD hourly\u003cbr/\u003eUSA, MS, Jackson - 28.00 - 50.00 USD hourly\u003cbr/\u003eUSA, MS, Jackson - 31.00 - 55.00 USD hourly\u003cbr/\u003eUSA, NV, Reno - 31.00 - 55.00 USD hourly\u003cbr/\u003eUSA, OR, Umatilla - 31.00 - 55.00 USD hourly\u003cbr/\u003eUSA, PA, PHILADELPHIA - 31.00 - 55.00 USD hourly\u003cbr/\u003eUSA, PA, Philadelphia - 28.00 - 50.00 USD hourly\u003cbr/\u003eUSA, PA, Philadelphia - 31.00 - 55.00 USD hourly\u003cbr/\u003eUSA, VA, Herndon - 31.00 - 55.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"OR","title":"Engineering Operations Technician, DCC Communities ","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3161277/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of Microsoft Office products and applications experience\u003cbr/\u003e- 2+ years of electrical and mechanical experience.\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends","business_category":"aws","city":"Umatilla","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e- Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"0bbd396f-b4f0-4057-93ee-7a4b6b5a7645","id_icims":"3161330","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3161330/engineering-operations-technician-dcc-communities","job_schedule_type":"full-time","location":"US, OR, Umatilla","locations":["{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"Reno\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, Reno\",\"coordinates\":\"39.52766,-119.81353\",\"normalizedCountyName\":\"Washoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Reno, Nevada, USA\",\"location\":\"US, NV, Reno\",\"region\":\"NV\",\"buildingCodeList\":[\"HRN2\",\"WFM293\",\"LSM7\",\"RNO404\",\"RNO400\",\"SVMT43\",\"RNO2\",\"HRN1\",\"DLV3\",\"KRNO\",\"SVMT18\",\"SVMT44\",\"RNO403\",\"RNO4\",\"DRN1\",\"SNV4\",\"SVMT45\"],\"normalizedCityName\":\"Reno\"}","{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Atlanta\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Atlanta\",\"coordinates\":\"33.74831,-84.39111\",\"normalizedCountyName\":\"Fulton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Atlanta, Georgia, USA\",\"location\":\"US, GA, Atlanta\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL52\",\"LAT2\",\"ATL66\",\"ATL21\",\"ATL140\",\"DAT4\",\"ATL23\",\"ATL50\",\"GST2\",\"UGA2\",\"ZAT6\",\"R077\",\"HAT1\",\"DAT6\",\"ATL02\",\"ONM145\",\"ATL11\",\"LMER\",\"XATL9\",\"ATL62\",\"ATL58\",\"ATL61\",\"ATL75\",\"ONM144\",\"ATL12\",\"CGG1\",\"LAT4\",\"WFM094\",\"ATL801\",\"HGA9\",\"TRU1\",\"LAL2\",\"GST1\",\"ONM151\",\"WFM206\",\"KATL\",\"ATL19\",\"DAT3\",\"ONM148\",\"LAT1\",\"GST3\",\"ATL22\",\"EMR1\",\"FTY3\",\"ATL34\",\"GST5\",\"ATL53\",\"ZAT3\",\"FAD1\",\"ATL55\",\"WFM650\",\"ATL77\",\"XAT2\",\"MGE8\",\"GWC1\",\"GAT1\",\"DFT4\",\"ATL84\",\"WFM196\",\"WFM697\",\"WFM136\",\"ATL200\",\"ATL74\",\"FTY9\",\"ATL01\",\"ONM288\",\"LAT7\",\"XAT3\",\"WFM342\",\"ATL63\",\"JAL1\",\"R042\",\"DGE8\",\"PDK2\",\"ONM147\",\"ZPN1\",\"WFC24\",\"ATL175\",\"GST4\",\"ATLY\"],\"normalizedCityName\":\"Atlanta\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD653\",\"IAD28\",\"IAD168\",\"DCA52\",\"IAD549\",\"IAD166\",\"IAD848\",\"IAD547\",\"IAD739\",\"IAD651\",\"IAD940\",\"IAD657\",\"IAD660\",\"IAD992\",\"IAD21\",\"IAD993\",\"IAD656\",\"IAD655\",\"IAD769\",\"IAD8\",\"IAD31\",\"IAD548\",\"IAD736\",\"IAD905\",\"IAD21R\",\"IAD654\",\"IAD650\",\"IAD165\",\"IAD991\",\"IAD500\",\"IAD658\",\"IAD546\",\"IAD990\",\"IAD960\",\"IAD659\",\"IAD869\",\"IAD652\",\"IAD545\",\"IAD737\",\"IAD980\",\"IAD167\"],\"normalizedCityName\":\"Herndon\"}","{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Phoenix\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Phoenix\",\"coordinates\":\"33.44825,-112.0758\",\"normalizedCountyName\":\"Maricopa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Phoenix, Arizona, USA\",\"location\":\"US, AZ, Phoenix\",\"region\":\"AZ\",\"buildingCodeList\":[\"PHX101\",\"CMKT6\",\"PHX3\",\"LALT2\",\"LPX4\",\"PHX60\",\"GYR3\",\"PPX1\",\"ONM217\",\"PHX250\",\"PHX402\",\"DAZ2\",\"VXAZ\",\"PHX62\",\"DPX2\",\"TFC1\",\"PHX052\",\"PHX55\",\"FFZ81\",\"UAZ1\",\"ZPH1\",\"LALT4\",\"PHX51\",\"WFM788\",\"KRB3\",\"HPX9\",\"AZA6\",\"DPX8\",\"MBE8\",\"XUSH\",\"ZPH2\",\"DTU6\",\"PHX40\",\"LPX1\",\"SDL1\",\"PHX41\",\"PHX50\",\"FFZ82\",\"ONM111\",\"PHX750\",\"PHX31\",\"SAZ1\",\"GEU4\",\"ZPX7\",\"FFZ61\",\"PHX102\",\"PHX801\",\"LALT3\",\"PCA1\",\"PHX30\",\"HPX2\",\"FFZ80\",\"DPX5\",\"PHX100\",\"KPHX1\",\"PHX73\",\"PHX68\",\"PHX54\",\"ONM113\",\"PHX251\",\"LPX5\",\"OSW9\",\"VUKC\",\"FFZ71\",\"LALT7\",\"PHX131\",\"ONM103\",\"ZPX9\",\"ZPX3\",\"PHX20\",\"AZA5\",\"FFZ70\",\"PHX78\",\"VUDS\",\"WFM476\",\"ONM105\",\"WFM172\",\"TUS1\",\"DTU8\",\"XPH2\",\"PHX6\",\"PHX7\",\"PHX120\",\"LALT6\",\"ADS63\",\"PHX72\",\"AZA4\",\"LPVM\",\"FFZ60\"],\"normalizedCityName\":\"Phoenix\"}","{\"normalizedStateName\":\"Oregon\",\"normalizedCountryCode\":\"USA\",\"city\":\"Umatilla\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OR, Umatilla\",\"coordinates\":\"45.91768,-119.34203\",\"normalizedCountyName\":\"Umatilla\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Umatilla, Oregon, USA\",\"location\":\"US, OR, Umatilla\",\"region\":\"OR\",\"buildingCodeList\":[\"PDX121\",\"PDT122\",\"PDX135\",\"PDT69\",\"PDX133\",\"PDX2\",\"PDX201\",\"PDX199\",\"PDT51\",\"PDX96\",\"PDX51\",\"PDX123\",\"PDX195\",\"PDX57\",\"PDT196\",\"PDX127\",\"PDX130\",\"PDX126\",\"PDX128\",\"PDT60\",\"PDX194\",\"PDT65\",\"PDX131\",\"PDX200\",\"PDT2\",\"PDX137\",\"PDX78\",\"PDX071\",\"PDT197\",\"PDX54\",\"PDT54\",\"PDX134\",\"PDX198\",\"PDX122\",\"PDX136\",\"PDX196\",\"PDT195\",\"PDX132\",\"PDT130\",\"PDX60\",\"PDX100\",\"PDX125\",\"PDX124\",\"PDT194\",\"PDX197\"],\"normalizedCityName\":\"Umatilla\"}","{\"normalizedStateName\":\"Ohio\",\"normalizedCountryCode\":\"USA\",\"city\":\"Columbus\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OH, Columbus\",\"coordinates\":\"39.96199,-83.00275\",\"normalizedCountyName\":\"Franklin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Columbus, Ohio, USA\",\"location\":\"US, OH, Columbus\",\"region\":\"OH\",\"buildingCodeList\":[\"XDCM\",\"DCM1\",\"LCB1\",\"CMH78\",\"CMH97\",\"XLAE\",\"WFM555\",\"XCM2\",\"CMH402\",\"ONM191\",\"CMH95\",\"CCH6\",\"QRU6\",\"DWO2\",\"UOH4\",\"JCM1\",\"ONM193\",\"CCH4\",\"WFM385\",\"CMH10\",\"ONM192\",\"CCH5\",\"OHI1\",\"CHC1\",\"CHC2\",\"CMH11\",\"OSU1\",\"LCB3\",\"DCN4\",\"CMH96\",\"OHR1\",\"CCH7\",\"KCM1\",\"CHC3\",\"DCM7\",\"DCN2\",\"XCM4\",\"CMH90\",\"UOH2\",\"CMH401\"],\"normalizedCityName\":\"Columbus\"}","{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Jackson\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Jackson\",\"coordinates\":\"32.29896,-90.18044\",\"normalizedCountyName\":\"Hinds\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Jackson, Mississippi, USA\",\"location\":\"US, MS, Jackson\",\"region\":\"MS\",\"buildingCodeList\":[\"HKS401\",\"QBB1\",\"WFM486\",\"LJKN\",\"WMS1\",\"HKS400\",\"JAN120\",\"JAN900\"],\"normalizedCityName\":\"Jackson\"}"],"normalized_location":"Umatilla, Oregon, USA","optional_search_labels":["military","aws.team-dc","hourly","aws.team-ais"],"posted_date":"January 16, 2026","preferred_qualifications":"- 4+ years of data center engineering experience\u003cbr/\u003e- Bachelor's degree in Electrical Engineering, Mechanical Engineering, or a related field\u003cbr/\u003e- Experience in data center engineering\u003cbr/\u003e- Experience with reading and writing procedures, technical documents, and engineering drawings\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, AZ, Phoenix - 36.00 - 63.00 USD hourly\u003cbr/\u003eUSA, GA, Atlanta - 36.00 - 63.00 USD hourly\u003cbr/\u003eUSA, MS, Jackson - 32.00 - 57.00 USD hourly\u003cbr/\u003eUSA, MS, Jackson - 36.00 - 63.00 USD hourly\u003cbr/\u003eUSA, NV, Reno - 36.00 - 63.00 USD hourly\u003cbr/\u003eUSA, OH, COLUMBUS - 36.00 - 63.00 USD hourly\u003cbr/\u003eUSA, OH, Columbus - 36.00 - 63.00 USD hourly\u003cbr/\u003eUSA, OR, Umatilla - 36.00 - 63.00 USD hourly\u003cbr/\u003eUSA, VA, Herndon - 36.00 - 63.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"OR","title":"Engineering Operations Technician, DCC Communities ","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3161330/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Are 18 years of age or older\u003cbr/\u003e- Currently enrolled in a PhD program in Computer Science, Robotics, Engineering, Machine Learning, Operations Research, Mathematics, or a related quantitative field\u003cbr/\u003e- Must be eligible for and available for full-time (40 hours per week) internship in person based out of the assigned office location for the whole duration of the internship/co-op\u003cbr/\u003e- At least 1 year of relevant academic research or industry experience within Robotics, Computer Vision, Machine Learning, Optimization, Manipulation, Perception, Motion Planning and Controls, Movement, Autonomous Navigation, Path Planning, or related\u003cbr/\u003e- Experience programming in Java, C++, Python, or related","business_category":"subsidiaries","city":"North Reading","company_name":"Amazon.com Services LLC - A57","country_code":"USA","description":"Are you passionate about robotics and research? Do you want to solve real customer problems through innovative technology? Do you enjoy working on scalable research and projects in a collaborative team environment? Do you want to see your science solutions directly impact millions of customers worldwide?\u003cbr/\u003e\u003cbr/\u003eAt Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. Customer obsession is part of our company DNA, which has made us one of the world's most beloved brands.\u003cbr/\u003e\u003cbr/\u003eWe’re looking for current PhD students with a passion for robotic research and applications to join us as Robotics Applied Scientist II Intern/Co-ops in 2026 to shape the future of robotics and automation at an unprecedented scale across. For these positions, our Robotics teams at Amazon are looking for students with a specialization in one or more of the research areas in robotics such as: robotics, robotics manipulation (e.g., robot arm, grasping, dexterous manipulation, end of arm tools/end effector), autonomous mobile robots, mobile manipulation, movement, autonomous navigation, locomotion, motion/path planning, controls, perception, sensing, robot learning, artificial intelligence, machine learning, computer vision, large language models, human-robot interaction, robotics simulation, optimization, and more!\u003cbr/\u003e\u003cbr/\u003eWe're looking for curious minds who think big and want to define tomorrow's technology. At Amazon, you'll grow into the high-impact engineer you know you can be, supported by a culture of learning and mentorship. Every day brings exciting new challenges and opportunities for personal growth.\u003cbr/\u003e\u003cbr/\u003eBy applying to this role, you will be considered for Robotics Applied Scientist II Intern/Co-op (2026) opportunities across various Robotics teams at Amazon with different robotics research focus, with internship positions available for multiple locations, durations (3 to 6+ months), and year-round start dates (winter, spring, summer, fall).\u003cbr/\u003e\u003cbr/\u003eAmazon intern and co-op roles follow the same internship structure. \"Intern/Internship\" wording refers to both interns and co-ops. Amazon internships across all seasons are full-time positions, and interns should expect to work in office, Monday-Friday, up to 40 hours per week typically between 8am-5pm. Specific team norms around working hours will be communicated by your manager. Interns should not have conflicts such as classes or other employment during the Amazon work-day. Applicants should have a minimum of one quarter/semester/trimester remaining in their studies after their internship concludes.\u003cbr/\u003e\u003cbr/\u003eThe robotics internship join dates, length, location, and prospective team will be finalized at the time of any applicable job offers. In your application, you will be able to provide your preference of research interests, start dates, internship duration, and location. While your preference will be taken into consideration, we cannot guarantee that we can meet your selection based on several factors including but not limited to the internship availability and business needs of this role.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout the team\u003cbr/\u003eLearn more about Robotics at Amazon:\u003cbr/\u003e\u003cbr/\u003ehttps://amazon.jobs/en/teams/amazon-robotics\u003cbr/\u003e\u003cbr/\u003ehttps://www.aboutamazon.com/news/operations/amazon-robotics-robots-fulfillment-center\u003cbr/\u003e\u003cbr/\u003ehttps://www.aboutamazon.com/news/operations/amazon-million-robots-ai-foundation-model","department_cost_center":null,"description_short":"Are you passionate about robotics and research? Do you want to solve real customer problems through innovative technology? Do you enjoy working on scalable research and projects in a collaborative team","display_distance":null,"id":"16d5338e-9092-41c8-9999-1847f1fada31","id_icims":"3104589","is_intern":null,"is_manager":null,"job_category":"Research Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3104589/robotics-applied-scientist-ii-intern-co-op-2026-robotics-manipulation-perception-motion-planning-autonomous-mobile-robots-computer-vision-machine-learning-controls-and-more-amazon-robotics-r-d","job_schedule_type":"full-time","location":"US, MA, North Reading","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Boston\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Boston\",\"coordinates\":\"42.35866,-71.05674\",\"normalizedCountyName\":\"Suffolk\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Boston, Massachusetts, USA\",\"location\":\"US, MA, Boston\",\"region\":\"MA\",\"buildingCodeList\":[\"UMA3\",\"LCRP\",\"BCC1\",\"OSB1\",\"DBO8\",\"ONM89\",\"JBO4\",\"BCC2\",\"BOS21R\",\"ZBS3\",\"WFM513\",\"BOS8\",\"ZBS2\",\"BOS29\",\"BOS80\",\"WFM438\",\"BOS39\",\"WFM158\",\"ONM85\",\"TDG2\",\"BOS51\",\"JOR8\",\"ONM246\",\"BOS17\",\"FWY1\",\"BOS52\",\"LSYM\",\"TDG1\",\"JOR13\",\"BOS21\",\"ONM302\",\"LBO5\",\"HUL3\",\"WFM031\",\"JBO6\",\"BOS41\",\"ONM86\",\"BOS28\",\"BOS50\",\"ONM90\",\"ONM216\",\"BOS800\",\"HCS4\"],\"normalizedCityName\":\"Boston\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sunnyvale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Sunnyvale\",\"coordinates\":\"37.37188,-122.03751\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sunnyvale, California, USA\",\"location\":\"US, CA, Sunnyvale\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC10\",\"UCA7\",\"SJC11\",\"SJC13\",\"ONM228\",\"DOF4\",\"ONM251\",\"FSJ1\",\"SJC32\",\"ONM71\",\"WFM707\",\"LSO2\",\"SJC14\",\"ZFA4\",\"WFM760\",\"SJC31\",\"ONM227\"],\"normalizedCityName\":\"Sunnyvale\"}","{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Westborough\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Westborough\",\"coordinates\":\"42.2843,-71.59909\",\"normalizedCountyName\":\"Worcester\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Westborough, Massachusetts, USA\",\"location\":\"US, MA, Westborough\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS27\"],\"normalizedCityName\":\"Westborough\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"ZBL2\",\"FLR5\",\"SEA127\",\"MAB2\",\"KFTS\",\"LBV5\",\"SEA94\",\"CWA12\",\"SEA132\",\"ZBL1\",\"SEA113\",\"NST3\",\"UNP1\",\"SEA108\",\"NST9\",\"SEA120\",\"SEA93\",\"METR1\",\"JSE3\",\"SEA105\",\"SEA119\",\"SEA123\",\"SPP67\",\"SEA6\",\"NST5\",\"SEA107\",\"SEA104\",\"ZSE2\",\"SEA121\",\"SEA8\",\"ONM123\",\"SEA112\",\"WFM657\",\"IBF2\",\"WFM153\",\"SEA82\",\"SEA106\",\"ZBL3\"],\"normalizedCityName\":\"Bellevue\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA90\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Wisconsin\",\"normalizedCountryCode\":\"USA\",\"city\":\"Westboro\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Westboro\",\"coordinates\":\"45.35424,-90.29663\",\"normalizedCountyName\":\"Taylor\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Westboro, Wisconsin, USA\",\"location\":\"US, MA, Westboro\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS27\",\"BOS36\"],\"normalizedCityName\":\"Westboro\"}","{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"North Reading\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, North Reading\",\"coordinates\":\"42.57455,-71.07888\",\"normalizedCountyName\":\"Middlesex\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"North Reading, Massachusetts, USA\",\"location\":\"US, MA, North Reading\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS12\"],\"normalizedCityName\":\"North Reading\"}","{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"N.reading\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, N.reading\",\"coordinates\":\"42.57455,-71.07888\",\"normalizedCountyName\":\"Middlesex\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"North Reading, Massachusetts, USA\",\"location\":\"US, MA, N.reading\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS38\"],\"normalizedCityName\":\"North Reading\"}"],"normalized_location":"North Reading, Massachusetts, USA","optional_search_labels":[],"posted_date":"October  8, 2025","preferred_qualifications":"- Publication(s) at top-tier peer-reviewed conferences or journals\u003cbr/\u003e- Ability to develop system prototypes\u003cbr/\u003e- Demonstrated ability to work on collaborative and cross-functional teams\u003cbr/\u003e- Drive to see a project through from research concept to working prototype\u003cbr/\u003e- Strong algorithm development experience\u003cbr/\u003e- A working knowledge of analysis of algorithms and computational complexity\u003cbr/\u003e- Familiarity with state-of-the-art algorithms in field of expertise\u003cbr/\u003e- Excellent creative problem-solving skills\u003cbr/\u003e- Strong written and verbal communication skills with the ability to present complex technical information in a clear and concise manner to a variety of audiences\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Sunnyvale - 171,600.00 - 222,200.00 USD annually\u003cbr/\u003eUSA, MA, BOSTON - 142,800.00 - 193,200.00 USD annually\u003cbr/\u003eUSA, MA, Boston - 142,800.00 - 193,200.00 USD annually\u003cbr/\u003eUSA, MA, N.Reading - 142,800.00 - 193,200.00 USD annually\u003cbr/\u003eUSA, MA, North Reading - 142,800.00 - 193,200.00 USD annually\u003cbr/\u003eUSA, MA, Westboro - 142,800.00 - 193,200.00 USD annually\u003cbr/\u003eUSA, WA, BELLEVUE - 142,800.00 - 193,200.00 USD annually\u003cbr/\u003eUSA, WA, Bellevue - 142,800.00 - 193,200.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 142,800.00 - 193,200.00 USD annually","primary_search_label":"subsidiaries.team-amazon-robotics","source_system":"JobCreator","state":"MA","title":"Robotics - Applied Scientist II Intern / Co-op - 2026 (Robotics, Manipulation, Perception, Motion Planning, Autonomous Mobile Robots, Computer Vision, Machine Learning, Controls, and more), Amazon Robotics R\u0026D","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3104589/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-robotics","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- 3+ years of program or project management experience\u003cbr/\u003e- Knowledge of Excel at an intermediate level (e.g., pivot tables \u0026 charts, multiple criteria lookups, nested logical/IF formulas, data cleansing, array formulas, etc.)\u003cbr/\u003e- Experience using data and metrics to determine and drive improvements\u003cbr/\u003e- Experience working cross functionally with tech and non-tech teams\u003cbr/\u003e- 3+ years of professional work experience in Health \u0026 Safety, finance or procurement, supply chain management, project/contractor management, contractor safety, engineering, or providing direct oversight for 3rd party services/contractors.","business_category":"fulfillment-and-operations","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Passionate about Safety? Join our dynamic team as a Contractor Safety Program Manager and make a real impact on the North America operations that power the world's largest e-commerce company! \u003cbr/\u003e\u003cbr/\u003eIn this exciting role, you'll be a key partner to Procurement, Field WHS, and site support teams such as Reliability, Maintenance, and Engineering (RME), working closely with them to ensure world-class safety standards for our under the roof contractors across Amazon North America Operations. You will also liaison externally with Amazon's contractor qualification partner, Avetta, supporting product enhancements and contractor partnership. \u003cbr/\u003e\u003cbr/\u003eYou will be empowered to own and drive safety programs from inception through implementation.\u003cbr/\u003eYou will also own safety related projects and own the actions needed to deliver them.\u003cbr/\u003e\u003cbr/\u003eAlso supporting field operations daily safety routines, you will support rigorous investigations to uncover root causes, develop actions, and share learnings. \u003cbr/\u003e\u003cbr/\u003eCollaborating cross-functionally, you'll scale successful safety initiatives and improvement projects, cementing Amazon's reputation as an industry leader. If you're an ambitious safety professional hungry to drive change across North America, this is an unparalleled opportunity to make your mark.\u003cbr/\u003e\u003cbr/\u003eBring your safety expertise, boundless energy, and collaborative spirit - together, we'll reinvent what's possible! Apply now.\u003cbr/\u003e\u003cbr/\u003eRelocation to corporate office location BNA12, WAS19, or SEA94 is required. SEA94 is preferred. \u003cbr/\u003e\u003cbr/\u003eThis role requires travel up to 25% of the time.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eA successful candidate will be able to own and drive safety programs from inception through implementation.\u003cbr/\u003eThe candidate will own safety related projects and own the actions needed to deliver them including narrative paper writing for executive leadership audiences.\u003cbr/\u003eAbility to assess contractor high risk operations, such as work at heights, hazardous energy, and lifting and rigging and implement strategies to minimize risk.\u003cbr/\u003eServe as a trusted safety partner to senior regional leaders across North America, aligning on strategic priorities and tracking progress against goals.\u003cbr/\u003eConduct regular site visits to Amazon warehouse locations to personally observe safety practices, gather feedback from frontline teams, and identify opportunities for improvement.\u003cbr/\u003eUtilize insights from site visits to develop and update  safety standards, protocols, and training materials that drive consistent, best-in-class safety performance.\u003cbr/\u003eLead comprehensive incident investigations, rapidly identify root causes, and implement corrective actions to prevent recurrence.\u003cbr/\u003eCollaborate cross-functionally with teams in Operations, Procurement, Construction, and beyond to scale successful safety initiatives and embed sustainable improvements.\u003cbr/\u003eMonitor safety metrics, analyze trends, and present recommendations to senior leadership on priorities and investment areas. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou might start with a series of check-in calls, connecting with Procurement and Regional Site WHS leaders across North America to discuss emerging issues, share best practices, and align on priorities. Then, you hop on a global project call, collaborating with teammates from around the world to finalize a new digital safety tool. In the afternoon, you analyze leading indicator data, identifying an opportunity for improvement. You could spend time partnering with field leaders to develop action plans from recent incidents, or working on a project to enhance safety language used in contracts. You end the day on a call with a contractor and a site WHS manager, reviewing compliance requirements for a planned project.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe North America WHS Contractor Safety team collaborates cross-functionally to develop and continually improve contractor safety policies, procedures, and standards. We provide SME knowledge and support related to contractor safety management. We deep dive contractor safety performance through our qualification partner Avetta. We collate and track contractor incident data to make risk based decisions. We standardize the collection and approval of contractor project safety documentation and management of under the roof contractors through Avetta Worksite Safety. We drive standardized levels of individual contractor competence through the collection and approval of training records and experience using Avetta Worker Management. We ensure contractors are aware of and adhere to Amazon safety policy and requirements onsite through contractor orientation and acknowledgement of Amazon Special Safety Conditions. ","department_cost_center":null,"description_short":"Passionate about Safety? Join our dynamic team as a Contractor Safety Program Manager and make a real impact on the North America operations that power the world's largest e-commerce company! In this exciting","display_distance":null,"id":"a66b2ee9-0b71-45dc-8c50-c44c5c4e696d","id_icims":"3171189","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Program Management","job_function_id":null,"job_path":"/en/jobs/3171189/program-manager-whs-contractor-safety","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA94\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"February  1, 2026","preferred_qualifications":"- 3+ years of driving end to end delivery, and communicating results to senior leadership experience\u003cbr/\u003e- Experience in stakeholder management, dealing with multiple stakeholders at varied levels of the organization\u003cbr/\u003e- Experience building processes, project management, and schedules\u003cbr/\u003e- PMP certificate\u003cbr/\u003e- Associate Safety Professional (ASP) or Certified Safety Professional (CSP)\u003cbr/\u003e- Embraces the use of AI, understanding basic principles, such as prompt engineering, and how to apply AI to day to day tasks.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Bellevue - 82,700.00 - 129,800.00 USD annually","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"WA","title":"Program Manager, WHS - Contractor Safety","university_job":null,"updated_time":"about 3 hours","url_next_step":"https://account.amazon.com/jobs/3171189/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of program or project management experience\u003cbr/\u003e- Knowledge of Excel (Pivot Tables, VLookUps) at an advanced level and SQL\u003cbr/\u003e- Experience working cross functionally with tech and non-tech teams\u003cbr/\u003e- Experience using data and metrics to determine and drive improvements\u003cbr/\u003e- Experience owning program strategy, end-to-end delivery, and communicating results to senior leadership\u003cbr/\u003e- Bachelor’s degree in Ergonomics or Occupational Health and Safety\u003cbr/\u003e- Experience in interfacing with safety regulatory agencies","business_category":"fulfillment-and-operations","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"At Amazon, we strive to be Earth's best employer. The Workplace Health \u0026 Safety (WHS) Worldwide Ergonomics and Safety Experience (WESE) team is seeking a detailed-oriented, experienced Ergonomics Expert to join the Ergonomics Policy Implementation team vertical and coordinate regulatory ergonomic responses with the governance and external affairs team.\u003cbr/\u003e\u003cbr/\u003eThis position requires an experienced, customer-obsessed ergonomics leader with deep project management expertise who can interface with policy managers to deliver results via cross-organizational programs.  The individual must be comfortable working through ambiguity, forging cross-discipline relationships, making high-judgement decisions based on data, and influencing senior leaders and executives.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Drive resolution of requests for information for inspections, complaints, and deep dives related to ergonomics at facilities worldwide\u003cbr/\u003e• Identify and address customer and business pain points by actively deep diving into data and operational processes, and by working with cross-functional teams\u003cbr/\u003e• Write effective Amazon documents and ensure high quality content for stakeholders\u003cbr/\u003e• Work backwards – demonstrate planning capability to execute on deliverables\u003cbr/\u003e• Provide effective ergonomic guidance to customers and stakeholders across regions\u003cbr/\u003e• Collect, analyze, and present data to drive decision making, as required.  Know when something is not right, and either course correct or escalate for help. \u003cbr/\u003e• Anticipate bottlenecks and blockers, assess risks, mitigate issues, and troubleshoot, as needed","department_cost_center":null,"description_short":"At Amazon, we strive to be Earth's best employer. The Workplace Health \u0026 Safety (WHS) Worldwide Ergonomics and Safety Experience (WESE) team is seeking a detailed-oriented, experienced Ergonomics Expert","display_distance":null,"id":"2b903e62-fe1f-4b8d-a55d-0840eb49f9e4","id_icims":"3171188","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Program Management","job_function_id":null,"job_path":"/en/jobs/3171188/ergonomics-conformance-expert-worldwide-ergonomics-and-safety-experience","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA94\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"February  1, 2026","preferred_qualifications":"- Experience managing, analyzing and communicating results to senior leadership\u003cbr/\u003e- Experience implementing repeatable processes and driving automation or standardization\u003cbr/\u003e- Experience managing conflict, escalations, negotiating compromise, influencing others and problem solving with engineering teams\u003cbr/\u003e- Experience building and cultivating relationships with internal and external stakeholders\u003cbr/\u003e- Experience in stakeholder management, dealing with multiple stakeholders at varied levels of the organization\u003cbr/\u003e- Project Management Professional certification\u003cbr/\u003e- Experience prioritizing complex deliverables, understanding and discussing technical concepts, managing trade-offs, and running meetings with technical and business leaders\u003cbr/\u003e- Verbal and written communication skills\u003cbr/\u003e- Successful record of accomplishment working with other teams within the company, using a high degree of influence and a relationship-based approach to achieve results\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $66,800/year in our lowest geographic market up to $142,800/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"WA","title":"Ergonomics Conformance Expert, Worldwide Ergonomics and Safety Experience","university_job":null,"updated_time":"about 3 hours","url_next_step":"https://account.amazon.com/jobs/3171188/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of engineering, construction, manufacturing, or warehouse environment experience\u003cbr/\u003e- 1+ years of project management, including resource planning, managing schedules, reporting project status and prioritizing tasks experience\u003cbr/\u003e- 1+ years of working with computers and Microsoft Office (including Outlook, Word, and Excel) experience\u003cbr/\u003e- Bachelor's degree in Science, Technology, Engineering, Math, or a related field","business_category":"fulfillment-and-operations","city":"Erlanger","company_name":"Amazon.com Services LLC","country_code":"USA","description":"When we hire you at Amazon, we hire for the future. You would be joining a team of environmental professionals focused on making a difference. With unlimited career opportunities, Amazon invests in ensuring our teams are always challenged, constantly learning from each other, and creatively contributing to our next big idea. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Assist with compliance of local, state, and federal environmental regulations and Amazon policy.\u003cbr/\u003e• Assist in driving an environmentally responsible culture within the organization.\u003cbr/\u003e• Conduct thorough and accurate environmental audits for continuous improvement.\u003cbr/\u003e• Prioritize and manage multiple assignments concurrently.\u003cbr/\u003e• Represent Amazon at appropriate levels with governmental agencies and throughout the company.\u003cbr/\u003e• Work collaboratively with contractors that maintain Amazon Environmental System.\u003cbr/\u003e• Support the completion of environmental incident investigations.\u003cbr/\u003e• Assist with managing and handling regulated waste programs.\u003cbr/\u003e• Assist with inspection and over site of Under Ground Fuel Storage and Hydrant Fuel Systems.\u003cbr/\u003e• Tracking of air emissions.\u003cbr/\u003e• Assist with storm water compliance, stream inspections and sampling.\u003cbr/\u003e• Assist with Ground Service Equipment (GSE) Maintenance Shop Inspections.\u003cbr/\u003e• Assist in inspection and oversite of Deicing Fluid Management Systems.\u003cbr/\u003e• Inspection during delivery of fuel and deicing fluid products.\u003cbr/\u003e• Inspect construction projects to assure sediment and erosion controls are maintained.\u003cbr/\u003e• Inspect oil/water separators, glycol storage tanks, and pump stations.\u003cbr/\u003e• Assist with spill clean-ups and emergency response.\u003cbr/\u003e• Travel up to 20% domestically ","department_cost_center":null,"description_short":"When we hire you at Amazon, we hire for the future. You would be joining a team of environmental professionals focused on making a difference. With unlimited career opportunities, Amazon invests in ensuring","display_distance":null,"id":"c8e207ea-3731-486c-a52c-5127c5bf100d","id_icims":"3171186","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Risk Family","job_function_id":null,"job_path":"/en/jobs/3171186/site-environmental-technician-field-ge-kcvg","job_schedule_type":"full-time","location":"US, KY, Erlanger","locations":["{\"normalizedStateName\":\"Kentucky\",\"normalizedCountryCode\":\"USA\",\"city\":\"Erlanger\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, KY, Erlanger\",\"coordinates\":\"39.02416,-84.60919\",\"normalizedCountyName\":\"Kenton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Erlanger, Kentucky, USA\",\"location\":\"US, KY, Erlanger\",\"region\":\"KY\",\"buildingCodeList\":[\"KCVG\"],\"normalizedCityName\":\"Erlanger\"}"],"normalized_location":"Erlanger, Kentucky, USA","optional_search_labels":[],"posted_date":"February  1, 2026","preferred_qualifications":"- 2+ years of increasing responsibilities in EHS or environmental programs in manufacturing, production, or service operations experience\u003cbr/\u003e- Experience with deployment and usage of monitoring systems\u003cbr/\u003e- Experience in project management including resource planning, managing schedules, reporting project status and prioritizing tasks\u003cbr/\u003e- Experience with NPDES and POTW requirements, and waste management\u003cbr/\u003e- Knowledge of airport environmental regulations and operations desired\u003cbr/\u003e- Excellent communication skills and basic environmental and regulatory knowledge capabilities.\u003cbr/\u003e- Experience with respect to airport environmental regulations and operations a plus.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, KY, Erlanger - 55,600.00 - 97,400.00 USD annually","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"KY","title":"Site Environmental Technician, Field - GE KCVG","university_job":null,"updated_time":"about 3 hours","url_next_step":"https://account.amazon.com/jobs/3171186/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of program or project Management experience\u003cbr/\u003e- Experience building strategic relationships with stakeholders, including communicating and collaborating across teams and functions\u003cbr/\u003e- Experience in verbal and written communication for executive level leaders\u003cbr/\u003e- Bachelor's degree, or BS degree\u003cbr/\u003e- Demonstrated experience identifying hazards and developing risk mitigations","business_category":"fulfillment-and-operations","city":"Arlington","company_name":"Amazon.com Services LLC","country_code":"USA","description":"We are seeking a leader to join Amazon's Global Road Safety team to drive implementation of Safety Management System (SMS) components across Amazon's transportation operations. In this role, you will shape transportation safety strategy, build sustainable safety management capabilities, and drive measurable improvements across Amazon's on-the-road transportation network, protecting the lives of people on road everywhere.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThis role focuses on engaging leaders at multiple levels and across organizations to accelerate safety risk decision-making and foster a proactive safety culture. You will establish and manage the governance structure that supports the SMS, including committees and working groups that enable effective decision-making. You will create, optimize, and drive adoption of mechanisms to ensure long-term SMS success. Additionally, you will translate SMS principles into language that resonates with diverse audiences and build coalitions to implement safety management best practices. Success in this role requires building trust and communicating effectively with cross-functional stakeholders to deliver sustainable, broad-scope results.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include: 1. Medical, Dental, and Vision Coverage 2. Maternity and Parental Leave Options 3. Paid Time Off (PTO) 4. 401(k) Plan If you are not sure that every qualification on the list above describes you exactly, we'd still love to hear from you! At Amazon, we value people with unique backgrounds, experiences, and skillsets. If you’re passionate about this role and want to make an impact on a global scale, please apply! ","department_cost_center":null,"description_short":"We are seeking a leader to join Amazon's Global Road Safety team to drive implementation of Safety Management System (SMS) components across Amazon's transportation operations. In this role, you will shape","display_distance":null,"id":"e1c5b40f-5c9d-453f-a61c-075bb5c88bda","id_icims":"3171187","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Risk Family","job_function_id":null,"job_path":"/en/jobs/3171187/sr-risk-manager-global-road-safety-sms","job_schedule_type":"full-time","location":"US, VA, Arlington","locations":["{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Nashville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Nashville\",\"coordinates\":\"36.16792,-86.77798\",\"normalizedCountyName\":\"Davidson\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Nashville, Tennessee, USA\",\"location\":\"US, TN, Nashville\",\"region\":\"TN\",\"buildingCodeList\":[\"BNA12\"],\"normalizedCityName\":\"Nashville\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA94\"],\"normalizedCityName\":\"Bellevue\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS19\"],\"normalizedCityName\":\"Arlington\"}"],"normalized_location":"Arlington, Virginia, USA","optional_search_labels":[],"posted_date":"February  1, 2026","preferred_qualifications":"- Experience identifying, mitigating, and managing business risks and tradeoffs\u003cbr/\u003e- Experience leading and interacting with cross-functional teams\u003cbr/\u003e- Master's degree\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TN, Nashville - 109,000.00 - 155,400.00 USD annually\u003cbr/\u003eUSA, VA, Arlington - 121,200.00 - 163,900.00 USD annually\u003cbr/\u003eUSA, WA, Bellevue - 121,200.00 - 163,900.00 USD annually","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"VA","title":"Sr. Risk Manager, Global Road Safety, SMS","university_job":null,"updated_time":"about 3 hours","url_next_step":"https://account.amazon.com/jobs/3171187/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in BI, finance, engineering, statistics, computer science, mathematics, finance or equivalent quantitative field\u003cbr/\u003e- 3+ years of analyzing and interpreting data with Redshift, Oracle, NoSQL etc. experience\u003cbr/\u003e- Experience with data modeling, warehousing and building ETL pipelines\u003cbr/\u003e- Experience with data visualization using Tableau, Quicksight, or similar tools","business_category":"fulfillment-and-operations","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"At Amazon, the Leadership Principle “Strive to be Earth’s Best Employer” challenges us to create “a safer, more productive, higher performing, more diverse, and more just work environment,” and reinforces that nothing is more important than the safety and well-being of our teams. At Workplace Health and Safety (WHS) we strive to do just this. We work tirelessly to ensure we have the appropriate strategy, technology, and attitude to be successful. We also understand that people are at the center of safety and look to invest in talent that shares in our passion for making our employees and partners lives better.\u003cbr/\u003e\u003cbr/\u003eThe WHS Data team is hiring a Business Intelligence Engineer (BIE). The Data team spans the Business Intelligence (BI) and Data Engineering (DE) functional areas, and is responsible with providing all reporting solutions required by the WHS Organization to drive workplace safety and regulatory compliance worldwide. This BIE role will primarily support the data and reporting needs for the Safety Performance Insights (SPI) BI team in the WHS Organization. This role regularly requires close engagement with senior leaders and principal PMs to generate insights and deep dives into core metrics that directly impact organizational strategic decisions and priorities. The role requires high proficiency in complex SQL scripting, often joining together multiple types of data sets that range from normalized summaries to raw information spanning many diverse sources. The role will need to have a high bar for ownership and work autonomously to create high-quality products for the customer. The role is required to communicate project roadmap, prioritization, and release notes of new products with customer and stakeholder groups including leadership.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e-Contribute to the design, implementation, and delivery of BI solutions for complex and ambiguous problems\u003cbr/\u003e-Conduct deep dive analyses of business problem statements and formulate conclusions and recommendations to leadership\u003cbr/\u003e-Identify opportunities and key criteria to drive analytical reporting and business strategy\u003cbr/\u003e-Produce written recommendations and insights for key stakeholders that will help shape effective metric development and reporting\u003cbr/\u003e-Simplify and automate reporting, audits, and other data-driven activities\u003cbr/\u003e-Partner with Data Engineering to enhance data infrastructure, data availability, and broad access to customer insights\u003cbr/\u003e-Develop and drive best practices in data integrity, consistency, analysis, validations, and documentation\u003cbr/\u003e-Learn new technology and techniques to meaningfully support product and process innovation\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include:\u003cbr/\u003e1. Medical Coverage\u003cbr/\u003e2. Maternity and Parental Leave Options\u003cbr/\u003e3. Paid Time Off (PTO) \u003cbr/\u003e\u003cbr/\u003eIf you are not sure that every qualification on the list above describes you exactly, we'd still love to hear from you! At Amazon, we value people with unique backgrounds, experiences, and skillsets. If you’re passionate about this role and want to make an impact on a global scale, please apply!     \u003cbr/\u003e","department_cost_center":null,"description_short":"At Amazon, the Leadership Principle “Strive to be Earth’s Best Employer” challenges us to create “a safer, more productive, higher performing, more diverse, and more just work environment,” and reinforces","display_distance":null,"id":"91c957c6-bb52-4fe6-8b23-c3758a6f9b4e","id_icims":"3171184","is_intern":null,"is_manager":null,"job_category":"Data Science","job_family":"Business Intel Engineer","job_function_id":null,"job_path":"/en/jobs/3171184/business-intelligence-engineer-whs-data","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR22\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"February  1, 2026","preferred_qualifications":"- Master's degree in BI, finance, engineering, statistics, computer science, mathematics, finance or equivalent quantitative field\u003cbr/\u003e- 5+ years of analyzing and interpreting data with Redshift, Oracle, NoSQL etc. experience\u003cbr/\u003e- Experience with AWS solutions such as EC2, DynamoDB, S3, and Redshift\u003cbr/\u003e- Experience in data mining, ETL, etc. and using databases in a business environment with large-scale, complex datasets\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"KA","title":"Business Intelligence Engineer, WHS Data","university_job":null,"updated_time":"about 3 hours","url_next_step":"https://account.amazon.com/jobs/3171184/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}