{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- High school diploma, GED or equivalent experience\u003cbr/\u003e- 4+ years in mechanical or electrical hardware assembly, test, and/or installation","business_category":"alexa-and-amazon-devices","city":"Kirkland","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the capacity, flexibility, and performance to serve a wide range of customers, from individual households to schools, hospitals, businesses, government agencies, and other organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eThe success of Leo depends on the quality, reliability, cost, manufacturability, throughput, and security of the products that you deliver. If you seek a fast-paced, dynamic environment; if you thrive on solving difficult problems where resolutions have high impact; and if you love the challenge of building something from scratch, then this role will be an ideal next career step. To be successful you need to be highly motivated and detail oriented while showing the highest standards of execution.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Lead and guide a team of Integration Technicians by planning, assigning and executing daily tasks, and assisting with new member onboarding and training\u003cbr/\u003e- Enforce high quality and safety standards for both product and personnel\u003cbr/\u003e- Integration and test of the Leo satellite and various complex subassemblies in a cleanroom and ESD controlled environment\u003cbr/\u003e- Produce daily reports on Integration builds\u003cbr/\u003e- Rigging and critical lifts of bulky, sensitive hardware\u003cbr/\u003e- Use precision calibrated tools – torque wrenches, multimeters, optical inspection devices, micrometers and calipers\u003cbr/\u003e- Read, create and interpret engineering drawings and technical documentation\u003cbr/\u003e- Perform work according to procedures, specifications, and test instructions, some of which may be ambiguous or incomplete in nature\u003cbr/\u003e- Run functional and environmental testing on units, including some advanced troubleshooting operations\u003cbr/\u003e- Use computer software programs for managing tests\u003cbr/\u003e- Check and inspect your work, as well as others, after completion to ensure engineering and quality standards are met per the drawing and work instruction requirements\u003cbr/\u003e- Collaborate with manufacturing, design and test engineers to develop, document and complete activities, including continuous improvement opportunities\u003cbr/\u003e- Perform other related duties, as assigned, for the purpose of ensuring an efficient, safe and effective work environment\u003cbr/\u003e\u003cbr/\u003e***Anticipated work schedule - from 6am to 4:30pm PT, Wednesday to Saturday***\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThe Lead Integration Technician is responsible for guiding a team of technicians to assemble, test, and ship production of Leo satellites. This team will work closely with cross-functional engineering, test, quality and operations teams to deliver Leo production hardware at the final integration and testing level, prior to launch. This position requires skill and experience in a variety of areas, including mechanical assembly, avionics integration, rigging, electrical checkouts and environmental testing. You will be responsible for ensuring critical tasks to build Leo satellites are performed with high quality, high workmanship and safety standards, and on time.","department_cost_center":null,"description_short":"Amazon Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the","display_distance":null,"id":"0a2bab45-6312-4ea4-87fa-75559ccb4ded","id_icims":"3098390","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Manufacturing","job_function_id":null,"job_path":"/en/jobs/3098390/lead-integration-technician-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Kirkland","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Kirkland\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Kirkland\",\"coordinates\":\"47.67887,-122.2066\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Kirkland, Washington, USA\",\"location\":\"US, WA, Kirkland\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA133\"],\"normalizedCityName\":\"Kirkland\"}"],"normalized_location":"Kirkland, Washington, USA","optional_search_labels":["kuiper-mfg","devices-services.kuiper-prod-ops","devices-manufacturing"],"posted_date":"September 30, 2025","preferred_qualifications":"- 1+ year(s) leading technicians in a manufacturing environment\u003cbr/\u003e- Experience in the aerospace industry, automotive industry, medical device industry, aviation, military or other high-reliability operating environment\u003cbr/\u003e- Experience in an ambiguous, fast-paced production environment \u003cbr/\u003e- Experience working with FOD, ESD sensitive hardware and clean room requirements\u003cbr/\u003e- Experience with forklifts, cranes and heavy equipment (including previous certifications)\u003cbr/\u003e- Skill in operating and manipulating machinery and various hand and power tools requiring manual dexterity\u003cbr/\u003e- A demonstrated ability in reading/writing/creating/understanding technical drawings, work instructions, test plans and standard operating procedures\u003cbr/\u003e- Detailed knowledge of electrical, optical and mechanical systems, antennas, functional testing and satellite components\u003cbr/\u003e- Ability to use a wide variety of precision measuring and testing instruments\u003cbr/\u003e- Ability to work effectively in a team environment\u003cbr/\u003e- Ability to rapidly change roles/responsibilities while working in a high-paced, challenging work environment\u003cbr/\u003e\u003cbr/\u003eAdditional Requirements:\u003cbr/\u003e- Willing to work all shifts, overtime and weekends as needed. Estimated shift times: 1st shift, from 6am to 4:30pm, Wednesday to Saturday. Shifts may vary, depending on program needs\u003cbr/\u003e- Able to stand for long periods of time and perform repetitive assembly operations\u003cbr/\u003e- Able to climb and down ladders, work in tight spaces, bending, grasping, sitting, pulling, pushing, stooping, and stretching may be required to perform the functions of this position\u003cbr/\u003e- Able to lift at least 25 lbs. unassisted\u003cbr/\u003e- Must be willing to travel up to 5% to different sites and for training\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $63,400/year in our lowest geographic market up to $104,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Lead Integration Technician, Amazon Leo","university_job":null,"updated_time":"3 minutes","url_next_step":"https://account.amazon.com/jobs/3098390/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High School diploma or equivalent\u003cbr/\u003e- 4+ years in mechanical or electrical hardware assembly, test, and/or installation","business_category":"alexa-and-amazon-devices","city":"Kirkland","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon Leo will serve people and organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eThe success of Amazon Leo depends on the quality, reliability, cost, manufacturability, throughput, and security of the products that you deliver. If you seek a fast-paced, dynamic environment; if you thrive on solving difficult problems where resolutions have high impact; and if you love the challenge of building something from scratch, then this role will be an ideal next career step. To be successful you need to be highly motivated and detail oriented while showing the highest standards of execution.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Lead and guide a team of Integration Technicians by planning, assigning and executing daily tasks, and assisting with new member onboarding and training\u003cbr/\u003e- Enforce high quality and safety standards for both product and personnel\u003cbr/\u003e- Integration and test of the Leo satellite and various complex subassemblies in a cleanroom and ESD controlled environment\u003cbr/\u003e- Produce daily reports on Integration builds\u003cbr/\u003e- Rigging and critical lifts of bulky, sensitive hardware\u003cbr/\u003e- Use precision calibrated tools – torque wrenches, multimeters, optical inspection devices, micrometers and calipers\u003cbr/\u003e- Read, create and interpret engineering drawings and technical documentation\u003cbr/\u003e- Perform work according to procedures, specifications, and test instructions, some of which may be ambiguous or incomplete in nature\u003cbr/\u003e- Run functional and environmental testing on units, including some advanced troubleshooting operations\u003cbr/\u003e- Use computer software programs for managing tests\u003cbr/\u003e- Check and inspect your work, as well as others, after completion to ensure engineering and quality standards are met per the drawing and work instruction requirements\u003cbr/\u003e- Collaborate with manufacturing, design and test engineers to develop, document and complete activities, including continuous improvement opportunities\u003cbr/\u003e- Perform other related duties, as assigned, for the purpose of ensuring an efficient, safe and effective work environment\u003cbr/\u003e\u003cbr/\u003eAdditional Requirements:\u003cbr/\u003e- Willing to work all shifts, overtime and weekends as needed. Estimated shift time: 2nd shift Wed-Sat 4 / 10s (5:00 pm – 3:30 am). Shifts may vary, depending on program needs\u003cbr/\u003e- Able to stand for long periods of time and perform repetitive assembly operations\u003cbr/\u003e- Able to climb and down ladders, work in tight spaces, bending, grasping, sitting, pulling, pushing, stooping, and stretching may be required to perform the functions of this position\u003cbr/\u003e- Able to lift at least 25 lbs. unassisted\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThe Lead Integration Technician is responsible for guiding a team of technicians to assemble, test, and ship production Leo satellites. This team will work closely with cross-functional engineering, test, quality and operations teams to deliver Amazon Leo production hardware at the final integration and testing level, prior to launch. This position requires skill and experience in a variety of areas, including mechanical assembly, avionics integration, rigging, electrical checkouts and environmental testing. You will be responsible for ensuring critical tasks to build Leo satellites are performed with high quality, high workmanship and safety standards, and on time.","department_cost_center":null,"description_short":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to","display_distance":null,"id":"0654a674-5df2-423c-9b13-7795b66a633b","id_icims":"3142236","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Manufacturing","job_function_id":null,"job_path":"/en/jobs/3142236/lead-integration-technician-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Kirkland","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Kirkland\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Kirkland\",\"coordinates\":\"47.67887,-122.2066\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Kirkland, Washington, USA\",\"location\":\"US, WA, Kirkland\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA133\"],\"normalizedCityName\":\"Kirkland\"}"],"normalized_location":"Kirkland, Washington, USA","optional_search_labels":["kuiper-mfg","devices-services.kuiper-prod-ops"],"posted_date":"December 12, 2025","preferred_qualifications":"- 1+ year(s) leading technicians in a manufacturing environment\u003cbr/\u003e- Experience in the aerospace industry, automotive industry, medical device industry, aviation, military or other high-reliability operating environment\u003cbr/\u003e- Experience in an ambiguous, fast-paced production environment\u003cbr/\u003e- Experience working with FOD, ESD sensitive hardware and clean room requirements\u003cbr/\u003e- Experience with forklifts, cranes and heavy equipment (including previous certifications)\u003cbr/\u003e- Skill in operating and manipulating machinery and various hand and power tools requiring manual dexterity\u003cbr/\u003e- A demonstrated ability in reading/writing/creating/understanding technical drawings, work instructions, test plans and standard operating procedures\u003cbr/\u003e- Detailed knowledge of electrical, optical and mechanical systems, antennas, functional testing and satellite components\u003cbr/\u003e- Ability to use a wide variety of precision measuring and testing instruments\u003cbr/\u003e- Ability to work effectively in a team environment\u003cbr/\u003e- Ability to rapidly change roles/responsibilities while working in a high-paced, challenging work environment\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $63,400/year in our lowest geographic market up to $104,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Lead Integration Technician, Amazon Leo","university_job":null,"updated_time":"3 minutes","url_next_step":"https://account.amazon.com/jobs/3142236/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one modern language such as C++, C#, Java, Python, Golang, PowerShell, Ruby\u003cbr/\u003e- Proven track record of delivering software systems in production environments\u003cbr/\u003e- Strong understanding of computer science fundamentals including data structures, algorithms, and distributed systems\u003cbr/\u003e- Experience building and operating software systems that meet business goals and operational requirements","business_category":"subsidiaries","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Industrial Robotics is building the future of manufacturing and industrial operations. Our team combines cutting-edge robotics technology with world-class software engineering to deliver AI-native solutions that operate on an unprecedented scale. We're pioneering high-performance, low-latency systems (\u003c100ms) that coordinate complex robotic operations while continuously learning and improving from production data. You'll work with passionate builders who are customer-obsessed and committed to technical excellence in applying buffer-centric and flow optimization principles to create manufacturing environments where humans and robots work safely and efficiently together. In this environment your contributions directly impact Amazon's ability to serve customers worldwide by optimizing entire systems rather than individual components.\u003cbr/\u003e\u003cbr/\u003eAmazon Industrial Robotics is seeking an exceptional Software Development Engineer to build and scale software systems that enable advanced manufacturing capabilities and industrial operations. You will design, develop, and deliver critical components of our software stack, from real-time operational systems to enterprise-scale platforms, working at the forefront of AI-driven robotics and automation technology that orchestrates sophisticated operations at unprecedented scale.\u003cbr/\u003e\u003cbr/\u003eAs an SDE, you will apply strong technical skills to solve complex problems while collaborating with cross-functional teams including Senior Engineers, Principal Engineers, Software Development Managers, Technical Program Managers, and technology partners. You will leverage AI in development practices to enhance productivity through AWS Kiro and other AI-native development tools and contribute to building AI-enabled product capabilities. This is a ground-floor opportunity to make significant technical contributions to a strategic robotics initiative that combines cutting-edge AI, distributed systems, and advanced manufacturing processes.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Design, develop, and extend high-performance, test-driven code that is scalable, maintainable, and meets business requirements for industrial robotics systems\u003cbr/\u003e- Implement solutions that are scalable, cost-effective, and operate reliably at Amazon scale\u003cbr/\u003e- Participate in technical design reviews and contribute to architectural decisions for distributed systems supporting manufacturing operations\u003cbr/\u003e- Build software solutions leveraging AI-native development practices and tools to enhance productivity and contribute to AI-enabled product capabilities\u003cbr/\u003e- Own delivery of software components from design through deployment, including production support and operational excellence\u003cbr/\u003e- Follow and help maintain technical standards for code quality, testing, deployment, and monitoring\u003cbr/\u003e- Collaborate with team members and provide technical guidance to junior engineers\u003cbr/\u003e- Partner with cross-functional stakeholders to translate business requirements into technical solutions\u003cbr/\u003e- Work in an Agile/Scrum environment to deliver high-quality software with aggressive timelines\u003cbr/\u003e- Identify and solve difficult problems with well-defined solutions\u003cbr/\u003e- Participate in technical reviews and provide valuable feedback\u003cbr/\u003e- Contribute to continuous improvement in development processes, tools, and practices","department_cost_center":null,"description_short":"Amazon Industrial Robotics is building the future of manufacturing and industrial operations. Our team combines cutting-edge robotics technology with world-class software engineering to deliver AI-native","display_distance":null,"id":"0bb978ec-9e33-4693-8b72-a4feafd1c05e","id_icims":"3173456","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3173456/software-development-engineer-ii-amazon-industrial-robotics","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA90\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February  4, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in Computer Science, Engineering, a related field, or equivalent experience\u003cbr/\u003e- Experience with AI-native software development practices and leveraging AI tools for productivity gains (e.g., Amazon Kiro, Amazon Q Developer, Amazon CodeWhisperer, Cline, Wasabi)\u003cbr/\u003e- Experience with AI/ML capabilities in software systems\u003cbr/\u003e- Experience with cloud platforms (AWS preferred) and building scalable distributed systems\u003cbr/\u003e- Knowledge of flow optimization, theory of constraints, or manufacturing/industrial systems\u003cbr/\u003e- Experience with partner integrations and enterprise software systems\u003cbr/\u003e- Experience with robotics systems, autonomous agents, or industrial automation\u003cbr/\u003e- Ability to balance competing interests between time, quality, and resources\u003cbr/\u003e- Ability to work backwards from customer needs to define appropriate solutions\u003cbr/\u003e- Demonstrated ability to work in fast-paced environments with changing priorities\u003cbr/\u003e- Strong problem-solving skills with ability to think creatively and propose innovative solutions\u003cbr/\u003e- Effective written and verbal communication skills, with ability to clearly present technical concepts\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 143,700.00 - 194,400.00 USD annually","primary_search_label":"subsidiaries.team-amazon-robotics","source_system":"JobCreator","state":"WA","title":"Software Development Engineer II, Amazon Industrial Robotics","university_job":null,"updated_time":"3 minutes","url_next_step":"https://account.amazon.com/jobs/3173456/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-robotics","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team\u003cbr/\u003e- Proven track record of delivering complex software systems in production environments\u003cbr/\u003e- Strong understanding of computer science fundamentals including data structures, algorithms, and distributed systems.\u003cbr/\u003e- Experience building and operating software systems that meet business goals and operational requirements","business_category":"subsidiaries","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Industrial Robotics is building the future of manufacturing and industrial operations. Our team combines cutting-edge robotics technology with world-class software engineering to deliver AI-native solutions that operate on an unprecedented scale. We're pioneering high-performance, low-latency systems (\u003c100ms) that coordinate complex robotic operations while continuously learning and improving from production data. You'll work with passionate builders who are customer-obsessed and committed to technical excellence in applying buffer-centric and flow optimization principles to create manufacturing environments where humans and robots work safely and efficiently together. In this environment, your contributions directly impact Amazon's ability to serve customers worldwide by optimizing entire systems rather than individual components.\u003cbr/\u003e\u003cbr/\u003eAmazon Industrial Robotics is seeking an exceptional Senior Software Development Engineer to build and scale software systems that enable advanced manufacturing capabilities and industrial operations. You will architect, design and deliver critical components of our software stack, from real-time operational systems to enterprise-scale platforms, working at the forefront of AI-driven robotics and automation technology that orchestrates sophisticated operations at unprecedented scale.\u003cbr/\u003e\u003cbr/\u003eAs a Senior SDE, you will leverage deep technical expertise to solve complex problems in areas where solutions may not be well-defined. You will work independently with high judgment, taking ownership of significant technical domains while collaborating with cross-functional teams including Principal Engineers, Software Development Managers, Technical Program Managers, and technology partners. You understand how to leverage AI both in development practices (enabling 3x productivity gains through AWS Kiro and other AI-native development tools) and in product capabilities (such as closed-loop learning systems that automatically improve from production data). This is a ground-floor opportunity to shape the technical foundation of a strategic robotics initiative that combines cutting-edge AI, distributed systems, and advanced manufacturing processes to create adaptable automation solutions.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Architect, design, develop, and extend high-performance, test-driven code that is scalable, maintainable, and meets business requirements for industrial robotics systems\u003cbr/\u003e- Design and implement solutions that are highly scalable, cost-effective, and operate reliably at Amazon scale\u003cbr/\u003e- Lead technical design reviews and drive architectural decisions for complex distributed systems supporting manufacturing operations\u003cbr/\u003e- Build AI-native software solutions, leveraging AI in both development practices and in product capabilities (intelligent decision-making, optimization, predictive systems)\u003cbr/\u003e- Own end-to-end delivery of software components from design through deployment, including production support and operational excellence\u003cbr/\u003e- Establish and maintain technical standards for code quality, testing, deployment, and monitoring\u003cbr/\u003e- Mentor and provide technical guidance to other engineers, raising the bar for engineering excellence across the team\u003cbr/\u003e- Partner with cross-functional stakeholders to translate business requirements into technical solutions\u003cbr/\u003e- Work in an Agile/Scrum environment to deliver high-quality software with aggressive timelines\u003cbr/\u003e- Mitigate complexity risks by deconstructing significantly complex problems into straightforward solutions\u003cbr/\u003e- Actively participate in technical reviews across teams and provide critical feedback\u003cbr/\u003e- Drive continuous improvement in development processes, tools, and practices to increase team velocity and quality","department_cost_center":null,"description_short":"Amazon Industrial Robotics is building the future of manufacturing and industrial operations. Our team combines cutting-edge robotics technology with world-class software engineering to deliver AI-native","display_distance":null,"id":"b7ad4278-333a-4760-ad80-3bdf6d19fb77","id_icims":"3173458","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3173458/senior-software-development-engineer-amazon-industrial-robotics","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA90\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February  4, 2026","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in Computer Science, Engineering, a related field, or equivalent experience\u003cbr/\u003e- Experience building and operating AI-native software development practices and leveraging AI tools for productivity gains (e.g., Amazon Kiro, Amazon Q Developer, Amazon CodeWhisperer, Cline, Wasabi)\u003cbr/\u003e- Experience integrating AI/ML capabilities into production software systems\u003cbr/\u003e- Experience with cloud platforms (AWS preferred) and building scalable distributed systems\u003cbr/\u003e- Knowledge of flow optimization, theory of constraints, or manufacturing/industrial systems\u003cbr/\u003e- Experience with complex partner integrations and enterprise software systems\u003cbr/\u003e- Experience with robotics systems, autonomous agents, or industrial automation\u003cbr/\u003e- Experience influencing technical priorities and business strategy through data-driven contributions\u003cbr/\u003e- Ability to make trade-offs between opportunity, resources, and sustainability\u003cbr/\u003e- Demonstrated ability to work in highly ambiguous, fast-paced environments with changing priorities\u003cbr/\u003e- Strong problem-solving skills with ability to think creatively and propose innovative solutions\u003cbr/\u003e- Excellent written and verbal communication skills, with ability to present technical concepts to diverse audiences\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 168,100.00 - 227,400.00 USD annually","primary_search_label":"subsidiaries.team-amazon-robotics","source_system":"JobCreator","state":"WA","title":"Senior Software Development Engineer, Amazon Industrial Robotics","university_job":null,"updated_time":"3 minutes","url_next_step":"https://account.amazon.com/jobs/3173458/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-robotics","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team\u003cbr/\u003e- Proven track record of delivering complex software systems in production environments\u003cbr/\u003e- Strong understanding of computer science fundamentals including data structures, algorithms, and distributed systems.\u003cbr/\u003e- Experience building and operating software systems that meet business goals and operational requirements","business_category":"subsidiaries","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Industrial Robotics is building the future of manufacturing and industrial operations. Our team combines cutting-edge robotics technology with world-class software engineering to deliver AI-native solutions that operate on an unprecedented scale. We're pioneering high-performance, low-latency systems (\u003c100ms) that coordinate complex robotic operations while continuously learning and improving from production data. You'll work with passionate builders who are customer-obsessed and committed to technical excellence in applying buffer-centric and flow optimization principles to create manufacturing environments where humans and robots work safely and efficiently together. In this environment, your contributions directly impact Amazon's ability to serve customers worldwide by optimizing entire systems rather than individual components.\u003cbr/\u003e\u003cbr/\u003eAmazon Industrial Robotics is seeking an exceptional Senior Software Development Engineer to build and scale software systems that enable advanced manufacturing capabilities and industrial operations. You will architect, design and deliver critical components of our software stack, from real-time operational systems to enterprise-scale platforms, working at the forefront of AI-driven robotics and automation technology that orchestrates sophisticated operations at unprecedented scale.\u003cbr/\u003e\u003cbr/\u003eAs a Senior SDE, you will leverage deep technical expertise to solve complex problems in areas where solutions may not be well-defined. You will work independently with high judgment, taking ownership of significant technical domains while collaborating with cross-functional teams including Principal Engineers, Software Development Managers, Technical Program Managers, and technology partners. You understand how to leverage AI both in development practices (enabling 3x productivity gains through AWS Kiro and other AI-native development tools) and in product capabilities (such as closed-loop learning systems that automatically improve from production data). This is a ground-floor opportunity to shape the technical foundation of a strategic robotics initiative that combines cutting-edge AI, distributed systems, and advanced manufacturing processes to create adaptable automation solutions.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Architect, design, develop, and extend high-performance, test-driven code that is scalable, maintainable, and meets business requirements for industrial robotics systems\u003cbr/\u003e- Design and implement solutions that are highly scalable, cost-effective, and operate reliably at Amazon scale\u003cbr/\u003e- Lead technical design reviews and drive architectural decisions for complex distributed systems supporting manufacturing operations\u003cbr/\u003e- Build AI-native software solutions, leveraging AI in both development practices and in product capabilities (intelligent decision-making, optimization, predictive systems)\u003cbr/\u003e- Own end-to-end delivery of software components from design through deployment, including production support and operational excellence\u003cbr/\u003e- Establish and maintain technical standards for code quality, testing, deployment, and monitoring\u003cbr/\u003e- Mentor and provide technical guidance to other engineers, raising the bar for engineering excellence across the team\u003cbr/\u003e- Partner with cross-functional stakeholders to translate business requirements into technical solutions\u003cbr/\u003e- Work in an Agile/Scrum environment to deliver high-quality software with aggressive timelines\u003cbr/\u003e- Mitigate complexity risks by deconstructing significantly complex problems into straightforward solutions\u003cbr/\u003e- Actively participate in technical reviews across teams and provide critical feedback\u003cbr/\u003e- Drive continuous improvement in development processes, tools, and practices to increase team velocity and quality","department_cost_center":null,"description_short":"Amazon Industrial Robotics is building the future of manufacturing and industrial operations. Our team combines cutting-edge robotics technology with world-class software engineering to deliver AI-native","display_distance":null,"id":"4a31510a-ba86-472a-9f2e-d367b39f6e6a","id_icims":"3173457","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3173457/senior-software-development-engineer-amazon-industrial-robotics","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA90\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February  4, 2026","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in Computer Science, Engineering, a related field, or equivalent experience\u003cbr/\u003e- Experience building and operating AI-native software development practices and leveraging AI tools for productivity gains (e.g., Amazon Kiro, Amazon Q Developer, Amazon CodeWhisperer, Cline, Wasabi)\u003cbr/\u003e- Experience integrating AI/ML capabilities into production software systems\u003cbr/\u003e- Experience with cloud platforms (AWS preferred) and building scalable distributed systems\u003cbr/\u003e- Knowledge of flow optimization, theory of constraints, or manufacturing/industrial systems\u003cbr/\u003e- Experience with complex partner integrations and enterprise software systems\u003cbr/\u003e- Experience with robotics systems, autonomous agents, or industrial automation\u003cbr/\u003e- Experience influencing technical priorities and business strategy through data-driven contributions\u003cbr/\u003e- Ability to make trade-offs between opportunity, resources, and sustainability\u003cbr/\u003e- Demonstrated ability to work in highly ambiguous, fast-paced environments with changing priorities\u003cbr/\u003e- Strong problem-solving skills with ability to think creatively and propose innovative solutions\u003cbr/\u003e- Excellent written and verbal communication skills, with ability to present technical concepts to diverse audiences\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 168,100.00 - 227,400.00 USD annually","primary_search_label":"subsidiaries.team-amazon-robotics","source_system":"JobCreator","state":"WA","title":"Senior Software Development Engineer, Amazon Industrial Robotics","university_job":null,"updated_time":"3 minutes","url_next_step":"https://account.amazon.com/jobs/3173457/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-robotics","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of Microsoft Office products and applications experience\u003cbr/\u003e- 2+ years of electrical and mechanical experience\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.\"","business_category":"aws","city":"Canton","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e- Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"c892b2b0-d948-4957-ba9a-93fe64cecfe4","id_icims":"3151185","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3151185/engineering-operations-technician","job_schedule_type":"full-time","location":"US, MS, Canton","locations":["{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Canton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Canton\",\"coordinates\":\"32.61258,-90.03472\",\"normalizedCountyName\":\"Madison\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Canton, Mississippi, USA\",\"location\":\"US, MS, Canton\",\"region\":\"MS\",\"buildingCodeList\":[\"JAN100\"],\"normalizedCityName\":\"Canton\"}"],"normalized_location":"Canton, Mississippi, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"January  2, 2026","preferred_qualifications":"- Experience working in a data center or mission critical facility (example: hospital, military facility, public safety facility, etc.)\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e- Experience with reading and writing procedures, technical documents, and engineering drawings\"\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MS, Canton - 32.00 - 57.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"MS","title":"Engineering Operations Technician","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3151185/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- -4+ years of finance experience.   -Knowledge of standard software including Excel, Access, Oracle, Essbase, SQL and VBA skills.   -Experience using data to influence business decisions.   -Experience in corporate finance including budgeting/planning, forecasting and reporting.   -Advanced English proficiency.   -Advanced analytical skills and an ability to work independently in a fast-paced and rapidly changing environment.","business_category":"finance","city":"Heredia","company_name":"Amazon Support Services Costa Rica SRL","country_code":"CRI","description":"Amazon.com strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online. By providing customers more of what they want including low prices, vast selection, and convenience, Amazon.com continues to grow and evolve as a world-class e-commerce platform. The spirit of innovation that is part of the company’s DNA. The world's brightest technology minds come to Amazon.com to research and develop technology that improves the lives of shoppers and sellers around the world.\u003cbr/\u003e\u003cbr/\u003eGlobal Financial Services (GFS) team is a fast-paced, team-focused, dynamic environment and delivering great experiences for our customers is top priority.\u003cbr/\u003e\u003cbr/\u003eWe are looking for a Financial Analyst to perform business specific Financial Planning \u0026 Analysis activities. The person will build financial and operational reports that influence decision-making. This person will become a trusted business advisor by sharing findings with business leaders, supporting them by providing data analysis and business insights.\u003cbr/\u003eThe successful candidate will remain objective when communicating financial data results, provide clear and concise summaries, and effectively answer questions in detail to drive results. The person will be in charge of driving communication at the senior manager level, and articulate finance issues to non-Finance partners. This person will be comfortable working with cross-functional teams and demonstrating strong leadership skills. The ideal candidate must have superior attention to detail and the ability to successfully manage multiple competing priorities simultaneously.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003ePerform financial reporting and support monthly P\u0026L analysis and financial forecasts\u003cbr/\u003e\u003cbr/\u003eDeveloping and reporting on financial and operational performance metrics\u003cbr/\u003e\u003cbr/\u003eSupport in monthly/quarterly financial closing activity in close co-ordination with business and accounting teams\u003cbr/\u003e\u003cbr/\u003eAssist in Measuring and reporting progress on key goals for the business team in a timely manner\u003cbr/\u003e\u003cbr/\u003eProvide inputs for monthly and quarterly business reviews in a timely manner. Facilitate the business reviews with data analysis and follow through with business leaders on actionable items for improving business metrics over a period of time\u003cbr/\u003e\u003cbr/\u003ePerform ad-hoc business analyses, and financial modeling. Present recommendations to senior management on strategic decisions, and planned future initiatives\u003cbr/\u003e\u003cbr/\u003ePartnering with various accounting and finance vertical (Accounts Payable/Accounts Receivable) to ensure procedures and controls are routinely applied whist performing accounting and operation.\u003cbr/\u003e\u003cbr/\u003eDemonstrate appropriate understanding / working knowledge of accounting principles and internal controls, and apply them\u003cbr/\u003e\u003cbr/\u003eResponsible to frame and deliver team objectives.\u003cbr/\u003e\u003cbr/\u003eDrive process improvements required to enhance controls.","department_cost_center":null,"description_short":"Amazon.com strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online. By providing customers more of what they want including low","display_distance":null,"id":"d399d7da-089c-43c9-903c-cdf91cab6c37","id_icims":"3143195","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/Planning","job_function_id":null,"job_path":"/en/jobs/3143195/financial-analyst-global-finance-solutions","job_schedule_type":"full-time","location":"CR, H, Heredia","locations":["{\"normalizedStateName\":\"Heredia\",\"normalizedCountryCode\":\"CRI\",\"city\":\"Heredia\",\"countryIso3a\":\"CRI\",\"countryIso2a\":\"CR\",\"locationNonStemming\":\"Costa Rica, H, Heredia\",\"coordinates\":\"9.99969,-84.11717\",\"normalizedCountyName\":\"Heredia\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Costa Rica\",\"normalizedLocation\":\"Heredia, Heredia, CRI\",\"location\":\"CR, H, Heredia\",\"region\":\"H\",\"buildingCodeList\":[\"SJO16\"],\"normalizedCityName\":\"Heredia\"}"],"normalized_location":"Heredia, Heredia, CRI","optional_search_labels":[],"posted_date":"December 15, 2025","preferred_qualifications":"- Bachelor's degree in Finance, Accounting, Business, Economics or a highly analytical field (e.g., Engineering, Math, and Computer Science)\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-finops","source_system":"JobCreator","state":"H","title":"Financial Analyst, Global Finance Solutions","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3143195/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-finops","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 10+ years of professional non-internship marketing experience\u003cbr/\u003e- Experience using data and metrics to drive improvements\u003cbr/\u003e- Experience with Excel or Tableau (data manipulation, macros, charts and pivot tables)\u003cbr/\u003e- Experience driving direction and alignment with cross-functional teams\u003cbr/\u003e- Proven track record scaling global event programs ($10M+ budget)","business_category":"aws","city":"Seattle","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"AWS seeks a strategic events leader to revolutionize our internal event experiences across virtual, hybrid, and in-person formats. As organizations evolve in a digital-first world, this role will shape how AWS connects, enables, and inspires our global teams through innovative event programming.\u003cbr/\u003e\u003cbr/\u003eYou’ll lead the transformation of our internal events strategy, leveraging data-driven insights and emerging technologies to create immersive experiences that drive engagement and business impact. This includes reimagining our sales kick-off programs, leadership summits, training initiatives, and global team experiences.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Build and lead a high-performing team of event strategists, developing the next generation of experience-focused talent\u003cbr/\u003e- Design and execute a comprehensive internal events strategy that aligns with AWS's rapid growth and digital transformation goals\u003cbr/\u003e- Pioneer innovative hybrid event models that maximize engagement across global audiences\u003cbr/\u003e- Optimize event technology stack and data analytics to measure and enhance program effectiveness\u003cbr/\u003e- Partner with senior leadership to translate business objectives into memorable event experiences\u003cbr/\u003e- Drive operational excellence through standardized processes, vendor management, and quality assurance\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Sales, Marketing, and Global Services (SMGS) is responsible for driving revenue, adoption, and growth from the largest and fastest growing small- and mid-market accounts to enterprise-level customers including public sector. The AWS Global Support team interacts with leading companies and believes that world-class support is critical to customer success. AWS Support also partners with a global list of customers that are building mission-critical applications on top of AWS services.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eWhy AWS \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003e  \u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional\u003cbr/\u003e","department_cost_center":null,"description_short":"AWS seeks a strategic events leader to revolutionize our internal event experiences across virtual, hybrid, and in-person formats. As organizations evolve in a digital-first world, this role will shape","display_distance":null,"id":"cba5e776-3e05-4e7f-83c8-6a11df65b8b7","id_icims":"3133947","is_intern":null,"is_manager":null,"job_category":"Marketing \u0026 PR","job_family":"Marketing","job_function_id":null,"job_path":"/en/jobs/3133947/head-of-global-internal-events","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA44\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"November 28, 2025","preferred_qualifications":"- MBA\u003cbr/\u003e- Experience building, executing and scaling cross-functional marketing programs\u003cbr/\u003e- Experience communicating results to senior leadership\u003cbr/\u003e- Experience with AI-powered event technologies and engagement tools\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 142,000.00 - 192,000.00 USD annually","primary_search_label":"aws.team-marketing-primary","source_system":"JobCreator","state":"WA","title":"Head of Global Internal Events ","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3133947/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-marketing-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of Microsoft Office products and applications experience\u003cbr/\u003e- 2+ years of electrical and mechanical experience\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.\"","business_category":"aws","city":"Canton","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e- Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"a2e4aaa2-444f-4e81-ba43-8f2f18c58157","id_icims":"3151182","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3151182/engineering-operations-technician","job_schedule_type":"full-time","location":"US, MS, Canton","locations":["{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Canton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Canton\",\"coordinates\":\"32.61258,-90.03472\",\"normalizedCountyName\":\"Madison\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Canton, Mississippi, USA\",\"location\":\"US, MS, Canton\",\"region\":\"MS\",\"buildingCodeList\":[\"JAN100\"],\"normalizedCityName\":\"Canton\"}"],"normalized_location":"Canton, Mississippi, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"January  2, 2026","preferred_qualifications":"- Experience working in a data center or mission critical facility (example: hospital, military facility, public safety facility, etc.)\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e- Experience with reading and writing procedures, technical documents, and engineering drawings\"\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MS, Canton - 32.00 - 57.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"MS","title":"Engineering Operations Technician","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3151182/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Knowledge of SolidWorks or similar CAD experience and understanding of best practices for part design, and advanced assemblies\u003cbr/\u003e- Bachelor’s or Master’s degree in Mechanical Engineering, Mechatronics, or a related discipline.\u003cbr/\u003e- 3-6+ years of experience designing mechanical systems for robotics or complex electromechanical products.\u003cbr/\u003e- Significant hands-on experience building prototypes, integrating hardware, and troubleshooting mechanical/electromechanical issues.\u003cbr/\u003e- Solid knowledge of DFM/DFA principles and exposure to volume production (50+ units).","business_category":"fulfillment-technology-and-robotics","city":"San Francisco","company_name":"Amazon.com Services LLC","country_code":"USA","description":"About the Role:\u003cbr/\u003e\u003cbr/\u003eWe are looking for a Mechanical Engineer with a passion for building complex robotic systems from the ground up. This role is ideal for someone with a deep understanding of structural and electromechanical design, who thrives in hands-on environments and has experience taking high-performance robots from concept to production.\u003cbr/\u003e\u003cbr/\u003eYou will work on the mechanical architecture of advanced robotics platforms, including high degree-of-freedom systems, where considerations such as actuator selection, thermal constraints, cabling, sensing integration, and manufacturability are critical. This is a cross-disciplinary role requiring close collaboration with electrical, software, and AI research teams.\u003cbr/\u003e\u003cbr/\u003eWhat You Bring:\u003cbr/\u003e\u003cbr/\u003e* A systems-thinking mindset with a strong grasp of cross-domain engineering tradeoffs.\u003cbr/\u003e* A bias toward action: comfortable building, testing, and iterating rapidly.\u003cbr/\u003e* A collaborative and communicative working style — especially in multi-disciplinary research environments.\u003cbr/\u003e* A passion for robotics and advancing the state of the art in intelligent, capable machines.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Lead mechanical design of robotic subsystems and full platforms, including structures, joints, enclosures, and mechanisms for a research environment.\u003cbr/\u003e* Specify and integrate actuators and motors for high-torque density applications in high-degree-of-freedom systems.\u003cbr/\u003e* Design and route cabling and wire harnesses, ensuring reliability, serviceability, and thermal/electrical integrity.\u003cbr/\u003e* Contribute to thermal management strategies for motors, sensors, and embedded compute hardware.\u003cbr/\u003e* Integrate sensors such as lidar, stereo cameras, IMUs, tactile sensors, and compute modules into compact, functional assemblies.\u003cbr/\u003e* Prototype and test mechanical systems; support hands-on builds, debug sessions, and field testing.\u003cbr/\u003e* Conduct root cause analysis on system-level failures or performance issues and implement design improvements.\u003cbr/\u003e* Apply Design for Manufacturing (DFM) and Design for Assembly (DFA) principles to transition prototypes into scalable builds (10s–100s of units).\u003cbr/\u003e* Collaborate with cross-functional teams in electrical engineering, controls, perception, and research to meet research and product goals.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eFrontier AI \u0026 Robotics (FAR) is the team at Amazon building the next generation of embodied intelligence. FAR drives the development and implementation of advanced AI models within Amazon’s operations that enable robots to see, reason, and act on the world around them, supporting a number of different warehouse automation tasks.","department_cost_center":null,"description_short":"About the Role:We are looking for a Mechanical Engineer with a passion for building complex robotic systems from the ground up. This role is ideal for someone with a deep understanding of structural and","display_distance":null,"id":"7c186ecd-36f2-44a6-b049-ef31842f2f0d","id_icims":"3104552","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/3104552/advanced-robotics-mechanical-engineer-frontier-ai-robotics","job_schedule_type":"full-time","location":"US, CA, San Francisco","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Francisco\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Francisco\",\"coordinates\":\"37.77712,-122.41966\",\"normalizedCountyName\":\"San Francisco\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Francisco, California, USA\",\"location\":\"US, CA, San Francisco\",\"region\":\"CA\",\"buildingCodeList\":[\"UCA1\"],\"normalizedCityName\":\"San Francisco\"}"],"normalized_location":"San Francisco, California, USA","optional_search_labels":[],"posted_date":"October  8, 2025","preferred_qualifications":"- Deep understanding of actuator and motor selection for complex robotic applications, including sizing for torque, speed, and thermal performance.\u003cbr/\u003e- Experience with wire/cable harness design and routing in compact mechanical systems.\u003cbr/\u003e- Familiarity with integrating sensing and compute elements into mechanical designs.\u003cbr/\u003e- Experience working on robotic manipulators or high-DOF electromechanical systems.\u003cbr/\u003e- Exposure to designing, testing and validation for compliance (design for safety) and environmental factors (thermal, vibration, ingress protection, etc.).\u003cbr/\u003e- Experience with structural analysis practices and tools (e.g. FEA/Ansys), thermal analysis, and material selection.\u003cbr/\u003e- Basic familiarity with controls or embedded system concepts for integrated design work.\u003cbr/\u003e- Experience with formal engineering documentation and design review processes in a corporate R\u0026D setting.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, San Francisco - 134,900.00 - 185,000.00 USD annually","primary_search_label":"fulfillment-technology-and-robotics.team-frontier-ai-robotics","source_system":"JobCreator","state":"CA","title":"Advanced Robotics Mechanical Engineer, Frontier AI \u0026 Robotics ","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3104552/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-frontier-ai-robotics","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}