{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Education Requirements (must meet one):\u003cbr/\u003e- Currently enrolled in Bachelor's degree or above in Computer Science, Computer Engineering, Data Science, Information Systems, or related STEM fields\u003cbr/\u003e- Completed Bachelor's or Graduate degree in specified fields\u003cbr/\u003e- Expected graduation between October 2025 - September 2026, OR graduated within the last 24 months\u003cbr/\u003e- Demonstrated experience with at least one general-purpose programming language such as Java, Python, C++, C#, Go, Rust, or TypeScript\u003cbr/\u003e- Demonstrated experience one or more of the following: Data structures implementation, Basic algorithm development, Object-oriented design principles","business_category":"studentprograms","city":"Asti","company_name":"Amazon Development Centre Italy SRL - G85","country_code":"ITA","description":"Do you want to solve real customer problems through innovative technology? Do you enjoy working on scalable services in a collaborative team environment? Do you want to see your code directly impact millions of customers worldwide? \u003cbr/\u003e\u003cbr/\u003eAt Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. Customer obsession is part of our company DNA, which has made us one of the world's most beloved brands. \u003cbr/\u003e\u003cbr/\u003eOur Software Development Engineers (SDEs) use modern technology to solve complex problems while seeing their work's impact first-hand. The challenges SDEs solve at Amazon are meaningful and influence millions of customers, sellers, and products globally. We seek individuals passionate about creating new products, features, and services while managing ambiguity in an environment where development cycles are measured in weeks, not years.  \u003cbr/\u003e\u003cbr/\u003eAt Amazon, we believe in ownership at every level. As an SDE-I, you'll own the entire lifecycle of your code - from design through deployment and ongoing operations. This ownership mindset, combined with our commitment to operational excellence, ensures we deliver the highest quality solutions for our customers. \u003cbr/\u003e\u003cbr/\u003eWe're looking for curious minds who think big and want to define tomorrow's technology. At Amazon, you'll grow into the high-impact engineer you know you can be, supported by a culture of learning and mentorship. Every day brings exciting new challenges and opportunities for personal growth.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Collaborate and communicate effectively with experienced cross-disciplinary Amazonians to design, build, and operate innovative products and services that delight our customers, while participating in technical discussions to drive solutions forward. \u003cbr/\u003e\u003cbr/\u003e- Design and develop scalable solutions using cloud-native architectures and microservices in a large distributed computing environment. \u003cbr/\u003e\u003cbr/\u003e- Participate in code reviews and contribute to technical documentation. \u003cbr/\u003e\u003cbr/\u003e- Build and maintain resilient distributed systems that are scalable, fault-tolerant, and cost-effective. \u003cbr/\u003e\u003cbr/\u003e- Leverage and contribute to the development of GenAI and AI-powered tools to enhance development productivity while staying current with emerging technologies.  \u003cbr/\u003e\u003cbr/\u003e- Write clean, maintainable code following best practices and design patterns. \u003cbr/\u003e\u003cbr/\u003e- Work in an agile environment practicing CI/CD principles while participating in operational responsibilities including on-call duties. \u003cbr/\u003e\u003cbr/\u003e- Demonstrate operational excellence through monitoring, troubleshooting, and resolving production issues. \u003cbr/\u003e","department_cost_center":null,"description_short":"Do you want to solve real customer problems through innovative technology? Do you enjoy working on scalable services in a collaborative team environment? Do you want to see your code directly impact millions","display_distance":null,"id":"63095295-e1ba-447e-b78a-317cc8262615","id_icims":"3155212","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3155212/software-development-engineer-2026","job_schedule_type":"full-time","location":"IT, AT, Asti","locations":["{\"normalizedStateName\":\"Piedmont\",\"normalizedCountryCode\":\"ITA\",\"city\":\"Asti\",\"countryIso3a\":\"ITA\",\"countryIso2a\":\"IT\",\"locationNonStemming\":\"Italy, AT, Asti\",\"coordinates\":\"44.90443,8.19994\",\"normalizedCountyName\":\"Asti\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Italy\",\"normalizedLocation\":\"Asti, Piedmont, ITA\",\"location\":\"IT, AT, Asti\",\"region\":\"AT\",\"buildingCodeList\":[\"MXP11\",\"DPI4\"],\"normalizedCityName\":\"Asti\"}","{\"normalizedStateName\":\"Piedmont\",\"normalizedCountryCode\":\"ITA\",\"city\":\"Turin\",\"countryIso3a\":\"ITA\",\"countryIso2a\":\"IT\",\"locationNonStemming\":\"Italy, Turin\",\"coordinates\":\"45.06235,7.67993\",\"normalizedCountyName\":\"Turin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Italy\",\"normalizedLocation\":\"Turin, Piedmont, ITA\",\"location\":\"IT, Turin\",\"region\":\"\",\"buildingCodeList\":[\"TRN10\",\"HPI7\",\"LTRN1\"],\"normalizedCityName\":\"Turin\"}"],"normalized_location":"Asti, Piedmont, ITA","optional_search_labels":["studentprograms.team-software-development"],"posted_date":"January  8, 2026","preferred_qualifications":"- Previous technical internship(s) or demonstrated project experience\u003cbr/\u003e- Experience with one or more of the following: AI tools for development productivity, Cloud platforms (preferably AWS), Database systems (SQL and NoSQL), Contributing to open-source projects, Version control systems, Debugging and troubleshooting complex systems\u003cbr/\u003e- Strong problem-solving and analytical skills\u003cbr/\u003e- Excellent written and verbal communication skills\u003cbr/\u003e- Demonstrated ability to learn and adapt to new technologies quickly\u003cbr/\u003e- Basic understanding of software development lifecycle (SDLC)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"studentprograms.team-jobs-for-grads","source_system":"JobCreator","state":"AT","title":"Software Development Engineer - 2026","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3155212/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-jobs-for-grads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- high school diploma or equivalent\u003cbr/\u003e- 5+ years of experience in mechanical or electrical hardware assembly, test, and/or installation\u003cbr/\u003e- 2+ years of operating and/or maintaining high volume manufacturing equipment\u003cbr/\u003e- 2+ years using hand tools and/or precision measuring instruments (i.e., Calipers, multi-meters, torque wrenches, feeler gages, gage blocks)\u003cbr/\u003e- Experience of ownership of the performance and health of automated processes\u003cbr/\u003e- Experience reading, interpreting and working from engineering documentation and/or drawings\u003cbr/\u003e- Ability to gather and analyze data to support root cause diagnosis","business_category":"alexa-and-amazon-devices","city":"Kirkland","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon Leo will serve people and organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eWe are looking for a talented Technician Lead to help full-scale production of the Leo satellites. The success of Amazon Leo depends on the quality, reliability, cost, manufacturability, throughput, and security of the products that you deliver. If you seek a fast-paced, dynamic environment; if you thrive on solving difficult problems where resolutions have high impact; and if you love the challenge of building something from scratch, then this role will be an ideal next career step. To be successful you need to be highly motivated and detail oriented while showing the highest standards of execution.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Maintain configuration control and monitor health of automated equipment\u003cbr/\u003e- Troubleshoot and diagnose failures of automated equipment\u003cbr/\u003e- Gather data and communicate during equipment downtime\u003cbr/\u003e- Perform preventative maintenance activities on equipment\u003cbr/\u003e- Drive machine operation process improvements, maintain floor stock inventory\u003cbr/\u003e- Follow work instructions and safety procedures\u003cbr/\u003e- You will independently execute and prioritize work to meet company deliverables\u003cbr/\u003e- Execute test procedures for component and system level testing maintenance\u003cbr/\u003e- Champion safety requirements in all designated zones and work locations\u003cbr/\u003e- Ensure lab equipment is maintained and calibrated\u003cbr/\u003e- Receive shipments and coordinate deliveries with recipients (Using pallet jacks, kit carts, etc)\u003cbr/\u003e- Your work may include contributing to improving SOPs and safety procedures\u003cbr/\u003e\u003cbr/\u003eAdditional Requirements:\u003cbr/\u003e- Willing to work overtime and weekends as needed. Estimated shift times are Wed-Sat, 4X10 6:00 AM - 4:30 PM\u003cbr/\u003e- Standing for long periods of time, climbing up and down ladders, bending, grasping, sitting, pulling, pushing, stooping, and stretching may be required to perform the functions of this position\u003cbr/\u003e- Able to lift-up to 25lbs. unassisted\u003cbr/\u003e\u003cbr/\u003eCandidates must be 18 years or older with the ability to understand and adhere to all job requirements and safety guidelines.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to","display_distance":null,"id":"319ce046-81e0-4419-819b-23bc23d3bca1","id_icims":"3130190","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Manufacturing","job_function_id":null,"job_path":"/en/jobs/3130190/lead-solar-automation-specialist-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Kirkland","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Kirkland\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Kirkland\",\"coordinates\":\"47.67887,-122.2066\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Kirkland, Washington, USA\",\"location\":\"US, WA, Kirkland\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA133\"],\"normalizedCityName\":\"Kirkland\"}"],"normalized_location":"Kirkland, Washington, USA","optional_search_labels":["devices-services.kuiper-prod-ops","kuiper-mfg"],"posted_date":"November 20, 2025","preferred_qualifications":"- 6+ years of experience in mechanical or electrical hardware assembly, test, and/or installation\u003cbr/\u003e- 4+ years of operating and/or maintaining high volume manufacturing equipment\u003cbr/\u003e- 4+ years using hand tools and/or precision measuring instruments (i.e., Calipers, multi-meters, torque wrenches, feeler gages, gage blocks)\u003cbr/\u003e- Experience in the aerospace industry, automotive industry, medical device industry, aviation, military or other high-reliability operating environment\u003cbr/\u003e- Experience in a fast-paced production environment\u003cbr/\u003e- Experience working with FOD, ESD sensitive hardware and clean room requirements\u003cbr/\u003e- Experience working with Electro-Mechanical Assembly\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Kirkland - 34.00 - 56.00 USD hourly","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Lead Solar Automation Specialist, Amazon Leo","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3130190/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 6+ months of human resources experience\u003cbr/\u003e- 6+ months of customer service experience\u003cbr/\u003e- 6+ months of Microsoft Office products and applications experience\u003cbr/\u003e- High school or equivalent\u003cbr/\u003e- Experience in confidential environments","business_category":"global-corporate","city":"Hyderabad","company_name":"Amazon Dev Center India - Hyderabad","country_code":"IND","description":"At Amazon, we believe that every day is still Day One. We are striving to be Earth's Best Employer and to get there, we need exceptionally talented, bright, and driven people. Amazon’s MyHR Live Support team is seeking customer-focused professionals who thrive in a dynamic contact center environment.\u003cbr/\u003eDo you excel at real-time communication, problem-solving, and delivering exceptional customer service? The MyHR Live Support Team operates a state-of-the-art contact center, caring for 1.5 million Amazonians worldwide by assisting them with their HR needs. Our organization delivers best-in-class HR support to Amazon employees, applicants, and candidates globally. We specialize in topics related to time-off, employee relocations, offboarding processes, employment verification, benefits, bereavement support, and comprehensive pay and compensation services.\u003cbr/\u003eAs an HR Contact Center Professional, you will be at the forefront of our customer service operations, primarily handling live phone calls and/or chats. You are someone who is skilled at building positive relationships with employees through empathetic and effective communication. You are approachable and able to handle sensitive situations with tact and diplomacy in real-time. You pride yourself on maintaining high ethical standards and confidentiality when dealing with sensitive employee information, conflicts of interest, and compliance issues.\u003cbr/\u003eYou thrive in a fast-paced contact center environment, using your critical thinking and fact-finding skills to resolve issues efficiently. You excel at managing multiple tasks, priorities, and deadlines while maintaining a high level of customer satisfaction. You are adaptable and open to change, quickly adjusting to new policies, technologies, and industry trends. \u003cbr/\u003eAmazon’s MyHR Live Support team is comprised of HR Contact Center Professionals supporting Amazon employees globally within multiple languages, with services 24 hours a day, 7 days a week in some countries. As a MyHR Live Support Advisor, your primary responsibilities will be:\u003cbr/\u003e• Handle a high volume of live contacts, primarily through phone calls and potentially chats, taking ownership in ensuring each interaction is resolved with a high degree of problem-solving and customer obsession. \u003cbr/\u003e• Resolve inquiries holistically by referring to available documentation such as frequently asked questions, knowledge base articles, and standard operating procedures – escalate when these cannot be resolved. \u003cbr/\u003e• Build customer trust through empathetic, personalized conversations by assessing and adjusting resolution plans to each employee's changing needs during live interactions. \u003cbr/\u003e• Respond promptly to employees' urgent issues, ensuring the right communication and documentation occurs, even when information is limited. \u003cbr/\u003e• Use high judgment, critical thinking, and rationale to balance process adherence with employees' needs, analyzing and deciding on resolutions for their requests in real-time. \u003cbr/\u003e• Consistently consult and collaborate with partner teams on process changes to resolve cross-functional issues and improve policies. \u003cbr/\u003e• Maintain high performance metrics in areas such as contact handling time, first-contact resolution, and customer satisfaction scores.\u003cbr/\u003e• Adhere to set schedules, including timed breaks and lunches, to ensure consistent coverage and support for our 24/7 contact center operations.\u003cbr/\u003e• Demonstrate flexibility in working various shifts, including evenings, weekends, and overnight shifts, to support our global workforce across different time zones.\u003cbr/\u003eThis role requires excellent multitasking abilities, strong verbal and written communication skills, and the ability to thrive in a fast-paced contact center environment. If you're passionate about delivering exceptional customer service through live interactions and are ready to make a difference in people's lives, we want to hear from you!\u003cbr/\u003e","department_cost_center":null,"description_short":"At Amazon, we believe that every day is still Day One. We are striving to be Earth's Best Employer and to get there, we need exceptionally talented, bright, and driven people. Amazon’s MyHR Live Support","display_distance":null,"id":"b0f8514e-3564-4bfd-92d8-6634a2c1a0a2","id_icims":"3174718","is_intern":null,"is_manager":null,"job_category":"Human Resources","job_family":"Human Resources","job_function_id":null,"job_path":"/en/jobs/3174718/seasonal-my-hr-live-support-advisor-mhls-level-3-myhr-live-support","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD11\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":[],"posted_date":"February  5, 2026","preferred_qualifications":"- 1+ years of human resources experience\u003cbr/\u003e- 1+ years of customer service experience\u003cbr/\u003e- 1+ years of Microsoft Office products and applications experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"global-corporate.team-hr-for-hr","source_system":"JobCreator","state":"TS","title":"Seasonal My HR Live Support Advisor, MHLS (Level 3), MyHR Live Support","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3174718/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-hr-for-hr","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Knowledge of cloud architecture\u003cbr/\u003e- Experience in a technical role within a sales organization\u003cbr/\u003e- Experience within specific technology domain areas (e.g. software development, cloud computing, systems engineering, infrastructure, security, networking, data \u0026 analytics).\u003cbr/\u003e- Experience in IT development or implementation/consulting in the software or Internet industries","business_category":"aws","city":"Madrid","company_name":"AWS EMEA SARL (Spain Branch)","country_code":"ESP","description":"Imagine being a part of a team where your ideas can help reshape the future of the Energy industry and improve the lives of many. Here at AWS, you'll work with a talented \u0026 inclusive team while using state of the art technologies to help our customers accelerate the global energy transition.\u003cbr/\u003e\u003cbr/\u003eWe are looking for an experienced and motivated technologist who possess a unique balance of technical depth and strong interpersonal skills to build the future with us as a Sr. Solutions Architect supporting some of the largest Energy \u0026 Utilities companies in the world:\u003cbr/\u003e- You will craft highly scalable, flexible and resilient cloud architectures that address business problems and accelerate the adoption of AWS services.\u003cbr/\u003e- You'll become a trusted advisor for key customer personas including CIO, CDO, and Head of AI. \u003cbr/\u003e- You will be embedded with the customer technical teams and will leverage AI-assisted development tools to deliver proof of concepts and pilots that address industry-specific challenges and demonstrate AWS solutions.\u003cbr/\u003e- Your contributions through written content and speaking engagements at public conferences will position you as an AWS thought leader in the Energy \u0026 Utilities sector.\u003cbr/\u003e- In partnership with Global Account Managers, you will shape and execute a strategy to build mind-share and enable the broad use of AWS within the customer organization.\u003cbr/\u003e- You will interact, communicate and partner with other teams at AWS such as product, marketing, and professional services, and represent your team to executive management. \u003cbr/\u003e\u003cbr/\u003eYou exercise good judgement in balancing short-term value with longer-term supportability and are keenly aware of how technological changes might impact your solutions. You are never constrained by the realities of today. You can see areas where AWS and our partners can innovate and work across organizations (both internal and external) to deliver new value to our customers. You possess a demonstrated ability to think strategically about business, products, and technical challenges. Your dynamism, creativity and passion for excellence will make a positive impact with your customer.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Own the technical relationship with customers, making recommendations on security, cost, performance, reliability and operational efficiency.\u003cbr/\u003e- Design and architect complex cloud solutions for Energy \u0026 Utilities customers by combining business acumen with deep technical skills, helping customers solve their most critical business challenges.\u003cbr/\u003e- Collaborate with customer's technical teams to build and deliver proof of concepts and pilots using AI-assisted development tools that demonstrate the value and capabilities of AWS services for industry-specific use cases.\u003cbr/\u003e- Create thought leadership content through blog posts, whitepapers, and speaking engagements at public conferences, establishing yourself as an AWS for Energy \u0026 Utilities thought leader.\u003cbr/\u003e- Develop and maintain trusted advisor relationships with key customer personas (CIO, CDO, Head of AI), understanding their business context and influencing their long-term technology strategy.\u003cbr/\u003e- Drive effective feedback gathering from customers, translating that feedback into clear business and technical requirements for product and engineering teams to review and implement.\u003cbr/\u003e- Be an internal advocate acting on behalf of the customer to help drive continual improvements to the AWS platform.\u003cbr/\u003e- Help shape the future of the Solutions Architecture organisation by helping to hire, coach and mentor others.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe AWS Industries team is committed to helping industry customers enable their digital transformation journeys. Our primary goal is to meet customers in their cloud journeys and work backwards from their industry-specific needs to transform their businesses and industries. Our team focuses on business outcomes and industry use cases on behalf of our customers, whether that is how we build products and solutions, how we sell, how we deliver, or how we partner.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003e\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Imagine being a part of a team where your ideas can help reshape the future of the Energy industry and improve the lives of many. Here at AWS, you'll work with a talented \u0026 inclusive team while using state","display_distance":null,"id":"a7642d2a-d5a7-40cd-8b79-232fca857d3c","id_icims":"3144811","is_intern":null,"is_manager":null,"job_category":"Solutions Architect","job_family":"Solution Architect","job_function_id":null,"job_path":"/en/jobs/3144811/sr-solutions-architect-energy-and-utilities-madrid","job_schedule_type":"full-time","location":"ES, M, Madrid","locations":["{\"normalizedStateName\":\"Community of Madrid\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Madrid\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, M, Madrid\",\"coordinates\":\"40.42024,-3.68755\",\"normalizedCountyName\":\"Madrid\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Madrid, Community of Madrid, ESP\",\"location\":\"ES, M, Madrid\",\"region\":\"M\",\"buildingCodeList\":[\"MAD15\"],\"normalizedCityName\":\"Madrid\"}"],"normalized_location":"Madrid, Community of Madrid, ESP","optional_search_labels":["aws.team-global-accounts-solution-architects","aws.team-solutions-architects","aws.team-italy-optional"],"posted_date":"December 17, 2025","preferred_qualifications":"- Bachelor's degree in computer science, engineering, mathematics or equivalent\u003cbr/\u003e- Experience in infrastructure architecture, database architecture and networking\u003cbr/\u003e- Experience communicating across technical and non-technical audiences, including executive level stakeholders or clients\u003cbr/\u003e- Cloud Technology Certification (such as Solutions Architecture, Cloud Security Professional or Cloud DevOps Engineering)\u003cbr/\u003e- Knowledge of SAP systems (like SAP Business Suite, S/4HANA, SAP Business Warehouse, SAP HANA, SAP Business Objects, etc.) and their architecture and infrastructure needs\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-solutions-architect-primary","source_system":"JobCreator","state":"M","title":"Sr. Solutions Architect, Energy and Utilities (Madrid)","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3144811/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-solutions-architect-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience participating in continuous improvement projects in your team to scale and improve controllership with measurable results, or experience in creating process improvements with automation and analysis\u003cbr/\u003e- Bachelor's degree in Mechanical or Electrical Engineering or a related field\u003cbr/\u003e- 6+ years of quality assurance engineering experience\u003cbr/\u003e- Experience in compliance, audit or risk management","business_category":"retail","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"How do you get items to customers quickly, cost-effectively, and—most importantly—safely, in less than an hour? And how do you do it in a way that can scale? Our teams of hundreds of scientists, engineers, aerospace professionals, and futurists have been working hard to do just that! We are delivering to customers, and are excited for what’s to come. Check out more information about Prime Air on the About Amazon blog (https://www.aboutamazon.com/news/transportation/amazon-prime-air-delivery-drone-reveal-photos).\u003cbr/\u003eIf you are seeking an iterative environment where you can drive innovation, apply state-of-the-art technologies to solve real world delivery challenges, and provide benefits to customers, Prime Air is the place for you.\u003cbr/\u003eCome work on the Amazon Prime Air Team!\u003cbr/\u003e\u003cbr/\u003ePrime Air is seeking an experienced Quality Engineer to oversee Prime Air Drone delivery operations by meeting regulatory, quality, and compliance requirements of Unmanned Aircraft System (UAS) also known as Drone. In this role you will be responsible for overseeing quality, safety, and regulatory compliance of drone delivery operations by meeting Part-135 and other regulatory FAA (Federal Aviation Administration) requirements to ensure successful in-service fleet operations. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Work with Engineering teams (hardware \u0026 software), flight testing, fulfillment center delivery operations, Program Managers, and supply chain teams to execute in-service quality goals.\u003cbr/\u003e• Work closely with Flight Standards \u0026 Publications team collaborating on review and approval of Flight operations Manuals and checklists.\u003cbr/\u003e•  Ensure compliance to drone delivery \u0026 maintenance operations by overseeing the Continuing Analysis and Surveillance System (CASS) program in accordance with 14 CFR Part 135. \u003cbr/\u003e•  Ensure continuous monitoring and analysis of operational data for safety, quality, compliance, to report metrics in dashboard formats.\u003cbr/\u003e• Leverage expertise in statistical analysis to drive root cause investigation using tools like 8D, RCA, CAPA, COE, etc to resolve quality \u0026 compliance issues.\u003cbr/\u003e• On a daily basis, report commercial operations quality, compliance, and technical publication activity stemming from in service fleet operations especially issues impacting delivery performance and efficiency.\u003cbr/\u003e• Ensure compliance with safety, regulatory, and environmental standards across all operational sites.\u003cbr/\u003e• Conduct compliance, safety, and quality audits to ensure compliance with FAA regulations (e.g., Part 107, 135, etc).\u003cbr/\u003e• Interface with FAA inspectors and support FAA audits.\u003cbr/\u003e• Conduct Audits, report findings, and close audit gaps/findings in a timely fashion by working with cross-functional teams.\u003cbr/\u003e• Report In-Service Quality team's progress in WBR, MBR, QBR forums.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou will work closely with delivery operations and engineering teams on reporting and resolving quality \u0026 compliance issues. This role also involves conducting operations audits and reporting findings if any during audits. This role requires on-calls shifts and rotations supporting extending hours of delivery operations. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eIn-Service Quality (ISQ) team supports Drone delivery operations supporting Amazon's customer deliveries within 60 minutes. ISQ team helps ensure all the regulatory and compliance requirements from FAA, DOT, and other bodies are met in the context of aviation industry. This team also involves resolving engineering quality issues by working with cross-functional teams. ","department_cost_center":null,"description_short":"How do you get items to customers quickly, cost-effectively, and—most importantly—safely, in less than an hour? And how do you do it in a way that can scale? Our teams of hundreds of scientists, engineers,","display_distance":null,"id":"f18cc5fc-998c-473f-b70c-23d5f1383019","id_icims":"3141495","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/3141495/sr-in-service-fleet-quality-engineer-amazon-prime-air","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA109\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"December 11, 2025","preferred_qualifications":"- Experience working with interdisciplinary teams to execute product design from concept to production\u003cbr/\u003e- Experience with the project management of technical projects\u003cbr/\u003e- Master's degree in Mechanical or Electrical Engineering or a related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 137,300.00 - 185,700.00 USD annually","primary_search_label":"retail.team-global-prime-air","source_system":"JobCreator","state":"WA","title":"Sr. In-Service Fleet Quality Engineer, Amazon Prime Air","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3141495/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-prime-air","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or above in computer science, computer engineering, or related field, or experience managing teams\u003cbr/\u003e- 5+ years of management experience\u003cbr/\u003e- 5+ years of operations management experience\u003cbr/\u003e- Experience with Lean/Six Sigma\u003cbr/\u003e- 4+ years of professional work experience, or experience in technical work related to computer systems and technology components","business_category":"aws","city":"Hamlet","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"The Cluster Operations Manager is responsible for one or more Amazon Data Center Clusters and Colocation Operations within a particular region. It is the senior Infrastructure Operations role within the region and has managerial responsibility for safety, security, availability, scaling, efficiency and cost.\u003cbr/\u003e\u003cbr/\u003eThe Infrastructure Operations organizations are composed of two primary functions: Data Center operations (DCO) and Data Center Engineering Operations (DCEO). A physical security organization, while not reporting directly to the Cluster Operations Manager, is an integral part of the operation. Data Center Operations focuses on the server-level platforms that support both Amazon Retail and Amazon Web Services. Engineering Operations focuses on the mechanical, electrical and controls systems that support our data Center critical environments. Security Operations are charged with the physical security of our people, assets, and customer data.\u003cbr/\u003e\u003cbr/\u003eThe Cluster Operations Manager must be able to build and lead high performing teams across each of these functions, understand and manage their daily operations while at the same time having the technical capability and curiosity to dive deep into any given challenges as needed.\u003cbr/\u003e\u003cbr/\u003eThe Cluster Operations Manager is a key role in the management team that is operating and scaling the world’s largest cloud computing infrastructure. We encounter interesting, challenging and complex problems every day. As a technical manager in Amazon you can innovate to solve these issues and help drive operations excellence in all areas of your role. You will have the ability to refine and develop processes to optimize operational excellence in every aspect of your role. You must also have a passion for technology along with a desire to achieve best-in-the-world operational performance.\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services (AIS) owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Hiring, managing and developing the operations team including compute operations managers, engineering operations managers, logistics operations managers and their teams\u003cbr/\u003e- Attainment of organizational performance goals and objectives relating to safety, security, availability, scaling, efficiency and cost\u003cbr/\u003e- Planning and executing the Infrastructure Operations component of new Data Centers and Colocation (Colo) expansions\u003cbr/\u003e- Safety, security, and availability incident response, incident management and incident resolution\u003cbr/\u003e- Continuous improvement of operational processes, procedures, methods and tools\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThe CM drives all aspects of 24x7 Operations, to include emergent event response and hiring. Safety, Security, and Availability are core tenet areas of this role. This region is a business priority for Machine Learning Zone growth and expansion.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e","department_cost_center":null,"description_short":"The Cluster Operations Manager is responsible for one or more Amazon Data Center Clusters and Colocation Operations within a particular region. It is the senior Infrastructure Operations role within the","display_distance":null,"id":"616bc1ae-8a36-4440-8bf1-8cbd6779c78e","id_icims":"3164781","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3164781/data-center-cluster-operations-manager-infraops-data-center-ops-data-center-operations","job_schedule_type":"full-time","location":"US, NC, Hamlet","locations":["{\"normalizedStateName\":\"North Carolina\",\"normalizedCountryCode\":\"USA\",\"city\":\"Hamlet\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NC, Hamlet\",\"coordinates\":\"34.8934,-79.70087\",\"normalizedCountyName\":\"Richmond\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Hamlet, North Carolina, USA\",\"location\":\"US, NC, Hamlet\",\"region\":\"NC\",\"buildingCodeList\":[\"CLT100\"],\"normalizedCityName\":\"Hamlet\"}"],"normalized_location":"Hamlet, North Carolina, USA","optional_search_labels":["aws.team-dc","aws.team-ais","military"],"posted_date":"January 22, 2026","preferred_qualifications":"- Knowledge of Lean Manufacturing \u0026 Continuous Improvement principles \u0026 techniques\u003cbr/\u003e- Experience in identifying security issues and risks, and developing mitigation plans\u003cbr/\u003e- 7+ years of team management experience\u003cbr/\u003e- 10+ years of design, construction or program management in mission critical facilities experience\u003cbr/\u003e- Experience communicating technical details verbally and in writing\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NC, HAMLET - 145,400.00 - 254,500.00 USD annually","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"NC","title":"Data Center Cluster Operations Manager, InfraOps - Data Center Ops, Data Center Operations","university_job":null,"updated_time":"21 minutes","url_next_step":"https://account.amazon.com/jobs/3164781/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- Experience with computer hardware troubleshooting and repair\u003cbr/\u003e- Experience in networking","business_category":"aws","city":"Zaragoza","company_name":"Amazon Data Services Spain, S.L.","country_code":"ESP","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eWe are looking to hire a highly motivated, best-in-class Network Technician to join our growing team within Networking. The position responsibilities involve delivering the hardware, configuration and fiber connectivity of interdependent scaling projects across several data center locations. The Network Technician will work closely with both internal customers and external vendors to facilitate smooth project execution in association with Technical Program Managers.\u003cbr/\u003e\u003cbr/\u003eOur ideal candidate is highly autonomous, very detail oriented, possesses strong written and verbal communication skills and has significant experience in supporting large scale, enterprise class networks. They will be highly competent in all aspects of installation and troubleshooting of networking hardware, software and fiber connectivity, all combined with a proven project delivery methodology. This position will work with minimum supervision to drive the stability and sustainability of our next-generation networks and to assist in the development of innovative ways to automate and scale our network as we expand.\u003cbr/\u003eNetwork Technicians are expected to work with established best practices to refine operational procedures, develop new tooling and constantly think proactively and innovatively. The desire and ability to work in an ambiguous, collaborative environment is essential for success.\u003cbr/\u003e\u003cbr/\u003e**Must be fluent or at least advanced level in English\u003cbr/\u003e*Please submit CV in English\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e  ·         Working closely with our Network Engineering \u0026 Network Technical Project Manager teams to ensure fast, smooth rollout of established designs and products.\u003cbr/\u003e  ·         Managing work and priorities through ticketing system and workflows.\u003cbr/\u003e  ·         Collaborating with various stake holders to remove project obstacles.\u003cbr/\u003e  ·         Traveling within geographical work area is required, some travel outside traditional work area may be requested.\u003cbr/\u003e  ·         Troubleshooting networking, routing and inter connectivity issues, including troubleshooting of network device configuration and low level application interaction.\u003cbr/\u003e  ·         Troubleshooting cabling infrastructure connectivity issues, including patch panels and patch cords.\u003cbr/\u003e  ·         Specifying Power and Cooling requirements and ensuring Hardware Racking/Stacking completed for new equipment.\u003cbr/\u003e  ·         Completing customer requests via Remedy trouble ticketing system and project management workflows.\u003cbr/\u003e  ·         Participating in the migration, basic configuration and rollout of new or upgraded hardware.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou will play a pivotal part in scaling the network of several data center locations and be responsible for day to day assistance with capacity management. Working closely with both internal customers and external vendors, you will facilitate smooth project execution as directed by Technical Program Managers.\u003cbr/\u003eYou will be required to travel, up to 20% travel outside traditional work area may be required possibly including international travel.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"6c3d1679-1c19-4515-b55c-3eec2dcad5a9","id_icims":"3151766","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3151766/network-technician-data-center","job_schedule_type":"full-time","location":"ES, Zaragoza","locations":["{\"normalizedStateName\":\"Aragon\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Zaragoza\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, Zaragoza\",\"coordinates\":\"41.65184,-0.8811\",\"normalizedCountyName\":\"Zaragoza\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Zaragoza, Aragon, ESP\",\"location\":\"ES, Zaragoza\",\"region\":\"\",\"buildingCodeList\":[\"ZAZ62\"],\"normalizedCityName\":\"Zaragoza\"}"],"normalized_location":"Zaragoza, Aragon, ESP","optional_search_labels":[],"posted_date":"January  5, 2026","preferred_qualifications":"- Experience dealing effectively with customers during problem resolution and operating efficiently under pressure\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-system-development-engineer-primary","source_system":"JobCreator","state":null,"title":"Network Technician, Data Center","university_job":null,"updated_time":"25 minutes","url_next_step":"https://account.amazon.com/jobs/3151766/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-system-development-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience leading the design, automation, deployment, and support of large-scale infrastructure\u003cbr/\u003e- Experience programming with at least one modern language such as Python, Ruby, Golang, Java, C++, C#, Rust\u003cbr/\u003e- Experience with Linux/Unix\u003cbr/\u003e- Experience with CI/CD pipelines build processes\u003cbr/\u003e- Experience defining system architectures and exploring technical feasibility tradeoffs\u003cbr/\u003e- Experience in mentoring, leading, or managing more junior engineers\u003cbr/\u003e- Experience writing technical documents, project plans and progress reports to leadership and to stakeholders","business_category":"alexa-and-amazon-devices","city":"Kirkland","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon's low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we've designed the system with the capacity, flexibility, and performance to serve a wide range of customers, from individual households to schools, hospitals, businesses, government agencies, and other organizations operating in locations without reliable connectivity. \u003cbr/\u003e\u003cbr/\u003eWe are hiring a Sr. System Development Engineer to develop and integrate hardware and software for satellite production manufacturing. This is a highly collaborative position that interfaces with Amazon Leo production operations, engineering, and IT infrastructure teams. \u003cbr/\u003e\u003cbr/\u003eYou will be responsible for developing and maintaining SCADA systems for real-time monitoring and control of production equipment, and ensuring reliable data acquisition across the manufacturing floor. Additionally, you will support MES integration efforts to enable production scheduling, work order management, quality traceability, and machine connectivity with enterprise systems. As part of this role, you will also help drive the integration of Generative AI technologies into our production environment, leveraging AI-powered tools to optimize manufacturing processes, enhance quality assurance, and streamline workflows.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eManufacturing automation development: The Sr. SysDE will develop automated manufacturing applications in the Kuiper SCADA (Supervisory Control and Data Acquisition) ecosystem.\u003cbr/\u003e\u003cbr/\u003eMES integration: Support Manufacturing Execution System (MES) integration efforts to enable production scheduling, work order management, quality traceability, and seamless between plant floor systems and enterprise platforms.\u003cbr/\u003e\u003cbr/\u003eGenAI integration: Drive the integration of Generative AI technologies into the production environment, leveraging AI-powered tools to optimize manufacturing processes, enhance quality assurance, and streamline software development workflows.\u003cbr/\u003e\u003cbr/\u003eOwnership and collaboration: The Sr. SysDE is responsible for learning and addressing the business needs through interaction with partner teams. The Sr. SysDE will generate requirements collaboratively, document and collect customer feedback on the design, then implement and iterate. The Sr. SysDE is a single-threaded owner, responsible for delivering functioning applications to production, providing support for gamedays, and participating in an on-call rotation for production downtime escalations.\u003cbr/\u003e\u003cbr/\u003eSecurity and compliance: Produce system architecture and design documents for end-user, front line support, and security review purposes. Ensure that system integrations comply with internal IT and Security standards, with code that is well-documented and version controlled.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis is a fast-paced, intellectually challenging position. You will work with leaders in multiple technology areas across Amazon Leo to define and develop automation systems to meet the program needs. In addition, you will be responsible for project management, cost estimates and scheduling. You’ll have relentlessly high standards for yourself and everyone you work with, and you’ll be constantly looking for ways to improve your product’s performance, quality and cost. We want individuals who are ready for this challenge and want to reach beyond what is possible today.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Ground Support Equipment (GSE) team is responsible for designing and commissioning automation and tooling for Amazon Leo production. This in-house team of engineers work directly with satellite designers, production teams, and manufacturing engineers to solve unique problems in high-volume satellite production.","department_cost_center":null,"description_short":"Amazon Leo is Amazon's low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we've designed the system with the","display_distance":null,"id":"7c35b54c-7ace-41ed-af5a-95ecf21c0735","id_icims":"3143627","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"System Development Engineering","job_function_id":null,"job_path":"/en/jobs/3143627/sr-system-development-engineer-gse-automation-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Kirkland","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Kirkland\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Kirkland\",\"coordinates\":\"47.67887,-122.2066\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Kirkland, Washington, USA\",\"location\":\"US, WA, Kirkland\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA133\"],\"normalizedCityName\":\"Kirkland\"}"],"normalized_location":"Kirkland, Washington, USA","optional_search_labels":["devices-manufacturing","devices-services.kuiper-prod-ops"],"posted_date":"December 16, 2025","preferred_qualifications":"- Experience with distributed systems at scale\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Kirkland - 151,200.00 - 204,600.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Sr. System Development Engineer, GSE Automation, Amazon Leo","university_job":null,"updated_time":"30 minutes","url_next_step":"https://account.amazon.com/jobs/3143627/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of supply chain, inventory management or project management experience\u003cbr/\u003e- Bachelor's degree in a quantitative field such as statistics, mathematics, data science, business analytics, economics, finance, engineering, or computer science\u003cbr/\u003e- Experience working with complex data sets","business_category":"amazon-business","city":"Cairo","company_name":"Souq.com for E-Commerce LLC","country_code":"EGY","description":"Amazon strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online. By giving customers more of what they want - low prices, vast selection, and convenience - Amazon continues to grow and evolve as world-class e-commerce.\u003cbr/\u003e\u003cbr/\u003eAmazon is looking for a smart and driven Instock Manager to join our Retail team in Egypt. The Instock Manager will be responsible for leading forecasting planning, buying execution, and operational improvements projects, serving as key point of contact in Instock Management for one or more product categories.\u003cbr/\u003e\u003cbr/\u003eThe role will have responsibility for identifying opportunities to simplify and automate tasks, ensuring inventory systems and processes are meeting the needs of the business and implementing controls around them. The right candidate thrives in a high energy environment where tactical and strategic activities are expected to be driven in parallel.\u003cbr/\u003e\u003cbr/\u003eThe Instock Manager will be responsible for tracking and managing metrics on product availability, inventory health, selection, and vendor performance for key vendors. The successful candidate possesses strong analytical acumen, with experience generating reports, and analyses. The position requires an individual who supports decisions in a highly demanding and often ambiguous environment, with strong attention to detail. The candidate continuously learns and contributes to knowledge management.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eRoles and Responsibilities \u003cbr/\u003e-        Deliver product availability improvement and selection growth\u003cbr/\u003e-        Perform root cause analysis/reporting on Commercial Supply chain / operational issues, develop action plans and manage improvements\u003cbr/\u003e-        Lead collaborative planning, forecasting and replenishment processes with Retail teams and suppliers\u003cbr/\u003e-        Work with responsible Vendor Managers and Brand Specialists to meet the business demand plans via assessing deal and opportunity buys\u003cbr/\u003e-        Recommend and drive action plans to improve inventory turns\u003cbr/\u003e-        Develop yearly plan for a segment of vendors to improve operational performance like Purchase Order Confirmation Rates and Vendor Delivery Lead Time\u003cbr/\u003e-        Solve daily operational issues in contact with other Retail stakeholders and Operations teams\u003cbr/\u003e-        Work with internal teams to drive system, tools and process improvements / implementations that affect purchasing and vendor management workflow, with emphasis on automating tasks that are currently performed manually\u003cbr/\u003e-        Develop analysis of key business metrics, with emphasis on developing and executing recommendations for improvement","department_cost_center":null,"description_short":"Amazon strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online. By giving customers more of what they want - low prices, vast selection,","display_distance":null,"id":"5c078004-a3e7-432a-acd7-0ef295be1363","id_icims":"3174560","is_intern":null,"is_manager":null,"job_category":"Buying, Planning, \u0026 Instock Management","job_family":"Buying/Planning","job_function_id":null,"job_path":"/en/jobs/3174560/instock-manager-1-year-project-mena-instock-mgt","job_schedule_type":"full-time","location":"EG, Cairo","locations":["{\"normalizedCountryCode\":\"EGY\",\"city\":\"Cairo\",\"countryIso3a\":\"EGY\",\"countryIso2a\":\"EG\",\"locationNonStemming\":\"Egypt, Cairo\",\"coordinates\":\"30.04427,31.23525\",\"normalizedCountyName\":\"Cairo\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Egypt\",\"normalizedLocation\":\"Cairo, EGY\",\"location\":\"EG, Cairo\",\"region\":\"\",\"buildingCodeList\":[\"CAI14\"],\"normalizedCityName\":\"Cairo\"}"],"normalized_location":"Cairo, EGY","optional_search_labels":["ops.lander-pwd_mena","ops.lander-mena"],"posted_date":"February  5, 2026","preferred_qualifications":"- Experience with SQL\u003cbr/\u003e- Experience with process improvement techniques such as Kaizen, Lean Manufacturing or Six Sigma\u003cbr/\u003e- Experience in Retail or wholesale business\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-business.no-team-listed","source_system":"JobCreator","state":null,"title":"Instock Manager - 1 year project, MENA Instock Mgt","university_job":null,"updated_time":"32 minutes","url_next_step":"https://account.amazon.com/jobs/3174560/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of building models for business application experience\u003cbr/\u003e- PhD, or Master's degree and 4+ years of CS, CE, ML or related field experience\u003cbr/\u003e- Experience in patents or publications at top-tier peer-reviewed conferences or journals\u003cbr/\u003e- Experience programming in Java, C++, Python or related language\u003cbr/\u003e- Experience in any of the following areas: algorithms and data structures, parsing, numerical optimization, data mining, parallel and distributed computing, high-performance computing","business_category":"no-business-category","city":"Seattle","company_name":"Amazon.com Services LLC - A57","country_code":"USA","description":"Amazon is seeking an Applied Scientist II to join our team and drive innovation in Generative AI and Large Language Model (LLM) applications. In this role, you will design, develop, and deploy  AI solutions that directly impact millions of customers and transform how Amazon operates at scale. You'll work with state-of-the-art technologies including foundation models, prompt engineering, retrieval-augmented generation (RAG), and fine-tuning techniques to solve complex business problems.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tModel Development \u0026 Innovation: Design and implement novel GenAI/LLM solutions using foundation models (e.g., Claude, GPT, LLaMA) and AWS services including Amazon Bedrock, SageMaker, and other AWS AI/ML tools\u003cbr/\u003e•\tResearch \u0026 Experimentation: Conduct applied research to advance the state-of-the-art in LLM applications, including prompt engineering, few-shot learning, fine-tuning, and model evaluation\u003cbr/\u003e•\tProduction Deployment: Build scalable, production-ready AI systems that serve millions of requests with high reliability, low latency, and cost efficiency\u003cbr/\u003e•\tCross-Functional Collaboration: Partner with product managers, engineers, and business stakeholders to translate business requirements into technical solutions and drive measurable impact\u003cbr/\u003e•\tTechnical Leadership: Mentor junior scientists, contribute to technical strategy, and establish best practices for GenAI development across the organization\u003cbr/\u003e•\tEvaluation \u0026 Metrics: Design rigorous evaluation frameworks to measure model performance, bias, safety, and business impact\u003cbr/\u003e•\tDocumentation \u0026 Communication: Publish technical papers, create detailed documentation, and present findings to both technical and non-technical audiences\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon is seeking an Applied Scientist II to join our team and drive innovation in Generative AI and Large Language Model (LLM) applications. In this role, you will design, develop, and deploy  AI solutions","display_distance":null,"id":"dc355208-a38a-43b8-9772-7e8f69a21218","id_icims":"3162762","is_intern":null,"is_manager":null,"job_category":"Data Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3162762/applied-scientist-ii-gen-ai-llm-pxt","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"ZST8\",\"SHK5\",\"IBF4\",\"SEA43\",\"SEA88\",\"SEA57\",\"SEA109\",\"ONM125\",\"SEA91\",\"ATBP18\",\"SEA910\",\"UWA2\",\"SEA33R\",\"SEA26\",\"LBV2\",\"METR7\",\"BFI33\",\"XSE9\",\"UWA4\",\"SEA28\",\"LBV4\",\"WFM761\",\"JSE5\",\"LUM9\",\"SEA55\",\"SEA41\",\"SEA1\",\"SEA69\",\"ONM127\",\"SEA60\",\"SEA74\",\"ISE1\",\"DSW9\",\"PSE\",\"ATBP23\",\"QDS1\",\"SEA38\",\"SEA76\",\"LJG6\",\"SHK3\",\"ZSL2\",\"WFM216\",\"SEA98\",\"SEA45\",\"DCA53\",\"LFC1\",\"SEA116\",\"MAB6\",\"CPA2\",\"ASL1\",\"SEA86\",\"ZST1\",\"SEA70\",\"SEA19\",\"LUM5\",\"ZST4\",\"WFM103\",\"LUM2\",\"SOD5\",\"SEA134\",\"SOD4\",\"FSE1\",\"LWA2\",\"SEA48\",\"PSL1\",\"ONM234\",\"ZST2\",\"ISG2\",\"SEA801\",\"DWX3\",\"ISE3\",\"SEA33\",\"SEA4\",\"ONM135\",\"ZST3\",\"SEA52\",\"SEA63\",\"BFI99\",\"JSE4\",\"SEA300\",\"LUM1\",\"CPA3\",\"SEA62\",\"CPA4\",\"SEA68\",\"SEA3\",\"WFM524\",\"TFC2\",\"T001\",\"ONM126\",\"SEA53\",\"DSE9\",\"ATBP24\",\"SEA81\",\"SEA72\",\"SEA59\",\"COL1\",\"SEA78\",\"BLU1\",\"METR2\",\"WFM59\",\"SEA24\",\"HUS1\",\"SHK4\",\"CWA42\",\"ATBP20\",\"DWA8\",\"LWES\",\"LBV3\",\"SEA142\",\"R004\",\"PUP\",\"UWA3\",\"SEA73\",\"CPA1\",\"SHK6\",\"IBF5\",\"SEA190\",\"SEA42\",\"SEA25\",\"SSE1\",\"SEA39\",\"DSW8\",\"SEA9\",\"MAE1\",\"ZST9\",\"KRA1\",\"IBF3\",\"ATBP22\",\"CWA2\",\"ONM124\",\"SEA44\",\"ATBP17\",\"SEA90\",\"WFM630\",\"HDG13\",\"SEA71\",\"ISE9\",\"SEA58\",\"ISE7\",\"SEA32\",\"SHK2\",\"SEA77\",\"MAB7\",\"XBF2\",\"ONM122\",\"LRSQ\",\"ZSL1\",\"SEA2\",\"SEA01\",\"SEA54\",\"WFM755\",\"SEA23\",\"SEA29\",\"ATBP5\",\"T002\",\"PKD1\",\"FSE3\",\"SEA61\",\"SEA83\",\"ATBP10\",\"ONM232\",\"DTS2\",\"DWX8\",\"ONM128\",\"SEA89\",\"SEA803\",\"ZST7\",\"JSE1\",\"WFM604\",\"LUM4\",\"HCS8\",\"SEA51\",\"MAC8\",\"SEA20\",\"SEA65\",\"ATBP12\",\"SEA18\",\"SEA95\",\"SEA804\",\"SEA22\",\"LUM3\",\"SEA36\",\"SEA147\",\"METR4\",\"ISE6\",\"SEA47\",\"ZSE1\",\"CRP1\",\"ZST5\",\"DWX7\",\"SEA40\",\"IBF1\",\"SOD1\",\"PSE3\",\"WJL5\",\"SEA46\",\"SEA37\",\"SEA401\",\"SEA84\",\"BWA1\",\"XXX0\",\"SEA102\",\"R097\",\"SEA75\",\"METR5\",\"WFM275\",\"SEA27\",\"DSW4\",\"SHK7\",\"ZKL3\",\"SEA21\",\"SEA02\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"January 20, 2026","preferred_qualifications":"- PhD in computer science, machine learning, engineering, or related fields\u003cbr/\u003e- 2+ years of hands-on experience with foundation models and LLM applications (prompt engineering, RAG, fine-tuning, RLHF, Transformer models, and AI Agents)\u003cbr/\u003e- Experience with AWS AI/ML services (Amazon Bedrock, SageMaker, Lambda, etc.)\u003cbr/\u003e- Publications in top-tier conferences (NeurIPS, ICML, ACL, EMNLP, ICLR, COLM, etc.)\u003cbr/\u003e- Experience with model optimization techniques (quantization, distillation, efficient inference)\u003cbr/\u003e- Knowledge of responsible AI practices including bias detection, fairness, and safety evaluation\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, SEATTLE - 142,800.00 - 193,200.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 142,800.00 - 193,200.00 USD annually","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"WA","title":"Applied Scientist II - Gen AI \u0026 LLM, PXT","university_job":null,"updated_time":"32 minutes","url_next_step":"https://account.amazon.com/jobs/3162762/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}