{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"alexa-and-amazon-devices","city":"Sunnyvale","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is an initiative to launch a constellation of Low Earth Orbit satellites that will provide low-latency, high-speed broadband connectivity to unserved and underserved communities around the world.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eHave you wanted an opportunity to develop the core wireless and networking for an advanced global telecom service spanning both space and terrestrial networks?  Have you wondered what it takes to solve a multi-dimentional routing problem at global scale?  Amazon Leo's SDN team will design, implement and operate Leo's network control plane.  This service will enable a high throughput telecom service using a system of LEO satellites, customer terminals, gateways, cloud services, and terrestrial network infrastructure that connect into public and private networks.  For this role, you will:\u003cbr/\u003e- Take responsibility for designing and delivering a modern, flexible, scalable, high throughput, low latency network architecture\u003cbr/\u003e- Implement Routing and Forwarding, Traffic Engineering, and SDN technologies to deliver the best-in-class broadband network services for our customers\u003cbr/\u003e- Implement highly-available software that will drive networking control plane operation on physical and remote nodes\u003cbr/\u003e- Define and automate processes used for software development, implementation, testing, and maintenance\u003cbr/\u003e- Provide operational excellence for control plane services, to including enabling tools and definition/refinement of operational processes\u003cbr/\u003e- Developing routing control plane software for network nodes in C and Rust\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis is an opportunity to be at the heart of the design, building and operation of a massive satellite constellation and terrestrial network. We interact with the satellite ground control services, the customer engagement systems and monitoring services to constantly fine-tune our network and deliver a high quality service to our customers. You will be responsible to build the best network for our customers.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe SDN Control Plane team is building the brain driving the Leo Network. Innovation is in our DNA and we tackle the tough problems presented by a dynamic network at global scale. It is our responsibility to ensure that the network works and our customer has a one-of-a-kind experience using our service.\u003cbr/\u003e\u003cbr/\u003eOur team will design, implement and operate the  control plane that provides a high throughput telecom service comprised of Low Earth Orbit satellites, customer terminals, gateways, Cloud services and terrestrial network infrastructure that connects into public and private networks. ","department_cost_center":null,"description_short":"Amazon Leo is an initiative to launch a constellation of Low Earth Orbit satellites that will provide low-latency, high-speed broadband connectivity to unserved and underserved communities around the world.Key","display_distance":null,"id":"bcbdae6d-6e33-4679-a79a-2c58c29b06db","id_icims":"3187341","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3187341/software-dev-engineer-ii-software-defined-network-control-plane-amazon-leo","job_schedule_type":"full-time","location":"US, CA, Sunnyvale","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sunnyvale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Sunnyvale\",\"coordinates\":\"37.37188,-122.03751\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sunnyvale, California, USA\",\"location\":\"US, CA, Sunnyvale\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC10\"],\"normalizedCityName\":\"Sunnyvale\"}"],"normalized_location":"Sunnyvale, California, USA","optional_search_labels":[],"posted_date":"February 23, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Sunnyvale - 165,200.00 - 223,600.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"CA","title":"Software Dev Engineer II, Software Defined Network Control Plane, Amazon LEO","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3187341/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of engineering team management experience\u003cbr/\u003e- 7+ years of engineering experience\u003cbr/\u003e- Knowledge of engineering practices and patterns for the full software/hardware/networks development life cycle, including coding standards, code reviews, source control management, build processes, testing, certification, and livesite operations\u003cbr/\u003e- Experience partnering with product or program management teams","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is an initiative to launch a constellation of Low Earth Orbit satellites that will provide low-latency, high-speed broadband connectivity to unserved and underserved communities around the world.\u003cbr/\u003e\u003cbr/\u003eHave you wanted an opportunity to develop the software applications and services for an advanced global internet connectivity service? The Leo team is looking for an experienced manager to to oversee the development of architecture, solutions, and a roadmap for managing automation workstream. As the Software Development Manager of this team, you will guide a group of engineers in addressing these challenges, while also focusing on team development and upholding a high standard for delivery quality.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e    Recruit and develop top talent to achieve the team's objectives.\u003cbr/\u003e    Establish and steer the team's long-term vision.\u003cbr/\u003e    Manage resource allocation to meet both business objectives and career development targets.\u003cbr/\u003e    Participate in strategic planning to achieve technical and business goals.\u003cbr/\u003e    Collaborate closely with engineers to design and implement optimal technical designs and strategies.\u003cbr/\u003e    Ensure project timelines are met, prioritizing tasks and managing team workload effectively.\u003cbr/\u003e    Foster a culture of innovation and continuous improvement within the team.\u003cbr/\u003e    Maintain close collaboration with cross-functional teams to align software development with overall company goals.\u003cbr/\u003e    Monitor and ensure adherence to quality standards and best practices in software development.\u003cbr/\u003e    Provide regular performance feedback and career development guidance to team members.","department_cost_center":null,"description_short":"Amazon Leo is an initiative to launch a constellation of Low Earth Orbit satellites that will provide low-latency, high-speed broadband connectivity to unserved and underserved communities around the world.Have","display_distance":null,"id":"dc1600ea-7ae8-4af7-91a9-f365906a3234","id_icims":"3187409","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3187409/software-dev-manager-iii-leo","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA114\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":[],"posted_date":"February 23, 2026","preferred_qualifications":"- Experience in communicating with users, other technical teams, and senior leadership to collect requirements, describe software product features, technical designs, and product strategy\u003cbr/\u003e- Experience in recruiting, hiring, mentoring/coaching and managing teams of Software Engineers to improve their skills, and make them more effective, product software engineers\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Redmond - 184,900.00 - 250,200.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Software Dev Manager III, Leo","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3187409/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or above\u003cbr/\u003e- Experience managing competing priorities and using metrics to drive business decisions\u003cbr/\u003e- Experience building cross-functional partnerships and influencing stakeholders across the organization to act without having a direct reporting relationship\u003cbr/\u003e- Experience in written and verbal communication with the ability to present complex technical information in a clear and concise manner to executives and non-technical leaders\u003cbr/\u003e- Experience in managing multiple, competing priorities simultaneously\u003cbr/\u003e- 8+ years of experience in product management, program management, business operations, or data analytics roles\u003cbr/\u003e- Experience managing complex, cross-functional programs from conception through delivery\u003cbr/\u003e- Strong analytical skills with proficiency in SQL and data analysis tools (Excel, Python, R, or similar)\u003cbr/\u003e- High attention to detail with a bias for action and willingness to dive deep to solve problems at root cause","business_category":"international-stores","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon B2B Payments and Lending team is looking for a Sr. Portfolio Manager to join the Payments team to drive the strategy and performance of our lending portfolios. This role sits at the intersection of product management, data analytics, and portfolio strategy - requiring someone who can think like a product manager, analyze like a data scientist, and operate with the strategic mindset needed to scale a financial services business.\u003cbr/\u003e\u003cbr/\u003eA unique aspect of this role: You'll own the PBI portfolio management for JP and be responsible for identifying, assessing, managing, and reporting credit risks to help build and scale a best-in-class credit management program with close partnership with the Japan onsite operations team. You'll work backwards from customer needs while balancing business objectives, defining product features and operational processes that scale, and using metrics to continuously improve portfolio performance through economic cycles. The successful candidate will be a thought leader and builder who thrives on ambiguity, uses data to drive decisions, and partners across multiple organizations to deliver results.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eStrategic Planning \u0026 Execution:\u003cbr/\u003e- Define and own portfolio health metrics, performance targets, and escalation thresholds across the customer lifecycle\u003cbr/\u003e- Identify emerging trends and business risks proactively; develop and execute mitigation strategies to protect Amazon's balance sheet\u003cbr/\u003e- Drive strategic initiatives from concept to launch, working backwards from customer needs while balancing growth and sustainability objectives\u003cbr/\u003e- Partner with Product teams to define features, policies, and customer experiences that enable scalable, automated decision-making\u003cbr/\u003eCross-Functional Leadership:\u003cbr/\u003e- Build and maintain strong partnerships with onsite operations, Product, Engineering, Science, and Account Receivables teams\u003cbr/\u003e- Influence stakeholders across the organization to drive alignment and action without direct reporting authority\u003cbr/\u003e- Own end-to-end program execution, managing dependencies and driving results across multiple teams and time zones\u003cbr/\u003e- Establish and manage loss mitigation and recovery processes in partnership with collections teams\u003cbr/\u003eData-Driven Innovation:\u003cbr/\u003e- Leverage data analysis to identify opportunities for portfolio optimization and customer experience improvements\u003cbr/\u003e- Design and drive experiments that test hypotheses and inform product and operational decisions\u003cbr/\u003e- Build mechanisms to monitor portfolio performance, surface insights, and enable rapid response to changing conditions\u003cbr/\u003e- Partner with underwriting operations on complex decisions requiring manual review or exceptions, using data to inform judgment calls\u003cbr/\u003eAI-Enabled Portfolio Management:\u003cbr/\u003e- Actively use the AI Agent to conduct portfolio analysis, generate insights, and draft communications at scale\u003cbr/\u003e- Identify opportunities to automate repetitive analytical tasks and scale decision-making through AI augmentation\u003cbr/\u003e- Collaborate with Science and Engineering teams to improve agent performance and expand use cases\u003cbr/\u003e- Serve as a power user and advocate for AI-enabled tools within the portfolio management function\u003cbr/\u003eOperational Excellence:\u003cbr/\u003e- Define SOPs and operational processes that enable efficient scaling while maintaining high quality standards\u003cbr/\u003e- Establish mechanisms for continuous improvement and operational efficiency\u003cbr/\u003e- Drive automation initiatives that improve customer experience while reducing operational burden\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDo you like helping small businesses grow? Do you enjoy working across organizations and scaling programs? Come join us at Amazon B2B Payments \u0026 Lending! The Amazon B2B Payments \u0026 Lending team provides invoicing, working capital and payment acceptance solutions to Amazon Business customers, sellers and other small business customers across Amazon. We are part of the global Consumer Payments organization, who aims to delight our customers by building payment experiences and financial services that are trusted, valued and easy to use from anywhere in any way.","department_cost_center":null,"description_short":"Amazon B2B Payments and Lending team is looking for a Sr. Portfolio Manager to join the Payments team to drive the strategy and performance of our lending portfolios. This role sits at the intersection","display_distance":null,"id":"25cf07ea-551e-48de-890e-2ed526adf401","id_icims":"3184526","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Risk Family","job_function_id":null,"job_path":"/en/jobs/3184526/sr-risk-manager-lending-abpl","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA28\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February 19, 2026","preferred_qualifications":"- Master's degree, or MBA in business, data science, public administration, finance, engineering, human resources or related field\u003cbr/\u003e- Speak, write, and read fluently in Japanese at a business level or above (N1+)\u003cbr/\u003e- Experience with financial services, payments or e-commerce\u003cbr/\u003e- Familiarity with credit concepts, portfolio management, or financial risk principles\u003cbr/\u003e- Experience building and scaling 0-to-1 products or programs\u003cbr/\u003e- Demonstrated success driving innovation and experimentation in ambiguous environments\u003cbr/\u003e- Experience working with AI/ML tools, large language models, or generative AI applications\u003cbr/\u003e- Background in building automated decision systems or working with machine learning models\u003cbr/\u003e- Experience working with global teams across multiple time zones\u003cbr/\u003e- Curiosity about AI and enthusiasm for exploring how generative AI can transform knowledge work\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 121,400.00 - 163,900.00 USD annually","primary_search_label":"international-stores.team-amazon-payments","source_system":"JobCreator","state":"WA","title":"Sr Risk Manager, Lending, ABPL","university_job":null,"updated_time":"19 minutes","url_next_step":"https://account.amazon.com/jobs/3184526/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-payments","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 7+ years of industrial controls and automation experience\u003cbr/\u003e- 7+ years of process/production environment PLC-controlled automation and issue diagnosis experience\u003cbr/\u003e- 7+ years of robotics work cells and control systems experience\u003cbr/\u003e- 7+ years of Siemens, Allen-Bradley or Codesys Ladder Logic and structure programming experience\u003cbr/\u003e- 7+ years of electrical theory, robotics, controls components, and automated equipment experience\u003cbr/\u003e- Bachelor's degree in Computer Science, Electrical Engineering, or Automation Engineering, or 7+ years of PLC programming or automation engineering experience","business_category":"subsidiaries","city":"Maple Grove","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Operations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every day. The Reliability \u0026 Maintenance Engineering (RME) team are the business partners that work tirelessly behind the scenes to make it happen. We drive continuous improvement, and maintain all of the robotics and material handling equipment (MHE) to ensure our customers are met with the Amazon smile. Come join us on our journey!\u003cbr/\u003e\u003cbr/\u003eAbout the Role:\u003cbr/\u003eAs the Regional Automation Engineer Manager, you will lead teams of onsite and regional automation engineers in driving equipment reliability and operational excellence across our fulfillment centers. You’ll monitor and support their work in controls automation and technical support while ensuring they effectively troubleshoot complex control systems and analyze performance metrics. You’ll guide their leadership of continuous improvement projects and ensure they provide mentorship to junior engineers. You'll work with state-of-the-art technology, including conveyors, sortation systems, scanners, cameras, print and apply systems, and SCADA devices and programs. Through your technical leadership and design optimization efforts, you'll directly contribute to ensuring our customers receive their orders with Amazon's signature speed and accuracy while building team capabilities and driving operational excellence.\u003cbr/\u003eWhat Do We Offer?\u003cbr/\u003eAmazon offers competitive compensation packages including comprehensive healthcare benefits starting on Day 1, matching 401(k) program, and up to 20 weeks of paid parental leave. But wait, there’s more: We provide lightweight fire-resistant daily wear and composite toe safety shoes for your safety!\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities include, but are not limited to:\u003cbr/\u003e- Apply Subject Matter Expertise (SME) on troubleshooting and dive deeps for engineering issues, supporting a region of automation engineers to investigate the root cause and planning actions to eliminate/mitigate the downtime of critical assets\u003cbr/\u003e- Program and source coding for in-house built solutions based in PLC or PC controllers and SCADA/OEE platforms\u003cbr/\u003e- Lead a team of engineers in understanding, maintaining and troubleshooting material handling control systems, including PLC/PC controllers and industrial networks such as Ethernet, ControlNet, DeviceNet, Profibus, motor control systems, servo drives, frequency drives, and electrical distribution systems\u003cbr/\u003e- Monitor MHE metrics and partner with maintenance/operations to address system performance issues and provide analysis across all operations\u003cbr/\u003e- Provide regional escalation support to automation engineers, during and after business hours, troubleshooting locally and remotely, to ensure that all hardware or controls software within the region\u003cbr/\u003e- Perform and analyze building System Assessments to enhance material handling system performance\u003cbr/\u003e- Establish training plans and mentor a team of automation engineers\u003cbr/\u003e- Communicate technical issues and project timelines clearly to building managers, operations staff and maintenance teams \u003cbr/\u003e- Appropriately escalate downtime situations to vendors or senior leadership for support to restore equipment operation\u003cbr/\u003e- Provide 24/7 on-call rotational support for hardware and software systems across multiple sites\u003cbr/\u003e- Travel up to 80%","department_cost_center":null,"description_short":"Operations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every","display_distance":null,"id":"a3c300bb-2012-44a9-968b-7991ead4dc29","id_icims":"3156482","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3156482/regional-automation-engineer-manager-nasc-ae","job_schedule_type":"full-time","location":"US, MN, Maple Grove","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"McKinney\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, McKinney\",\"coordinates\":\"33.19916,-96.615\",\"normalizedCountyName\":\"Collin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"McKinney, Texas, USA\",\"location\":\"US, TX, McKinney\",\"region\":\"TX\",\"buildingCodeList\":[\"DDX2\"],\"normalizedCityName\":\"McKinney\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Irving\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Irving\",\"coordinates\":\"32.81352,-96.95532\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Irving, Texas, USA\",\"location\":\"US, TX, Irving\",\"region\":\"TX\",\"buildingCodeList\":[\"RBD5\"],\"normalizedCityName\":\"Irving\"}","{\"normalizedStateName\":\"Minnesota\",\"normalizedCountryCode\":\"USA\",\"city\":\"Maple Grove\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MN, Maple Grove\",\"coordinates\":\"45.09831,-93.44194\",\"normalizedCountyName\":\"Hennepin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Maple Grove, Minnesota, USA\",\"location\":\"US, MN, Maple Grove\",\"region\":\"MN\",\"buildingCodeList\":[\"MSP7\"],\"normalizedCityName\":\"Maple Grove\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Dallas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Dallas\",\"coordinates\":\"32.77823,-96.7951\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Dallas, Texas, USA\",\"location\":\"US, TX, Dallas\",\"region\":\"TX\",\"buildingCodeList\":[\"AFW8\"],\"normalizedCityName\":\"Dallas\"}"],"normalized_location":"Maple Grove, Minnesota, USA","optional_search_labels":[],"posted_date":"January  9, 2026","preferred_qualifications":"- Master's degree in Computer Science, Electrical Engineering, or Automation Engineering\u003cbr/\u003e- Master's degree, or Six Sigma Black Belt\u003cbr/\u003e- Experience maintaining, troubleshooting, programming, and designing HMI and control network components\u003cbr/\u003e- Experience programming with RSLogix5000, Studio 5000, FT View, and other controls software platforms\u003cbr/\u003e- Experience leading Controls in manufacturing or complex industrial environments\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $146,500/year in our lowest geographic market up to $242,200/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"subsidiaries.team-amazon-robotics","source_system":"JobCreator","state":"MN","title":"Regional Automation Engineer Manager, NASC AE","university_job":null,"updated_time":"19 minutes","url_next_step":"https://account.amazon.com/jobs/3156482/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-robotics","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor of Science in Pharmacy or Pharm.D. degree\u003cbr/\u003e- Active and unrestricted Pharmacy License in state of employment (additional licenses may be\u003cbr/\u003e- required)\u003cbr/\u003e- Proficiency with basic computer functions and pharmacy systems\u003cbr/\u003e- Exemplary interpersonal, written, and verbal communication skills","business_category":"healthcare","city":"Plainfield","company_name":"PillPack, LLC - H96","country_code":"USA","description":"Innovation is at the core of what we do. We believe that by removing and reducing the barriers\u003cbr/\u003ethat prevent people from taking their medications, we can help customers conveniently get the\u003cbr/\u003emedications they need, when they need them and take them as prescribed. We have provided\u003cbr/\u003ecustomers with the ability to find transparent and simple pricing, receive 24/7 customer service\u003cbr/\u003esupport, and have their meds delivered to their doorsteps while creating programs and\u003cbr/\u003eproducts that embody our mission and position ourselves in becoming the world's safest and\u003cbr/\u003efastest online pharmacy.\u003cbr/\u003eWe are looking for a Staff Pharmacist to join us on our journey to make it drastically easier for\u003cbr/\u003ecustomers to find, choose, afford, and engage with the services, products, and professionals\u003cbr/\u003ethey need to get and stay healthy!\u003cbr/\u003e\u003cbr/\u003eAvailable schedule: Sunday through Wednesday 10 hour shifts starting at 6:30pm.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003ePlease note that specific responsibilities may vary by position and location. The following list\u003cbr/\u003erepresents potential duties that may be required:\u003cbr/\u003e● Maintain comprehensive customer profiles including current and past medical history, clinical\u003cbr/\u003eand laboratory data, and concurrent medications (including over-the-counter and home\u003cbr/\u003eremedies)\u003cbr/\u003e● Evaluate physician medication orders for appropriateness of drug, dosage, potential\u003cbr/\u003einteractions, and route of administration. Make recommendations for therapy changes to the\u003cbr/\u003eprescriber as appropriate\u003cbr/\u003e● Operate and Troubleshoot Pharmacy Automation Systems\u003cbr/\u003e• Utilize, monitor, and troubleshoot automated dispensing and fulfillment systems to\u003cbr/\u003eensure accurate, efficient, and timely preparation of prescription orders\u003cbr/\u003e• Collaborate with pharmacy technicians and engineering teams to resolve automation\u003cbr/\u003eissues, optimize workflows, and maintain compliance with quality and safety standards\u003cbr/\u003e● Dispense Controlled Substances and Maintain Regulatory Compliance\u003cbr/\u003e• Accurately dispense controlled substances in accordance with DEA regulations and\u003cbr/\u003estate-specific laws\u003cbr/\u003e• Maintain thorough, timely, and auditable records of all controlled substance\u003cbr/\u003etransactions, including inventory management, reconciliation, and reporting\u003cbr/\u003erequirements\u003cbr/\u003e● Provide Clinical Support:\u003cbr/\u003e• Answer clinical questions and provide guidance\u003cbr/\u003e• Collaborate with healthcare team members\u003cbr/\u003e• Document all healthcare team communications\u003cbr/\u003e• Investigate and resolve medication errors\u003cbr/\u003e● Additional Responsibilities:\u003cbr/\u003e• Implement policies and procedures in accordance with state and federal laws\u003cbr/\u003e• Maintain required regulatory documentation\u003cbr/\u003e• Participate in continuous improvement initiatives\u003cbr/\u003e• Support pharmacy operations across departments as needed\u003cbr/\u003e• Physical requirements may include ability to perform warehouse work and lifting up to 20 pounds","department_cost_center":null,"description_short":"Innovation is at the core of what we do. We believe that by removing and reducing the barriersthat prevent people from taking their medications, we can help customers conveniently get themedications they","display_distance":null,"id":"77946c62-de8f-46b9-8dbf-abb184f6bdd5","id_icims":"3167737","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Pharmacy","job_function_id":null,"job_path":"/en/jobs/3167737/overnight-staff-pharmacist-staff-pharmacist","job_schedule_type":"full-time","location":"US, IN, Plainfield","locations":["{\"normalizedStateName\":\"Indiana\",\"normalizedCountryCode\":\"USA\",\"city\":\"Plainfield\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, IN, Plainfield\",\"coordinates\":\"39.70442,-86.39765\",\"normalizedCountyName\":\"Hendricks\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Plainfield, Indiana, USA\",\"location\":\"US, IN, Plainfield\",\"region\":\"IN\",\"buildingCodeList\":[\"PIN2\"],\"normalizedCityName\":\"Plainfield\"}"],"normalized_location":"Plainfield, Indiana, USA","optional_search_labels":[],"posted_date":"January 27, 2026","preferred_qualifications":"- Understanding of pharmacy laws and federal/state regulations\u003cbr/\u003e- Ability to manage high call volume while maintaining quality customer service\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, IN, Plainfield - 103,800.00 - 146,400.00 USD annually","primary_search_label":"healthcare.team-pharmacy","source_system":"JobCreator","state":"IN","title":"Overnight Staff Pharmacist, Staff Pharmacist","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3167737/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-pharmacy","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"A Bachelor's degree or foreign equivalent in engineering, business administration, human resources management or related field and 3 years of experience in job offered or project/program management related occupation. \u003cbr/\u003e\u003cbr/\u003eExperience must include: \u003cbr/\u003e(1) 3 year of experience in developing and driving strategic initiatives within a cross-functional environment\u003cbr/\u003e(2) 3 year of experience in root causes analysis to identify issues with process and tools\u003cbr/\u003e(3) 3 year of experience in process improvements and operational support\u003cbr/\u003e(4) 3 year of experience in status reporting and presentations to stakeholders and customers\u003cbr/\u003e\u003cbr/\u003eThe pay range for this position in Seattle, WA is $82,700/year to $ 112,500/year however, base pay offered may vary depending on job-related knowledge, skills, and experience  A sign-on bonus and restricted stock units may be provided as part of the compensation package, in addition to a full range of medical, financial, and/or other benefits, dependent on the position offered. This information is provided by Seattle, WA Equal Pay Act. Base pay information is based on market location. Applicants should apply via Amazon's internal or external careers site.\u003cbr/\u003e","business_category":"no-business-category","city":"Seattle","company_name":"Amazon.com Services LLC - A57","country_code":"USA","description":"Employer: Amazon.com Services\u003cbr/\u003ePosition: HR Specialist II  AMZ8176.8 (multiple positions available)\u003cbr/\u003eLocation: Seattle, WA\u003cbr/\u003e\u003cbr/\u003eMultiple Positions Available:\u003cbr/\u003e\u003cbr/\u003e1.\tLead and optimize the background check screening program for design, ensuring compliance and operational excellence across the network for designated business line(s).\u003cbr/\u003e2.\tDrive the strategy, vision, and roadmap, with a high degree of ownership over critical features and customer experience.\u003cbr/\u003e3.\tDesign and implement short- and long-term solutions for complex business challenges, delivering results with limited guidance while optimizing procedures and processes\u003cbr/\u003e4.\tOversee complex project implementations spanning compliance, customer experience, operational efficiency, and technical automation. \u003cbr/\u003e5.\tDevelop and execute plans by communicating business and screening requirements, negotiating priorities, and defining success criteria across teams. \u003cbr/\u003e6.\tEvaluate potential vendors, assess their fit for organizational needs, write comprehensive proposals, secure leadership buy-in, and manage the onboarding process for new vendors to support business objectives. \u003cbr/\u003e7.\tDrive cross-team initiatives and collaborate with multiple stakeholders to achieve business goals and drive operational excellence.\u003cbr/\u003e8.\tUse strong analytical and quantitative skills with the ability to use data and metrics to backup assumptions, evaluate outcomes, and develop and implement data-driven strategies to enhance program efficiency and service quality.\u003cbr/\u003e9.\tPresent findings and recommendations to leadership up to three levels above, facilitating dialogue and fostering shared understanding. \u003cbr/\u003e10.\tDemonstrate the understanding of technical concepts, managing and prioritizing trade-offs and new opportunities with technical team members.\u003cbr/\u003e11.\t100% telecommuting permitted, work may be performed from anywhere in the U.S. \u003cbr/\u003e\u003cbr/\u003e(40 hours / week, 8:00am-5:00pm, Salary Range $82,700/year to $ 112,500 /year)\u003cbr/\u003e\u003cbr/\u003eAmazon.com is an Equal Opportunity – Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation","department_cost_center":null,"description_short":"Employer: Amazon.com ServicesPosition: HR Specialist II  AMZ8176.8 (multiple positions available)Location: Seattle, WAMultiple Positions Available:1.\tLead and optimize the background check screening program","display_distance":null,"id":"e55bac6f-072b-496c-b96f-8998e0747ba0","id_icims":"3167614","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Human Resources","job_function_id":null,"job_path":"/en/jobs/3167614/hr-specialist-ii-amz8176-8","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA40\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"January 27, 2026","preferred_qualifications":"All applicants must meet all the above listed requirements.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"WA","title":"HR Specialist II - AMZ8176.8","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3167614/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"transportation-and-logistics","city":"Uxbridge","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager. In this role, you will lead a team of hourly workforce and will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\r\u003cbr/\u003e   \r\u003cbr/\u003e  Our Operation’s workflow has three major components:  First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer.\r\u003cbr/\u003e \r\u003cbr/\u003e Key Responsibilities and Job Elements:\r\u003cbr/\u003e     - Support,      mentor, and motivate your hourly workforce\u003cbr/\u003e   - Manage      safety, quality, productivity, and customer delivery promises \u003cbr/\u003e   - Collaborate      with all support teams including Safety, Engineering, Loss Prevention,      Quality Assurance, Human Resources to develop plans to meet business      objectives\u003cbr/\u003e   - Lift up to      49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e   - Stand/walk for      up to 12 hours during shifts \u003cbr/\u003e   - Work in an      environment where the noise level varies and can be loud\u003cbr/\u003e   - Work in an      environment that is subject to variable temperatures and weather (delivery      stations include outside loading departments)\u003cbr/\u003e   - Continuously      climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e   Our fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Area Managers based on location preference and the business’ current openings. \r\u003cbr/\u003e   ","department_cost_center":null,"description_short":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager.","display_distance":null,"id":"2ebf7632-293b-4a27-80e0-68115f105fab","id_icims":"3182067","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3182067/area-manager-ii-uxbridge-ma","job_schedule_type":"full-time","location":"US, MA, Uxbridge","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Uxbridge\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Uxbridge\",\"coordinates\":\"42.06418,-71.62246\",\"normalizedCountyName\":\"Worcester\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Uxbridge, Massachusetts, USA\",\"location\":\"US, MA, Uxbridge\",\"region\":\"MA\",\"buildingCodeList\":[\"ORH5\"],\"normalizedCityName\":\"Uxbridge\"}"],"normalized_location":"Uxbridge, Massachusetts, USA","optional_search_labels":[],"posted_date":"February 16, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 20+ employees\u003cbr/\u003e- Experience with process improvements (Lean process, Kaizen, and/or Six Sigma)\u003cbr/\u003e- Excellent customer service, communication, and interpersonal skills\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Industry experience in: retail, F\u0026B, military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MA, Uxbridge - 70,000.00 - 90,900.00 USD annually","primary_search_label":"transportation-and-logistics.team-sortation","source_system":"JobCreator","state":"MA","title":"Area Manager II - Uxbridge, MA","university_job":null,"updated_time":"21 minutes","url_next_step":"https://account.amazon.com/jobs/3182067/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sortation","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 3+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 3+ years of building complex software systems experience","business_category":"ecp","city":"New York","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our Org\u003cbr/\u003eAmazon Selection and Catalog Systems (ASCS) builds the systems that host and run the world’s largest e-Commerce products catalog. Our high scale distributed systems process hundreds of millions of updates on the billions of products to power the online buying experience for hundreds of millions of Amazon's customers worldwide, so they can find, discover and buy anything they want 24x7x365.\u003cbr/\u003e\u003cbr/\u003eOur Team \u003cbr/\u003eProduct Knowledge (PK) is a comprehensive set of schematic and semantic constructs that allows us to understand customer’s intent to provide an experience that feel targeted to their shopping missing. It expands beyond factual product characteristics (e.g. resolution of a TV) to the product characteristics our customer’s use in their shopping missions – what the product is used for (e.g. baby-proofing), where the product is used (e.g. kitchen), who uses the product (e.g. teenager), when the product is used (e.g. thanksgiving) and opinions about the product (e.g. cute t-shirt). We build distributed systems that are partially or entirely powered by AI and ML. The system will be responsible for scaling the discovery of Product Knowledge by mining customer engagements (e.g. search queries, customer reviews etc.)\u003cbr/\u003e\u003cbr/\u003eOur Mission \u003cbr/\u003eEnable customer shopping journeys on Amazon by modeling an standardized, semantically rich, easily discoverable, extensible, and universally applicable body of product knowledge that can be consistently utilized across customer shopping experiences, selling partner listing experiences and internal enrichment of product data.\u003cbr/\u003e\u003cbr/\u003eWe're looking for a software engineer who has strong technical skills and is able to drive technical efforts that have high impact and visibility. This role has a number of opportunities for cross-boundary ownership and require cross-organizational technical leadership skills to create seamless solutions that reliably work end-to-end. The engineer will develop by technologies and systems that heavily leverage Large Language Models (LLM) and Generative AI technologies. You will solve challenging technical problems - and this will entail learning about applying latest AI technologies, designing and developing distributed systems, and web services. You will innovate day-in and day-out,  beyond the \"textbook solutions\". \u003cbr/\u003e\u003cbr/\u003eThis is a great opportunity for engineers who want to work with latest AI technologies, and create reliable and scalable solutions that enable Amazon to create the largest and best possible selection for our customers. Come and help make history as we take e-Commerce to the 5 billion people on earth who do not have it today while having fun and learning a lot on the way!","department_cost_center":null,"description_short":"Our OrgAmazon Selection and Catalog Systems (ASCS) builds the systems that host and run the world’s largest e-Commerce products catalog. Our high scale distributed systems process hundreds of millions","display_distance":null,"id":"24888861-0196-4319-b475-12e31cc98360","id_icims":"3172837","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3172837/software-dev-engineer-genai-product-knowledge","job_schedule_type":"full-time","location":"US, NY, New York","locations":["{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK27\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"New York, New York, USA","optional_search_labels":[],"posted_date":"February  3, 2026","preferred_qualifications":"- Bachelor's degree or above in statistics, business analytics, data analytics, data science, computer science or related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, New York - 158,100.00 - 213,800.00 USD annually","primary_search_label":"ecp.team-ascs","source_system":"JobCreator","state":"NY","title":"Software Dev Engineer, GenAI, Product Knowledge","university_job":null,"updated_time":"22 minutes","url_next_step":"https://account.amazon.com/jobs/3172837/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-ascs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor of Science in Pharmacy or Pharm.D. degree\u003cbr/\u003e- Active and unrestricted Pharmacy License in state of employment (additional licenses may be required)\u003cbr/\u003e- Proficiency with basic computer functions and pharmacy systems\u003cbr/\u003e- Exemplary interpersonal, written, and verbal communication skill","business_category":"healthcare","city":"Virtual Location - Arizona","company_name":"PillPack, LLC","country_code":"USA","description":"Staff Pharmacist, Pharmacy Services\u003cbr/\u003e\u003cbr/\u003eInnovation is at the core of what we do. We believe that by removing and reducing the barriers\u003cbr/\u003ethat prevent people from taking their medications, we can help customers conveniently get the\u003cbr/\u003emedications they need, when they need them and take them as prescribed. We have provided\u003cbr/\u003ecustomers with the ability to find transparent and simple pricing, receive 24/7 customer service\u003cbr/\u003esupport, and have their meds delivered to their doorsteps while creating programs and\u003cbr/\u003eproducts that embody our mission and position ourselves in becoming the world's safest and\u003cbr/\u003efastest online pharmacy.\u003cbr/\u003e\u003cbr/\u003eWe are looking for a Staff Pharmacist to join us on our journey to make it drastically easier for\u003cbr/\u003ecustomers to find, choose, afford, and engage with the services, products, and professionals\u003cbr/\u003ethey need to get and stay healthy!\u003cbr/\u003e\u003cbr/\u003eMust have an active Registered Pharmacist license with the AZ Board of Pharmacy. Must reside in the state of Arizona, and must be able to commute to the  office if necessary.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003ePlease note that specific responsibilities may vary by position and location. The following list\u003cbr/\u003erepresents potential duties that may be required:\u003cbr/\u003e● Maintain comprehensive customer profiles including current and past medical history, clinical\u003cbr/\u003eand laboratory data, and concurrent medications (including over-the-counter and home\u003cbr/\u003eremedies)\u003cbr/\u003e● Evaluate physician medication orders for appropriateness of drug, dosage, potential\u003cbr/\u003einteractions, and route of administration. Make recommendations for therapy changes to the\u003cbr/\u003eprescriber as appropriate\u003cbr/\u003e● Operate and Troubleshoot Pharmacy Automation Systems\u003cbr/\u003e• Utilize, monitor, and troubleshoot automated dispensing and fulfillment systems to\u003cbr/\u003eensure accurate, efficient, and timely preparation of prescription orders\u003cbr/\u003e• Collaborate with pharmacy technicians and engineering teams to resolve automation\u003cbr/\u003eissues, optimize workflows, and maintain compliance with quality and safety standards\u003cbr/\u003e● Dispense Controlled Substances and Maintain Regulatory Compliance\u003cbr/\u003e• Accurately dispense controlled substances in accordance with DEA regulations and\u003cbr/\u003estate-specific laws\u003cbr/\u003e• Maintain thorough, timely, and auditable records of all controlled substance\u003cbr/\u003etransactions, including inventory management, reconciliation, and reporting\u003cbr/\u003erequirements\u003cbr/\u003e● Provide Clinical Support:\u003cbr/\u003e• Answer clinical questions and provide guidance\u003cbr/\u003e• Collaborate with healthcare team members\u003cbr/\u003e• Document all healthcare team communications\u003cbr/\u003e• Investigate and resolve medication errors\u003cbr/\u003e\u003cbr/\u003e Additional Responsibilities:\u003cbr/\u003e• Implement policies and procedures in accordance with state and federal laws\u003cbr/\u003e• Maintain required regulatory documentation\u003cbr/\u003e• Participate in continuous improvement initiatives\u003cbr/\u003e• Support pharmacy operations across departments as needed\u003cbr/\u003e• Physical requirements may include ability to perform warehouse work and lift at least\u003cbr/\u003e20 pounds","department_cost_center":null,"description_short":"Staff Pharmacist, Pharmacy ServicesInnovation is at the core of what we do. We believe that by removing and reducing the barriersthat prevent people from taking their medications, we can help customers","display_distance":null,"id":"304edf5b-8679-4eb0-ad32-3e970aa6387b","id_icims":"3113063","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Pharmacy","job_function_id":null,"job_path":"/en/jobs/3113063/staff-pharmacist-amazon-pharmacy","job_schedule_type":"full-time","location":"US, AZ, Virtual Location - Arizona","locations":["{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Virtual Location - Arizona\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Virtual Location - Arizona\",\"coordinates\":\"33.44825,-112.07581\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arizona, USA\",\"location\":\"US, AZ, Virtual Location - Arizona\",\"region\":\"AZ\",\"buildingCodeList\":[\"VIR\"]}"],"normalized_location":"Arizona, USA","optional_search_labels":[],"posted_date":"October 21, 2025","preferred_qualifications":"- Understanding of pharmacy laws and federal/state regulations\u003cbr/\u003e- Ability to manage high call volume while maintaining quality customer service\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, AZ, Virtual Location - Arizona - 103,800.00 - 146,400.00 USD annually","primary_search_label":"healthcare.team-pharmacy","source_system":"JobCreator","state":"AZ","title":"Staff Pharmacist, Amazon Pharmacy","university_job":null,"updated_time":"24 minutes","url_next_step":"https://account.amazon.com/jobs/3113063/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-pharmacy","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- PhD in computer science, computer engineering, or related field\u003cbr/\u003e- Experience in patents or publications at top-tier peer-reviewed conferences or journals\u003cbr/\u003e- Experience in any of the following areas: algorithms and data structures, parsing, numerical optimization, data mining, parallel and distributed computing, high-performance computing\u003cbr/\u003e- Experience programming in Java, C++, Python or related language\u003cbr/\u003e- Experience using Unix/Linux","business_category":"aws","city":"Santa Clara","company_name":"Annapurna Labs (U.S.) Inc.","country_code":"USA","description":"The AWS Neuron Science Team is looking for talented scientists to enhance our software stack, accelerating customer adoption of Trainium and Inferentia accelerators. In this role, you will work directly with external and internal customers to identify key adoption barriers and optimization opportunities. You'll collaborate closely with our engineering teams to implement innovative solutions and engage with academic and research communities to advance state-of-the-art ML systems. As part of a strategic growth area for AWS, you'll work alongside distinguished engineers and scientists in an exciting and impactful environment. We actively work on these areas:\u003cbr/\u003e\u003cbr/\u003e- AI for Systems: Developing and applying ML/RL approaches for kernel/code generation and optimization\u003cbr/\u003e- Machine Learning Compiler: Creating advanced compiler techniques for ML workloads\u003cbr/\u003e- System Robustness: Building tools for accuracy and reliability validation\u003cbr/\u003e- Efficient Kernel Development: Designing high-performance kernels optimized for our ML accelerator architectures\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAWS Utility Computing (UC) provides product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for their cloud services. Additionally, this role may involve exposure to and experience with Amazon's growing suite of generative AI services and other cloud computing offerings across the AWS portfolio.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Neuron is the software of Trainium and Inferentia, the AWS Machine Learning chips. Inferentia delivers best-in-class ML inference performance at the lowest cost in the cloud to our AWS customers. Trainium is designed to deliver the best-in-class ML training performance at the lowest training cost in the cloud, and it’s all being enabled by AWS Neuron. Neuron is a Software that include ML compiler and native integration into popular ML frameworks. Our products are being used at scale with external customers like Anthropic and Databricks as well as internal customers like Alexa, Amazon Bedrocks, Amazon Robotics, Amazon Ads, Amazon Rekognition and many more.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.","department_cost_center":null,"description_short":"The AWS Neuron Science Team is looking for talented scientists to enhance our software stack, accelerating customer adoption of Trainium and Inferentia accelerators. In this role, you will work directly","display_distance":null,"id":"b2225aa3-ba07-4027-92f8-bfa84027f95b","id_icims":"3139216","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3139216/applied-scientist-aws-neuron-science-team","job_schedule_type":"full-time","location":"US, CA, Santa Clara","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Santa Clara\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Santa Clara\",\"coordinates\":\"37.3558,-121.95512\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Santa Clara, California, USA\",\"location\":\"US, CA, Santa Clara\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC25\"],\"normalizedCityName\":\"Santa Clara\"}"],"normalized_location":"Santa Clara, California, USA","optional_search_labels":["aws.team-utility-computing","amazon.artificial-intelligence","aws.team-generative-ai"],"posted_date":"December  8, 2025","preferred_qualifications":"- Experience in investigating, designing, prototyping, and delivering new and innovative system solutions\u003cbr/\u003e- Experience in state-of-the-art deep learning models architecture design and deep learning training and optimization and model pruning\u003cbr/\u003e- Experience with popular deep learning frameworks such as MxNet and Tensor Flow\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Santa Clara - 171,600.00 - 222,200.00 USD annually","primary_search_label":"aws.team-data-science-primary","source_system":"JobCreator","state":"CA","title":"Applied Scientist, AWS Neuron Science Team","university_job":null,"updated_time":"24 minutes","url_next_step":"https://account.amazon.com/jobs/3139216/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-data-science-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}