{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 5+ years of engineering, installation, or startup/commissioning of electrical and mechanical systems experience\u003cbr/\u003e- Bachelor’s degree in Mechanical/Electrical Engineering or 5 years of relevant discipline work experience\u003cbr/\u003e- High technical competency in either mechanical or electrical or control systems utilized in critical infrastructures, with the capability to learn and be trained in the others.\u003cbr/\u003e- Understand the design concept and intent by reviewing mechanical or electrical design documentation, including drawings, specifications, vendor submittals and sequences of operations and provide feedback on the same in accordance with Amazon standards for basis of design.\u003cbr/\u003e- Develop but majorly review commissioning documentation such as test plans, scripts and reports developed by vendors to ensure accuracy in accordance with the design requirements.","business_category":"aws","city":null,"company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAre you experienced in Critical Infrastructure Commissioning and looking for a fast paced environment to work in? As a Data Center Commissioning Engineer (CxE), you will be part of highly creative, efficient team tasked with tackling fascinating and challenging problems building and supporting the operations of Amazon owned data centers. The Amazon Commissioning team (ACx) understands, evaluates, defines and manages the expectations of construction quality in accordance to engineering designs to meet the customer requirements. The CxE is responsible for supporting vendors, contractors, and other teams involved in the construction and commissioning of various systems such as:\u003cbr/\u003e\t• Medium and low voltage power systems \u003cbr/\u003e\t• Generators\u003cbr/\u003e\t• UPS\u003cbr/\u003e\t• HVAC (Air Handlers / Exhaust Fans / VFD)\u003cbr/\u003e\t• Chilled Water Systems\u003cbr/\u003e\t• Building Management systems (BMS)\u003cbr/\u003e\t• Electrical Power Monitoring Systems (EPMS)\u003cbr/\u003e\t• Testing and balancing\u003cbr/\u003e        • Pumps and Hydronic systems\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs the Commissioning Engineer (CxE), you will provide testing and validation oversight of AWS data center electrical and mechanical infrastructure. This includes, but not limited to, review of design documents and equipment submittals, leading Factory Witness Testing (FWT), and managing third-party commissioning vendors in the performance of onsite pre-functional, functional, and integrated systems testing. You will own your projects’ successes where you Deep Dived to resolve technical issues and had Bias for Action to address schedule impacts and coordination demands onsite. You will be sharing your lessons learned leading towards team growth and program improvements.\u003cbr/\u003e\u003cbr/\u003eYou will get the opportunity to provide multi-discipline input into the scheduling, test script development, designing, and planning of projects. During commissioning, you will be continuously auditing Cx vendors’ activities to ensure compliance with environmental, quality, and safety requirements. Following the AWS project reporting format, you will be responsible for regular reporting of commissioning progress and metrics of assigned project to your Regional Commissioning Manager. You will have the opportunity to lead several projects simultaneously to achieve key milestones and deliver data center capacity, while managing project budget as approved by Finance.\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eOn a typical project, the CxE works across AWS engineering, capacity delivery, operations, and contractor teams to coordinate site activities, prioritize tasks, and ensure each issue has clear path to resolution. The CxE manages the project commissioning vendor whose primary scope is to execute functional tests, identify issues, determine criticality, propose solutions, and document their findings. If project turnover is at risk, the CxE escalates to the appropriate stakeholders. Upon project completion, the CxE will communicate lessons learned to help peers on similar projects in flight and participate in initiatives that drive improvement to the commissioning program.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e \u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003e#DCCD_AMER\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"430faed7-e891-47eb-9411-058207003e48","id_icims":"3122970","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Infrastructure Eng","job_function_id":null,"job_path":"/en/jobs/3122970/commissioning-engineer-amer-central-acx","job_schedule_type":"full-time","location":"US, MS","locations":["{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS\",\"coordinates\":\"32.29896,-90.18045\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Mississippi, USA\",\"location\":\"US, MS\",\"region\":\"MS\",\"buildingCodeList\":[\"JAN101\"]}","{\"normalizedStateName\":\"Indiana\",\"normalizedCountryCode\":\"USA\",\"city\":\"New Carlisle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, IN, New Carlisle\",\"coordinates\":\"41.70584,-86.51309\",\"normalizedCountyName\":\"St Joseph\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New Carlisle, Indiana, USA\",\"location\":\"US, IN, New Carlisle\",\"region\":\"IN\",\"buildingCodeList\":[\"SBN201\"],\"normalizedCityName\":\"New Carlisle\"}"],"normalized_location":"Mississippi, USA","optional_search_labels":["military","aws.team-dc","aws.team-ais"],"posted_date":"November  7, 2025","preferred_qualifications":"- Advanced knowledge Microsoft Office Suite - Word, Excel, Outlook required; advanced knowledge of SharePoint (or similar) preferred\u003cbr/\u003e- Strong communication skills, detail oriented, highly organized, and able to work in high stress environments to maintain calm and respectful interaction with multiple teams\u003cbr/\u003e- Advanced knowledge of mechanical, electrical, and controls systems for critical infrastructures\u003cbr/\u003e- Ability to read and edit construction documents (design drawings, control diagrams, specifications, etc.)\u003cbr/\u003e- Experience developing and executing test procedures for mechanical or electrical systems/components based on design intent and approved equipment submittals\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $105,100/year in our lowest geographic market up to $185,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-system-development-engineer-primary","source_system":"JobCreator","state":"MS","title":"Commissioning Engineer, AMER-Central ACx","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3122970/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-system-development-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"• A completed Bachelor’s Degree\u003cbr/\u003e• Direct experience managing and leading an operation (Gateway, Warehouse, Ramp, Fulfillment Center, Sort Center, etc.)\u003cbr/\u003e• Experience with performance metrics, process improvement, and Lean techniques (how, when, who)\u003cbr/\u003e• Candidates must be able to work overnights and may be required to work weekends\u003cbr/\u003e","business_category":"fulfillment-ops","city":"Lewisberry","company_name":"Amazon.com Services LLC","country_code":"USA","description":"DESCRIPTION\u003cbr/\u003eAt Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. The Air Hub Senior Operations Manager has complete responsibility for inbound, outbound, package sortation and ramp operations or a functional process responsibility within the hub on a specified shift or across multiple shifts.\u003cbr/\u003e\u003cbr/\u003eResponsibilities:\u003cbr/\u003e• Lead and manage the outbound, inbound, package sortation and ramp operations within the Air Hub\u003cbr/\u003e• Responsible for the overall safety, quality, performance and customer experience of the shift.\u003cbr/\u003e• Carry out supervisory responsibilities in accordance with the organization’s policies and procedures.\u003cbr/\u003e• Accountability for meeting and exceeding operational goals.\u003cbr/\u003e• Strategic planning and forecasting; appraise performance; reward and discipline employees; resolve problems; and address staffing needs.\u003cbr/\u003e• Mentor, train and develop teammates for career progression and learning\u003cbr/\u003e• Ability to develop and share best practices across the shifts and network.\u003cbr/\u003e• Develop and implement processes required to support hub launch.\u003cbr/\u003e• This position requires a candidate with the proven ability to drive process improvements and the ability to keep pace with our explosive growth while motivating others to meet the challenges of an extremely deadline-driven environment.\u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements:\u003cbr/\u003e• Lift and move totes up to 49 pounds each\u003cbr/\u003e• Regular bending, lifting, stretching and reaching both below the waist and above the head\u003cbr/\u003e• Walking in the building and around area with great frequency; facilities are over a quarter mile in length\u003cbr/\u003e• Must be able to stand/walk for up to 10-12 hours\u003cbr/\u003e• Should be able to work in environments (building and ramp) with variable noise levels, lighting conditions and temperature variation\u003cbr/\u003e• Able to access all areas of building; ascending and descending ladders, stairs, gangways safely and without limitation\u003cbr/\u003e\u003cbr/\u003eEligibility Requirements:\u003cbr/\u003e• Individuals hired into this position will have unescorted access privileges to airport security identification display areas (SIDA). For this reason, eligibility for this role will be limited to individuals who pass a security screening, as required by the FAA, DHS, and TSA (as applicable).\u003cbr/\u003e• Must be able to secure appropriate airport authority and/or US Customs security badges, if applicable.\u003cbr/\u003e• This position requires an employee’s full and unimpaired skills and judgment to safely execute their job duties to ensure the safety and security of Amazon AIR personnel, third-party contractors, Airport personnel, cargo, and equipment. This position is therefore designated as a safety sensitive position and is subject to mandatory pre-employment and, where permitted, post-hire drug testing.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"DESCRIPTIONAt Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. The Air Hub Senior Operations Manager has","display_distance":null,"id":"056bf20c-00b8-4ab7-b485-37b0253f0915","id_icims":"3061167","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3061167/senior-operations-manager","job_schedule_type":"full-time","location":"US, PA, Lewisberry","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Lewisberry\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Lewisberry\",\"coordinates\":\"40.13566,-76.85974\",\"normalizedCountyName\":\"York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Lewisberry, Pennsylvania, USA\",\"location\":\"US, PA, Lewisberry\",\"region\":\"PA\",\"buildingCodeList\":[\"HPA1\"],\"normalizedCityName\":\"Lewisberry\"}"],"normalized_location":"Lewisberry, Pennsylvania, USA","optional_search_labels":[],"posted_date":"August 18, 2025","preferred_qualifications":"Preferred qualifications\u003cbr/\u003e• Bachelor’s degree in Engineering, Operations, or a related field.\u003cbr/\u003e• 3 years of management experience in a manufacturing, production or distribution environment.\u003cbr/\u003e• 3 years of air cargo/3P integrator ramp experience\u003cbr/\u003e• 2 years of Amazon Sort Center operations management experience\u003cbr/\u003e• Previous experience operating in an automated package sortation environment\u003cbr/\u003e• Experience in managing an operation lead process improvements though Lean process, Kaizen, and Six Sigma.\u003cbr/\u003e• Previous facility launch experience with Amazon\u003cbr/\u003e• You have the ability to thrive in an ambiguous environment, and when given a deadline you know how to motivate yourself and meet it.\u003cbr/\u003e• Strong verbal and written communication skills.\u003cbr/\u003e• Enjoy analytical work and using data to provide thought-provoking and workable solutions. Data is what you look to when given a problem to solve.\u003cbr/\u003e• Proven track record of taking ownership and driving results.\u003cbr/\u003e• Willing to relocate and travel to any of our Gateways or Regional Air Hub sites in the country with the assistance provided.\u003cbr/\u003e• Experience with Amazon Kiva systems or within an automated facility.\u003cbr/\u003e• Interest in developing a long-term career through assignments in multiple operational buildings across the nation.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, PA, Lewisberry - 135,000.00 - 182,700.00 USD annually","primary_search_label":"fulfillment-ops.team-global-specialty-fulfillment","source_system":"JobCreator","state":"PA","title":"Senior Operations Manager","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/3061167/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-specialty-fulfillment","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"Basic Qualifications:\u003cbr/\u003e•\tA completed Bachelor’s Degree from an accredited university or 2+ years of Amazon blue-badge experience \u003cbr/\u003e•\t7+ years of direct management experience, including a salaried workforce, in a manufacturing, production, distribution, or logistics environment\u003cbr/\u003e•\tPrior experience with performance metrics, process improvement, and Lean methodologies\u003cbr/\u003e•\tPrior experience with the full staffing lifecycle, including interviewing, hiring, performance management, promotions and terminations\u003cbr/\u003e•\tCandidates must be flexible to work a variety of hours as business demands, including overnight, weekends and holidays\u003cbr/\u003e","business_category":"amazonfresh","city":"Brooklyn","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our Multi-Site Leaders are responsible for all budgetary, people development and operations objectives for multiple facilities. Their responsibilities include managing and leading teams across various locations, coaching and mentoring to ensure performance objectives are met and building leadership bench strength within the organization. The leader in this role must be nimble, demonstrate high judgment, make quick decisions in the face of ambiguity, and be strong in innovation. In addition, they must lead their teams to have high Bias for Action, Ownership, and have the ability to Hire and Develop the Best. As we continue to grow, we will rely on smart and scalable practices to enable execution of a best-in-class operation and drive cost down.\u003cbr/\u003e\u003cbr/\u003eOur Operation’s workflow has three major components: First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer. Amazon Grocery Logistics (AGL) is an exciting organization within Amazon specializing in delighting our customers with speed in which we can make items appear on their doorsteps. We are a combination of operations and support teams aligned to innovate for the last mile customer experience. \u003cbr/\u003e\u003cbr/\u003eResponsibilities:\u003cbr/\u003e•\tDrives creation of quality initiatives, process change initiatives and other Lean initiatives meet and exceed business plan.\u003cbr/\u003e•\tResponsible for the overall safety, quality and performance and customer experience of their facilities.\u003cbr/\u003e•\tMeasures performance, provides feedback, and holds leaders accountable for their performance and the performance of their departments.\u003cbr/\u003e•\tTakes proactive steps to ensure that best practices are shared across all departments, shifts and among the network.\u003cbr/\u003e•\tWorks closely with support staff (HR, Finance, Ops Integration, Loss Prevention, Safety and other leaders) to build and secure support and resources for projects and initiatives.\u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements:\u003cbr/\u003e•\tLift and move totes up to 49 pounds each\u003cbr/\u003e•\tRegular bending, lifting, stretching and reaching both below the waist and above the head\u003cbr/\u003e•\tMust be able to stand/walk for up to 10-12 hours, walking in the facility and around area with great frequency; some facilities are over a quarter mile in length\u003cbr/\u003e•\tShould be able to work in environments with variable noise levels, lighting conditions and temperature variation, including chilled and frozen spaces with great frequency\u003cbr/\u003e•\tAble to access all areas of building (ascending and descending ladders, stairs, gangways safely and without limitation)\u003cbr/\u003e•\tAbility to travel 50% of the time\u003cbr/\u003e","department_cost_center":null,"description_short":"Our Multi-Site Leaders are responsible for all budgetary, people development and operations objectives for multiple facilities. Their responsibilities include managing and leading teams across various","display_distance":null,"id":"ce62cac6-c6f6-4d79-80a3-c6b11a9ed0c3","id_icims":"3082263","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3082263/senior-operations-manager-site-leader-agl","job_schedule_type":"full-time","location":"US, NY, Brooklyn","locations":["{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"Brooklyn\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, Brooklyn\",\"coordinates\":\"40.69245,-73.99036\",\"normalizedCountyName\":\"Kings\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Brooklyn, New York, USA\",\"location\":\"US, NY, Brooklyn\",\"region\":\"NY\",\"buildingCodeList\":[\"UNY5\"],\"normalizedCityName\":\"Brooklyn\"}"],"normalized_location":"Brooklyn, New York, USA","optional_search_labels":[],"posted_date":"September 12, 2025","preferred_qualifications":"Preferred Qualifications:\u003cbr/\u003e•\tDegree in Engineering, Operations or related technical field; MBA or Master’s degree preferred\u003cbr/\u003e•\tAbility to handle changing priorities and use good judgment in stressful situation\u003cbr/\u003e•\tInterest in long-term career development through assignments in multiple buildings across the nation \u003cbr/\u003e•\tExperience with a contingent workforce during peak seasons\u003cbr/\u003e•\tAbility to organize and manage multiple tasks simultaneously\u003cbr/\u003e•\tExcellent written and verbal communication skills complemented with the ability to problem solve independently\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, Brooklyn - 148,500.00 - 200,900.00 USD annually","primary_search_label":"amazonfresh.no-team-listed","source_system":"JobCreator","state":"NY","title":"Senior Operations Manager, Site Leader, AGL","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/3082263/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 10+ years of industry work with hands-on security engineering experience\u003cbr/\u003e- 10+ years of risk assessment and enabling organizations making security decisions experience\u003cbr/\u003e- 10+ years of team management and building (including coaching and mentoring) experience\u003cbr/\u003e- 10+ years of communicating technical concepts to a non-technical audience experience\u003cbr/\u003e- Bachelor's degree in Computer Science or a related field\u003cbr/\u003e- Experience communicating technical concepts to a non-technical audience\u003cbr/\u003e- Experience with hands-on security engineering\u003cbr/\u003e- Experience in risk assessment and enabling organizations to make security decisions\u003cbr/\u003e- Experience in team management and building (including coaching and mentoring)","business_category":"amazon-security","city":"San Francisco","company_name":"Amazon.com Services LLC","country_code":"USA","description":"We are open to hiring candidates to work out of one of the following locations:\u003cbr/\u003e\u003cbr/\u003eSan Francisco, CA, USA\u003cbr/\u003e\u003cbr/\u003eThe Amazon Devices and Services team designs and engineers high-profile consumer\u003cbr/\u003eelectronics, including the best-selling Eero products. We have also produced\u003cbr/\u003edevices like Fire tablets, Fire TV, Amazon Dash, Ring, and Amazon Echo.\u003cbr/\u003eWith eero, our mission is to serve as the central nervous system of the home. While we began by revolutionizing home WiFi, we now create comprehensive and secure solutions that serve both wireless and wired connectivity needs for customers and businesses worldwide. Our team builds products that customers love - from mesh routers to high-performance wired networking devices - and we're looking for you to join us in shaping the future of the connected home.\u003cbr/\u003eWhat will you help us create?\u003cbr/\u003e\u003cbr/\u003eAre you interested in building and leading a focused top-notch security team responsible for securing\u003cbr/\u003econsumer devices and information? Do you want to solve new security challenges and build\u003cbr/\u003esolutions at scale? If so, we have the job for you! Amazon’s Devices and Services Security\u003cbr/\u003eteam is looking for a senior leader who will be responsible for leading, developing and taking\u003cbr/\u003ethe Eero Security team to the next level. You will be responsible for the security\u003cbr/\u003erisk posture for the full Eero product line, while enabling the organization to deliver great\u003cbr/\u003eand secure experiences for our customers. In this role, you will define security requirements,\u003cbr/\u003ebuild processes and mechanisms that continue to raise the security bar for Amazon’s\u003cbr/\u003econsumer products, and develop scalable solutions that meet the business and customer\u003cbr/\u003eneeds. This role will require innovation, as well as the ability to perform security at scale while leading and motivating a team of skilled security engineers.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs the leader of the Devices and Services Security Eero team, you will be tasked in setting and\u003cbr/\u003eexecuting the security strategic direction for various consumer services, and device security strategies. You will be responsible for leading a multi-functionally diverse team. You will partner with\u003cbr/\u003eengineering teams to integrate scalable security tools and controls into everyday work for\u003cbr/\u003ethe entire organization. You will help envision, drive, and scale the programs through\u003cbr/\u003einnovative process changes across multiple organizations and teams, engaging technical\u003cbr/\u003eand non-technical people throughout the organization. You will partner and work across\u003cbr/\u003edisciplines and executives including engineering, marketing, product management, legal,\u003cbr/\u003eand business. Above all, you feel strongly about protecting customers. Your focus will be to\u003cbr/\u003ehelp teams design their systems and customer experiences in a manner that upholds our\u003cbr/\u003ehigh bar for customer trust.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour work will be dynamic and impactful. Day-to-day, you might find yourself analyzing application code for security vulnerabilities, building tools and frameworks that help developers work more securely and efficiently, or partnering with engineering teams to integrate security into new service architectures. You'll conduct comprehensive security reviews, and collaborate with product managers to balance security requirements with exceptional user experiences. You will coach and develop the members of your team and guide them in their career\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon Security values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003eWhy Amazon Security?\u003cbr/\u003eAt Amazon, security is central to maintaining customer trust and delivering delightful customer experiences. Our organization is responsible for creating and maintaining a high bar for security across all of Amazon’s products and services. We offer talented security professionals the chance to accelerate their careers with opportunities to build experience in a wide variety of areas including cloud, devices, retail, entertainment, healthcare, operations, and physical stores\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eIn Amazon Security, it’s in our nature to learn and be curious. Ongoing DEI events and learning experiences inspire us to continue learning and to embrace our uniqueness. Addressing the toughest security challenges requires that we seek out and celebrate a diversity of ideas, perspectives, and voices.\u003cbr/\u003eTraining \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, training, and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.","department_cost_center":null,"description_short":"We are open to hiring candidates to work out of one of the following locations:San Francisco, CA, USAThe Amazon Devices and Services team designs and engineers high-profile consumerelectronics, including","display_distance":null,"id":"44f82d3a-6e19-47e6-b607-49bfae5bedf7","id_icims":"3138991","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"Systems Security Engineering","job_function_id":null,"job_path":"/en/jobs/3138991/senior-manager-devices-services-security-devices-services-security","job_schedule_type":"full-time","location":"US, CA, San Francisco","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Francisco\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Francisco\",\"coordinates\":\"37.77712,-122.41966\",\"normalizedCountyName\":\"San Francisco\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Francisco, California, USA\",\"location\":\"US, CA, San Francisco\",\"region\":\"CA\",\"buildingCodeList\":[\"SFO38\"],\"normalizedCityName\":\"San Francisco\"}"],"normalized_location":"San Francisco, California, USA","optional_search_labels":[],"posted_date":"December  8, 2025","preferred_qualifications":"- Knowledge of information security risk-based prioritization\u003cbr/\u003e- Knowledge of information security technologies such as security design review, threat modeling, risk analysis, and software testing techniques\u003cbr/\u003e- Experience applying threat modeling or other risk identification techniques or equivalent\u003cbr/\u003e- Experience architecting, securing, and operating Amazon Web Services\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $187,500/year in our lowest geographic market up to $324,100/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"amazon-security.team-devices-security","source_system":"JobCreator","state":"CA","title":"Senior Manager - Devices \u0026 Services Security, Devices \u0026 Services Security","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3138991/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-devices-security","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of building models for business application experience\u003cbr/\u003e- PhD, or Master's degree and 4+ years of CS, CE, ML or related field experience\u003cbr/\u003e- Experience in patents or publications at top-tier peer-reviewed conferences or journals\u003cbr/\u003e- Experience programming in Java, C++, Python or related language\u003cbr/\u003e- Experience in any of the following areas: algorithms and data structures, parsing, numerical optimization, data mining, parallel and distributed computing, high-performance computing","business_category":"amazon-security","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"At Amazon, security is central to maintaining customer trust and delivering delightful customer experiences. Our mission is to prevent denied entities from transacting with Amazon businesses. We build automatic mechanisms to detect and prevent prohibited transactions with denied entities using a diverse set of algorithms and machine learning techniques. We screen over a billion events every day and develop algorithms which are able to scale and detect suspicious entities . We are still Day 1 and have an exciting road map to build Machine Learning (ML) and Generative AI (LLM) powered detection and resolution systems to help scale Amazon for years to come. \u003cbr/\u003e\u003cbr/\u003eWe are seeking an Applied Scientist to join our team and help tackle challenging problems at the forefront of machine learning and artificial intelligence. Working closely with a multidisciplinary team of engineers, data scientists, and domain experts, you will play a crucial role in defining cutting-edge ML/AI-powered customer experiences and solutions. If you have an entrepreneurial mindset, the technical depth to deliver impactful results, and a passion for innovation, we want to hear from you. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eIn this role, you will: \u003cbr/\u003e• Drive the research, design, and development of novel ML/AI models and systems to power critical products and services \u003cbr/\u003e• Collaborate cross-functionally to deeply understand business requirements, customer needs, and technical constraints \u003cbr/\u003e• Rapidly prototype, test, and iterate on ML/AI solutions, iterating quickly based on data and feedback \u003cbr/\u003e• Communicate complex technical concepts to technical and non-technical stakeholders • Mentor and grow a team of talented ML scientists and engineers \u003cbr/\u003e• Stay up-to-date on the latest advancements in AI/ML and identify opportunities to apply emerging techniques \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e- Starting the day by reviewing the latest model performance metrics and identifying areas for improvement \u003cbr/\u003e- Brainstorming new architectures and approaches with your cross-functional team during a whiteboard session \u003cbr/\u003e- Diving deep into a complex dataset, leveraging advanced statistical and AI techniques to uncover hidden insights \u003cbr/\u003e- Prototyping a new model and running a series of experiments to optimize its performance \u003cbr/\u003e- Preparing a presentation to pitch your latest research findings and recommendations to product and engineering leaders \u003cbr/\u003e- Mentoring a junior data scientist, providing guidance on coding best practices and problem-solving strategies\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy Amazon Security\u003cbr/\u003eAt Amazon, security is central to maintaining customer trust and delivering delightful customer experiences. Our organization is responsible for creating and maintaining a high bar for security across all of Amazon’s products and services.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eIn Amazon Security, it’s in our nature to learn and be curious. Ongoing DEI events and learning experiences inspire us to continue learning and to embrace our uniqueness. Addressing the toughest security challenges requires that we seek out and celebrate a diversity of ideas, perspectives, and voices.\u003cbr/\u003e\u003cbr/\u003eTraining and Career growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, training, and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"At Amazon, security is central to maintaining customer trust and delivering delightful customer experiences. Our mission is to prevent denied entities from transacting with Amazon businesses. We build","display_distance":null,"id":"95fe0817-9d44-423a-b82c-ed9d64c09f07","id_icims":"3157154","is_intern":null,"is_manager":null,"job_category":"Data Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3157154/applied-scientist-denied-party-screening-aws-compliance-security-assurance","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA33\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Dallas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Dallas\",\"coordinates\":\"32.77822,-96.79512\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Dallas, Texas, USA\",\"location\":\"US, TX, Dallas\",\"region\":\"TX\",\"buildingCodeList\":[\"DFW11\"],\"normalizedCityName\":\"Dallas\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"January 12, 2026","preferred_qualifications":"- Experience using Unix/Linux\u003cbr/\u003e- Experience in professional software development\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Dallas - 142,800.00 - 193,200.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 142,800.00 - 193,200.00 USD annually","primary_search_label":"amazon-security.team-aws-security","source_system":"JobCreator","state":"WA","title":"Applied Scientist, Denied Party Screening, AWS Compliance \u0026 Security Assurance","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3157154/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-aws-security","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Bakersfield","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager. In this role, you will lead a team of hourly workforce and will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e\u003cbr/\u003eOur Operation’s workflow has three major components: First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Support, mentor, and motivate your hourly workforce\u003cbr/\u003e* Manage safety, quality, productivity, and customer delivery promises\u003cbr/\u003e* Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e* Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e* Stand/walk for up to 12 hours during shifts\u003cbr/\u003e* Work in an environment where the noise level varies and can be loud\u003cbr/\u003e* Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e* Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e\u003cbr/\u003eOur fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Area Managers based on location preference and the business’ current openings.","department_cost_center":null,"description_short":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager.","display_distance":null,"id":"6db51d91-66b4-4250-9459-72dcd1858bbc","id_icims":"3159311","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3159311/area-manager-ii","job_schedule_type":"full-time","location":"US, CA, Bakersfield","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bakersfield\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Bakersfield\",\"coordinates\":\"35.3673,-119.01886\",\"normalizedCountyName\":\"Kern\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bakersfield, California, USA\",\"location\":\"US, CA, Bakersfield\",\"region\":\"CA\",\"buildingCodeList\":[\"BFL1\"],\"normalizedCityName\":\"Bakersfield\"}"],"normalized_location":"Bakersfield, California, USA","optional_search_labels":[],"posted_date":"January 14, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 20+ employees\u003cbr/\u003e- Experience with process improvements (Lean process, Kaizen, and/or Six Sigma)\u003cbr/\u003e- Excellent customer service, communication, and interpersonal skills\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Industry experience in: retail, F\u0026B, military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Bakersfield - 72,500.00 - 90,900.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"CA","title":"Area Manager II ","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3159311/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience managing multiple projects and priorities across teams in a fast-paced, deadline-driven environment\u003cbr/\u003e- Experience handling multiple projects simultaneously\u003cbr/\u003e- Bachelor's degree or equivalent in a related field\u003cbr/\u003e- Experience using analytical, marketing, and productivity tools including Oracle Business Intelligence, Salesforce or other CRM tools, Microsoft OneNote and Microsoft SharePoint\u003cbr/\u003e- 1+ years of using a CRM (Customer Relationship Management) tool experience\u003cbr/\u003e- Speak, write, and read fluently in English\u003cbr/\u003e- 2+ years of customer-facing environment experience (account management, customer service or B2B support)","business_category":"fulfillment-and-operations","city":"San Jose","company_name":"Amazon Support Services Costa Rica SRL - B20","country_code":"CRI","description":"Amazon's mission is to be Earth's most customer-centric company, and Amazon Shipping exemplifies this commitment. As a shipping service provider supporting e-commerce businesses, we offer competitive rates and delivery speeds without compromising on customer obsession. The Amazon Shipping team drives strategic innovation to transform the shipping experience for our business partners. We leverage Amazon's core strengths in logistics excellence, flexible delivery options, and end-to-end visibility to create competitive advantages for our enterprise shippers. We play a critical role in listening to shippers and escalating pain points, enabling Amazon to improve and deliver world-class service while building a scalable and profitable network that brings value to both our customers and Amazon. Our team's dedication to service reliability and innovation directly supports our global tenets of maximizing existing technology while providing value-based pricing that works for shippers and Amazon alike.\u003cbr/\u003e\u003cbr/\u003eAs a Shipper Success Specialist in San Jose, Costa Rica, you will be at the forefront of supporting our enterprise shippers, handling complex inquiries and escalations while delivering solutions that optimize their shipping operations. You will be responsible for resolving shipper issues, identifying trends, and contributing to continuous improvement initiatives that enhance the overall shipper experience.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Provide high-touch support to enterprise shippers, resolving day-to-day inquiries and complex escalations with high standards and sense of urgency \u003cbr/\u003e- Advocate for shippers by escalating critical issues when necessary and following through until resolution \u003cbr/\u003e- Maintain comprehensive knowledge of Amazon Shipping services, policies, and procedures to effectively address shipper concerns \u003cbr/\u003e- Analyze shipper issues, identify root causes, and collaborate with cross-functional teams to implement effective solutions and ensure a seamless shipper experience\u003cbr/\u003e- Document shipper pain points and provide insights to leadership that inform product and process improvements\u003cbr/\u003e- Create and maintain internal knowledge resources to support team consistency and education \u003cbr/\u003e- Track and report on key performance metrics while continuously seeking ways to improve service quality \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Shipping is a customer-obsessed delivery service that serves Shippers (vendors, sellers) who ship their items either into Amazon buildings or to non-Amazon destinations. The Enterprise Shipper Support team's main mission is to provide best-in-class customer service to our Shippers. We are a metrics-focused organization who keep raising the bar on shipper-facing performance.","department_cost_center":null,"description_short":"Amazon's mission is to be Earth's most customer-centric company, and Amazon Shipping exemplifies this commitment. As a shipping service provider supporting e-commerce businesses, we offer competitive rates","display_distance":null,"id":"24971a54-8468-4358-bb83-1b7bb6c8ff43","id_icims":"3150222","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Customer Success","job_function_id":null,"job_path":"/en/jobs/3150222/shipper-success-specialist-amazon-shipping-operations","job_schedule_type":"full-time","location":"CR, San Jose","locations":["{\"normalizedStateName\":\"San Jose\",\"normalizedCountryCode\":\"CRI\",\"city\":\"San Jose\",\"countryIso3a\":\"CRI\",\"countryIso2a\":\"CR\",\"locationNonStemming\":\"Costa Rica, San Jose\",\"coordinates\":\"9.92975,-84.08569\",\"normalizedCountyName\":\"San Jose\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Costa Rica\",\"normalizedLocation\":\"San Jose, San Jose, CRI\",\"location\":\"CR, San Jose\",\"region\":\"\",\"buildingCodeList\":[\"SJO11\"],\"normalizedCityName\":\"San Jose\"}"],"normalized_location":"San Jose, San Jose, CRI","optional_search_labels":[],"posted_date":"December 30, 2025","preferred_qualifications":"- Experience in program management, logistics, operations, supply chain, transportation, or a related field\u003cbr/\u003e- Experience in process training, or experience in facilitating\u003cbr/\u003e- Experience in capacity planning, operations planning, business analysis or equivalent\u003cbr/\u003e- Experience with startups or large enterprise customers\u003cbr/\u003e- Experience using data and trends to articulate business needs or equivalent\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.no-team-listed","source_system":"JobCreator","state":null,"title":"Shipper Success Specialist , Amazon Shipping Operations","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3150222/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 7+ years of direct sales or business development in software, cloud or SaaS markets selling to C-level executives experience\u003cbr/\u003e- Bachelor's degree or equivalent","business_category":"aws","city":"Seattle","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Would you like to be part of a business helping hyper-growth Independent Software Vendors (ISVs) innovate, and exceed revenue goals?  Do you have the business savvy skills necessary to motivate a cross-functional team including sales, product and alliances to deliver business growth for AWS and our ISV partners?  \u003cbr/\u003e    \u003cbr/\u003eAWS is seeking an experienced Sr. Account Manager for selling to Strategic ISV’s and to expand the business with our hottest ISV customers.  The Sr. Account Manager will be responsible for setting a  long-term strategy and executing daily to grow customers. In addition to being a customer, these companies partner with AWS as an ISV and have  multiple GTM goals.  In the role, you will build and maintain broad relationships, develop and manage opportunities, and facilitate a large team of extended resources. \u003cbr/\u003e    \u003cbr/\u003eRole \u0026 Responsibilities \u003cbr/\u003eThe Account Manager is responsible for teaming with all aspects of  the customer’s organization. This includes C-level executives, engineering, IT/operations, partner org, and sales.  Skills required to build relationships across an account include creative systems thinking, visioning, and executing via collaboration with an extended team to address all ISV customer's needs.  The Account Manager is responsible for  selling at the most strategic (C-level) within the account and implementing a broad strategy for earning customer acceptance and  service implementation.  The Account Manager works collaboratively with all appropriate AWS resources (Executives, Partner, Support, Solution  Architect) to support customer interests, and will understand how to  strongly advocate for the customer in harmony with what the AWS business  needs.  In addition to new service adoption and new line of business development, this role includes dotted line responsibility for partnership and technical collaboration.  \u003cbr/\u003e  \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.","department_cost_center":null,"description_short":"Would you like to be part of a business helping hyper-growth Independent Software Vendors (ISVs) innovate, and exceed revenue goals?  Do you have the business savvy skills necessary to motivate a cross-functional","display_distance":null,"id":"e8510c72-8847-4fed-82cd-a075d86a4120","id_icims":"3138891","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Tech Sales","job_function_id":null,"job_path":"/en/jobs/3138891/sr-account-manager-isv","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA81\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Francisco\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Francisco\",\"coordinates\":\"37.77712,-122.41966\",\"normalizedCountyName\":\"San Francisco\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Francisco, California, USA\",\"location\":\"US, CA, San Francisco\",\"region\":\"CA\",\"buildingCodeList\":[\"SFO28\"],\"normalizedCityName\":\"San Francisco\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"December  8, 2025","preferred_qualifications":"- 5+ years of building profitable partner ecosystems experience\u003cbr/\u003e- Experience developing detailed go to market plans\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments, restricted stock units (RSUs), and sales incentives. Final compensation will be determined based on factors including experience, qualifications, and location. \u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eAmazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, San Francisco - 157,100.00 - 212,600.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 142,800.00 - 193,200.00 USD annually","primary_search_label":"aws.team-sales-primary","source_system":"JobCreator","state":"WA","title":"Sr. Account Manager, ISV","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3138891/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sales-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of design experience\u003cbr/\u003e- 3+ years of delivering design solutions as a UX designer or interaction designer experience\u003cbr/\u003e- Have an available online portfolio\u003cbr/\u003e- Experience designing and prototyping with tools such as Figma, Adobe Creative Cloud, or similar.","business_category":"advertising","city":"Seattle","company_name":"IMDb.com, Inc.","country_code":"USA","description":"Do you want to be an integral part of the world’s most popular source for movie, TV and celebrity content? IMDb is looking for a UX Designer to create new experiences for IMDb’s    250MM+ audience of passionate entertainment  consumers and entertainment professionals. We seek a designer who is customer focused and has a love for  movies, television, and online video content.   \u003cbr/\u003e     \u003cbr/\u003e  As a designer, you obsess over the details, from how information is architected to the best ways  to  leverage visual design to communicate an idea. You’re comfortable thinking big, envisioning design solutions across multiple platforms, and diving deep to explore all possible paths in order to deliver   engaging and delightful experiences. You repeatedly  explore and translate ambiguous business  requirements and design concepts into precise   interactive and visual design specifications for  development and implementation. You identify and define UI patterns and  best-practice guidelines to help unify design projects and process throughout the company.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e - Create user-centered designs that incorporate business requirements, market analysis, customer  feedback, site metrics, and usability findings and insights\u003cbr/\u003e\u003cbr/\u003e - Design conceptual wireframes, high-fidelity mockups, information architecture diagrams, user flows, and interaction specifications\u003cbr/\u003e\u003cbr/\u003e- Seek out diverse feedback and foster a passion for cross-functional collaboration\u003cbr/\u003e\u003cbr/\u003e - Present design work to multiple teams and senior leadership for review \u003cbr/\u003e\u003cbr/\u003e- Lead the creation and refinement of UI components, patterns, and template libraries, ensuring each element meets high visual craft standards, and reflects a systematic approach to design with a strong eye for consistency\u003cbr/\u003e\u003cbr/\u003e- Continue to shape our visual language and design system that reaches millions of users every day\u003cbr/\u003e\u003cbr/\u003e- Advocate for accessibility standards and ensure compliance across components, reflecting your commitment to inclusive design practices.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Do you want to be an integral part of the world’s most popular source for movie, TV and celebrity content? IMDb is looking for a UX Designer to create new experiences for IMDb’s    250MM+ audience of passionate","display_distance":null,"id":"fcab925f-ede1-4c65-ac71-e19ed9f4e658","id_icims":"3157245","is_intern":null,"is_manager":null,"job_category":"Design","job_family":"Design","job_function_id":null,"job_path":"/en/jobs/3157245/ux-designer-imdb","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA40\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"January 12, 2026","preferred_qualifications":"- 2+ years of mass-market consumer web / mobile products experience\u003cbr/\u003e- Experience working in a collaborative team and working directly with developers for implementation of designs\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 117,800.00 - 160,000.00 USD annually","primary_search_label":"advertising.team-amazon-ads","source_system":"JobCreator","state":"WA","title":"UX Designer, IMDb","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3157245/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-ads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in developing functional specifications, design verification plans and functional test procedures\u003cbr/\u003e- BSEE with 10+ years experience in hardware board and systems development (must have taken products from concept to mass production) and recent 5+ years experience with Ethernet switching fabrics, Ethernet PHY and SerDes interfaces, embedded CPU subsytems, DDR2/DDR3/DDR4 memory design, network processors, I2C, USB\u003cbr/\u003e- Experience with high-speed PCB design and AC/DC PI and 5+ years of experience in CPLD/FPGA design using VHDL or Verilog\u003cbr/\u003e- Experience troubleshooting with oscilloscopes, logic analyzers, and specialized test equipment such as PCI analyzers and in-circuit-emulators\u003cbr/\u003e- Experience interfacing with cross functional teams such mechanical engineers, HW engineers, SI engineers, diagnostic engineers, and manufacturing engineers as well as with outside vendors and developers","business_category":"aws","city":"Cupertino","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Amazon Web Services’ Network Products Development team is looking for experienced hardware engineering professionals to help build our next generation networking platforms.  The right candidate will play a key role in the design and development of our next generation Ethernet switching platforms for our world class datacenters.  Strong experience in modular chassis based enterprise/carrier products is a must.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate is a strong hardware board designer with Ethernet networking experience in the areas of terabit switch fabrics, 10/40/100 gigabit interfaces, embedded CPU subsystems, and network processors.  Previous experience in defining and designing modular chassis based products is required.  Must have previous experience working with Asian ODM and JDM partners, both in development and in manufacturing.\u003cbr/\u003e\u003cbr/\u003eYou will have previous experience in high speed digital design as a design lead in the networking field.  This includes architectural definition, specification, key component selection, detailed design, working closely with PCB designers, testing, and transition to manufacturing.  Applying skills in simulation, timing analysis, thermal analysis, and EMC is expected.  \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"Amazon Web Services’ Network Products Development team is looking for experienced hardware engineering professionals to help build our next generation networking platforms.  The right candidate will play","display_distance":null,"id":"11c6024c-1032-4d0d-ac4b-168dd8941596","id_icims":"3168218","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"Cloud Hardware Development","job_function_id":null,"job_path":"/en/jobs/3168218/senior-hardware-development-engineer-npd-hardware","job_schedule_type":"full-time","location":"US, CA, Cupertino","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA112\"],\"normalizedCityName\":\"Bellevue\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA29\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Cupertino\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Cupertino\",\"coordinates\":\"37.31913,-122.02929\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Cupertino, California, USA\",\"location\":\"US, CA, Cupertino\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC3\"],\"normalizedCityName\":\"Cupertino\"}"],"normalized_location":"Cupertino, California, USA","optional_search_labels":["aws.team-ais","aws.team-neteng"],"posted_date":"January 27, 2026","preferred_qualifications":"- Master's degree in electrical engineering, computer engineering, or equivalent\u003cbr/\u003e- Experience working with interdisciplinary teams to execute product design from concept to production\u003cbr/\u003e- Experience with the project management of technical projects\u003cbr/\u003e- Experience defining and implementing modular chassis functions such as system redundancy, hot-swap, power distribution, environmental control and system management\u003cbr/\u003e- CPLD/FPGA experience in the areas of advanced HW control/monitoring/logging\u003cbr/\u003e- Experience in specifying mechanical enclosures\u003cbr/\u003e- Experience in the following is an asset:  analog design, signal integrity analysis, DC-DC switcher design, EDVT, and MDVT\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Cupertino - 183,000.00 - 247,600.00 USD annually","primary_search_label":"aws.team-hardware-development-primary","source_system":"JobCreator","state":"CA","title":"Senior Hardware Development Engineer, NPD Hardware","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3168218/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-hardware-development-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}