{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- * 2+ years electrical, mechanical and/or controls relevant experience (degree or trade qualification preferred);\u003cbr/\u003e- * Ability to prioritize in a complex, fast-paced environment;\u003cbr/\u003e- * Valid EU driving license;\u003cbr/\u003e- * Note: This role involves covering 24x7 shift rotation.","business_category":"aws","city":"Västerås","company_name":"Amazon Data Services Sweden AB","country_code":"SWE","description":"We are currently seeking a Data Center Engineering Operations Technician to serve as a technical resource within our mission critical Data Center’s in Vasteras but also in other locations in Sweden. The position will help ensure overall availability and reliability to meet or exceed defined service levels of Data Center Engineering Operations. In this role you will have a positive involvement in both the maintenance of facilities and the improvement of efficiencies to help offer Amazon customer’s better value.\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services (AIS)\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Assisting in the operation and maintenance of all electrical, mechanical, fire/life safety equipment and HVAC equipment within the Data Center/Facility. This equipment supports mission-critical servers and must maintain better than 99.999% uptime.\u003cbr/\u003e- Assisting in the maintenance and monitoring of all Data Center systems to include incidents/events, problems, changes, monitoring, problem escalation/notification/resolution and all other aspects of Data Center support.\u003cbr/\u003e- Monitoring and troubleshooting all mechanical, electrical, HVAC systems, voice/data, cooling systems, fire/life safety equipment and generators.\u003cbr/\u003e- Providing assistance to contractor or data center engineers to ensure proper operation and maintenance of all facility equipment.\u003cbr/\u003e- Providing assistance to contractors or data center engineers to deploy new equipment, such as building racks, cabling, and other tasks as necessary.\u003cbr/\u003e- Performing site walk throughs to verify proper operation of Facility Equipment and Monitoring Systems. In addition to acting as a Facilities First Responder to critical events, you will be a part of the team supporting new data center facilities and existing data center facilities!\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e- Monitoring of all alarms and systems involved in the operation of power, cooling and fire suppression systems in the data center.\u003cbr/\u003e- Planning and coordinating vendor works on site to ensure equipment is maintained and uptime retained.\u003cbr/\u003e- Supporting other sites and teams during events and planned works.\u003cbr/\u003e- Carrying out rack power up and installation duties.\u003cbr/\u003e- Monitoring and facilitating new equipment handover.\u003cbr/\u003e- Supporting new hires and team members through knowledge share and development.\u003cbr/\u003e- Event response and drill participation.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.","department_cost_center":null,"description_short":"We are currently seeking a Data Center Engineering Operations Technician to serve as a technical resource within our mission critical Data Center’s in Vasteras but also in other locations in Sweden. The","display_distance":null,"id":"9a3170c0-608e-4a4f-b94b-4f9af6ae5962","id_icims":"3162245","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3162245/engineering-operations-technician-data-center-engineering-operations","job_schedule_type":"full-time","location":"SE, Västerås","locations":["{\"normalizedStateName\":\"Vastmanland County\",\"normalizedCountryCode\":\"SWE\",\"city\":\"Västerås\",\"countryIso3a\":\"SWE\",\"countryIso2a\":\"SE\",\"locationNonStemming\":\"Sweden, Västerås\",\"coordinates\":\"59.60959,16.54538\",\"normalizedCountyName\":\"Vasteras\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Sweden\",\"normalizedLocation\":\"Vasteras, Vastmanland County, SWE\",\"location\":\"SE, Västerås\",\"region\":\"\",\"buildingCodeList\":[\"ARN52\"],\"normalizedCityName\":\"Vasteras\"}"],"normalized_location":"Vasteras, Vastmanland County, SWE","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"January 20, 2026","preferred_qualifications":"- * Professional Certification in Electrical, Mechanical or Controls engineering.\u003cbr/\u003e- * Heavy industry or data center experience.\u003cbr/\u003e- * Understanding of basic electrical principles and systems.\u003cbr/\u003e- * Working knowledge of generic mechanical-room infrastructure such as chillers, Air Handling Units, and fan controls.\u003cbr/\u003e- * Working knowledge of backup generator systems.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-it-services","source_system":"JobCreator","state":null,"title":"Engineering Operations Technician , Data Center Engineering Operations","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3162245/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-it-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Formation et expérience : Bac Pro, BTS, BUT ou équivalent (Bac+2 minimum) en maintenance industrielle, électrotechnique ou mécanique, avec expérience en maintenance électrique et mécanique ou une expérience sur un poste similaire pour une durée d'au moins de deux ans.\u003cbr/\u003e- Maintenance préventive et GMAO : Expérience prouvée avec les systèmes de maintenance préventive planifiée et maîtrise des plateformes GMAO\u003cbr/\u003e- Dépannage et diagnostic : Capacités avancées de dépannage sur équipements de manutention et systèmes d'automatisation, avec maîtrise de la lecture des plans mécaniques et électriques\u003cbr/\u003e- Compétences techniques : Expérience pratique avec systèmes de convoyeurs, contrôleurs moteur, variateurs de fréquence et technologies de capteurs\u003cbr/\u003e- Compétences opérationnelles : Connaissance des normes de santé et sécurité, fortes compétences organisationnelles et excellentes capacités de communication","business_category":"fulfillment-ops","city":"Satolas-et-bonce","company_name":"Amazon France Logistique SAS","country_code":"FRA","description":"Technicien de Maintenance (F/H) Chaque jour, des millions de clients comptent sur Amazon pour recevoir leurs commandes à temps. Derrière cette promesse se cache un réseau d'automatisation sophistiqué où chaque seconde compte. En tant que Technicien/ne RME, vous serez au cœur de cette mécanique de précision, gardien des technologies qui permettent à nos centres de distribution de fonctionner 24h/24 et 7j/7.\u003cbr/\u003eCe qui rend ce rôle unique ? Vous travaillerez sur des équipements à la pointe de la technologie, parfois conçus en interne, dans un environnement où l'innovation rencontre l'excellence opérationnelle. Votre expertise technique aura un impact direct et mesurable : chaque intervention réussie, c'est des milliers de colis qui arrivent à destination comme prévu.\u003cbr/\u003eSi vous adorez les challenges techniques, que vous vous épanouissez dans des environnements dynamiques et que vous voulez voir l'impact concret de votre travail à l'échelle mondiale, ce poste est fait pour vous.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eResponsabilités Clés\u003cbr/\u003eGarantir la sécurité et la conformité\u003cbr/\u003e•\tPromouvoir les meilleures pratiques de santé et sécurité dans toutes les activités de maintenance, en assurant la conformité totale aux normes et réglementations\u003cbr/\u003e•\tEffectuer des évaluations de risques et mettre en place des protocoles de sécurité pour les travaux de maintenance\u003cbr/\u003eAssurer l'excellence en maintenance préventive\u003cbr/\u003e•\tExécuter des programmes complets de maintenance préventive planifiée sur des équipements automatisés diversifiés : convoyeurs, robots, systèmes de tri et d'emballage\u003cbr/\u003e•\tUtiliser les systèmes informatisés de gestion de la maintenance (GMAO) pour suivre, programmer et documenter les activités de maintenance\u003cbr/\u003e•\tCollaborer avec les fabricants d'équipements et prestataires externes pour optimiser les procédures de maintenance\u003cbr/\u003eIntervenir rapidement et résoudre les problèmes complexes\u003cbr/\u003e•\tFournir une réponse rapide aux pannes d'équipement avec communication claire aux équipes opérationnelles\u003cbr/\u003e•\tEffectuer un dépannage avancé sur les systèmes électriques, mécaniques et d'automatisation complexes\u003cbr/\u003e•\tUtiliser les outils de diagnostic et documentation technique pour identifier efficacement les causes racines\u003cbr/\u003eMaîtriser les technologies d'automatisation\u003cbr/\u003e•\tMaintenir et configurer des systèmes d'automatisation sophistiqués incluant les contrôleurs logiques programmables (API) et réseaux de terrain\u003cbr/\u003e•\tEntretenir et calibrer les scanners de codes-barres, systèmes d'impression-application et équipements de tri\u003cbr/\u003eContribuer à l'amélioration continue\u003cbr/\u003e•\tAnalyser les données de performance des équipements pour identifier les opportunités d'amélioration\u003cbr/\u003e•\tDévelopper et mettre en œuvre des initiatives de réduction des coûts par l'optimisation des équipements\u003cbr/\u003e•\tPartager les connaissances techniques et encadrer les techniciens juniors\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eHoraires de travail : Ce poste fonctionne dans un environnement 24h/24 et 7j/7 nécessitant une flexibilité avec des horaires variables, incluant nuits, week-ends et jours fériés.","department_cost_center":null,"description_short":"Technicien de Maintenance (F/H) Chaque jour, des millions de clients comptent sur Amazon pour recevoir leurs commandes à temps. Derrière cette promesse se cache un réseau d'automatisation sophistiqué où","display_distance":null,"id":"3b6c591b-3f56-48da-935e-54e828064fef","id_icims":"3177616","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3177616/technicien-de-maintenance","job_schedule_type":"full-time","location":"FR, Satolas-et-bonce","locations":["{\"normalizedStateName\":\"Auvergne-Rhone-Alpes\",\"normalizedCountryCode\":\"FRA\",\"city\":\"Satolas-et-bonce\",\"countryIso3a\":\"FRA\",\"countryIso2a\":\"FR\",\"locationNonStemming\":\"France, Satolas-et-bonce\",\"coordinates\":\"45.69358,5.12729\",\"normalizedCountyName\":\"Isère\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"France\",\"normalizedLocation\":\"Satolas-et-Bonce, Auvergne-Rhone-Alpes, FRA\",\"location\":\"FR, Satolas-et-bonce\",\"region\":\"\",\"buildingCodeList\":[\"LYS8\"],\"normalizedCityName\":\"Satolas-et-Bonce\"}"],"normalized_location":"Satolas-et-Bonce, Auvergne-Rhone-Alpes, FRA","optional_search_labels":["operations-team.reliability-maintenance-engineering-eu","ops.lander-emea-rme-reliability","ops.lander-emea-rme-technician","ops.rme-technician"],"posted_date":"February 10, 2026","preferred_qualifications":"- Certifications électriques : Habilitations électriques avec expérience en travaux d'ordre électrique et maintenance des contrôleurs moteur/variateurs\u003cbr/\u003e- Expertise en automatisation : Expérience avec systèmes Siemens (API), réseaux de terrain, robotique et systèmes automatisés de stockage/récupération\u003cbr/\u003e- Technologies de traçabilité : Expertise en configuration et maintenance de scanners de codes-barres et systèmes d'impression-application\u003cbr/\u003e- Technologie de maintenance 4.0: Utilisation et/ou exploitation des différentes technologies liées à la maintenance 4.0\u003cbr/\u003e- Leadership technique : Expérience d'encadrement de techniciens juniors avec compétences en rédaction technique pour la documentation\u003cbr/\u003e- Gestion de projets : Expérience en gestion de projet d'installations d'équipements et capacités multilingues (un atout)\u003cbr/\u003e- Machine de conditionnement: Entretien et mise au point de machine de conditionnement automatique\u003cbr/\u003e\u003cbr/\u003eAmazon est un employeur engagé pour l'égalité des chances. Nous sommes convaincus qu'une main d'oeuvre diversifée est essentielle à notre réussite. Nous prenons nos décisions de recrutement en fonction de votre expérience et de vos compétences. Nous apprécions votre envie de découvrir, d'inventer, de simplifier et de construire. La protection de votre vie privée et la sécurité de vos données constituent depuis longtemps une priorité absolue pour Amazon. Veuillez consulter notre Politique de Confidentialité pour en savoir plus sur la façon dont nous collectons, utilisons et traitons les données personnelles de nos candidats.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":null,"title":"Technicien de Maintenance ","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3177616/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Technology related sales or business development experience\u003cbr/\u003e- Ability to build and deliver against a plan for your territory which meets or exceeds revenue targets\u003cbr/\u003e- Passion for helping startups grow\u003cbr/\u003e- Entrepreneurial “builder” mentality\u003cbr/\u003e- Excellent French \u0026 English verbal and written communication skills\u003cbr/\u003e- Comfortable delivering results amid ambiguity and change","business_category":"aws","city":"Courbevoie","company_name":"AWS EMEA SARL (France Branch)","country_code":"FRA","description":"As an Account Manager you will help drive the growth of startups, serving their unique needs, engaging with Founders, CxOs, Board of Directors and VC influencers, and teaming with business development, marketing, solution architecture and partner teams to lead execution of coordinated go-to-market strategies.\u003cbr/\u003e\u003cbr/\u003eIn this role, you will also establish Amazon Web Services as the key cloud technology provider across the companies you manage, promoting the entire AWS products and services portfolio to Startup Customers. You will be at the heart of latest trends like GenAI and you will help your customers to leverage state-of-the-art technologies on AWS to innovate and become the next disrupters. \u003cbr/\u003e\u003cbr/\u003eDo you look around corners for ways to engage and service customers? Are you passionate about startups? Come build the future with us.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e - Successfully work in a large scale environment, and strategically impact a diverse customer portfolio.\u003cbr/\u003e - Accelerate the adoption of AWS services in a defined territory with an ultimate goal of meeting or exceeding quarterly revenue targets and defined goals.\u003cbr/\u003e - Develop and execute a territory plan to drives account growth.\u003cbr/\u003e - Maintain a robust customer pipeline while continuously maintaining high closing rates.\u003cbr/\u003e - Develop long-term strategic relationships with key stakeholders at all levels of the customer organization.\u003cbr/\u003e - Collaborate with AWS resources (Solution Architects, Business Development, Marketing, Partners, Support, and Service teams) to support customer interests, and further drive solution adoption.\u003cbr/\u003e - Expect moderate travel\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\t\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\t\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\t\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\t\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e","department_cost_center":null,"description_short":"As an Account Manager you will help drive the growth of startups, serving their unique needs, engaging with Founders, CxOs, Board of Directors and VC influencers, and teaming with business development,","display_distance":null,"id":"e122c255-15f8-436f-aa5e-9b8bf1212a60","id_icims":"3179592","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Tech Sales","job_function_id":null,"job_path":"/en/jobs/3179592/senior-account-manager-engaged-startups-france","job_schedule_type":"full-time","location":"FR, Courbevoie","locations":["{\"normalizedStateName\":\"Ile-de-France\",\"normalizedCountryCode\":\"FRA\",\"city\":\"Courbevoie\",\"countryIso3a\":\"FRA\",\"countryIso2a\":\"FR\",\"locationNonStemming\":\"France, Courbevoie\",\"coordinates\":\"48.89617,2.25648\",\"normalizedCountyName\":\"Hauts-de-Seine\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"France\",\"normalizedLocation\":\"Courbevoie, Ile-de-France, FRA\",\"location\":\"FR, Courbevoie\",\"region\":\"\",\"buildingCodeList\":[\"CDG11\"],\"normalizedCityName\":\"Courbevoie\"}"],"normalized_location":"Courbevoie, Ile-de-France, FRA","optional_search_labels":["aws.team-startupbd","aws.team-sus-startups-optional"],"posted_date":"February 12, 2026","preferred_qualifications":"- A technical background in engineering, computer science, or MIS a plus\u003cbr/\u003e- Knowledge of French start-up ecosystem\u003cbr/\u003e- Extensive customer network throughout France is a plus.\u003cbr/\u003e\u003cbr/\u003eAmazon est un employeur engagé pour l'égalité des chances. Nous sommes convaincus qu'une main d'oeuvre diversifée est essentielle à notre réussite. Nous prenons nos décisions de recrutement en fonction de votre expérience et de vos compétences. Nous apprécions votre envie de découvrir, d'inventer, de simplifier et de construire. La protection de votre vie privée et la sécurité de vos données constituent depuis longtemps une priorité absolue pour Amazon. Veuillez consulter notre Politique de Confidentialité pour en savoir plus sur la façon dont nous collectons, utilisons et traitons les données personnelles de nos candidats.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-sales-primary","source_system":"JobCreator","state":null,"title":"Senior Account Manager, Engaged, Startups, France","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3179592/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sales-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Formation et expérience : Bac Pro, BTS, BUT ou équivalent (Bac+2 minimum) en maintenance industrielle, électrotechnique ou mécanique, avec expérience en maintenance électrique et mécanique ou une expérience sur un poste similaire pour une durée d'au moins de deux ans.\u003cbr/\u003e- Maintenance préventive et GMAO : Expérience prouvée avec les systèmes de maintenance préventive planifiée et maîtrise des plateformes GMAO\u003cbr/\u003e- Dépannage et diagnostic : Capacités avancées de dépannage sur équipements de manutention et systèmes d'automatisation, avec maîtrise de la lecture des plans mécaniques et électriques\u003cbr/\u003e- Compétences techniques : Expérience pratique avec systèmes de convoyeurs, contrôleurs moteur, variateurs de fréquence et technologies de capteurs\u003cbr/\u003e- Compétences opérationnelles : Connaissance des normes de santé et sécurité, fortes compétences organisationnelles et excellentes capacités de communication\u003cbr/\u003e- • Formation et expérience : Bac Pro, BTS, BUT ou équivalent (Bac+2 minimum) en maintenance industrielle, électrotechnique ou mécanique, avec expérience en maintenance électrique et mécanique ou une expérience sur un poste similaire pour une durée d'au moins de deux ans.\u003cbr/\u003e- • Maintenance préventive et GMAO : Expérience prouvée avec les systèmes de maintenance préventive planifiée et maîtrise des plateformes GMAO\u003cbr/\u003e- • Dépannage et diagnostic : Capacités avancées de dépannage sur équipements de manutention et systèmes d'automatisation, avec maîtrise de la lecture des plans mécaniques et électriques\u003cbr/\u003e- • Compétences techniques : Expérience pratique avec systèmes de convoyeurs, contrôleurs moteur, variateurs de fréquence et technologies de capteurs\u003cbr/\u003e- • Compétences opérationnelles : Connaissance des normes de santé et sécurité, fortes compétences organisationnelles et excellentes capacités de communication","business_category":"fulfillment-ops","city":"Colombier-saugnieu","company_name":"Amazon France Logistique SAS","country_code":"FRA","description":"Technicien de Maintenance (F/H) Chaque jour, des millions de clients comptent sur Amazon pour recevoir leurs commandes à temps. Derrière cette promesse se cache un réseau d'automatisation sophistiqué où chaque seconde compte. En tant que Technicien/ne RME, vous serez au cœur de cette mécanique de précision, gardien des technologies qui permettent à nos centres de distribution de fonctionner 24h/24 et 7j/7.\u003cbr/\u003eCe qui rend ce rôle unique ? Vous travaillerez sur des équipements à la pointe de la technologie, parfois conçus en interne, dans un environnement où l'innovation rencontre l'excellence opérationnelle. Votre expertise technique aura un impact direct et mesurable : chaque intervention réussie, c'est des milliers de colis qui arrivent à destination comme prévu.\u003cbr/\u003eSi vous adorez les challenges techniques, que vous vous épanouissez dans des environnements dynamiques et que vous voulez voir l'impact concret de votre travail à l'échelle mondiale, ce poste est fait pour vous.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eResponsabilités Clés\u003cbr/\u003eGarantir la sécurité et la conformité\u003cbr/\u003e•\tPromouvoir les meilleures pratiques de santé et sécurité dans toutes les activités de maintenance, en assurant la conformité totale aux normes et réglementations\u003cbr/\u003e•\tEffectuer des évaluations de risques et mettre en place des protocoles de sécurité pour les travaux de maintenance\u003cbr/\u003eAssurer l'excellence en maintenance préventive\u003cbr/\u003e•\tExécuter des programmes complets de maintenance préventive planifiée sur des équipements automatisés diversifiés : convoyeurs, robots, systèmes de tri et d'emballage\u003cbr/\u003e•\tUtiliser les systèmes informatisés de gestion de la maintenance (GMAO) pour suivre, programmer et documenter les activités de maintenance\u003cbr/\u003e•\tCollaborer avec les fabricants d'équipements et prestataires externes pour optimiser les procédures de maintenance\u003cbr/\u003eIntervenir rapidement et résoudre les problèmes complexes\u003cbr/\u003e•\tFournir une réponse rapide aux pannes d'équipement avec communication claire aux équipes opérationnelles\u003cbr/\u003e•\tEffectuer un dépannage avancé sur les systèmes électriques, mécaniques et d'automatisation complexes\u003cbr/\u003e•\tUtiliser les outils de diagnostic et documentation technique pour identifier efficacement les causes racines\u003cbr/\u003eMaîtriser les technologies d'automatisation\u003cbr/\u003e•\tMaintenir et configurer des systèmes d'automatisation sophistiqués incluant les contrôleurs logiques programmables (API) et réseaux de terrain\u003cbr/\u003e•\tEntretenir et calibrer les scanners de codes-barres, systèmes d'impression-application et équipements de tri\u003cbr/\u003eContribuer à l'amélioration continue\u003cbr/\u003e•\tAnalyser les données de performance des équipements pour identifier les opportunités d'amélioration\u003cbr/\u003e•\tDévelopper et mettre en œuvre des initiatives de réduction des coûts par l'optimisation des équipements\u003cbr/\u003e•\tPartager les connaissances techniques et encadrer les techniciens juniors\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eHoraires de travail : Ce poste fonctionne dans un environnement 24h/24 et 7j/7 nécessitant une flexibilité avec des horaires variables, incluant nuits, week-ends et jours fériés.","department_cost_center":null,"description_short":"Technicien de Maintenance (F/H) Chaque jour, des millions de clients comptent sur Amazon pour recevoir leurs commandes à temps. Derrière cette promesse se cache un réseau d'automatisation sophistiqué où","display_distance":null,"id":"75e1c0b3-f934-4806-b882-b14f45f458cb","id_icims":"3177612","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3177612/technicien-de-maintenance-m-f","job_schedule_type":"full-time","location":"FR, Colombier-saugnieu","locations":["{\"normalizedStateName\":\"Auvergne-Rhone-Alpes\",\"normalizedCountryCode\":\"FRA\",\"city\":\"Colombier-saugnieu\",\"countryIso3a\":\"FRA\",\"countryIso2a\":\"FR\",\"locationNonStemming\":\"France, Colombier-saugnieu\",\"coordinates\":\"45.71521,5.12736\",\"normalizedCountyName\":\"Rhône\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"France\",\"normalizedLocation\":\"Colombier-Saugnieu, Auvergne-Rhone-Alpes, FRA\",\"location\":\"FR, Colombier-saugnieu\",\"region\":\"\",\"buildingCodeList\":[\"LYS2\"],\"normalizedCityName\":\"Colombier-Saugnieu\"}"],"normalized_location":"Colombier-Saugnieu, Auvergne-Rhone-Alpes, FRA","optional_search_labels":["operations-team.reliability-maintenance-engineering-eu","ops.lander-emea-rme-reliability","ops.lander-emea-rme-technician","ops.rme-technician"],"posted_date":"February 10, 2026","preferred_qualifications":"- Certifications électriques : Habilitations électriques avec expérience en travaux d'ordre électrique et maintenance des contrôleurs moteur/variateurs\u003cbr/\u003e- Expertise en automatisation : Expérience avec systèmes Siemens (API), réseaux de terrain, robotique et systèmes automatisés de stockage/récupération\u003cbr/\u003e- Technologies de traçabilité : Expertise en configuration et maintenance de scanners de codes-barres et systèmes d'impression-application\u003cbr/\u003e- Technologie de maintenance 4.0: Utilisation et/ou exploitation des différentes technologies liées à la maintenance 4.0\u003cbr/\u003e- Leadership technique : Expérience d'encadrement de techniciens juniors avec compétences en rédaction technique pour la documentation\u003cbr/\u003e- Gestion de projets : Expérience en gestion de projet d'installations d'équipements et capacités multilingues (un atout)\u003cbr/\u003e- Machine de conditionnement: Entretien et mise au point de machine de conditionnement automatiqu\u003cbr/\u003e\u003cbr/\u003eAmazon est un employeur engagé pour l'égalité des chances. Nous sommes convaincus qu'une main d'oeuvre diversifée est essentielle à notre réussite. Nous prenons nos décisions de recrutement en fonction de votre expérience et de vos compétences. Nous apprécions votre envie de découvrir, d'inventer, de simplifier et de construire. La protection de votre vie privée et la sécurité de vos données constituent depuis longtemps une priorité absolue pour Amazon. Veuillez consulter notre Politique de Confidentialité pour en savoir plus sur la façon dont nous collectons, utilisons et traitons les données personnelles de nos candidats.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":null,"title":"Technicien de Maintenance M/F","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3177612/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- •\tFormation et expérience : Bac Pro, BTS, BUT ou équivalent (Bac+2 minimum) en maintenance industrielle, électrotechnique ou mécanique, avec expérience en maintenance électrique et mécanique ou une expérience sur un poste similaire pour une durée d'au moins de deux ans.\u003cbr/\u003e- •\tMaintenance préventive et GMAO : Expérience prouvée avec les systèmes de maintenance préventive planifiée et maîtrise des plateformes GMAO\u003cbr/\u003e- •\tDépannage et diagnostic : Capacités avancées de dépannage sur équipements de manutention et systèmes d'automatisation, avec maîtrise de la lecture des plans mécaniques et électriques\u003cbr/\u003e- •\tCompétences techniques : Expérience pratique avec systèmes de convoyeurs, contrôleurs moteur, variateurs de fréquence et technologies de capteurs\u003cbr/\u003e- •\tCompétences opérationnelles : Connaissance des normes de santé et sécurité, fortes compétences organisationnelles et excellentes capacités de communication","business_category":"fulfillment-ops","city":"Satolas-et-bonce","company_name":"Amazon France Logistique SAS","country_code":"FRA","description":"Technicien de Maintenance (F/H) Chaque jour, des millions de clients comptent sur Amazon pour recevoir leurs commandes à temps. Derrière cette promesse se cache un réseau d'automatisation sophistiqué où chaque seconde compte. En tant que Technicien/ne RME, vous serez au cœur de cette mécanique de précision, gardien des technologies qui permettent à nos centres de distribution de fonctionner 24h/24 et 7j/7.\u003cbr/\u003eCe qui rend ce rôle unique ? Vous travaillerez sur des équipements à la pointe de la technologie, parfois conçus en interne, dans un environnement où l'innovation rencontre l'excellence opérationnelle. Votre expertise technique aura un impact direct et mesurable : chaque intervention réussie, c'est des milliers de colis qui arrivent à destination comme prévu.\u003cbr/\u003eSi vous adorez les challenges techniques, que vous vous épanouissez dans des environnements dynamiques et que vous voulez voir l'impact concret de votre travail à l'échelle mondiale, ce poste est fait pour vous\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eGarantir la sécurité et la conformité\u003cbr/\u003e•\tPromouvoir les meilleures pratiques de santé et sécurité dans toutes les activités de maintenance, en assurant la conformité totale aux normes et réglementations\u003cbr/\u003e•\tEffectuer des évaluations de risques et mettre en place des protocoles de sécurité pour les travaux de maintenance\u003cbr/\u003eAssurer l'excellence en maintenance préventive\u003cbr/\u003e•\tExécuter des programmes complets de maintenance préventive planifiée sur des équipements automatisés diversifiés : convoyeurs, robots, systèmes de tri et d'emballage\u003cbr/\u003e•\tUtiliser les systèmes informatisés de gestion de la maintenance (GMAO) pour suivre, programmer et documenter les activités de maintenance\u003cbr/\u003e•\tCollaborer avec les fabricants d'équipements et prestataires externes pour optimiser les procédures de maintenance\u003cbr/\u003eIntervenir rapidement et résoudre les problèmes complexes\u003cbr/\u003e•\tFournir une réponse rapide aux pannes d'équipement avec communication claire aux équipes opérationnelles\u003cbr/\u003e•\tEffectuer un dépannage avancé sur les systèmes électriques, mécaniques et d'automatisation complexes\u003cbr/\u003e•\tUtiliser les outils de diagnostic et documentation technique pour identifier efficacement les causes racines\u003cbr/\u003eMaîtriser les technologies d'automatisation\u003cbr/\u003e•\tMaintenir et configurer des systèmes d'automatisation sophistiqués incluant les contrôleurs logiques programmables (API) et réseaux de terrain\u003cbr/\u003e•\tEntretenir et calibrer les scanners de codes-barres, systèmes d'impression-application et équipements de tri\u003cbr/\u003eContribuer à l'amélioration continue\u003cbr/\u003e•\tAnalyser les données de performance des équipements pour identifier les opportunités d'amélioration\u003cbr/\u003e•\tDévelopper et mettre en œuvre des initiatives de réduction des coûts par l'optimisation des équipements\u003cbr/\u003e•\tPartager les connaissances techniques et encadrer les techniciens juniors\u003cbr/\u003eHoraires de travail : Ce poste fonctionne dans un environnement 24h/24 et 7j/7 nécessitant une flexibilité avec des horaires variables, incluant nuits, week-ends et jours fériés.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eNos techniciens RME sont basés sur site, afin de répondre rapidement à tout problème technique affectant nos opérations. Vous effectuerez une série de travaux de maintenance préventive planifiée sur les équipements en place sur nos sites afin de vous assurer qu’ils fonctionnent et ne présentent aucun risque de sécurité. En tant que technicien RME, vous interviendrez rapidement en cas de panne, et vous mènerez l’enquête pour détecter les pannes et les solutionner aussi vite que possible.  Il vous appartiendra également de faire des suggestions pour améliorer durablement les processus.\u003cbr/\u003eEn collaboration avec des collègues expérimentés, vous effectuerez des tâches de maintenance quotidiennes telles que la peinture et la plomberie et assurerez la liaison avec les sous-traitants externes en cas de besoin si nécessaire. Vous travaillerez en équipe afin de vous assurer que nos sites bénéficient d’une assistance 24 heures sur 24, ce qui permet à Amazon de livrer ses produits à la vitesse qui fait sa réputation. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eNotre équipe d’ingénieurs RME (Reliability Maintenance Engineering) veille à ce que nos équipements fonctionnent au mieux. Guidés par des responsables expérimentés, nous sommes une équipe à l’esprit analytique. Nos collaborateurs·trices possèdent à la fois des connaissances techniques poussées et un bon esprit d’équipe. Nous travaillons ensemble pour assurer l’entretien, le dépannage et la réparation des ressources de notre réseau mondial de centres d’expédition. Certains de nos employé·es occupent des postes à responsabilités et sont chargés de superviser l’équipe dans son travail sur des technologies passionnantes, dont certaines n’existent que chez Amazon.\u003cbr/\u003eDe l’installation de systèmes d’emballage automatisés à la supervision de la maintenance générale d’un site, en passant par la réparation d’équipements de distribution essentiels, notre équipe assure le bon fonctionnement de la plupart des éléments techniques d’Amazon. Nous veillons, par exemple, à ce que les bâtiments soient conformes à la législation, afin d’assurer la sécurité de tous et le fonctionnement à plein régime de nos sites. Les possibilités d’évolution sont nombreuses, tant au sein de l’équipe RME qu’à l’échelle d’Amazon.\u003cbr/\u003eTout ce que nous faisons vise à réduire les temps d’arrêt dans les principaux sites logistiques d’Amazon, afin que les clients reçoivent leurs commandes à temps. Nous travaillons souvent tôt ou tard pour effectuer les tâches de maintenance avec un minimum de perturbations, y compris en équipes de nuit. Si nous voyons qu’il existe une méthodologie plus aboutie pour faire les choses, nous avons les compétences nécessaires pour développer et introduire des processus nouveaux ou des technologies de pointe, comme Amazon Robotics ou notre robot de tri ultra sophistiqué.","department_cost_center":null,"description_short":"Technicien de Maintenance (F/H) Chaque jour, des millions de clients comptent sur Amazon pour recevoir leurs commandes à temps. Derrière cette promesse se cache un réseau d'automatisation sophistiqué où","display_distance":null,"id":"f0b46bfd-6387-497d-a77b-3096e5871130","id_icims":"3177611","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3177611/technicien-de-maintenance-m-f","job_schedule_type":"full-time","location":"FR, Satolas-et-bonce","locations":["{\"normalizedStateName\":\"Auvergne-Rhone-Alpes\",\"normalizedCountryCode\":\"FRA\",\"city\":\"Satolas-et-bonce\",\"countryIso3a\":\"FRA\",\"countryIso2a\":\"FR\",\"locationNonStemming\":\"France, Satolas-et-bonce\",\"coordinates\":\"45.69358,5.12729\",\"normalizedCountyName\":\"Isère\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"France\",\"normalizedLocation\":\"Satolas-et-Bonce, Auvergne-Rhone-Alpes, FRA\",\"location\":\"FR, Satolas-et-bonce\",\"region\":\"\",\"buildingCodeList\":[\"LYS8\",\"LYS4\",\"XOR2\"],\"normalizedCityName\":\"Satolas-et-Bonce\"}"],"normalized_location":"Satolas-et-Bonce, Auvergne-Rhone-Alpes, FRA","optional_search_labels":["operations-team.reliability-maintenance-engineering-eu","ops.lander-emea-rme-reliability","ops.lander-emea-rme-technician","ops.rme-technician"],"posted_date":"February 10, 2026","preferred_qualifications":"- •\tCertifications électriques : Habilitations électriques avec expérience en travaux d'ordre électrique et maintenance des contrôleurs moteur/variateurs\u003cbr/\u003e- •\tExpertise en automatisation : Expérience avec systèmes Siemens (API), réseaux de terrain, robotique et systèmes automatisés de stockage/récupération\u003cbr/\u003e- •\tTechnologies de traçabilité : Expertise en configuration et maintenance de scanners de codes-barres et systèmes d'impression-application\u003cbr/\u003e- •\tTechnologie de maintenance 4.0: Utilisation et/ou exploitation des différentes technologies liées à la maintenance 4.0\u003cbr/\u003e- •\tLeadership technique : Expérience d'encadrement de techniciens juniors avec compétences en rédaction technique pour la documentation\u003cbr/\u003e- •\tGestion de projets : Expérience en gestion de projet d'installations d'équipements et capacités multilingues (un atout)\u003cbr/\u003e- •\tMachine de conditionnement: Entretien et mise au point de machine de conditionnement automatique.\u003cbr/\u003e\u003cbr/\u003eAmazon est un employeur engagé pour l'égalité des chances. Nous sommes convaincus qu'une main d'oeuvre diversifée est essentielle à notre réussite. Nous prenons nos décisions de recrutement en fonction de votre expérience et de vos compétences. Nous apprécions votre envie de découvrir, d'inventer, de simplifier et de construire. La protection de votre vie privée et la sécurité de vos données constituent depuis longtemps une priorité absolue pour Amazon. Veuillez consulter notre Politique de Confidentialité pour en savoir plus sur la façon dont nous collectons, utilisons et traitons les données personnelles de nos candidats.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":null,"title":"Technicien de Maintenance M/F","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3177611/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Formation et expérience : Bac Pro, BTS, BUT ou équivalent (Bac+2 minimum) en maintenance industrielle, électrotechnique ou mécanique, avec expérience en maintenance électrique et mécanique ou une expérience sur un poste similaire pour une durée d'au moins de deux ans.\u003cbr/\u003e- Maintenance préventive et GMAO : Expérience prouvée avec les systèmes de maintenance préventive planifiée et maîtrise des plateformes GMAO\u003cbr/\u003e- Dépannage et diagnostic : Capacités avancées de dépannage sur équipements de manutention et systèmes d'automatisation, avec maîtrise de la lecture des plans mécaniques et électriques\u003cbr/\u003e- Compétences techniques : Expérience pratique avec systèmes de convoyeurs, contrôleurs moteur, variateurs de fréquence et technologies de capteurs\u003cbr/\u003e- Compétences opérationnelles : Connaissance des normes de santé et sécurité, fortes compétences organisationnelles et excellentes capacités de communication\u003cbr/\u003e- •Formation et expérience : Bac Pro, BTS, BUT ou équivalent (Bac+2 minimum) en maintenance industrielle, électrotechnique ou mécanique, avec expérience en maintenance électrique et mécanique ou une expérience sur un poste similaire pour une durée d'au moins de deux ans.\u003cbr/\u003e- •Maintenance préventive et GMAO : Expérience prouvée avec les systèmes de maintenance préventive planifiée et maîtrise des plateformes GMAO\u003cbr/\u003e- •Dépannage et diagnostic : Capacités avancées de dépannage sur équipements de manutention et systèmes d'automatisation, avec maîtrise de la lecture des plans mécaniques et électriques\u003cbr/\u003e- •Compétences techniques : Expérience pratique avec systèmes de convoyeurs, contrôleurs moteur, variateurs de fréquence et technologies de capteurs\u003cbr/\u003e- •Compétences opérationnelles : Connaissance des normes de santé et sécurité, fortes compétences organisationnelles et excellentes capacités de communication","business_category":"fulfillment-ops","city":"Colombier-saugnieu","company_name":"Amazon France Logistique SAS","country_code":"FRA","description":"Technicien de Maintenance (F/H) Chaque jour, des millions de clients comptent sur Amazon pour recevoir leurs commandes à temps. Derrière cette promesse se cache un réseau d'automatisation sophistiqué où chaque seconde compte. En tant que Technicien/ne RME, vous serez au cœur de cette mécanique de précision, gardien des technologies qui permettent à nos centres de distribution de fonctionner 24h/24 et 7j/7.\u003cbr/\u003eCe qui rend ce rôle unique ? Vous travaillerez sur des équipements à la pointe de la technologie, parfois conçus en interne, dans un environnement où l'innovation rencontre l'excellence opérationnelle. Votre expertise technique aura un impact direct et mesurable : chaque intervention réussie, c'est des milliers de colis qui arrivent à destination comme prévu.\u003cbr/\u003eSi vous adorez les challenges techniques, que vous vous épanouissez dans des environnements dynamiques et que vous voulez voir l'impact concret de votre travail à l'échelle mondiale, ce poste est fait pour vous.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eResponsabilités Clés\u003cbr/\u003eGarantir la sécurité et la conformité\u003cbr/\u003e• Promouvoir les meilleures pratiques de santé et sécurité dans toutes les activités de maintenance, en assurant la conformité totale aux normes et réglementations\u003cbr/\u003e• Effectuer des évaluations de risques et mettre en place des protocoles de sécurité pour les travaux de maintenance\u003cbr/\u003eAssurer l'excellence en maintenance préventive\u003cbr/\u003e• Exécuter des programmes complets de maintenance préventive planifiée sur des équipements automatisés diversifiés : convoyeurs, robots, systèmes de tri et d'emballage\u003cbr/\u003e• Utiliser les systèmes informatisés de gestion de la maintenance (GMAO) pour suivre, programmer et documenter les activités de maintenance\u003cbr/\u003e• Collaborer avec les fabricants d'équipements et prestataires externes pour optimiser les procédures de maintenance\u003cbr/\u003eIntervenir rapidement et résoudre les problèmes complexes\u003cbr/\u003e• Fournir une réponse rapide aux pannes d'équipement avec communication claire aux équipes opérationnelles\u003cbr/\u003e• Effectuer un dépannage avancé sur les systèmes électriques, mécaniques et d'automatisation complexes\u003cbr/\u003e• Utiliser les outils de diagnostic et documentation technique pour identifier efficacement les causes racines\u003cbr/\u003eMaîtriser les technologies d'automatisation\u003cbr/\u003e• Maintenir et configurer des systèmes d'automatisation sophistiqués incluant les contrôleurs logiques programmables (API) et réseaux de terrain\u003cbr/\u003e• Entretenir et calibrer les scanners de codes-barres, systèmes d'impression-application et équipements de tri\u003cbr/\u003eContribuer à l'amélioration continue\u003cbr/\u003e• Analyser les données de performance des équipements pour identifier les opportunités d'amélioration\u003cbr/\u003e• Développer et mettre en œuvre des initiatives de réduction des coûts par l'optimisation des équipements\u003cbr/\u003e• Partager les connaissances techniques et encadrer les techniciens juniors\u003cbr/\u003eHoraires de travail : Ce poste fonctionne dans un environnement 24h/24 et 7j/7 nécessitant une flexibilité avec des horaires variables, incluant nuits, week-ends et jours fériés.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eNos techniciens RME sont basés sur site, afin de répondre rapidement à tout problème technique affectant nos opérations. Vous effectuerez une série de travaux de maintenance préventive planifiée sur les équipements en place sur nos sites afin de vous assurer qu’ils fonctionnent et ne présentent aucun risque de sécurité. En tant que technicien RME, vous interviendrez rapidement en cas de panne, et vous mènerez l’enquête pour détecter les pannes et les solutionner aussi vite que possible.  Il vous appartiendra également de faire des suggestions pour améliorer durablement les processus.\u003cbr/\u003eEn collaboration avec des collègues expérimentés, vous effectuerez des tâches de maintenance quotidiennes telles que la peinture et la plomberie et assurerez la liaison avec les sous-traitants externes en cas de besoin si nécessaire. Vous travaillerez en équipe afin de vous assurer que nos sites bénéficient d’une assistance 24 heures sur 24, ce qui permet à Amazon de livrer ses produits à la vitesse qui fait sa réputation. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eNotre équipe d’ingénieurs RME (Reliability Maintenance Engineering) veille à ce que nos équipements fonctionnent au mieux. Guidés par des responsables expérimentés, nous sommes une équipe à l’esprit analytique. Nos collaborateurs·trices possèdent à la fois des connaissances techniques poussées et un bon esprit d’équipe. Nous travaillons ensemble pour assurer l’entretien, le dépannage et la réparation des ressources de notre réseau mondial de centres d’expédition. Certains de nos employé·es occupent des postes à responsabilités et sont chargés de superviser l’équipe dans son travail sur des technologies passionnantes, dont certaines n’existent que chez Amazon.\u003cbr/\u003eDe l’installation de systèmes d’emballage automatisés à la supervision de la maintenance générale d’un site, en passant par la réparation d’équipements de distribution essentiels, notre équipe assure le bon fonctionnement de la plupart des éléments techniques d’Amazon. Nous veillons, par exemple, à ce que les bâtiments soient conformes à la législation, afin d’assurer la sécurité de tous et le fonctionnement à plein régime de nos sites. Les possibilités d’évolution sont nombreuses, tant au sein de l’équipe RME qu’à l’échelle d’Amazon.\u003cbr/\u003eTout ce que nous faisons vise à réduire les temps d’arrêt dans les principaux sites logistiques d’Amazon, afin que les clients reçoivent leurs commandes à temps. Nous travaillons souvent tôt ou tard pour effectuer les tâches de maintenance avec un minimum de perturbations, y compris en équipes de nuit. Si nous voyons qu’il existe une méthodologie plus aboutie pour faire les choses, nous avons les compétences nécessaires pour développer et introduire des processus nouveaux ou des technologies de pointe, comme Amazon Robotics ou notre robot de tri ultra sophistiqué.","department_cost_center":null,"description_short":"Technicien de Maintenance (F/H) Chaque jour, des millions de clients comptent sur Amazon pour recevoir leurs commandes à temps. Derrière cette promesse se cache un réseau d'automatisation sophistiqué où","display_distance":null,"id":"0cef89d5-96b2-4659-a46e-92fc21533936","id_icims":"3176986","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3176986/technicien-de-maintenance","job_schedule_type":"full-time","location":"FR, Colombier-saugnieu","locations":["{\"normalizedStateName\":\"Auvergne-Rhone-Alpes\",\"normalizedCountryCode\":\"FRA\",\"city\":\"Colombier-saugnieu\",\"countryIso3a\":\"FRA\",\"countryIso2a\":\"FR\",\"locationNonStemming\":\"France, Colombier-saugnieu\",\"coordinates\":\"45.71521,5.12736\",\"normalizedCountyName\":\"Rhône\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"France\",\"normalizedLocation\":\"Colombier-Saugnieu, Auvergne-Rhone-Alpes, FRA\",\"location\":\"FR, Colombier-saugnieu\",\"region\":\"\",\"buildingCodeList\":[\"LYS2\"],\"normalizedCityName\":\"Colombier-Saugnieu\"}"],"normalized_location":"Colombier-Saugnieu, Auvergne-Rhone-Alpes, FRA","optional_search_labels":["operations-team.reliability-maintenance-engineering-eu","ops.lander-emea-rme-reliability","ops.lander-emea-rme-technician","ops.rme-technician"],"posted_date":"February  9, 2026","preferred_qualifications":"- Certifications électriques : Habilitations électriques avec expérience en travaux d'ordre électrique et maintenance des contrôleurs moteur/variateurs\u003cbr/\u003e- Expertise en automatisation : Expérience avec systèmes Siemens (API), réseaux de terrain, robotique et systèmes automatisés de stockage/récupération\u003cbr/\u003e- Technologies de traçabilité : Expertise en configuration et maintenance de scanners de codes-barres et systèmes d'impression-application\u003cbr/\u003e- Technologie de maintenance 4.0: Utilisation et/ou exploitation des différentes technologies liées à la maintenance 4.0\u003cbr/\u003e- Leadership technique : Expérience d'encadrement de techniciens juniors avec compétences en rédaction technique pour la documentation\u003cbr/\u003e- Gestion de projets : Expérience en gestion de projet d'installations d'équipements et capacités multilingues (un atout)\u003cbr/\u003e- Machine de conditionnement: Entretien et mise au point de machine de conditionnement automatique.\u003cbr/\u003e\u003cbr/\u003eAmazon est un employeur engagé pour l'égalité des chances. Nous sommes convaincus qu'une main d'oeuvre diversifée est essentielle à notre réussite. Nous prenons nos décisions de recrutement en fonction de votre expérience et de vos compétences. Nous apprécions votre envie de découvrir, d'inventer, de simplifier et de construire. La protection de votre vie privée et la sécurité de vos données constituent depuis longtemps une priorité absolue pour Amazon. Veuillez consulter notre Politique de Confidentialité pour en savoir plus sur la façon dont nous collectons, utilisons et traitons les données personnelles de nos candidats.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":null,"title":"Technicien de Maintenance ","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3176986/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team\u003cbr/\u003e- Bachelor's degree in computer science or equivalent","business_category":"selling-partner-services","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"Selling on Amazon is one of Amazon’s fastest-growing businesses. The Selling Partner Financial Technology team’s vision is to empower every Selling Partner to succeed globally by providing a trusted and seamless financial experience. We enable this through building foundational capabilities for financial events and currently support payouts to millions of active sellers across all Amazon businesses. This role will lead software development initiatives across two teams.\u003cbr/\u003e\u003cbr/\u003eWe are looking for a leader who is passionate about building reliable, consistent, and scalable data systems. In this role, you will work on complex technical challenges and develop innovative solutions that enhance the Payout and Collections experience for our Selling Partners.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs part of our team, you will design and develop large-scale distributed data systems that support our financial platforms.\u003cbr/\u003e\u003cbr/\u003eYou will collaborate with cross-functional teams to understand a range of financial requirements and deliver solutions that ensure high data quality and availability. You will also contribute to evaluating and implementing new technologies to improve our financial systems and support team members through knowledge sharing and technical guidance.\u003cbr/\u003e\u003cbr/\u003eExperience with full-stack development, distributed systems, and machine learning will be valuable as you work across various layers of our technology stack to ensure end-to-end data excellence.","department_cost_center":null,"description_short":"Selling on Amazon is one of Amazon’s fastest-growing businesses. The Selling Partner Financial Technology team’s vision is to empower every Selling Partner to succeed globally by providing a trusted and","display_distance":null,"id":"57597b1d-77a6-4740-97c6-cbe2cc2c2c70","id_icims":"3140098","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3140098/senior-sde-spac","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR18\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"December 10, 2025","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"selling-partner-services.no-team-listed","source_system":"JobCreator","state":"KA","title":"Senior SDE, SPAC ","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3140098/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in automating, deploying, and supporting infrastructure\u003cbr/\u003e- Experience with automating and simplifying team development, test, and operations processes\u003cbr/\u003e- Experience coding, scripting, automating in at least one language (e.g., Python, C, C++, Java, Ruby, or PowerShell)","business_category":"amazon-business","city":"Hyderabad","company_name":"ADCI - HYD 15 SEZ - E55","country_code":"IND","description":"Are you excited to use Generative AI to improve how we develop and support business problems and software solutions? Are you passionate about driving innovation and discovering new ways to optimize systems? Do you thrive on solving technical and operational challenges? Join us on Amazon Business! We are seeking talented Systems Development Engineers to help support, sustain, and evolve our solutions for business customers using GenAI! \u003cbr/\u003e\u003cbr/\u003eAmazon Business (business.amazon.com) aims to improve how buying and selling happens between businesses and suppliers. We provide business customers everything they love about Amazon, for work. We are focused on building a unique shopping experience for business users and business sellers with access to hundreds of millions of products worldwide, business-only selection, business and quantity pricing, bulk buying experience, and much more. We've grown a lot in the 10+ years since our launch and become one of the most promising opportunities within Amazon. Go ahead and read about us on any of your favorite media outlets!\u003cbr/\u003e\u003cbr/\u003eWe are looking for Systems Development Engineers who will be instrumental in building and evolving our software infrastructure across a diverse ecosystem of technologies and applications. In this role, you'll lead smaller projects independently while contributing to larger, strategic initiatives as part of a team. As a Systems Development Engineer, you'll design and implement robust infrastructure solutions, develop applications, and create automated processes that scale. We're particularly focused on leveraging Generative AI to accelerate development velocity, enhance code quality, and transform how we approach problem-solving through intelligent automation and AI-assisted collaboration.\u003cbr/\u003e","department_cost_center":null,"description_short":"Are you excited to use Generative AI to improve how we develop and support business problems and software solutions? Are you passionate about driving innovation and discovering new ways to optimize systems?","display_distance":null,"id":"1029bf5d-f087-4fc0-95d6-1f75167c26ef","id_icims":"3173619","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"System Development Engineering","job_function_id":null,"job_path":"/en/jobs/3173619/systems-development-engineer-amazon-business","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"PMOW\",\"TTB7\",\"TTA3\",\"TTE8\",\"YEXJ\",\"XSMM\",\"HYD46\",\"HYD113\",\"SHYI\",\"HHDB\",\"PNHR\",\"TTF1\",\"PHYG\",\"PHNT\",\"TTL3\",\"HSCH\",\"PMMO\",\"TTG3\",\"TTH7\",\"UHYY\",\"YSUR\",\"TTJ4\",\"HYD48\",\"PMNF\",\"HYDW\",\"TTA1\",\"TTJ6\",\"TTC9\",\"TTB5\",\"YSFB\",\"SHTX\",\"HYD13\",\"PMOY\",\"YZZD\",\"QSBC\",\"TTD4\",\"FHYB\",\"TTM3\",\"PMQE\",\"UHY4\",\"YZZM\",\"TTJ8\",\"TTG7\",\"SHTI\",\"HYD602\",\"FHY3\",\"PTOB\",\"HYD51\",\"TTC2\",\"YEYL\",\"XBLH\",\"TTE4\",\"PMOU\",\"SHYG\",\"UHY93\",\"PNHY\",\"HYD111\",\"TTB3\",\"HHZ1\",\"YSUP\",\"PNHG\",\"TTD8\",\"YSYN\",\"PNHA\",\"HBM11\",\"TTD2\",\"HYD120\",\"PMMM\",\"PNH8\",\"TTB9\",\"QSAJ\",\"HYD123\",\"ZSDZ\",\"HYT2\",\"TTL7\",\"TLD8\",\"TTL1\",\"UHYR\",\"BPM54\",\"HHY8\",\"TTH9\",\"HHY5\",\"HYD101\",\"TTJ2\",\"PMOC\",\"ZSDV\",\"TTE2\",\"YZZV\",\"YEXD\",\"SHYC\",\"TTC5\",\"PMNY\",\"FHY1\",\"RSB8\",\"HYD85\",\"HYBV\",\"RSBC\",\"RSBD\",\"HYD253\",\"HYD54\",\"YSO5\",\"TTD9\",\"HBX2\",\"HYD84\",\"PMVW\",\"HYD122\",\"XSEV\",\"TTG9\",\"PMNC\",\"QSD6\",\"HHY7\",\"TTJ1\",\"HYD56\",\"HYD121\",\"TTH2\",\"HYD83\",\"BPM61\",\"PHYC\",\"TTG1\",\"PMOS\",\"YEYJ\",\"YSYP\",\"SHYB\",\"VGA3\",\"TTC3\",\"PDSU\",\"UHY91\",\"HYD8\",\"YSUE\",\"YEYK\",\"HYD2\",\"FHYE\",\"TTF3\",\"PNHN\",\"PMOZ\",\"TTL5\",\"TTG2\",\"UHY92\",\"TTB4\",\"HYD102\",\"PNHH\",\"PMOT\",\"TTF9\",\"HYD103\",\"PNLA\",\"HYD20\",\"TTA5\",\"PMPY\",\"TTJ7\",\"FHYD\",\"QSN6\",\"TTF2\",\"QSLJ\",\"TTF8\",\"TTL6\",\"MHYB\",\"HYD112\",\"HYD11\",\"TTC4\",\"PHYH\",\"BPM62\",\"TTE9\",\"PNWN\",\"HYD30\",\"UHY5\",\"TTE3\",\"YEXK\",\"TTG8\",\"UHYA\",\"YSUK\",\"HYD254\",\"FHY2\",\"MHYD\",\"HYBP\",\"UHYZ\",\"PNO4\",\"HYT1\",\"TBC121\",\"TTG4\",\"QSO0\",\"TTL2\",\"HYD100\",\"TTD3\",\"PNVP\",\"TTH8\",\"PNH9\",\"QWQP\",\"VGX1\",\"HHDC\",\"HYD114\",\"PMOX\",\"TTE7\",\"TTA2\",\"HYD50\",\"TTG6\",\"HHDA\",\"HYD45\",\"XSML\",\"PMPZ\",\"HYD601\",\"HYD16\",\"SHYH\",\"HYD7\",\"PNIL\",\"PMOV\",\"TTA4\",\"UHYQ\",\"FAPA\",\"PHYF\",\"TTB8\",\"TTD1\",\"REBY\",\"VGA1\",\"PDKP\",\"YSFA\",\"QSN5\",\"TTE5\",\"HYD110\",\"TTA6\",\"HYD256\",\"HYD3\",\"KSZD\",\"YSUF\",\"HYD57\",\"UHY3\",\"TTC8\",\"PHYD\",\"HYD12\",\"HYD9\",\"KSZ7\",\"PNOA\",\"TTB6\",\"ZSDW\",\"TTD5\",\"FHYC\",\"SHYA\",\"XSIP\",\"UHYX\",\"TTF4\",\"TTL4\",\"TTF7\",\"TTH6\",\"TTJ5\",\"HYD60\",\"HYD47\",\"XSAD\",\"TTF6\",\"HYD71\",\"YSFJ\",\"QSD7\",\"TTA9\",\"PMOQ\",\"TTH3\",\"HYD252\",\"TTB1\",\"VGA4\",\"YEYI\",\"HYX1\",\"YSUM\",\"PMOR\",\"TTA8\",\"TTE1\",\"PNIP\",\"YSTU\",\"IPCX\",\"TTM1\",\"BPM60\",\"FHYG\",\"TTF5\",\"TTH4\",\"PNLC\",\"HYD007\",\"YSFH\",\"HHY4\",\"HBM10\",\"PMNX\",\"YZZ5\",\"TTJ9\",\"YSUA\",\"HYD124\",\"TTB2\",\"YSED\",\"TTD7\",\"TTL8\",\"PMOP\",\"TTA7\",\"UHY1\",\"TTC6\",\"SHYF\",\"HHY9\",\"BPM55\",\"HYD49\",\"ZSDY\",\"SHYL\",\"XBLS\",\"HBH91\",\"YSIZ\",\"UHYW\",\"TTJ3\",\"TTH5\",\"TTD6\",\"HVR40\",\"PMQJ\",\"HSTG\",\"HYD503\",\"HYD81\",\"HYD125\",\"TTC1\",\"PHYE\",\"HYD251\",\"HYD115\",\"TTL9\",\"HYD257\",\"UHYD\",\"FHYA\",\"TTE6\",\"PMNQ\",\"HYD600\",\"TTC7\",\"UHY2\",\"PNH3\",\"HYB47\",\"TTG5\",\"PNTL\",\"TTM2\",\"SHYR\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":[],"posted_date":"February  4, 2026","preferred_qualifications":"- Experience with CI/CD pipelines build processes\u003cbr/\u003e- Experience designing or architecting (design patterns, reliability and scaling) of new and existing systems\u003cbr/\u003e- Experience with distributed computing, programs and systems\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-business.no-team-listed","source_system":"JobCreator","state":"TS","title":"Systems Development Engineer, Amazon Business","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3173619/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Maintenance préventive et GMAO : Expérience prouvée avec les systèmes de maintenance préventive planifiée et maîtrise des plateformes GMAO\u003cbr/\u003e- Dépannage et diagnostic : Capacités avancées de dépannage sur équipements de manutention et systèmes d'automatisation, avec maîtrise de la lecture des plans mécaniques et électriques\u003cbr/\u003e- Compétences techniques : Expérience pratique avec systèmes de convoyeurs, contrôleurs moteur, variateurs de fréquence et technologies de capteurs\u003cbr/\u003e- Compétences opérationnelles : Connaissance des normes de santé et sécurité, fortes compétences organisationnelles et excellentes capacités de communication\u003cbr/\u003e- Formation et expérience : Bac Pro, BTS, BUT ou équivalent (Bac+2 minimum) en maintenance industrielle, électrotechnique ou mécanique, avec expérience en maintenance électrique et mécanique ou une expérience sur un poste similaire pour une durée d'au moins de deux ans.","business_category":"fulfillment-ops","city":"Satolas-et-bonce","company_name":"Amazon France Logistique SAS","country_code":"FRA","description":"Technicien de Maintenance (F/H) Chaque jour, des millions de clients comptent sur Amazon pour recevoir leurs commandes à temps. Derrière cette promesse se cache un réseau d'automatisation sophistiqué où chaque seconde compte. En tant que Technicien/ne RME, vous serez au cœur de cette mécanique de précision, gardien des technologies qui permettent à nos centres de distribution de fonctionner 24h/24 et 7j/7.\u003cbr/\u003e\u003cbr/\u003eCe qui rend ce rôle unique ? \u003cbr/\u003eVous travaillerez sur des équipements à la pointe de la technologie, parfois conçus en interne, dans un environnement où l'innovation rencontre l'excellence opérationnelle. Votre expertise technique aura un impact direct et mesurable : chaque intervention réussie, c'est des milliers de colis qui arrivent à destination comme prévu.\u003cbr/\u003eSi vous adorez les challenges techniques, que vous vous épanouissez dans des environnements dynamiques et que vous voulez voir l'impact concret de votre travail à l'échelle mondiale, ce poste est fait pour vous.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eGarantir la sécurité et la conformité\u003cbr/\u003e•\tPromouvoir les meilleures pratiques de santé et sécurité dans toutes les activités de maintenance, en assurant la conformité totale aux normes et réglementations\u003cbr/\u003e•\tEffectuer des évaluations de risques et mettre en place des protocoles de sécurité pour les travaux de maintenance\u003cbr/\u003eAssurer l'excellence en maintenance préventive\u003cbr/\u003e•\tExécuter des programmes complets de maintenance préventive planifiée sur des équipements automatisés diversifiés : convoyeurs, robots, systèmes de tri et d'emballage\u003cbr/\u003e•\tUtiliser les systèmes informatisés de gestion de la maintenance (GMAO) pour suivre, programmer et documenter les activités de maintenance\u003cbr/\u003e•\tCollaborer avec les fabricants d'équipements et prestataires externes pour optimiser les procédures de maintenance\u003cbr/\u003eIntervenir rapidement et résoudre les problèmes complexes\u003cbr/\u003e•\tFournir une réponse rapide aux pannes d'équipement avec communication claire aux équipes opérationnelles\u003cbr/\u003e•\tEffectuer un dépannage avancé sur les systèmes électriques, mécaniques et d'automatisation complexes\u003cbr/\u003e•\tUtiliser les outils de diagnostic et documentation technique pour identifier efficacement les causes racines\u003cbr/\u003eMaîtriser les technologies d'automatisation\u003cbr/\u003e•\tMaintenir et configurer des systèmes d'automatisation sophistiqués incluant les contrôleurs logiques programmables (API) et réseaux de terrain\u003cbr/\u003e•\tEntretenir et calibrer les scanners de codes-barres, systèmes d'impression-application et équipements de tri\u003cbr/\u003eContribuer à l'amélioration continue\u003cbr/\u003e•\tAnalyser les données de performance des équipements pour identifier les opportunités d'amélioration\u003cbr/\u003e•\tDévelopper et mettre en œuvre des initiatives de réduction des coûts par l'optimisation des équipements\u003cbr/\u003e•\tPartager les connaissances techniques et encadrer les techniciens juniors\u003cbr/\u003eHoraires de travail : Ce poste fonctionne dans un environnement 24h/24 et 7j/7 nécessitant une flexibilité avec des horaires variables, incluant nuits, week-ends et jours fériés.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eNos techniciens RME sont basés sur site, afin de répondre rapidement à tout problème technique affectant nos opérations. Vous effectuerez une série de travaux de maintenance préventive planifiée sur les équipements en place sur nos sites afin de vous assurer qu’ils fonctionnent et ne présentent aucun risque de sécurité. En tant que technicien RME, vous interviendrez rapidement en cas de panne, et vous mènerez l’enquête pour détecter les pannes et les solutionner aussi vite que possible.  Il vous appartiendra également de faire des suggestions pour améliorer durablement les processus.\u003cbr/\u003eEn collaboration avec des collègues expérimentés, vous effectuerez des tâches de maintenance quotidiennes telles que la peinture et la plomberie et assurerez la liaison avec les sous-traitants externes en cas de besoin si nécessaire. Vous travaillerez en équipe afin de vous assurer que nos sites bénéficient d’une assistance 24 heures sur 24, ce qui permet à Amazon de livrer ses produits à la vitesse qui fait sa réputation. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eNotre équipe d’ingénieurs RME (Reliability Maintenance Engineering) veille à ce que nos équipements fonctionnent au mieux. Guidés par des responsables expérimentés, nous sommes une équipe à l’esprit analytique. Nos collaborateurs·trices possèdent à la fois des connaissances techniques poussées et un bon esprit d’équipe. Nous travaillons ensemble pour assurer l’entretien, le dépannage et la réparation des ressources de notre réseau mondial de centres d’expédition. Certains de nos employé·es occupent des postes à responsabilités et sont chargés de superviser l’équipe dans son travail sur des technologies passionnantes, dont certaines n’existent que chez Amazon.\u003cbr/\u003eDe l’installation de systèmes d’emballage automatisés à la supervision de la maintenance générale d’un site, en passant par la réparation d’équipements de distribution essentiels, notre équipe assure le bon fonctionnement de la plupart des éléments techniques d’Amazon. Nous veillons, par exemple, à ce que les bâtiments soient conformes à la législation, afin d’assurer la sécurité de tous et le fonctionnement à plein régime de nos sites. Les possibilités d’évolution sont nombreuses, tant au sein de l’équipe RME qu’à l’échelle d’Amazon.\u003cbr/\u003eTout ce que nous faisons vise à réduire les temps d’arrêt dans les principaux sites logistiques d’Amazon, afin que les clients reçoivent leurs commandes à temps. Nous travaillons souvent tôt ou tard pour effectuer les tâches de maintenance avec un minimum de perturbations, y compris en équipes de nuit. Si nous voyons qu’il existe une méthodologie plus aboutie pour faire les choses, nous avons les compétences nécessaires pour développer et introduire des processus nouveaux ou des technologies de pointe, comme Amazon Robotics ou notre robot de tri ultra sophistiqué.","department_cost_center":null,"description_short":"Technicien de Maintenance (F/H) Chaque jour, des millions de clients comptent sur Amazon pour recevoir leurs commandes à temps. Derrière cette promesse se cache un réseau d'automatisation sophistiqué où","display_distance":null,"id":"fbbde201-da43-4cf8-b661-7a054ac567ee","id_icims":"3177589","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3177589/technicien-de-maintenance-m-f","job_schedule_type":"full-time","location":"FR, Satolas-et-bonce","locations":["{\"normalizedStateName\":\"Auvergne-Rhone-Alpes\",\"normalizedCountryCode\":\"FRA\",\"city\":\"Satolas-et-bonce\",\"countryIso3a\":\"FRA\",\"countryIso2a\":\"FR\",\"locationNonStemming\":\"France, Satolas-et-bonce\",\"coordinates\":\"45.69358,5.12729\",\"normalizedCountyName\":\"Isère\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"France\",\"normalizedLocation\":\"Satolas-et-Bonce, Auvergne-Rhone-Alpes, FRA\",\"location\":\"FR, Satolas-et-bonce\",\"region\":\"\",\"buildingCodeList\":[\"LYS8\"],\"normalizedCityName\":\"Satolas-et-Bonce\"}"],"normalized_location":"Satolas-et-Bonce, Auvergne-Rhone-Alpes, FRA","optional_search_labels":["operations-team.reliability-maintenance-engineering-eu","ops.lander-emea-rme-reliability","ops.lander-emea-rme-technician","ops.rme-technician"],"posted_date":"February 10, 2026","preferred_qualifications":"- Certifications électriques : Habilitations électriques avec expérience en travaux d'ordre électrique et maintenance des contrôleurs moteur/variateurs\u003cbr/\u003e- Expertise en automatisation : Expérience avec systèmes Siemens (API), réseaux de terrain, robotique et systèmes automatisés de stockage/récupération\u003cbr/\u003e- Technologies de traçabilité : Expertise en configuration et maintenance de scanners de codes-barres et systèmes d'impression-application\u003cbr/\u003e- Technologie de maintenance 4.0: Utilisation et/ou exploitation des différentes technologies liées à la maintenance 4.0\u003cbr/\u003e- Leadership technique : Expérience d'encadrement de techniciens juniors avec compétences en rédaction technique pour la documentation\u003cbr/\u003e- Gestion de projets : Expérience en gestion de projet d'installations d'équipements et capacités multilingues (un atout)\u003cbr/\u003e\u003cbr/\u003eAmazon est un employeur engagé pour l'égalité des chances. Nous sommes convaincus qu'une main d'oeuvre diversifée est essentielle à notre réussite. Nous prenons nos décisions de recrutement en fonction de votre expérience et de vos compétences. Nous apprécions votre envie de découvrir, d'inventer, de simplifier et de construire. La protection de votre vie privée et la sécurité de vos données constituent depuis longtemps une priorité absolue pour Amazon. Veuillez consulter notre Politique de Confidentialité pour en savoir plus sur la façon dont nous collectons, utilisons et traitons les données personnelles de nos candidats.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":null,"title":"Technicien de Maintenance M/F","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3177589/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Studienabschluss\u003cbr/\u003e- Führungserfahrung\u003cbr/\u003e- Relevante Erfahrung in der Kommunikation mit verschiedenen Stakeholdern, einschließlich Kolleg:innen und Führungskräften\u003cbr/\u003e- Relevante Erfahrung in der Verwendung von Daten oder anekdotischer Evidenz zur Begründung von geschäftlichen Entscheidungen\u003cbr/\u003e- Fortgeschrittene Englisch- und Deutschkenntnisse in Wort und Schrift","business_category":"fulfillment-ops","city":"Contwig","company_name":"Amazon Logistik Dortmund GmbH","country_code":"DEU","description":"-- Bitte beachten Sie, dass diese Stelle in Contwig, DE angesiedelt ist --\u003cbr/\u003e\u003cbr/\u003eFür unser Logistikzentrum in Contwig suchen wir nach einem Schichtleiter:in / Abteilungsleiter:in / Teamleiter:in / Lieferkettenmanager:in (interner Titel: Area Manager). Falls Sie für die Stelle umziehen und Ihre Heimatadresse mindestens 80 km vom Standort entfernt ist, unterstützen wir Sie mit einem Umzugspaket.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eDer operative Geschäftsbereich ist das Herz von Amazon. Dieser wesentliche Teil unseres Unternehmens sorgt dafür, dass wir Bestellungen effizient versenden, damit unsere Kund:innen ihre Artikel rechtzeitig erhalten. Als Area Manager:in sorgst Sie dafür, dass alle Abläufe an Deinem Standort so reibungslos wie möglich funktionieren, damit wir die Kundennachfrage erfüllen können. Sie führst ein Team, das für die Sicherheit, Effizienz und erstklassige Qualität unserer Betriebsabläufe sorgt. Zusätzlich leitest Sie eine Reihe von Projekten in unserem gesamten Netzwerk, um die Produktivität zu fördern. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eErschaffen, Beaufsichtigen und Fördern einer Kultur der Sicherheit und des Wohlbefindens\u003cbr/\u003eAnalyse und Umsetzung von Änderungen, um fortlaufend hohe Qualität und Produktivität zu gewährleisten\u003cbr/\u003eBeaufsichtigung von Projekten zur Verschlankung von Prozessen, Optimierung der Produktivität und Verbesserung der Servicequalität für Kund:innen in Deinem Verantwortungsbereich\u003cbr/\u003eAnalyse der Schichten laut Unternehmensvorgaben und Umsetzung von Maßnahmen zur Verbesserung unserer Operational Excellence\u003cbr/\u003eZusammenarbeit mit Kolleg:innen auf Führungsebene, um Schichtverfahren zu vereinheitlichen\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eSie arbeitest im Schichtbetrieb an einem unserer Standorte und sorgst dafür, dass die dortigen Abläufe so produktiv wie möglich sind. Schwerpunkt Deiner Tätigkeit ist die Leitung und Förderung einer Sicherheitskultur sowie die Aufrechterhaltung der Qualität und der Leistungsstandards der Arbeitsschichten. Sie beaufsichtigst außerdem die Prozessverbesserungen in Deinem Bereich und organisierst die Umsetzung. Ein typischer Arbeitstag kann ganz unterschiedlich aussehen und umfasst sowohl routinemäßiges Teammanagement und tägliche Betriebsaufgaben als auch Prozessverbesserung und weitreichende operative Aufgaben für den Eventualfall. Außerdem agierst Sie als Vorbild und Mentor für neue Manager:innen.","department_cost_center":null,"description_short":"-- Bitte beachten Sie, dass diese Stelle in Contwig, DE angesiedelt ist --Für unser Logistikzentrum in Contwig suchen wir nach einem Schichtleiter:in / Abteilungsleiter:in / Teamleiter:in / Lieferkettenmanager:in","display_distance":null,"id":"0477b335-186a-410b-9525-67430c367ba1","id_icims":"3154335","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3154335/schichtleiter-in-abteilungsleiter-in-teamleiter-in-lieferkettenmanager-in-contwig-bei-zweibrucken","job_schedule_type":"full-time","location":"DE, Contwig","locations":["{\"normalizedStateName\":\"Rhineland-Palatinate\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Contwig\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, Contwig\",\"coordinates\":\"49.24825,7.42892\",\"normalizedCountyName\":\"Südwestpfalz\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Contwig, Rhineland-Palatinate, DEU\",\"location\":\"DE, Contwig\",\"region\":\"\",\"buildingCodeList\":[\"SCN4\"],\"normalizedCityName\":\"Contwig\"}","{\"normalizedStateName\":\"Saarland\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Saarland\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, SL, Saarland\",\"coordinates\":\"49.23173,6.99848\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Saarland, DEU\",\"location\":\"DE, SL, Saarland\",\"region\":\"SL\",\"buildingCodeList\":[\"OSL2\",\"OSL3\",\"OSL1\"]}","{\"normalizedStateName\":\"Rhineland-Palatinate\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Kaiserslautern\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, Kaiserslautern\",\"coordinates\":\"49.44208,7.76045\",\"normalizedCountyName\":\"Kaiserslautern (City)\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Kaiserslautern, Rhineland-Palatinate, DEU\",\"location\":\"DE, Kaiserslautern\",\"region\":\"\",\"buildingCodeList\":[\"SCN2\",\"LZQW1\",\"XSC2\"],\"normalizedCityName\":\"Kaiserslautern\"}","{\"normalizedStateName\":\"Rhineland-Palatinate\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Saarburg\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, Saarburg\",\"coordinates\":\"49.60949,6.55363\",\"normalizedCountyName\":\"Trier-Saarburg\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Saarburg, Rhineland-Palatinate, DEU\",\"location\":\"DE, Saarburg\",\"region\":\"\",\"buildingCodeList\":[\"SCN3\"],\"normalizedCityName\":\"Saarburg\"}"],"normalized_location":"Contwig, Rhineland-Palatinate, DEU","optional_search_labels":["fulfillment-and-operations.fulfillment-center-mgmt-emea"],"posted_date":"January  7, 2026","preferred_qualifications":"- Erfahrung in der Arbeit mit Lean-, Six-Sigma- und Kaizen-Methoden\u003cbr/\u003e- Erfahrung mit der Arbeit in einem anderen Logistikumfeld\u003cbr/\u003e- Erfahrung in der Arbeit mit der MS Office Suite (Word, Excel, Outlook) im beruflichen Umfeld\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":null,"title":"Schichtleiter:in / Abteilungsleiter:in / Teamleiter:in / Lieferkettenmanager:in - Contwig bei Zweibrücken","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3154335/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}