{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- You have a completed bachelor’s degree - You speak fluent English - You take ownership in your work and team and are available to work overtime during Amazon’s peak holiday season and as needed year-round - In addition, you are flexible to work on any type of assigned shift (nights, weekends, etc.). - You pride yourself in leading others; you have direct management experience and have been responsible for your employees’ performance. - You have an eye for efficiency and have experience identifying and executing process improvement initiatives.\u003cbr/\u003e- - You have a completed bachelor’s degree - You speak fluent English - You take ownership in your work and team and are available to work overtime during Amazon’s peak holiday season and as needed year-round - In addition, you are flexible to work on any type of assigned shift (nights, weekends, etc.). - You pride yourself in leading others; you have direct management experience and have been responsible for your employees’ performance. - You have an eye for efficiency and have experience identifying and executing process improvement initiatives.","business_category":"fulfillment-ops","city":"Dobroviz","company_name":"Amazon Logistic Prague s.r.o.","country_code":"CZE","description":"At Amazon we believe that every day is still day one.\r\u003cbr/\u003e  \r\u003cbr/\u003eA day to take a first step. A day to look forwards to new challenges. And today is that day for you. It's your day to be part of something great. A day to make your ideas come to life. And your day to join a company that redefines itself every day. That's the energy and passion behind Amazon. At Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright and driven people. Amazon is one of the most recognizable brand names in the world and we distribute millions of products each year to our loyal customers.\r\u003cbr/\u003e  Our overall mission is simple: We want Amazon to be the place where our customers can find, discover and buy anything online. Whatever our customers want, we will find the means to deliver it. With your help, Amazon will continue to enable people to discover new worlds. \r\u003cbr/\u003e This is your chance to make history.\r\u003cbr/\u003e  We are looking to hire Area Manager (m/f/d) to join the team and play a critical role in our BRQ2- FC in (Kojetin, CZ).\r\u003cbr/\u003e  As an Area Manager Logistics you will be responsible for one of our main departments in the distribution center - receive, stow, pick or pack. You and your team ensure that the workflow runs smoothly so that all customer wishes are met. Simultaneously you concentrate on the realization of our most important goals: safety, quality, productivity, inventory accuracy and the constant improvement of our processes. You will be required to lead, train and motivate the logistics team of 80 to 120 employees in your business unit whilst working to a number of KPIs and targets, always actively looking at ways in which to improve the warehouse operation. Although this is a supervisory position, it is still very much a hands-on role and you will be expected to be involved in the day-to-day operation of the distribution center.\r\u003cbr/\u003e\r\u003cbr/\u003eKey job responsibilities \r\u003cbr/\u003e   \r\u003cbr/\u003e     - You lead and manage a large team of associates in a      specified department within a very fast-paced and demanding environment.\u003cbr/\u003e    \r\u003cbr/\u003e     - You are continuously proactive and create a culture of      creativity within the workplace.\u003cbr/\u003e    \r\u003cbr/\u003e     - You maintain health and safety standards within area      and promote a positive health and safety culture on site.\u003cbr/\u003e    \r\u003cbr/\u003e     - You are a Subject Matter Expert on larger processes and      activities within the FC, ensuring in line with Standard Work that best      practice is shared with other distribution centers within the network.\u003cbr/\u003e    \r\u003cbr/\u003e     - You participate in continuous improvement activities      using methodologies such as Kaizen and 5s.\u003cbr/\u003e    \r\u003cbr/\u003e     - You establish collaborative relationships with      individuals from other functions.\u003cbr/\u003e    \r\u003cbr/\u003e     - You lead cross-functional teams tasked with solving      operational problems.\u003cbr/\u003e \r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003e","department_cost_center":null,"description_short":"At Amazon we believe that every day is still day one.\r  \rA day to take a first step. A day to look forwards to new challenges. And today is that day for you. It's your day to be part of something great.","display_distance":null,"id":"0dc14023-c6e0-49c0-9472-75a1a21daeb7","id_icims":"3172785","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3172785/area-manager-brq2-operations","job_schedule_type":"full-time","location":"CZ, Dobroviz","locations":["{\"normalizedStateName\":\"Středočeský kraj\",\"normalizedCountryCode\":\"CZE\",\"city\":\"Dobroviz\",\"countryIso3a\":\"CZE\",\"countryIso2a\":\"CZ\",\"locationNonStemming\":\"Czechia, Dobroviz\",\"coordinates\":\"50.11318,14.21764\",\"normalizedCountyName\":\"Praha-západ\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Czechia\",\"normalizedLocation\":\"Dobrovíz, Středočeský kraj, CZE\",\"location\":\"CZ, Dobroviz\",\"region\":\"\",\"buildingCodeList\":[\"PRG2\"],\"normalizedCityName\":\"Dobrovíz\"}"],"normalized_location":"Dobrovíz, Středočeský kraj, CZE","optional_search_labels":["fulfillment-and-operations.fulfillment-center-mgmt-emea"],"posted_date":"February  3, 2026","preferred_qualifications":"- Amazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Amazon takes your personal data protection seriously and respects EU and local data protection laws. Unless you express otherwise, by submitting your CV you authorize the hiring Amazon company to store your personal data in the electronic database maintained by Amazon Corporate LLC. In the USA or one of its affiliates for the purpose of assessing your suitability for this and future job vacancies and to pursue your recruiting process. If at any time you want your personal data to be deleted, you simply need to notify the hiring Amazon company. Amazon will not share your personal data with any third party without your prior consent. As part of your interview process with Amazon you may be asked to authorize the hiring Amazon company to separately verify your application data and personal background through a third party service provider.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":null,"title":"Area Manager, BRQ2 Operations","university_job":null,"updated_time":"1 minute","url_next_step":"https://account.amazon.com/jobs/3172785/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Speak, write, and read fluently in English\u003cbr/\u003e- Experience analyzing numerical data points\u003cbr/\u003e- Experience working with multiple groups of stakeholders","business_category":"fulfillment-ops","city":"Barcelona","company_name":"Amazon Spain Fulfillment, S.L.U. - C05","country_code":"ESP","description":"Shape the future of global e-commerce as a Process Control Specialist (PCS) at Amazon's European Central Flow Team, where you'll orchestrate millions of daily orders and innovate advanced fulfilment solutions! We’re busy revolutionizing how the world shops supporting a vast network of Fulfilment Centres (FCs) operating 24/7 worldwide. As the primary escalation point for our warehouses and the crucial link between millions of daily orders and our dedicated Amazon Associates, the PCS ensures seamless fulfilment operations.\u003cbr/\u003e\u003cbr/\u003eIn this critical position, you'll be instrumental in driving Amazon Europe's workflow planning, risk mitigation, and cost and capacity management. Collaborating directly with FC partners, you'll provide guidance, identify and rectify workflow variances, and actively manage the journey of millions of customer orders from checkout to shipment. Our comprehensive onboarding process equips you with all the necessary knowledge, while our supportive matrix structure empowers you to deliver, innovate, create, and grow. We're seeking problem-solvers with a keen eye for optimization opportunities, meticulous attention to detail, and the ability to seamlessly navigate tasks while communicating effectively across all organizational levels. Your natural curiosity will drive you to explore the intricate web of systems that power our smile-delivery machine, understanding their inter dependencies and interactions. Join us in this dynamic role and help shape the future of e-commerce fulfilment at Amazon.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Master Amazon's proprietary flow management tools and processes, becoming the go-to for seamless FC operations interface \u003cbr/\u003e• Innovate and implement metrics, conducting thorough analyses to uncover optimization opportunities, then design and champion scalable, standardized solutions\u003cbr/\u003e• Cultivate cross-functional partnerships, translating complex concepts into accessible insights for stakeholders across all organizational levels\u003cbr/\u003e• Own and influence critical performance indicators, including customer promise attainment, flow planning adherence, and site-specific KPIs\u003cbr/\u003e• Teach peers and customers with knowledge-sharing initiatives, developing and delivering impactful training programs to elevate team capabilities and operational excellence\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eIn our European Central Flow Team offices in sunny Barcelona, as a Process Control Specialist, you’ll play a crucial role in optimizing operations in our Fulfilment Centres across Europe. Here’s what you can expect:\u003cbr/\u003e\u003cbr/\u003eStart of Shift\u003cbr/\u003e• Begin your day with a shift handover, understanding the current network status, what are the forecasted volumes and capacities and any possible events that might impact these forecasts\u003cbr/\u003e• Catch-up with the teams on site (in the Fulfilment Centres) team to align on priorities review key metrics and operational highlights.\u003cbr/\u003eThroughout Your Shift\u003cbr/\u003e• Connect with operations teams across Europe in a collaborative environment.\u003cbr/\u003e• Create smart, data-driven plans using our in-house developed tools.\u003cbr/\u003e• Fine-tune staffing strategies to optimize workflow.\u003cbr/\u003e• Lead real-time decisions that keep our network flowing smoothly.\u003cbr/\u003e• Make strategic adjustments as new information comes in.\u003cbr/\u003e• Maintain clear communication with stakeholders.\u003cbr/\u003e\u003cbr/\u003eEnd of Shift\u003cbr/\u003e• Share valuable insights and report key performance metrics from your shift, highlighting potential impacts that may affect the upcoming shift.\u003cbr/\u003e• Share key updates and recommendations.\u003cbr/\u003e• Head home knowing you've made a real impact!\u003cbr/\u003eWe’re looking for Problem-Solving Excellence! Use your analytical skills to tackle challenging situations, coordinate effective solutions with our supportive team and turn unexpected challenges into opportunities for improvement. And of course, as a collaborative team, share insights and best practices! \u003cbr/\u003eYou'll get to expand your career skillset through a variety of exciting roles that go beyond day-to-day execution. From guiding processes to training colleagues, conducting in-depth analyses, and more, you'll have the opportunity to develop a diverse range of skills. This position offers a unique chance to grow professionally while making a significant impact across multiple areas of our organization.\u003cbr/\u003e\u003cbr/\u003eWhat Makes This Role Special:\u003cbr/\u003e• Supportive, inclusive and diverse team culture.\u003cbr/\u003e• Clear career progression path and access to Amazon’s internal promotions.\u003cbr/\u003e• As you develop your expertise, you'll have the opportunity to lead innovative projects and mentor your peers.\u003cbr/\u003e• Schedule options that support work-life balance. Our workdays are 8-hrs, you’ll start off in the Thursday to Monday cohort but as you gain tenure in the department, you’ll have the option to change shifts *: Monday to Friday/ Saturday to Wednesday, with Rotating shifts (6:00-14:00 / 14:00-22:00) or Permanent night shift (22:00-6:00).\u003cbr/\u003e*based on business needs\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe European Central Flow Team (ECFT), a vital component of PE, serves as the beating heart of Amazon's Fulfilment Centres (FCs). We embody the Day 1 spirit, leveraging 24/7 communication and deep expertise to drive continuous innovation, standardization, and improvement across our FC network. While our core mission revolves around capacity, risk, and workflow management, we're about so much more. Our relentless focus on real-time responsiveness and resource planning ensures that customer promises are always kept, and deliveries arrive on time, every time.\u003cbr/\u003e\u003cbr/\u003eWhy Join ECFT?\u003cbr/\u003eAt ECFT, we're not just optimizing operations – we're reinventing the future of fulfilment. We collaborate closely with multiple stakeholder teams, identifying high-impact opportunities to add value across the network. Our team pioneered FC optimization, developing a comprehensive suite of metrics and amassing millions of data points to uncover every efficiency opportunity. Integrated within FCs, we combine hard data with frontline insights to drive meaningful innovations, constantly creating new metrics, workflows, and process paths. With our extensive relationships, we can scale these innovations immediately, standardizing efforts to increase availability, boost delivery speed, reduce defects, and minimize cost-to-serve across the entire FC network. Join ECFT, and you'll be at the forefront of optimizing Amazon's global fulfilment operations, delivering smiles to millions of customers while tackling some of the most complex logistical challenges in the world.","department_cost_center":null,"description_short":"Shape the future of global e-commerce as a Process Control Specialist (PCS) at Amazon's European Central Flow Team, where you'll orchestrate millions of daily orders and innovate advanced fulfilment solutions!","display_distance":null,"id":"f40f8ae8-bdb5-4714-b0ff-38fca6aa2385","id_icims":"3152524","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3152524/process-control-specialist-logistics-analyst-european-central-flow-team-ecft","job_schedule_type":"full-time","location":"ES, Barcelona","locations":["{\"normalizedStateName\":\"Catalonia\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Barcelona\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, Barcelona\",\"coordinates\":\"41.38804,2.17001\",\"normalizedCountyName\":\"Barcelona\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Barcelona, Catalonia, ESP\",\"location\":\"ES, Barcelona\",\"region\":\"\",\"buildingCodeList\":[\"BCN1\"],\"normalizedCityName\":\"Barcelona\"}"],"normalized_location":"Barcelona, Catalonia, ESP","optional_search_labels":["hourly","ops.lander-ops-management-esp"],"posted_date":"January  5, 2026","preferred_qualifications":"- Experience communicating complex concepts clearly and persuasively to different audiences\u003cbr/\u003e- Experience recognizing a challenge and working with a variety of teams and data sources to diagnose the problem and recommend solutions\u003cbr/\u003e- Experience working independently and collaborating effectively in a remote team environment\u003cbr/\u003e- Experience working with data to drive business decisions, including advanced proficiency in Excel\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":null,"title":"Process Control Specialist/ Logistics Analyst, European Central Flow Team (ECFT)","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3152524/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- - An Associate’s Degree or related work experience\u003cbr/\u003e- - C1+ or equivalent fluency in French language\u003cbr/\u003e- - Good working knowledge (B2+) in both spoken and written English\u003cbr/\u003e- - Strong business writing skills with ability to create reports, proposals, and professional correspondence\u003cbr/\u003e- - Advanced reading comprehension with ability to analyze complex business documents\u003cbr/\u003e- - Developed analytical thinking and structured problem-solving capabilities\u003cbr/\u003e- - Strong ability to interpret and implement detailed instructions across various projects\u003cbr/\u003e- - Proficient research skills with experience gathering and synthesizing information from multiple sources\u003cbr/\u003e- - Proven attention to detail in managing complex tasks and documents","business_category":"amazon-artificial-general-intelligence","city":"Gdansk","company_name":"Amazon MLS Poland Sp. z o.o. - K69","country_code":"POL","description":"AI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment of large language models (LLMs) across all of our businesses. Come build the future of human-technology interaction with us.\u003cbr/\u003e\u003cbr/\u003eWe are looking for those candidates who just don’t think out of the box, but make the box they are in ‘Bigger’. The future is now, do you want to be a part of it? Then read on! \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Maintain and follow strict confidentiality as customer privacy is our most important tenet\u003cbr/\u003e- Work with a range of different types of data including, but not limited to: text, speech, audio, image, and video\u003cbr/\u003e- Deliver high-quality labelled data, using guidelines provided to meet our KPIs and using in-house tools and software, as part of Amazon's commitment to developing and deploying AI responsibly.\u003cbr/\u003e- Demonstrate proficiency in generating high quality human insight data across a range of modalities, inclusive of text, image video and audio. \u003cbr/\u003e- Capable of making sound judgments and logical decisions when faced with ambiguous or incomplete information while performing tasks.\u003cbr/\u003e- Eye for detail and ability to pivot from one category of requirement to another instantaneously.\u003cbr/\u003e- Demonstrate support on daily operational deliverables for multiple task types assigned to you and the team\u003cbr/\u003e- Analyze root causes, identify error patterns, and propose solutions to enhance the quality of labeling tasks and their outputs.\u003cbr/\u003e- Responsible for identifying day-to-day process and operational issues in Standard Operating Procedure, tools and suggest changes to unblock operations\u003cbr/\u003e- Demonstrate ownership in floor support to clarify internal queries during execution on need basis\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are looking for a ML Data Associate (MLDA) to undertake the task of foundational labeling functions, such as dialogue evaluation on speech, text, audio, video data.\u003cbr/\u003e\u003cbr/\u003eYour ability to concentrate, multi-task and your high attention to detail helps you deliver high-quality work as well as maintaining strict confidentiality and follow all applicable Amazon policies for securing confidential information. You will be a part of a diverse team with the shared vision of improving customers’ lives with practical, useful generative AI innovations. An inner drive, individuality, and a creative mind are extremely beneficial.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe minimum base pay salary for this position is listed below. As a total compensation company, Amazon's package may include further pay components such as performance bonuses, where applicable. Your recruiting team will share final base pay and any applicable total compensation elements depending on skills and requirements.Company discretionary, supplementary benefits apply subject to further terms, including pension plans, health insurance, life and disability insurance, business travel insurance, MultiSport card, employee discount code and program (EDC/Extras), commuter benefits where applicable, and the Employee Assistance Program (private and confidential counselling and referral service to support health and well-being).The minimum base pay for this position is PLN 7,916.66  monthly.\u003cbr/\u003e\u003cbr/\u003eWynagrodzenie podstawowe dla tego stanowiska jest wskazane poniżej. Amazon kieruje się zasadą całkowitego wynagrodzenia, w związku z czym oprócz wynagrodzenia zasadniczego mogą być przewidziane dodatkowe składniki wynagrodzenia, takie jak premie (w odpowiednich przypadkach). Zespół rekrutacyjny poinformuje Cię o ostatecznej kwocie wynagrodzenia zasadniczego oraz o wszystkich przysługujących dodatkowych składnikach wynagrodzenia, w zależności od umiejętności i wymagań.Dodatkowe świadczenia przysługują na warunkach obowiązujących w Spółce i obejmują m.in. plany emerytalne, dodatkowe ubezpieczenie zdrowotne, dodatkowe ubezpieczenie na życie, ubezpieczenie podróży służbowych, kartę MultiSport, kod rabatowy dla pracowników i program zniżek pracowniczych (EDC/Extras), dotacje dla osób dojeżdżających (w odpowiednich przypadkach) oraz Program Wsparcia Pracownika (EAP – prywatne i poufne doradztwo i wsparcie).Wynagrodzenie podstawowe dla tego stanowiska wynosi 7,916.66 PLN miesięcznie.","department_cost_center":null,"description_short":"AI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment","display_distance":null,"id":"0d82eae2-28a6-41b4-9a7d-6f57fe39a2ab","id_icims":"3175979","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Machine Learning Data Operatio","job_function_id":null,"job_path":"/en/jobs/3175979/ai-data-associate-with-french-agi-data-services","job_schedule_type":"full-time","location":"PL, Gdansk","locations":["{\"normalizedStateName\":\"Pomeranian Voivodeship\",\"normalizedCountryCode\":\"POL\",\"city\":\"Gdansk\",\"countryIso3a\":\"POL\",\"countryIso2a\":\"PL\",\"locationNonStemming\":\"Poland, Gdansk\",\"coordinates\":\"54.35311,18.65105\",\"normalizedCountyName\":\"Gdansk\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Poland\",\"normalizedLocation\":\"Gdansk, Pomeranian Voivodeship, POL\",\"location\":\"PL, Gdansk\",\"region\":\"\",\"buildingCodeList\":[\"GDN13\"],\"normalizedCityName\":\"Gdansk\"}"],"normalized_location":"Gdansk, Pomeranian Voivodeship, POL","optional_search_labels":["alexa-and-amazon-devices.team-operations-job-family","alexa-and-amazon-devices.team-administrative-support-job-family","amazon.artificial-intelligence"],"posted_date":"February 23, 2026","preferred_qualifications":"- - Bachelor’s degree in a relevant field\u003cbr/\u003e- - 2+ years of professional work experience with demonstrated task execution ability\u003cbr/\u003e- - Proven capacity to leverage open-source resources effectively for comprehensive research purposes\u003cbr/\u003e- - Ability to adapt well to fast-paced environments with changing circumstances, direction, and strategy\u003cbr/\u003e- - 2-3 years project coordination or management experience (for support functions teams)\u003cbr/\u003e- - Experience managing stakeholder relationships across departments\u003cbr/\u003e- - Advanced proficiency in Microsoft Office Suite and common business applications.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":null,"title":"AI Data Associate with French, AGI-Data Services","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3175979/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"Qualitative Requirements\u003cbr/\u003e  Ø  Graduation in any specialization from a recognized university.\u003cbr/\u003e  Ø  Excellent communication skills (written and verbal).\u003cbr/\u003e  Ø  Ability to communicate correctly and clearly with all customers\u003cbr/\u003e  Ø  Good comprehension skills – ability to clearly understand and state the issues customers present\u003cbr/\u003e  Ø  Ability to concentrate – follow customers issues without distraction to resolution\u003cbr/\u003e  Ø  Work successfully in a team environment as well as independently\u003cbr/\u003e  Ø  Familiarity with Windows XP, Microsoft Outlook, Microsoft Word and Internet Explorer\u003cbr/\u003e  Ø  Excellent typing skills\u003cbr/\u003e  Ø  Demonstrates an ability to successfully navigate websites\u003cbr/\u003e  Ø  Demonstrates a proficient knowledge of email applications","business_category":"transportation-and-logistics","city":"Virtual","company_name":"ASSPL - Telangana","country_code":"IND","description":"Job Description for L2 associates\r\u003cbr/\u003e\r\u003cbr/\u003eOverview\r\u003cbr/\u003eThe L2 associate acts as the primary interface between Amazon and our delivery partners, so to our delivery partners- you ARE  Amazon. L2 Associates are expected to identify DP concerns and work on  troubleshooting delivery partner issues and provide process improvement  suggestions.\r\u003cbr/\u003e\r\u003cbr/\u003eSummary of Responsibilities\r\u003cbr/\u003e - Effectively communicate in a clear and professional manner at all times\r\u003cbr/\u003e - Provides/ expedites prompt and efficient service to Amazon customers/ delivery partners\r\u003cbr/\u003e - Effectively manage sensitive cases by reporting up the escalation matrix\r\u003cbr/\u003e - Demonstrate excellent time-management skills \r\u003cbr/\u003e - Maintains or exceeds targeted performance metrics \r\u003cbr/\u003e - Actively seek solutions through logical reasoning and identify trends to suggest process improvements ","department_cost_center":null,"description_short":"Job Description for L2 associates\r\rOverview\rThe L2 associate acts as the primary interface between Amazon and our delivery partners, so to our delivery partners- you ARE  Amazon. L2 Associates are expected","display_distance":null,"id":"3fe415dd-0759-4615-b346-872e29c2b0d0","id_icims":"3063394","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Cust. Experience Qualit Ops","job_function_id":null,"job_path":"/en/jobs/3063394/transportation-representative-transportation-representative","job_schedule_type":"full-time","location":"IN, TS, Virtual","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Virtual\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Virtual\",\"coordinates\":\"17.3949,78.47081\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Telangana, IND\",\"location\":\"IN, TS, Virtual\",\"region\":\"TS\",\"buildingCodeList\":[\"VCC13\"]}"],"normalized_location":"Telangana, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"August 21, 2025","preferred_qualifications":"*Logistics background and Experience in similar role \r\u003cbr/\u003e* Proficient in Excel \u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-linehaul","source_system":"JobCreator","state":"TS","title":"Transportation Representative, Transportation Representative ","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3063394/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-linehaul","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Qualitative Requirements Ø Graduation in any specialization from a recognized university. Ø Excellent communication skills (written and verbal). Ø Ability to communicate correctly and clearly with all customers Ø Good comprehension skills – ability to clearly understand and state the issues customers present Ø Ability to concentrate – follow customers issues without distraction to resolution Ø Work successfully in a team environment as well as independently Ø Familiarity with Windows XP, Microsoft Outlook, Microsoft Word and Internet Explorer Ø Excellent typing skills Ø Demonstrates an ability to successfully navigate websites Ø Demonstrates a proficient knowledge of email applications","business_category":"transportation-and-logistics","city":"Virtual","company_name":"ASSPL - Telangana","country_code":"IND","description":"Job Description for L2 associates\r\u003cbr/\u003e\r\u003cbr/\u003eOverview\r\u003cbr/\u003eThe L2 associate acts as the primary interface between Amazon and our delivery partners, so to our delivery partners- you ARE  Amazon. L2 Associates are expected to identify DP concerns and work on  troubleshooting delivery partner issues and provide process improvement  suggestions.\r\u003cbr/\u003e\r\u003cbr/\u003eSummary of Responsibilities\r\u003cbr/\u003e - Effectively communicate in a clear and professional manner at all times\r\u003cbr/\u003e - Provides/ expedites prompt and efficient service to Amazon customers/ delivery partners\r\u003cbr/\u003e - Effectively manage sensitive cases by reporting up the escalation matrix\r\u003cbr/\u003e - Demonstrate excellent time-management skills \r\u003cbr/\u003e - Maintains or exceeds targeted performance metrics \r\u003cbr/\u003e - Actively seek solutions through logical reasoning and identify trends to suggest process improvements ","department_cost_center":null,"description_short":"Job Description for L2 associates\r\rOverview\rThe L2 associate acts as the primary interface between Amazon and our delivery partners, so to our delivery partners- you ARE  Amazon. L2 Associates are expected","display_distance":null,"id":"1679afba-a9b3-4810-bf77-37bc77464a57","id_icims":"3143742","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Cust. Experience Qualit Ops","job_function_id":null,"job_path":"/en/jobs/3143742/transportation-representative-transportation-representative","job_schedule_type":"full-time","location":"IN, TS, Virtual","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Virtual\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Virtual\",\"coordinates\":\"17.3949,78.47081\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Telangana, IND\",\"location\":\"IN, TS, Virtual\",\"region\":\"TS\",\"buildingCodeList\":[\"VCC13\"]}"],"normalized_location":"Telangana, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"December 16, 2025","preferred_qualifications":"- *Logistics background and Experience in similar role\u003cbr/\u003e- * Proficient in Excel Our inclusive culture empowers Amazonians to deliver the best results for our customers\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-linehaul","source_system":"JobCreator","state":"TS","title":"Transportation Representative, Transportation Representative ","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3143742/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-linehaul","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bonne maîtrise de la suite MS Office (Word, Excel, Outlook) dans un environnement professionnel\u003cbr/\u003e- Vous possédez le diplôme du baccalauréat\u003cbr/\u003e- Vous possédez une expérience en matière de direction d'équipe dans un environnement opérationnel ou logistique dynamique orienté processus.\u003cbr/\u003e- Parfaite maîtrise du français, à l’oral et à l’écrit","business_category":"fulfillment-ops","city":"Satolas-et-bonce","company_name":"Amazon France Logistique SAS","country_code":"FRA","description":"Vous ne voyez pas d’inconvénient à travailler avec des équipes et des horaires flexibles (Horaires de nuits et de weekend inclus).\u003cbr/\u003e\u003cbr/\u003eLes opérations sont au cœur de toutes les activités d’Amazon. L’efficacité de nos fonctions opérationnelles nous permet de traiter nos commandes et d’expédier les articles à nos clients en temps voulu. En tant que superviseur des opérations, vous verrez comment nous assurons le fonctionnement de nos différentes fonctions opérationnelles et vous jouerez un rôle dans leur bon déroulement.\u003cbr/\u003eVous serez le premier point de contact des membres de l’équipe pendant leur service et les aiderez à suivre les processus mis en place par vos supérieurs. Il s’agit d’un rôle de terrain, qui vous permettra d’acquérir de l’expérience dans l’utilisation des outils et des systèmes essentiels au succès de nos opérations.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Mesurer et contrôler les flux de travail, suivre les performances sur site et fournir aux responsables de terrain les données nécessaires et relatives aux postes/équipes afin de nous aider à atteindre notre objectif d’excellence opérationnelle\u003cbr/\u003e- Soutenir et former les collaborateurs pour qu’ils donnent le meilleur d’eux-mêmes et les superviser dans leurs tâches quotidiennes\u003cbr/\u003e- Soutenir le responsable d’équipe/de secteur pour améliorer les processus, cultiver un environnement de travail sûr et accroître l’engagement des collaborateurs\u003cbr/\u003e- Travailler avec d’autres services pour trouver des solutions aux problèmes fréquents ou aux besoins en matière d’appui opérationnel dans les secteurs clés\u003cbr/\u003e- Analyse les données pour identifier les solutions qui nous permettront d’optimiser la sécurité, la qualité et la productivité\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eEn tant que superviseur des opérations, vous serez basé·e sur l’un de nos sites opérationnels. Vous aiderez votre chef d’équipe/de secteur à mettre en pratique le plan de travail de l’équipe. Vous participerez aux réunions d’avant-poste avec votre équipe. Vous vous assurerez que chacun respecte les règles de sécurité et les processus de qualité en place et effectue les tâches selon le degré de priorité de chacune.\u003cbr/\u003eVous ferez remonter les problèmes à votre supérieur, mais vous serez parfois la personne la plus gradée de l’équipe et vous donnerez aux collaborateurs les instructions dont ils ont besoin pour mener à bien leurs tâches. À d’autres moments, vous aiderez votre chef d’équipe/de secteur à planifier les rotations d’équipes afin d’avoir un personnel suffisamment nombreux pendant les périodes de pointe.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eNotre centre de traitement des commandes (Customer Fulfilment, ou CF), est l’endroit où tout a commencé pour Amazon. D’une modeste équipe de libraires, le CF est devenu une équipe mondiale spécialisée qui traite plus de 1,5 million de commandes chaque jour. L’équipe CF est le moteur de notre entreprise et ses efforts nous ont permis de nous tourner vers de nouvelles régions et de proposer de nouveaux services. Avec l’aide des technologies émergentes, nous sommes en permanence à la recherche de solutions nouvelles pour proposer une gamme de produits plus large et de meilleure qualité, livrée rapidement et à un prix abordable.\u003cbr/\u003eL’équipe CF est le premier maillon de la chaîne qui permet aux clients d’obtenir les produits à la vitesse qui fait notre réputation. Nous sommes basés dans les centres de traitement des commandes, qui sont au cœur du réseau des opérations d’Amazon. Nos centres sont parfois appelés le « premier kilomètre », car c’est là que la plupart des colis Amazon commencent leur voyage. Nous aidons à gérer les stocks dynamiques et à faciliter les livraisons rapides, 24 heures sur 24, 7 jours sur 7.\u003cbr/\u003eNos centres de traitement des commandes regroupent des profils variés et les opportunités y sont nombreuses. Certains membres de l’équipe travaillent avec des produits physiques, tandis que d’autres analysent des données. Ensemble, nous travaillons pour que chacun puisse prendre des décisions éclairées dans toute l’entreprise.  ","department_cost_center":null,"description_short":"Vous ne voyez pas d’inconvénient à travailler avec des équipes et des horaires flexibles (Horaires de nuits et de weekend inclus).Les opérations sont au cœur de toutes les activités d’Amazon. L’efficacité","display_distance":null,"id":"180b8035-f6c6-4dca-a4e5-7929b3778839","id_icims":"3131494","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3131494/superviseur-euse-logistique-h-f-x","job_schedule_type":"full-time","location":"FR, Satolas-et-bonce","locations":["{\"normalizedStateName\":\"Auvergne-Rhone-Alpes\",\"normalizedCountryCode\":\"FRA\",\"city\":\"Satolas-et-bonce\",\"countryIso3a\":\"FRA\",\"countryIso2a\":\"FR\",\"locationNonStemming\":\"France, Satolas-et-bonce\",\"coordinates\":\"45.69358,5.12729\",\"normalizedCountyName\":\"Isère\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"France\",\"normalizedLocation\":\"Satolas-et-Bonce, Auvergne-Rhone-Alpes, FRA\",\"location\":\"FR, Satolas-et-bonce\",\"region\":\"\",\"buildingCodeList\":[\"LYS8\",\"LYS4\",\"XOR2\"],\"normalizedCityName\":\"Satolas-et-Bonce\"}"],"normalized_location":"Satolas-et-Bonce, Auvergne-Rhone-Alpes, FRA","optional_search_labels":[],"posted_date":"November 24, 2025","preferred_qualifications":"- Expérience dans la gestion des parties prenantes, y compris l’établissement et le maintien de relations professionnelles\u003cbr/\u003e- Expérience dans un environnement opérationnel, tel que la logistique, le commerce de détail, l’hôtellerie ou le service client\u003cbr/\u003e- Expérience préalable dans l’analyse de données pour identifier les problèmes\u003cbr/\u003e- Maîtrise de l’anglais\u003cbr/\u003e\u003cbr/\u003eAmazon est un employeur engagé pour l'égalité des chances. Nous sommes convaincus qu'une main d'oeuvre diversifée est essentielle à notre réussite. Nous prenons nos décisions de recrutement en fonction de votre expérience et de vos compétences. Nous apprécions votre envie de découvrir, d'inventer, de simplifier et de construire. La protection de votre vie privée et la sécurité de vos données constituent depuis longtemps une priorité absolue pour Amazon. Veuillez consulter notre Politique de Confidentialité pour en savoir plus sur la façon dont nous collectons, utilisons et traitons les données personnelles de nos candidats.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-tal3nt-priority","source_system":"JobCreator","state":null,"title":"Superviseur/euse Logistique (H/F/X)","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3131494/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-tal3nt-priority","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of customer-facing environment, warehousing, logistics or manufacturing experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Speak, write, and read fluently in English\u003cbr/\u003e- Experience with Microsoft Office products and applications","business_category":"transportation-and-logistics","city":"Agra","company_name":"ASSPL - Uttar Pradesh - D37","country_code":"IND","description":"At Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Team leads for our transportation team. Amazon is one of the most recognizable brand names in the world and we distribute millions of products each year to our loyal customers\u003cbr/\u003e\u003cbr/\u003eWe're seeking a Team lead for our Delivery center. In this role you will be responsible for shift operations at our DCs and support the DC manager in performance management and driving the operational plan.\u003cbr/\u003e\u003cbr/\u003eTitle:Team Lead\u003cbr/\u003eLocation: New Delhi\u003cbr/\u003e\u003cbr/\u003eEssential Functions\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e- Working with the Center manager to ensure smooth functioning of the operations\u003cbr/\u003e-Executing the delivery process from delivery station to customer address\u003cbr/\u003e- Ensure enough bandwidth in delivery team to ensure peak time delivery management\u003cbr/\u003e- Continuously improve the delivery process and attain a sustained level of delivery performance improvement\u003cbr/\u003e\u003cbr/\u003eEssential Skills\u003cbr/\u003e- Strong execution skills, Action oriented, go getter\u003cbr/\u003e- Resourceful to identify the way to get things done using limited resources\u003cbr/\u003e- Ability to work under pressure situations\u003cbr/\u003e- Ability to work and perform station operations independently.\u003cbr/\u003e\u003cbr/\u003e- Ability to work in ambiguous situations and to come out with solutions as per the situations faced. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAnalytical Skills: Effectively analyses and interpret information, identifying \u0026 validating the key facts, including reviewing alternatives to determine advantages and associated risks.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eInteract with multiple stakeholders and get things done. Regular show of ownership and bias for action.","department_cost_center":null,"description_short":"At Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Team leads for our transportation team.","display_distance":null,"id":"efb9f030-32e0-4d26-84dc-1262d7036107","id_icims":"3171376","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3171376/team-lead-team-lead","job_schedule_type":"full-time","location":"IN, UP, Agra","locations":["{\"normalizedStateName\":\"Uttar Pradesh\",\"normalizedCountryCode\":\"IND\",\"city\":\"Agra\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, UP, Agra\",\"coordinates\":\"27.19223,78.00005\",\"normalizedCountyName\":\"Agra\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Agra, Uttar Pradesh, IND\",\"location\":\"IN, UP, Agra\",\"region\":\"UP\",\"buildingCodeList\":[\"QNCP\",\"PNAM\",\"PUPB\",\"AGR251\",\"UAGA\",\"UPA40\",\"AGR40\",\"FIXP\",\"FAGC\",\"KNLX\",\"UAGC\",\"FAGA\"],\"normalizedCityName\":\"Agra\"}"],"normalized_location":"Agra, Uttar Pradesh, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"February  2, 2026","preferred_qualifications":"- Experience with Excel\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-fulfillment-transportation","source_system":"JobCreator","state":"UP","title":"Team Lead , Team Lead","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3171376/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-transportation","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- - An Associate’s Degree or related work experience\u003cbr/\u003e- - C1+ or equivalent fluency in French language\u003cbr/\u003e- - Good working knowledge (B2+) in both spoken and written English\u003cbr/\u003e- - Strong business writing skills with ability to create reports, proposals, and professional correspondence\u003cbr/\u003e- - Advanced reading comprehension with ability to analyze complex business documents\u003cbr/\u003e- - Developed analytical thinking and structured problem-solving capabilities\u003cbr/\u003e- - Strong ability to interpret and implement detailed instructions across various projects\u003cbr/\u003e- - Proficient research skills with experience gathering and synthesizing information from multiple sources\u003cbr/\u003e- - Proven attention to detail in managing complex tasks and documents","business_category":"amazon-artificial-general-intelligence","city":"Gdansk","company_name":"Amazon MLS Poland Sp. z o.o. - K69","country_code":"POL","description":"AI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment of large language models (LLMs) across all of our businesses. Come build the future of human-technology interaction with us.\u003cbr/\u003e\u003cbr/\u003eWe are looking for those candidates who just don’t think out of the box, but make the box they are in ‘Bigger’. The future is now, do you want to be a part of it? Then read on! \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Maintain and follow strict confidentiality as customer privacy is our most important tenet\u003cbr/\u003e- Work with a range of different types of data including, but not limited to: text, speech, audio, image, and video\u003cbr/\u003e- Deliver high-quality labelled data, using guidelines provided to meet our KPIs and using in-house tools and software, as part of Amazon's commitment to developing and deploying AI responsibly.\u003cbr/\u003e- Demonstrate proficiency in generating high quality human insight data across a range of modalities, inclusive of text, image video and audio. \u003cbr/\u003e- Capable of making sound judgments and logical decisions when faced with ambiguous or incomplete information while performing tasks.\u003cbr/\u003e- Eye for detail and ability to pivot from one category of requirement to another instantaneously.\u003cbr/\u003e- Demonstrate support on daily operational deliverables for multiple task types assigned to you and the team\u003cbr/\u003e- Analyze root causes, identify error patterns, and propose solutions to enhance the quality of labeling tasks and their outputs.\u003cbr/\u003e- Responsible for identifying day-to-day process and operational issues in Standard Operating Procedure, tools and suggest changes to unblock operations\u003cbr/\u003e- Demonstrate ownership in floor support to clarify internal queries during execution on need basis\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are looking for a ML Data Associate (MLDA) to undertake the task of foundational labeling functions, such as dialogue evaluation on speech, text, audio, video data.\u003cbr/\u003e\u003cbr/\u003eYour ability to concentrate, multi-task and your high attention to detail helps you deliver high-quality work as well as maintaining strict confidentiality and follow all applicable Amazon policies for securing confidential information. You will be a part of a diverse team with the shared vision of improving customers’ lives with practical, useful generative AI innovations. An inner drive, individuality, and a creative mind are extremely beneficial.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe minimum base pay salary for this position is listed below. As a total compensation company, Amazon's package may include further pay components such as performance bonuses, where applicable. Your recruiting team will share final base pay and any applicable total compensation elements depending on skills and requirements.Company discretionary, supplementary benefits apply subject to further terms, including pension plans, health insurance, life and disability insurance, business travel insurance, MultiSport card, employee discount code and program (EDC/Extras), commuter benefits where applicable, and the Employee Assistance Program (private and confidential counselling and referral service to support health and well-being).The minimum base pay for this position is PLN 7,916.66  monthly.\u003cbr/\u003e\u003cbr/\u003eWynagrodzenie podstawowe dla tego stanowiska jest wskazane poniżej. Amazon kieruje się zasadą całkowitego wynagrodzenia, w związku z czym oprócz wynagrodzenia zasadniczego mogą być przewidziane dodatkowe składniki wynagrodzenia, takie jak premie (w odpowiednich przypadkach). Zespół rekrutacyjny poinformuje Cię o ostatecznej kwocie wynagrodzenia zasadniczego oraz o wszystkich przysługujących dodatkowych składnikach wynagrodzenia, w zależności od umiejętności i wymagań.Dodatkowe świadczenia przysługują na warunkach obowiązujących w Spółce i obejmują m.in. plany emerytalne, dodatkowe ubezpieczenie zdrowotne, dodatkowe ubezpieczenie na życie, ubezpieczenie podróży służbowych, kartę MultiSport, kod rabatowy dla pracowników i program zniżek pracowniczych (EDC/Extras), dotacje dla osób dojeżdżających (w odpowiednich przypadkach) oraz Program Wsparcia Pracownika (EAP – prywatne i poufne doradztwo i wsparcie).Wynagrodzenie podstawowe dla tego stanowiska wynosi 7,916.66 PLN miesięcznie.","department_cost_center":null,"description_short":"AI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment","display_distance":null,"id":"965ea4b8-ed9f-41df-8386-ebb17e285e3b","id_icims":"3175992","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Machine Learning Data Operatio","job_function_id":null,"job_path":"/en/jobs/3175992/ai-data-associate-with-french-agi-data-services","job_schedule_type":"full-time","location":"PL, Gdansk","locations":["{\"normalizedStateName\":\"Pomeranian Voivodeship\",\"normalizedCountryCode\":\"POL\",\"city\":\"Gdansk\",\"countryIso3a\":\"POL\",\"countryIso2a\":\"PL\",\"locationNonStemming\":\"Poland, Gdansk\",\"coordinates\":\"54.35311,18.65105\",\"normalizedCountyName\":\"Gdansk\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Poland\",\"normalizedLocation\":\"Gdansk, Pomeranian Voivodeship, POL\",\"location\":\"PL, Gdansk\",\"region\":\"\",\"buildingCodeList\":[\"GDN13\"],\"normalizedCityName\":\"Gdansk\"}"],"normalized_location":"Gdansk, Pomeranian Voivodeship, POL","optional_search_labels":["alexa-and-amazon-devices.team-operations-job-family","alexa-and-amazon-devices.team-administrative-support-job-family","amazon.artificial-intelligence"],"posted_date":"February 23, 2026","preferred_qualifications":"- - Bachelor’s degree in a relevant field\u003cbr/\u003e- - 2+ years of professional work experience with demonstrated task execution ability\u003cbr/\u003e- - Proven capacity to leverage open-source resources effectively for comprehensive research purposes\u003cbr/\u003e- - Ability to adapt well to fast-paced environments with changing circumstances, direction, and strategy\u003cbr/\u003e- - 2-3 years project coordination or management experience (for support functions teams)\u003cbr/\u003e- - Experience managing stakeholder relationships across departments\u003cbr/\u003e- - Advanced proficiency in Microsoft Office Suite and common business applications.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":null,"title":"AI Data Associate with French, AGI-Data Services","university_job":null,"updated_time":"23 minutes","url_next_step":"https://account.amazon.com/jobs/3175992/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor’s Degree in an IT related field, or at proven equivalent experience working in the Internet peering and embedded caching space, with strong understanding of the negotiation strategies involved in working with ISPs from all around the world.\u003cbr/\u003e- Technical experience with CDN architecture and embedded caching, and solid understanding of related topics in the data center space. Knowledge of IP peering ecosystems.\u003cbr/\u003e- Effective writing and communications skills.\u003cbr/\u003e- Bachelor’s Degree in an IT related field, or at least five years of equivalent experience working in the Internet peering and embedded caching space, with strong understanding of the negotiation strategies involved in working with ISPs from all around the world.","business_category":"entertainment","city":"Stockholm","company_name":"Amazon Corporate Services Sweden AB","country_code":"SWE","description":"Prime Video is changing the way millions of customers consume and interact with video content. Customers can gain unlimited access to over 40,000 movies and TV episodes through a Prime subscription, rent or purchase from over 180,000 titles, subscribe to incremental Channel (Paramount+, HBO Max, etc.) based content, and get exclusive access to premium live sports such as the UEFA Champions League (UCL), NBA and the NFL. If you are looking for an opportunity that will deliver significant positive impact to Prime Video’s growth for years to come, like the idea of your work playing out on a global scale, with all the complexity, nuance, and challenge of doing business with companies in virtually every country in the world, and prefer to work in a dynamic environment where innovating on behalf of our customers is at the heart of everything we do, please read on.\u003cbr/\u003e\u003cbr/\u003eThe Video Delivery Scaling team is looking for a Technical Business Developer to lead our video delivery expansion and scale in Europe, to support our future growth for live events and VOD (video on demand). As the leader, you will help define and set strategies to 1) procure and scale video delivery capacity in new and existing markets, 2) deploying solutions to successfully deliver exclusive live events at scale, including low latency UDP based live streaming, and 3) drive new strategic initiatives by partnering with leading companies across a variety of market segments to support the launch and growth of Prime Video's business. Some of the scaling and development activities include: 1) partnering with AWS, CDNs, ISPs, and mobile carriers to establish the right mix of network capacity and embedded cache deployments, 2) driving solutions that will improve playback performance for the long tail of customers streaming in remote locales and poor performing networks, 3) creating opportunities with regional carriers to more efficiently deliver live streams at scale with lower latency and better quality (e.g. multicast/broadcast), and 4) collaborating with a variety of internal teams including business development, legal, and deployment, to successfully implement strategic growth plans in new markets.\u003cbr/\u003e\u003cbr/\u003eThe successful candidate will become a trusted advisor and a subject matter expert on regional capacity planning and delivery scaling/build out for Prime Video. The successful candidate will have a strong understanding of CDN, familiar with peering and transit negotiations, ideally with personal experience managing business relationships and completing or overseeing similar negotiations in prior roles. The ideal candidate will have worked for a large-scale content provider or a Content Delivery Network (CDN) in a similar role. The ideal candidate will have experience and knowledge of the inner workings and critical components of a successful embedded caching program and video delivery technology.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eEngage with CDN and ISP partners, establish relationships, negotiate contracts, ensure our customers have the bandwidth they need to view the content they want whenever and wherever they are.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eIn a typical day, you will be working with third party partners to understand how much bandwidth they support, the quality of the bandwidth, and using that information build strategies to deliver to customers video streams of the highest quality.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eVideo Delivery Scaling team supports all Prime Video streaming, including VOD, channels, and live events for every country, where Prime Video is present.","department_cost_center":null,"description_short":"Prime Video is changing the way millions of customers consume and interact with video content. Customers can gain unlimited access to over 40,000 movies and TV episodes through a Prime subscription, rent","display_distance":null,"id":"4cefe9d8-d233-489b-b6f2-a43d90a40de2","id_icims":"3137950","is_intern":null,"is_manager":null,"job_category":"Business \u0026 Merchant Development","job_family":"Business/Merchant Development","job_function_id":null,"job_path":"/en/jobs/3137950/tech-business-developer-video-delivery-scaling","job_schedule_type":"full-time","location":"SE, Stockholm","locations":["{\"normalizedStateName\":\"Stockholm County\",\"normalizedCountryCode\":\"SWE\",\"city\":\"Stockholm\",\"countryIso3a\":\"SWE\",\"countryIso2a\":\"SE\",\"locationNonStemming\":\"Sweden, Stockholm\",\"coordinates\":\"59.33257,18.06683\",\"normalizedCountyName\":\"Stockholm\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Sweden\",\"normalizedLocation\":\"Stockholm, Stockholm County, SWE\",\"location\":\"SE, Stockholm\",\"region\":\"\",\"buildingCodeList\":[\"ARN15\"],\"normalizedCityName\":\"Stockholm\"}"],"normalized_location":"Stockholm, Stockholm County, SWE","optional_search_labels":["primevideo.team-stockholm"],"posted_date":"December  5, 2025","preferred_qualifications":"- Master's degree or MBA Exceptional interpersonal and communication skills.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"entertainment.team-primevideo","source_system":"JobCreator","state":null,"title":"Tech Business Developer, Video Delivery Scaling","university_job":null,"updated_time":"28 minutes","url_next_step":"https://account.amazon.com/jobs/3137950/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-primevideo","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience of hands-on media in planning, buying, or strategy with experience of Theatrical media planning and/or buying required.\u003cbr/\u003e- Deep understanding of media planning principles, audience strategy, and performance measurement.\u003cbr/\u003e- Strong digital fluency and proven partnership with platforms such as Meta, Google, and TikTok.\u003cbr/\u003e- Proven track record in end-to-end campaign development and execution.\u003cbr/\u003e- Experience managing media across multiple international markets.\u003cbr/\u003e- Excellent stakeholder management, communication, and presentation skills.\u003cbr/\u003e- Strong organizational skills and the ability to manage multiple campaigns simultaneously.\u003cbr/\u003e- Strong financial acumen and a proven track record of managing multiple budgets.\u003cbr/\u003e- Proven experience in film or media industries","business_category":"entertainment","city":"London","company_name":"Amazon Digital UK Limited","country_code":"GBR","description":"Amazon MGM Studios is seeking a dynamic and driven International Media Manager to join the London-based International Theatrical Marketing team. This role will play a key part in developing and executing innovative media campaigns that amplify Amazon’s MGM theatrical releases across global markets.\u003cbr/\u003e\u003cbr/\u003eReporting to the International Theatrical Media Lead, you will be responsible for delivering media excellence across both centrally managed campaigns and market-led initiatives. You will partner closely with international marketing, creative, and distribution teams to ensure our campaigns reach audiences in culturally relevant and effective ways.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eCampaign Management\u003cbr/\u003e•\tTranslate international marketing strategy into actionable audience and media strategies for both local markets and central activations.\u003cbr/\u003e•\tPlan and coordinate central biddable media buys and integrated media partnerships.\u003cbr/\u003e•\tDevelop innovative, first-to-market media initiatives in collaboration with local teams.\u003cbr/\u003e•\tEnsure all digital campaigns are informed by robust audience data and insights.\u003cbr/\u003e•\tManage the creation and delivery of timely, actionable trailer campaign reporting for internal stakeholders and local markets.\u003cbr/\u003e•\tLead the agency briefing process — crafting clear, detailed briefs and assessing responses to ensure strategic alignment and creative excellence.\u003cbr/\u003e•\tCapture and distribute campaign learnings, ensuring insights drive continuous improvement across markets.\u003cbr/\u003eMedia Strategy\u003cbr/\u003e•\tIn partnership with the media agency, develop and oversee a digital learning agenda focused on advancing campaign effectiveness.\u003cbr/\u003e•\tBuild and maintain strong relationships with global media partners (e.g., Meta, Google, TikTok) to leverage new opportunities and innovation.\u003cbr/\u003e•\tEnsure local teams have access to best-in-market media rates and tools.\u003cbr/\u003e•\tCollaborate closely with creative, publicity, and distribution teams to align media strategies with broader marketing efforts.\u003cbr/\u003eLocal Market Leadership\u003cbr/\u003e•\tGuide local teams to align media plans with central strategy and ensure best-in-class tactics are adopted for efficiency and impact.\u003cbr/\u003e•\tFoster collaboration across markets, encouraging knowledge sharing and the adoption of innovative practices.\u003cbr/\u003e\u003cbr/\u003eFinancial management\u003cbr/\u003e•\tManage the communication and reporting for local territory campaign budgets. Ensure local market media plans align with assigned budget levels.\u003cbr/\u003e•\tCommunicate budget changes to all stakeholders in and accurate and timely manner.\u003cbr/\u003e•\tWork with the finance team to ensure a smooth process for campaign budget reconciliation per title.\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon MGM Studios is seeking a dynamic and driven International Media Manager to join the London-based International Theatrical Marketing team. This role will play a key part in developing and executing","display_distance":null,"id":"89194160-cdaf-42e5-829f-69e3837f96c9","id_icims":"3146206","is_intern":null,"is_manager":null,"job_category":"Marketing \u0026 PR","job_family":"Marketing","job_function_id":null,"job_path":"/en/jobs/3146206/international-media-manager-amazon-mgm-theatrical-marketing-amazon-mgm-studios","job_schedule_type":"full-time","location":"GB, London","locations":["{\"normalizedStateName\":\"England\",\"normalizedCountryCode\":\"GBR\",\"city\":\"London\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, London\",\"coordinates\":\"51.50643,-0.12719\",\"normalizedCountyName\":\"London\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"London, England, GBR\",\"location\":\"GB, London\",\"region\":\"\",\"buildingCodeList\":[\"LHR16\"],\"normalizedCityName\":\"London\"}"],"normalized_location":"London, England, GBR","optional_search_labels":[],"posted_date":"December 19, 2025","preferred_qualifications":"- Global market experience and cultural fluency\u003cbr/\u003e- Attention to detail with the ability to identify and communicate clear direction when dealing with ambiguity\u003cbr/\u003e- Demonstrated creative thinking and a test-and-learn mindset.\u003cbr/\u003e- Passion for movies, entertainment, and emerging media trends.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"entertainment.team-amazonstudios","source_system":"JobCreator","state":null,"title":"International Media Manager – Amazon MGM Theatrical Marketing , Amazon MGM Studios","university_job":null,"updated_time":"28 minutes","url_next_step":"https://account.amazon.com/jobs/3146206/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazonstudios","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}