{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Knowledge of data modeling and data pipeline design\u003cbr/\u003e- Experience with data querying or modeling with SQL\u003cbr/\u003e- Knowledge of BI analytics, reporting or visualization tools like Tableau, AWS QuickSight, Cognos or other third-party tools","business_category":"entertainment","city":"Culver City","company_name":"Amazon Studios LLC","country_code":"USA","description":"Amazon Studios Data Operations connects the dots across fragmented data and workflows to enable reliable, actionable insights. Sitting within Studio Strategy \u0026 Operations, our team supports visibility and continuity across Production, Post, Consumer Insights, and Finance through trusted reporting and analytics.\u003cbr/\u003e\u003cbr/\u003eWe’re seeking a Business Intelligence Engineer who is excited to build, maintain, and improve reports and dashboards that Studio teams rely on every day. This role focuses on turning operational data into clear, consistent metrics and visualizations, partnering closely with business stakeholders to ensure reporting is accurate, understandable, and useful.\u003cbr/\u003e\u003cbr/\u003eThis role is ideal for candidates with strong analytical instincts who enjoy working with data, dashboards, and stakeholders, and who want to grow their technical depth over time.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Build and maintain dashboards and recurring reports that support Studio operational and financial workflows.\u003cbr/\u003e • Write and maintain SQL queries to support reporting, metric calculation, and data validation.\u003cbr/\u003e • Partner with business stakeholders to understand reporting needs and translate them into clear, actionable visualizations.\u003cbr/\u003e • Perform routine data quality checks to ensure accuracy, consistency, and timeliness of reports.\u003cbr/\u003e • Maintain documentation for metrics, definitions, and dashboards to support clarity and reuse.\u003cbr/\u003e • Support ongoing improvements to reporting workflows by identifying opportunities to simplify, standardize, or automate manual processes.\u003cbr/\u003e • Work with senior BI and Data Engineers to align reports to agreed-upon source data and definitions.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eStudio Data Operations is the connective layer of Amazon Studios. We manage the systems, standards, and data flows that create continuity across Production, Post, and Finance. Our focus is not just on moving data, it’s on creating meaning, quality, and trust in how Studios measures and manages its operations.","department_cost_center":null,"description_short":"Amazon Studios Data Operations connects the dots across fragmented data and workflows to enable reliable, actionable insights. Sitting within Studio Strategy \u0026 Operations, our team supports visibility","display_distance":null,"id":"d16d38e0-842c-4db3-8baf-f16adabe21db","id_icims":"3166352","is_intern":null,"is_manager":null,"job_category":"Data Science","job_family":"Business Intel Engineer","job_function_id":null,"job_path":"/en/jobs/3166352/business-intelligence-engineer-studio-data-operations","job_schedule_type":"full-time","location":"US, CA, Culver City","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Culver City\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Culver City\",\"coordinates\":\"34.02202,-118.39589\",\"normalizedCountyName\":\"Los Angeles\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Culver City, California, USA\",\"location\":\"US, CA, Culver City\",\"region\":\"CA\",\"buildingCodeList\":[\"LAX22\"],\"normalizedCityName\":\"Culver City\"}"],"normalized_location":"Culver City, California, USA","optional_search_labels":["primevideo.team-studios-tech","primevideo.team-tech"],"posted_date":"January 26, 2026","preferred_qualifications":"- Experience with relational and star schema data modeling concepts\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Culver City - 82,300.00 - 144,000.00 USD annually","primary_search_label":"entertainment.team-amazonstudios","source_system":"JobCreator","state":"CA","title":"Business Intelligence Engineer, Studio Data Operations","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3166352/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazonstudios","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of technical infrastructure management experience\u003cbr/\u003e- Knowledge of best practices and emerging technologies, related to infrastructure (i.e. network, data center, hardware, software)\u003cbr/\u003e- Experience with varying scenarios of infrastructure builds","business_category":"aws","city":"Seattle","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"The AWS Infrastructure Capacity Planning Team is searching for a passionate and talented Regional Capacity Planner to drive capacity planning across multiple AWS regions, resulting in a single plan of record for each region. You will have goals to improve infrastructure utilization as well as availability. You will work across the AWS Organization to align demand with data center capacity and coordinate execution planning across AWS.\u003cbr/\u003e\u003cbr/\u003eIf you love being at the forefront of industry growth and development, applying your people skills and your analytical skills to drive insight into the business and improve the quality of key inputs, then this is a spot for you. This is a high impact role offering an opportunity work cross-functionally on lasting solutions that impact the long-term future of AWS.  \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tPlan data center capacity for the 0-24-month horizon.\u003cbr/\u003e•\tPlan for rack retirements and migrations based on infra needs.\u003cbr/\u003e•\tPlan for network requirements per site for order plan and network reserve.\u003cbr/\u003e•\tPlan and initiate dedicated spine builds, intercept builds and resize per the recommended planning values.\u003cbr/\u003e•\tIntercept builds for emerging customer requirements and communicate changes per established process.\u003cbr/\u003e•\tResolve racks on hold blockers to meet the org goals.\u003cbr/\u003e•\tResolve blocked order blockers to meet the org goals.\u003cbr/\u003e•\tResolve position usability defects to meet the org goals.\u003cbr/\u003e•\tInitiate and manage projects to meet power usage targets.\u003cbr/\u003e•\tPerform customer impact analysis as needed.\u003cbr/\u003e•\tWork with supply chain and service owners to prioritize rack landings in constrained regions. \u003cbr/\u003e•\tPrepare and present mitigated views in weekly review meetings.\u003cbr/\u003e•\tDeep dive and communicate supply changes (WoW, MoM).\u003cbr/\u003e•\tPerform position inventory and build updates as needed.\u003cbr/\u003e•\tWork with brick planners and network TPMs on resolving position constraints.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003e*Why AWS*\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003e*Diverse Experiences*\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003e*Work/Life Balance*\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003e*Inclusive Team Culture*\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003e*Mentorship and Career Growth*\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003e#DCPD_Delivery","department_cost_center":null,"description_short":"The AWS Infrastructure Capacity Planning Team is searching for a passionate and talented Regional Capacity Planner to drive capacity planning across multiple AWS regions, resulting in a single plan of","display_distance":null,"id":"e0520f5f-5b6e-4fa0-a9a2-4ef06266baab","id_icims":"3169842","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Tech Infrastructure Prgrm Mgmt","job_function_id":null,"job_path":"/en/jobs/3169842/technical-program-manager-capacity-delivery-planning-capacity-delivery-planning","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA84\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"January 29, 2026","preferred_qualifications":"- 3+ years of driving end to end delivery, and communicating results to senior leadership experience\u003cbr/\u003e- 3+ years of driving process improvements experience\u003cbr/\u003e- Experience in stakeholder management, dealing with multiple stakeholders at varied levels of the organization\u003cbr/\u003e- Experience building processes, project management, and schedules\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 127,100.00 - 171,900.00 USD annually","primary_search_label":"aws.team-program-management-primary","source_system":"JobCreator","state":"WA","title":"Technical Program Manager, Capacity Delivery Planning, Capacity Delivery Planning","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3169842/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-program-management-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"1)Bachelor’s degree\u003cbr/\u003e2)12-24 months of work experience.\u003cbr/\u003e3)Good communication skills - Trans Ops Representative will be facilitating flow of information between external\u003cbr/\u003e4)Proficiency in Excel (pivot tables, vlookups)\u003cbr/\u003e5)Demonstrated ability to work in a team in a very dynamic environment","business_category":"transportation-and-logistics","city":"Virtual","company_name":"ASSPL - Telangana","country_code":"IND","description":"Job Description for Transportation Representative – NOC\u003cbr/\u003eNOC Overview\u003cbr/\u003e\u003cbr/\u003eNOC (Network Operation Center) is the central command and control center for ‘Transportation Execution’ across the Amazon Supply Chain network supporting multiple geographies like NA, India and EU. It ensures hassle free, timely pick-up and delivery of freight from vendors to Amazon fulfillment centers (FC) and from Amazon FCs to carrier hubs. In case of any exceptions, NOC steps in to resolve the issue and keeps all the stakeholders informed on the proceedings. Along with this tactical problem solving NOC is also charged with understanding trends in network exceptions and then automating processes or proposing process changes to streamline operations. This second aspect involves network monitoring and significant analysis of network data.\u003cbr/\u003eOverall, NOC plays a critical role in ensuring the smooth functioning of Amazon transportation and thereby has a direct impact on Amazon’s ability to serve its customers on time.\u003cbr/\u003e\u003cbr/\u003ePurview of a Trans Ops Representative:\u003cbr/\u003eA Trans Ops Representative at NOC facilitates flow of information between different stakeholders (Trans Carriers/Hubs/Warehouses) and resolves any potential issues that impacts customer experience and business continuity. Trans Ops Specialist at NOC works across two verticals – Inbound and Outbound operations.\u003cbr/\u003eInbound Operations deals with Vendor/Carrier/FC relationship, ensuring that the freight is picked-up on time and is delivered at FC as per the given appointment. Trans Ops Specialist on Inbound addresses any potential issues occurring during the lifecycle of pick-up to delivery.\u003cbr/\u003eOutbound Operations deals with FC/Carrier/Carrier Hub relationship, ensuring that the truck leaves the FC in order to delivery customer orders as per promise. Trans Ops Specialist on Outbound addresses any potential issues occurring during the lifecycle of freight leaving the FC and reaching customer premises.\u003cbr/\u003e\u003cbr/\u003eA Trans Ops Representative provides timely resolution to the issue in hand by researching and querying internal tools and by taking real-time decisions. An ideal candidate should be able to understand the requirements/be able to analyze data and notice trends and be able to drive Customer Experience without compromising on time. The candidate should have the basic understanding of Logistics and should be able to communicate clearly in the written and oral form. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eTrans Ops Representative should be able to ideate process improvements and should have the zeal to drive them to conclusion.\u003cbr/\u003eResponsibilities include, but are not limited to:\u003cbr/\u003e\u003cbr/\u003e· Communication with external customers (Carriers, Vendors/Suppliers) and internal customers (Retail, Finance, Software Support, Fulfillment Centers)\u003cbr/\u003e· Must be able to systematically escalate problems or variance in the information and data to the relevant owners and teams and follow through on the resolutions to ensure they are delivered.\u003cbr/\u003e· Excellent communication, both verbal and written as one may be required to create a narrative outlining weekly findings and the variances to goals, and present these finding in a review forum.\u003cbr/\u003e\u003cbr/\u003e    Providing real-time customer experience by working in 24*7 operating environment.","department_cost_center":null,"description_short":"Job Description for Transportation Representative – NOCNOC OverviewNOC (Network Operation Center) is the central command and control center for ‘Transportation Execution’ across the Amazon Supply Chain","display_distance":null,"id":"7886320b-6c26-48ed-a795-76e53d08674b","id_icims":"3155976","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Cust. Experience Qualit Ops","job_function_id":null,"job_path":"/en/jobs/3155976/transportation-representative-gsf-sg-co","job_schedule_type":"full-time","location":"IN, TS, Virtual","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Virtual\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Virtual\",\"coordinates\":\"17.3949,78.47081\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Telangana, IND\",\"location\":\"IN, TS, Virtual\",\"region\":\"TS\",\"buildingCodeList\":[\"VCC13\"]}"],"normalized_location":"Telangana, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"January  9, 2026","preferred_qualifications":"Graduate with Bachelor’s degree Good logical skills Good communication skills - Trans Ops Representative will be facilitating flow of information between different teams \u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-supply-chain","source_system":"JobCreator","state":"TS","title":"Transportation Representative, GSF SG CO","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3155976/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-supply-chain","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience working with fast-moving, high-performance teams and driving innovative solutions tailored to unique business environments\u003cbr/\u003e- Experience using Salesforce or other CRM tools\u003cbr/\u003e- Experience communicating to senior management and customers verbally and in writing\u003cbr/\u003e- 3+ years of digital ad sales as an individual contributor experience","business_category":"advertising","city":"New York","company_name":"Amazon Advertising LLC","country_code":"USA","description":"Amazon Ads is dedicated to driving measurable outcomes for brand advertisers, agencies, authors, and entrepreneurs. Our ad solutions—including sponsored, display, video, and custom ads—leverage Amazon’s innovations and insights to find, attract, and engage intended audiences throughout their daily journeys. With a range of flexible pricing and buying models, including self-service, managed service, and programmatic ad buying, these solutions help businesses build brand awareness, increase product sales, and more. We start with the customer and work backwards in everything we do, including advertising. If you’re interested in joining a rapidly growing team working to build a unique, world-class advertising group with a relentless focus on the customer, you’ve come to the right place.\u003cbr/\u003e\u003cbr/\u003eAmazon Ads is seeking an Account Executive to join our video-focused new business team within our Large Customer Sales organization. This is an exciting time to join a new team in a role with broad scope and the potential to make real impact. This role will be focused on driving net-new business with a prospecting mindset. As the first line of communication with prospective brands, ideal candidates will have a strong understanding of the sales process, excel at researching leads, nurturing new relationships, pitch presentations, proposal generations, and driving video investment.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Generate advertising revenue by calling on ad agencies, new prospects, and consulting advertisers on Streaming TV and other brand-building advertising solutions.\u003cbr/\u003e* Be a true hunter, hungry to uncover opportunity and connect it with a value adding solution.\u003cbr/\u003e* Generate a pipeline and influence buying decisions to drive revenue from new advertisers.\u003cbr/\u003e* Establish credible relationships with ad agencies and advertiser decision makers.\u003cbr/\u003e* Map account strategies, align resources, and match video products that best serve an advertiser’s needs.\u003cbr/\u003e* Hold sales calls with existing and prospective clients, delivering superior customer service.\u003cbr/\u003e* Prepare and deliver customized presentations to clients.","department_cost_center":null,"description_short":"Amazon Ads is dedicated to driving measurable outcomes for brand advertisers, agencies, authors, and entrepreneurs. Our ad solutions—including sponsored, display, video, and custom ads—leverage Amazon’s","display_distance":null,"id":"41fb0981-1fd5-48cf-8e39-54bc17438cd7","id_icims":"3105120","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Ad Sales","job_function_id":null,"job_path":"/en/jobs/3105120/account-executive-lcs-acquisition","job_schedule_type":"full-time","location":"US, NY, New York","locations":["{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK19\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"New York, New York, USA","optional_search_labels":[],"posted_date":"October  9, 2025","preferred_qualifications":"- Experience working effectively across cross-functional teams and partnering well with people at all levels within an organization\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $80,200/year in our lowest geographic market up to $171,500/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"advertising.team-amazon-ads","source_system":"JobCreator","state":"NY","title":"Account Executive, LCS Acquisition","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3105120/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-ads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 4+ years of Information Technology (IT) experience, or Bachelor's degree in computer science, engineering, mathematics or equivalent\u003cbr/\u003e- 2+ years of people management experience\u003cbr/\u003e- 2+ years of operations and on-call support for data center facilities, mission critical plants, or production facilities experience","business_category":"aws","city":"Boardman","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services (AIS) owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe successful candidate will be operationally responsible for a Data Center. Some high-level responsibilities include:\u003cbr/\u003e- Prioritize and assign trouble tickets to data center technicians and operators\u003cbr/\u003e- Manage the performance of a diverse team(s) of data center operation professionals with varying skills across different locations\u003cbr/\u003e- Developing Career Paths for the employees and to make updates in our internal tools.\u003cbr/\u003e- Recruit and train data technicians to ensure appropriate staffing levels\u003cbr/\u003e- Ensure effective and efficient management of day to day data center operations including queue management, 7/24 shift arrangement and hardware logistics\u003cbr/\u003e- Fast learn or act as the subject matter expert across all aspects in data center operations\u003cbr/\u003e- Ensure all operational KPIs and metrics are being measured and met\u003cbr/\u003e- Inspire and guide improvement in team process, technology innovation and automation\u003cbr/\u003e- Manage Large Scale Events (outages) and act as the call leader\u003cbr/\u003e- Manage and improve the work-flows and through-put for data centers operations\u003cbr/\u003e- Recommend, document, and oversee policies and procedures to meet industry best practices and to meet required SLAs \u003cbr/\u003e - Maintain the on-call schedule coordinating absence and vacations\u003cbr/\u003e- Be passionate about the quality and quantity of services being provided, and continuously strive to improve our Customer Experience\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAmazon Web Services (AWS) is a fast paced technology company and a leader in the world of data centers. The position will help ensure overall availability and reliability to meet or exceed defined service levels of data center operations. We are currently expanding our infrastructure management team and are looking for technology managers with experience in people management, strong technical understanding and the drive and vision to take AWS Data Center Operations to the next level. \u003cbr/\u003e\u003cbr/\u003eThe successful candidate will have experience creating/devising strategies, mentoring people in all levels, sponsoring projects and proposing technical solutions. This position involves leading teams in hardware and network diagnostics followed by physical repair and includes participation in an on-call rotation. All candidates should be willing to work both independently and managing their teams effectively. Work prioritization, organizational skills, effective communication, and the ability to react quickly are critical to being successful. In addition to strong knowledge in Data Centers, hardware and network repair, candidates will create documentation, innovate solutions, participate in site-level project work, and fix complex problems within the Data Center Space. This team works in an environment that operates 24/7.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Infrastructure Services (AIS) owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data","display_distance":null,"id":"bf249386-3505-4489-8df3-a0d276f3ec22","id_icims":"3121775","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3121775/data-center-it-operations-manager-dcc-communities","job_schedule_type":"full-time","location":"US, OR, Boardman","locations":["{\"normalizedStateName\":\"Oregon\",\"normalizedCountryCode\":\"USA\",\"city\":\"Boardman\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OR, Boardman\",\"coordinates\":\"45.83987,-119.70238\",\"normalizedCountyName\":\"Morrow\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Boardman, Oregon, USA\",\"location\":\"US, OR, Boardman\",\"region\":\"OR\",\"buildingCodeList\":[\"PDX56\"],\"normalizedCityName\":\"Boardman\"}"],"normalized_location":"Boardman, Oregon, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"November  5, 2025","preferred_qualifications":"- Experience in Linux systems administration and/or development\u003cbr/\u003e- Knowledge of network design and layout as well as low voltage (copper/ fiber) cabling\u003cbr/\u003e- Experience in computer architecture, or experience with general troubleshooting/debugging of hardware\u003cbr/\u003e- Experience writing and publishing technical documents or equivalent\u003cbr/\u003e- Experience previously in program or project management\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, OR, Boardman - 78,400.00 - 137,300.00 USD annually","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"OR","title":"Data Center IT Operations Manager, DCC Communities ","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3121775/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of data center engineering or operations experience\u003cbr/\u003e- 4+ years of experience managing people in a technical environment. \"","business_category":"aws","city":"Sparks","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"As a Data Center Manager in Amazon, you will get to manage the world’s largest Cloud Computing Infrastructure. We encounter interesting, challenging \u0026 complex problems every day, being a technical manager in Amazon means that you can innovate to solve these issues and help drive Operations Excellence in all areas of your role.\u003cbr/\u003e\u003cbr/\u003eYou will be a proven manager with experience managing teams of high performers. You will have the ability to refine and develop processes to optimize operational excellence in every area of your role. You will be able to drive performance levels to achieve the pace we build and operate our Data Centers at. You will have previous experience in Data Centers, either building or managing (or both) along with exposure to developing great relationships with both internal teams and external vendors.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Managing and developing teams of engineers, providing both technical and leadership expertise and ensuring highest levels of performance.\u003cbr/\u003e- Maintaining existing Data Centers\u003cbr/\u003e- Helping build and bring online new Data Centers\u003cbr/\u003e- Constantly improving all our processes and procedures. We believe there is nothing we cannot improve\u003cbr/\u003e- Assisting \u0026 managing relationships with external vendors \u0026 contractors\u003cbr/\u003e- Liaising with internal teams \u0026 management groups\u003cbr/\u003e- Ensuring we adhere to and exceed local Health \u0026 Safety standards in all our Data Centers\u003cbr/\u003e- Creating and maintaining metrics on all aspects of our Data Centers and utilizing those metrics to drive positive changes\u003cbr/\u003e- Assisting in implementing service methodologies including incident management, problem management, change management, capacity management, etc.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.","department_cost_center":null,"description_short":"As a Data Center Manager in Amazon, you will get to manage the world’s largest Cloud Computing Infrastructure. We encounter interesting, challenging \u0026 complex problems every day, being a technical manager","display_distance":null,"id":"51a0cc54-caac-4290-9d53-ca01ac26f8f0","id_icims":"3155184","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3155184/data-center-manager","job_schedule_type":"full-time","location":"US, NV, Sparks","locations":["{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sparks\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, Sparks\",\"coordinates\":\"39.54115,-119.74832\",\"normalizedCountyName\":\"Washoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sparks, Nevada, USA\",\"location\":\"US, NV, Sparks\",\"region\":\"NV\",\"buildingCodeList\":[\"RNO100\"],\"normalizedCityName\":\"Sparks\"}"],"normalized_location":"Sparks, Nevada, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"January  8, 2026","preferred_qualifications":"- 2+ years of data center experience\u003cbr/\u003e- Behavioral interviewing and hiring experience\u003cbr/\u003e- Experience in technical writing in a relevant field\u003cbr/\u003e- Experience contributing to the definition and implementation of automation opportunities within an operations environment\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends. \"\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NV, Sparks - 107,700.00 - 188,500.00 USD annually","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"NV","title":"Data Center Manager","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3155184/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience managing a technical team\u003cbr/\u003e- A Bachelor's degree or 4+ years of professional or military experience in an IT related field.\u003cbr/\u003e- 2+ years of experience with Networking, or Computer hardware.","business_category":"aws","city":"Mesa","company_name":"Amazon Data Services, Inc. - A19","country_code":"USA","description":"As a Data Center Manager in Amazon, you will get to manage the world’s largest Cloud Computing Infrastructure. We encounter interesting, challenging \u0026 complex problems every day, being a technical manager in Amazon means that you can innovate to solve these issues and help drive Operations Excellence in all areas of your role.\u003cbr/\u003e\u003cbr/\u003eYou will be a proven manager with experience managing teams of high performers. You will have the ability to refine and develop processes to optimize operational excellence in every area of your role. You will be able to drive performance levels to achieve the pace we build and operate our Data Centers at. You will have previous experience in Data Centers, either building or managing (or both) along with exposure to developing great relationships with both internal teams and external vendors.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eManaging and developing teams of engineers, providing both technical and leadership expertise and ensuring highest levels of performance.\u003cbr/\u003e\u003cbr/\u003eMaintaining existing Data Centers\u003cbr/\u003e\u003cbr/\u003eHelping build and bring online new Data Centers\u003cbr/\u003e\u003cbr/\u003eConstantly improving all our processes and procedures. We believe there is nothing we cannot improve\u003cbr/\u003e\u003cbr/\u003eAssisting \u0026 managing relationships with external vendors \u0026 contractors\u003cbr/\u003e\u003cbr/\u003eLiaising with internal teams \u0026 management groups\u003cbr/\u003e\u003cbr/\u003eEnsuring we adhere to and exceed local Health \u0026 Safety standards in all our Data Centers\u003cbr/\u003e\u003cbr/\u003eCreating and maintaining metrics on all aspects of our Data Centers and utilizing those metrics to drive positive changes\u003cbr/\u003e\u003cbr/\u003eAssisting in implementing service methodologies including incident management, problem management, change management, capacity management, etc.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eA day in the life\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"As a Data Center Manager in Amazon, you will get to manage the world’s largest Cloud Computing Infrastructure. We encounter interesting, challenging \u0026 complex problems every day, being a technical manager","display_distance":null,"id":"5f76f670-21e8-401a-9c8a-9c887061adf7","id_icims":"3118048","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3118048/dco-manager-ii","job_schedule_type":"full-time","location":"US, AZ, Mesa","locations":["{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Mesa\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Mesa\",\"coordinates\":\"33.41704,-111.83146\",\"normalizedCountyName\":\"Maricopa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Mesa, Arizona, USA\",\"location\":\"US, AZ, Mesa\",\"region\":\"AZ\",\"buildingCodeList\":[\"PHX53\"],\"normalizedCityName\":\"Mesa\"}"],"normalized_location":"Mesa, Arizona, USA","optional_search_labels":[],"posted_date":"October 29, 2025","preferred_qualifications":"- 2+ years of previous Data Center Management experience.\u003cbr/\u003e- Effective communication and decision making skills\u003cbr/\u003e- Behavioral interviewing and hiring experience\u003cbr/\u003e- Formal project management certifications (Prince2, PMP, AGILE)\u003cbr/\u003e- Experience or Knowledge of AWS products: EC2, EBS, S3 and infrastructure and system redundancy (Power feeds, ATS, Server Hardware, RAID, Network Connectivity)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, AZ, Mesa - 107,700.00 - 188,500.00 USD annually","primary_search_label":"aws.team-aws-cloud-management","source_system":"JobCreator","state":"AZ","title":"DCO Manager II","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3118048/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-aws-cloud-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 4+ years of technical team management experience\u003cbr/\u003e- 4+ years of experience in a data center technology role and/or 4 + years of knowledge with Networking or Computer hardware.","business_category":"aws","city":"Sparks","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"As a Data Center Manager in Amazon, you will get to manage the world’s largest Cloud Computing Infrastructure. We encounter interesting, challenging \u0026 complex problems every day, being a technical manager in Amazon means that you can innovate to solve these issues and help drive Operations Excellence in all areas of your role.\u003cbr/\u003e\u003cbr/\u003eYou will be a proven manager with experience managing teams of high performers. You will have the ability to refine and develop processes to optimize operational excellence in every area of your role. You will be able to drive performance levels to achieve the pace we build and operate our Data Centers at. You will have previous experience in Data Centers, either building or managing (or both) along with exposure to developing great relationships with both internal teams and external vendors.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Managing and developing teams of engineers, providing both technical and leadership expertise and ensuring highest levels of performance.\u003cbr/\u003e- Maintaining existing Data Centers\u003cbr/\u003e- Helping build and bring online new Data Centers\u003cbr/\u003e- Constantly improving all our processes and procedures. We believe there is nothing we cannot improve\u003cbr/\u003e- Assisting \u0026 managing relationships with external vendors \u0026 contractors\u003cbr/\u003e- Liaising with internal teams \u0026 management groups\u003cbr/\u003e- Ensuring we adhere to and exceed local Health \u0026 Safety standards in all our Data Centers\u003cbr/\u003e- Creating and maintaining metrics on all aspects of our Data Centers and utilizing those metrics to drive positive changes\u003cbr/\u003e- Assisting in implementing service methodologies including incident management, problem management, change management, capacity management, etc.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.","department_cost_center":null,"description_short":"As a Data Center Manager in Amazon, you will get to manage the world’s largest Cloud Computing Infrastructure. We encounter interesting, challenging \u0026 complex problems every day, being a technical manager","display_distance":null,"id":"d95e2271-2fd5-49e9-a73b-444bc620d645","id_icims":"3155967","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3155967/data-center-manager","job_schedule_type":"full-time","location":"US, NV, Sparks","locations":["{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sparks\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, Sparks\",\"coordinates\":\"39.54115,-119.74832\",\"normalizedCountyName\":\"Washoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sparks, Nevada, USA\",\"location\":\"US, NV, Sparks\",\"region\":\"NV\",\"buildingCodeList\":[\"RNO100\"],\"normalizedCityName\":\"Sparks\"}"],"normalized_location":"Sparks, Nevada, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"January  9, 2026","preferred_qualifications":"- 2+ years of data center experience\u003cbr/\u003e- Behavioral interviewing and hiring experience\u003cbr/\u003e- Experience in technical writing in a relevant field\u003cbr/\u003e- Experience contributing to the definition and implementation of automation opportunities within an operations environment\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NV, Sparks - 107,700.00 - 188,500.00 USD annually","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"NV","title":"Data Center Manager","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3155967/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 4+ years of building machine learning models for business application experience\u003cbr/\u003e- PhD, or Master's degree and 3+ years of applied research experience\u003cbr/\u003e- Experience programming in Java, C++, Python or related language\u003cbr/\u003e- Experience with neural deep learning methods and machine learning\u003cbr/\u003e- 4+ years of applied research experience","business_category":"selling-partner-services","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Are you passionate about applying machine learning and advanced statistical techniques to protect one of the world's largest online marketplaces? Do you want to be at the forefront of developing innovative solutions that safeguard Amazon's customers and legitimate sellers while ensuring a fair and trusted shopping experience? Do you thrive in a collaborative environment where diverse perspectives drive breakthrough solutions?\u003cbr/\u003e\u003cbr/\u003eIf yes, we invite you to join the Amazon Risk Intelligence Science Team. We're seeking an exceptional scientist who can revolutionize how we protect our marketplace through intelligent automation. As a key member of our team, you'll develop and deploy state-of-the-art machine learning systems that analyze millions of seller interactions daily, ensuring the integrity and trustworthiness of Amazon's marketplace while scaling our operations to new heights. Your work will directly impact the safety and security of the shopping experience for hundreds of millions of customers worldwide, while supporting the growth of honest entrepreneurs and businesses.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Use machine learning and statistical techniques to create scalable abuse detection solutions that identify fraudulent seller behavior, account takeovers, and marketplace manipulation schemes\u003cbr/\u003e\u003cbr/\u003e• Innovate with the latest GenAI technology to build highly automated solutions for efficient seller verification, transaction monitoring, and risk assessment\u003cbr/\u003e\u003cbr/\u003e• Design, develop and deploy end-to-end machine learning solutions in the Amazon production environment to prevent and detect sophisticated abuse patterns across the marketplace\u003cbr/\u003e\u003cbr/\u003e• Learn, explore and experiment with the latest machine learning advancements to protect customer trust and maintain marketplace integrity while supporting legitimate selling partners\u003cbr/\u003e\u003cbr/\u003e• Collaborate with cross-functional teams to develop comprehensive risk models that can adapt to evolving abuse patterns and emerging threats\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eYou'll be working closely with business partners and engineering teams to create end-to-end scalable machine learning solutions that address real-world problems. You will build scalable, efficient, and automated processes for large-scale data analyses, model development, model validation, and model implementation.\u003cbr/\u003e\u003cbr/\u003eYou will also be providing clear and compelling reports for your solutions and contributing to the ongoing innovation and knowledge-sharing that are central to the team's success.","department_cost_center":null,"description_short":"Are you passionate about applying machine learning and advanced statistical techniques to protect one of the world's largest online marketplaces? Do you want to be at the forefront of developing innovative","display_distance":null,"id":"dd40dafb-1abf-4ae1-b361-29db6e115100","id_icims":"3134314","is_intern":null,"is_manager":null,"job_category":"Research Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3134314/sr-applied-scientist-amazon-selling-partner-trust-store-integrity-science","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA76\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"December  1, 2025","preferred_qualifications":"- Experience with modeling tools such as R, scikit-learn, Spark MLLib, MxNet, Tensorflow, numpy, scipy etc.\u003cbr/\u003e- Experience with large scale distributed systems such as Hadoop, Spark etc.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 167,100.00 - 226,100.00 USD annually","primary_search_label":"selling-partner-services.no-team-listed","source_system":"JobCreator","state":"WA","title":"Sr. Applied Scientist, Amazon Selling Partner Trust \u0026 Store Integrity Science","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3134314/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 3+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 3+ years of software development engineer or related occupational experience\u003cbr/\u003e- 3+ years of Object Oriented Design experience\u003cbr/\u003e- 3+ years of designing and developing large-scale, multi-tiered, multi-threaded, embedded or distributed software applications, tools, systems, and services using: C#, C++, Java, or Perl experience\u003cbr/\u003e- Bachelor's degree or foreign equivalent in Computer Science, Engineering, Mathematics, or a related field\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Project Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the capacity, flexibility, and performance to serve a wide range of customers, from individual households to schools, hospitals, businesses, government agencies, and other organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003e In this role, you will develop software for the Leo Customer Terminal embedded systems engineering team. You will be responsible for the design, implementation, deployment and operations of the functions for Leo Customer Terminals.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Development and testing with embedded Linux\u003cbr/\u003e* Develop embedded software functions for Customer Terminal devices within the Project Leo system\u003cbr/\u003e*Develop embedded software utilizing Rust, C++, C \u003cbr/\u003e*Participate in all phases of SDLC: requirements,  design, coding, test, deployment and production system \u003cbr/\u003e*Development of software in a secure compute environment  \u003cbr/\u003e*State machine design and analysis\u003cbr/\u003e*Support Customer Terminal deployments operations and  debugging on production systems\u003cbr/\u003e*Technical writing of design specifications \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs part of our software engineering team, you will design, implement and debug software used to test and debug embedded software for Leo Customer Terminal platforms in R\u0026D and commercial operation. You will work in a collaborative environment with teams in Leo Customer Terminal hardware development, software development and operations. You need to be flexible and responsive to fast changing priorities and issues. You will work on Customer Terminal issues on production system platforms.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Leo Customer Terminal Software Team develops and supports the devices that connect Leo subscribers to the Leo network. We provide software for the Leo Customer Terminal platform, applications and underlying Linux system. We work hand in hand with hardware engineering, product, and operations teams to deliver commercial grade services for our Leo subscribers.","department_cost_center":null,"description_short":"Project Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with","display_distance":null,"id":"5697043e-f6a3-40c6-8b7c-459fc312f65c","id_icims":"3156503","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3156503/embedded-software-engineer-project-leo-customer-terminals","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA143\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":[],"posted_date":"January  9, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Redmond - 143,700.00 - 194,400.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Embedded Software Engineer, Project Leo Customer Terminals","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3156503/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}