{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Experience with computer hardware troubleshooting and repair\u003cbr/\u003e- Speak, write, and read fluently in English\u003cbr/\u003e- Completed apprenticeship s an electronics technician/IT specialist or equivalent training or job-related experience","business_category":"aws","city":"Frankfurt","company_name":"A100 ROW GmbH","country_code":"DEU","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eWe are looking for Data Center Technicians to join our expanding Infrastructure Operations team. Data Center Technicians are the primary resolver and troubleshoot and solve a range of data center infrastructure issues including, but not limited to: hardware, fiber, networking, and related problems.\u003cbr/\u003e\u003cbr/\u003eYou will be part of the Data Center Operations (DCO) team, overseeing the operation and maintenance of the IT infrastructure and hardware for data centers in AWS Cloud regions. You will become the primary resolver for your support team, and gain troubleshooting skills on different hardware and software cases. You will be able to troubleshoot and solve most infrastructure issues and engage other appropriate solutions groups on more complex problems to drive solutions.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eSAFETY\u003cbr/\u003e- Follow and maintain the highest safety standards and diligently encourage a world-class safety culture. Own the safety initiatives and projects to foster a strong safety culture.\u003cbr/\u003e\u003cbr/\u003eDATA CENTER OPERATIONS (DCO)\u003cbr/\u003eThis position involves:\u003cbr/\u003e- Diagnosing hardware and network problems followed by physical repairs\u003cbr/\u003e- Troubleshooting events within internal Service Level Agreements (SLAs)\u003cbr/\u003e- Performing root cause analysis of equipment failures\u003cbr/\u003e- Manual handling and lifting of equipment may be required (weight limits in accordance with regulations)\u003cbr/\u003e- Working rotating shifts (morning/late/night) as well as weekends to maintain the 24/7 data center environment\u003cbr/\u003e- On-call rotation reaction to off-duty emergency calls\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAWS Benefits:\u003cbr/\u003e- A permanent contract with Amazon Web Services. Professional growth opportunities: chance to participate in various training courses and seminars offered by AWS and external partners.\u003cbr/\u003e- Amazon Employee Discount\u003cbr/\u003e- Pension Plan, Life and disability insurance\u003cbr/\u003e- 24/7 Employee Assistance Program (EAP) to help you navigate through work-life experiences, and provide you with the resources to support you and your family’s health and well-being.\u003cbr/\u003e- Language course\u003cbr/\u003e- Commuter benefits\u003cbr/\u003e- An international working environment\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"c75fb524-0f53-4b83-a128-86de0182e3fe","id_icims":"3148386","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3148386/it-specialist-data-center-technician-data-center-operations","job_schedule_type":"full-time","location":"DE, HE, Frankfurt","locations":["{\"normalizedStateName\":\"Hesse\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Frankfurt\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, HE, Frankfurt\",\"coordinates\":\"50.11208,8.68341\",\"normalizedCountyName\":\"Frankfurt\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Frankfurt, Hesse, DEU\",\"location\":\"DE, HE, Frankfurt\",\"region\":\"HE\",\"buildingCodeList\":[\"FRA033\"],\"normalizedCityName\":\"Frankfurt\"}"],"normalized_location":"Frankfurt, Hesse, DEU","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"December 23, 2025","preferred_qualifications":"- Experience dealing effectively with customers during problem resolution and operating efficiently under pressure\u003cbr/\u003e- Bachelor's degree in Information Technology or Computer Science\u003cbr/\u003e- Basic knowledge of Linux and experience with network protocols\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"HE","title":"IT Specialist (Data Center Technician), Data Center Operations","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3148386/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of cloud architecture, designing, implementing cloud solutions; as well as cloud architecture and solution implementation experience.\u003cbr/\u003e- Bachelor's degree in Computer Science, Engineering, related field, or equivalent experience.\u003cbr/\u003e- 4+ years of deep technical experience in the pharmaceutical clinical development domain, with proficiency in clinical trial processes (study planning, conduct, closeout), clinical data standards (CDISC SDTM/ADaM), regulatory submissions (eCTD), and understanding of how agentic AI and GenAI solutions transform clinical operations and accelerate drug development timelines.\u003cbr/\u003e- Experience managing and delivering large-scale enterprise IT projects for pharmaceutical companies, including hands-on experience with clinical development systems (CTMS, EDC, eTMF), clinical data management workflows, and IT compliance requirements (GxP, FDA 21 CFR Part 11, HIPAA, GDPR, SOX).","business_category":"aws","city":"Zurich","company_name":"AWS EMEA SARL (Switzerland Branch)","country_code":"CHE","description":"The Amazon Web Services Healthcare and Life Sciences (HCLS) Professional Services (ProServe) team is seeking an experienced Clinical ProServe Cloud Architect (PCA) to join our team in Europe. In this role, you'll work directly with pharmaceutical and life sciences customers, including senior technology and business leaders, to understand their business objectives and translate them into innovative cloud and AI solutions that drive meaningful impact in pharmaceutical innovation. \u003cbr/\u003e\u003cbr/\u003eAs a PCA, you'll be responsible for creating and leading solution designs to address customer business outcomes (CBO) in the pharmaceutical domain. Operating as the conduit between ProServe Account Executives and our Shared Delivery Teams (SDT), you'll ensure proposed solutions are realistic, achievable, and optimized to maximize CBOs. You'll lead cloud modernization and AI transformation initiatives, designing scalable AWS solutions that address complex clinical development challenges including clinical trial management, clinical data operations, regulatory submissions, and study lifecycle optimization from protocol design through database lock. Your experience in designing technical solutions within the pharmaceutical sector will equip you to architect complex, scalable, and secure solutions tailored to meet specific customer needs, translating technical concepts into business value. Your success will be linked to impacting SOW signings and successful solution implementations that achieve CBOs while exceeding customer satisfaction (CSAT) expectations. \u003cbr/\u003e\u003cbr/\u003eAs a trusted technical advisor, you'll provide guidance on industry trends, emerging technologies, and agentic AI applications specific to pharma. You'll collaborate with expert teams including our Gen AI Innovation Center, Industry Sales, and Product teams to bring leading-edge innovation to customers. As a technical SME, you'll share knowledge within the organization through mentoring, training, and creating reusable tools such as demos, accelerators, and white papers. \u003cbr/\u003e\u003cbr/\u003eJob 10044\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Partner with customers on industry trends and emerging technologies, particularly agentic AI applications in clinical trial automation, clinical data standardization (CDISC SDTM/ADaM), electronic data capture (EDC), and clinical trial management systems (CTMS). \u003cbr/\u003e- Design scalable, secure AWS solutions that deliver measurable customer business outcomes across the clinical development lifecycle. \u003cbr/\u003e- Provide technical guidance during sales and implementation phases, focusing on pharmaceutical domain challenges including clinical data management, regulatory submissions (eCTD), study conduct optimization, and GxP compliance. \u003cbr/\u003e- Collaborate with Account Executives and Delivery Teams to ensure successful solution implementation. \u003cbr/\u003e- Work with AWS experts and external partners to accelerate innovation. \u003cbr/\u003e- Share knowledge through coaching, demos, accelerators, and technical documentation. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences - AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job below, we encourage candidates to apply. If your career is just starting, hasn't followed a traditional path, or includes alternative experiences, don't let it stop you from applying. \u003cbr/\u003e \u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world's most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating - that's why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e \u003cbr/\u003eInclusive Team Culture - Here at AWS, it's in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. \u003cbr/\u003e \u003cbr/\u003eMentorship \u0026 Career Growth - We're continuously raising our performance bar as we strive to become Earth's Best Employer. That's why you'll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e \u003cbr/\u003eWork/Life Balance - We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there nothing we can’t achieve in the cloud. ","department_cost_center":null,"description_short":"The Amazon Web Services Healthcare and Life Sciences (HCLS) Professional Services (ProServe) team is seeking an experienced Clinical ProServe Cloud Architect (PCA) to join our team in Europe. In this role,","display_distance":null,"id":"ae2a6f2d-b2c0-4502-8cac-c929856ff067","id_icims":"3168104","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Professional Services","job_function_id":null,"job_path":"/en/jobs/3168104/senior-proserve-cloud-architect-healthcare-and-life-sciences-hcls-hcls-awsi-sales","job_schedule_type":"full-time","location":"CH, ZH, Zurich","locations":["{\"normalizedStateName\":\"Zurich\",\"normalizedCountryCode\":\"CHE\",\"city\":\"Zurich\",\"countryIso3a\":\"CHE\",\"countryIso2a\":\"CH\",\"locationNonStemming\":\"Switzerland, ZH, Zurich\",\"coordinates\":\"47.37918,8.54236\",\"normalizedCountyName\":\"Zurich\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Switzerland\",\"normalizedLocation\":\"Zurich, Zurich, CHE\",\"location\":\"CH, ZH, Zurich\",\"region\":\"ZH\",\"buildingCodeList\":[\"ZRH15\"],\"normalizedCityName\":\"Zurich\"}"],"normalized_location":"Zurich, Zurich, CHE","optional_search_labels":[],"posted_date":"January 27, 2026","preferred_qualifications":"- Experience architecting enterprise-scale clinical data platforms with proficiency in multi-agent orchestration frameworks, clinical data integration patterns (API-based, batch ETL, real-time streaming), and cloud-native data lake/lakehouse architectures, demonstrating ability to articulate how agentic AI transforms clinical operations through intelligent automation of study planning, site activation, patient recruitment optimization, clinical monitoring, and regulatory submission workflows.\u003cbr/\u003e- Proven track record of maintaining executive-level customer relationships with pharmaceutical senior technology leaders, including ability to translate complex technical architectures into business value propositions and strategic roadmaps that align cloud modernization initiatives with clinical development transformation objectives.\u003cbr/\u003e- Achieved AWS Professional level certifications (AWS Certified Solutions Architect - Professional, and AWS Certified Generative AI Developer – Professional or AWS Certified Machine Learning – Specialty) preferred. Deep understanding of AWS services across compute, storage, networking, security, databases, machine learning, and serverless technologies.\u003cbr/\u003e- Knowledge of security and compliance standards (e.g., HIPAA, GDPR) and expertise in performance optimization and cost management for cloud environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-pro-serv","source_system":"JobCreator","state":"ZH","title":"Senior ProServe Cloud Architect, Healthcare and Life Sciences (HCLS) , HCLS, AWSI Sales","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3168104/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-pro-serv","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 7+ years in technology sales, with 3+ years in management\u003cbr/\u003e- 7+ years in Health care and/or Life Sciences industry, in technology, professional services, and/or corporate leadership roles\u003cbr/\u003e- Experience with cloud technologies and AI, GenAI and agentic-AI solutions and services and transformations\u003cbr/\u003e- Experience in leading business development activities, managing sales cycles, and business-building\u003cbr/\u003e- Bachelor's degree in Computer Science, Engineering, related field, or equivalent experience","business_category":"aws","city":"Zurich","company_name":"AWS EMEA SARL (Switzerland Branch)","country_code":"CHE","description":"The Amazon Web Services Professional Services (ProServe) team is seeking an experienced technology sales leader to join our team to grow our Health Care and Life Sciences Europe business. This leader will shape technology transformation programs with our largest and most strategic regional customers, focusing on AI/Gen AI/Agentic AI transformation, IT modernization, and cloud migration.\u003cbr/\u003eIn doing so, this leader will cultivate relationships with and serve as a trusted advisor to customer C-suite and SVPs across Digital, IT, AI and across lines of business (Clinical Development, Commercial, Manufacturing, etc.) and collaborate with ProServe sales, delivery teams and specialist teams (such as the GenAI Innovation Center) to design transformative programs and solutions that achieve our customers’ business objectives. This leader will be responsible for guiding, coaching and managing a team, while also directly developing large, programmatic customer deals for selected accounts. Key performance metrics include, but are not limited to Revenue, Billable Bookings, team engagement, and customer experience and satisfaction (NPS, CSAT).\u003cbr/\u003eStrong candidates will have a proven ability to work backwards from HCLS customer outcomes to design ambitious technology transformation programs and a track record of building teams and growing businesses. Leaders who think big and innovate, obsess over customer objectives, execute at a high standard, and are continuously curious will thrive in this role.\u003cbr/\u003eThis is your opportunity to shape how technology drives business and patient impact across healthcare and life sciences.\u003cbr/\u003eThe AWS Professional Services organization is a global team of experts who help customers realize their desired business outcomes when using AWS solutions and services. We work together with customer teams and the AWS Partner Network (APN) to execute technology transformations and enterprise cloud computing initiatives. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries.\u003cbr/\u003e\u003cbr/\u003eJob #10044\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs an experienced Professional Services Sales Leader, you will be responsible for: \u003cbr/\u003e- Leading and developing a high-performing team of Account Executives \u003cbr/\u003e- Developing and implementing sales strategies to meet team targets and drive revenue growth\u003cbr/\u003e- Cultivating executive customer relationships, earning trust, credibility and shaping new opportunities\u003cbr/\u003e- Leveraging deep AWS knowledge to guide sellers in proposing optimal solutions that work backwards from customers’ objectives\u003cbr/\u003e- Monitoring and analyzing key performance indicators and driving executional rigor and accurate forecasting and reporting to optimize operational processes and manage risk\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences: AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job below, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture - Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth - We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance - We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.  ","department_cost_center":null,"description_short":"The Amazon Web Services Professional Services (ProServe) team is seeking an experienced technology sales leader to join our team to grow our Health Care and Life Sciences Europe business. This leader will","display_distance":null,"id":"5a216a8b-6e31-450c-9eeb-59f0fb48d845","id_icims":"3173083","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Tech Sales","job_function_id":null,"job_path":"/en/jobs/3173083/senior-proserve-sales-leader-emea-healthcare-and-life-sciences","job_schedule_type":"full-time","location":"CH, ZH, Zurich","locations":["{\"normalizedStateName\":\"Zurich\",\"normalizedCountryCode\":\"CHE\",\"city\":\"Zurich\",\"countryIso3a\":\"CHE\",\"countryIso2a\":\"CH\",\"locationNonStemming\":\"Switzerland, ZH, Zurich\",\"coordinates\":\"47.37918,8.54236\",\"normalizedCountyName\":\"Zurich\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Switzerland\",\"normalizedLocation\":\"Zurich, Zurich, CHE\",\"location\":\"CH, ZH, Zurich\",\"region\":\"ZH\",\"buildingCodeList\":[\"ZRH15\"],\"normalizedCityName\":\"Zurich\"}"],"normalized_location":"Zurich, Zurich, CHE","optional_search_labels":[],"posted_date":"February  3, 2026","preferred_qualifications":"- Excellent communication, presentation, and negotiation skills\u003cbr/\u003e- Ability to build and maintain C-level client relationships\u003cbr/\u003e- Experience shaping and delivering at-scale AI/GenAI/Agentic AI transformations with HCLS customers\u003cbr/\u003e- Professional services experience\u003cbr/\u003e- P\u0026L leadership experience\u003cbr/\u003e- Advanced degree in relevant discipline (Biomedical, MD, Computer Science)\u003cbr/\u003e- Proficiency in Swiss German or German and/or French\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-pro-serv","source_system":"JobCreator","state":"ZH","title":"Senior ProServe Sales Leader EMEA, Healthcare and Life Sciences","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3173083/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-pro-serv","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- •\tMust be 18 years of age or older\u003cbr/\u003e- •\tEducation Requirements (must meet one):\u003cbr/\u003e- o\tCurrently enrolled in Bachelor's degree or above in Computer Science, Computer Engineering, Data Science, Information Systems, or related STEM fields [degrees can be updated based on regional variations]\u003cbr/\u003e- o\tCompleted Bachelor's or Graduate degree in specified fields\u003cbr/\u003e- •\tExpected graduation between October 2026 - September 2029\u003cbr/\u003e- •\tDemonstrated experience with at least one general-purpose programming language such as Java, Python, C++, C#, Go, Rust, or TypeScript\u003cbr/\u003e- •\tDemonstrated experience one or more of the following:\u003cbr/\u003e- o\tData structures implementation\u003cbr/\u003e- o\tBasic algorithm development\u003cbr/\u003e- o\tObject-oriented design principles","business_category":"studentprograms","city":"Madrid","company_name":"Amazon Spain Services, S.L.U.","country_code":"ESP","description":"Do you want to solve real customer problems through innovative technology? Do you enjoy working on scalable services in a collaborative team environment? Do you want to see your code directly impact millions of customers worldwide?\u003cbr/\u003eAt Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. Customer obsession is part of our company DNA, which has made us one of the world's most beloved brands.\u003cbr/\u003eOur Software Development Engineer (SDE) interns use modern technology to solve complex problems while seeing their work's impact first-hand. The challenges SDE interns solve at Amazon are meaningful and influence millions of customers, sellers, and products globally. We seek individuals passionate about creating new products, features, and services while managing ambiguity in an environment where development cycles are measured in weeks, not years. \u003cbr/\u003eAt Amazon, we believe in ownership at every level. As an SDE intern, you'll own the entire lifecycle of your code - from design through deployment and ongoing operations. This ownership mindset, combined with our commitment to operational excellence, ensures we deliver the highest quality solutions for our customers.\u003cbr/\u003eWe're looking for curious minds who think big and want to define tomorrow's technology. At Amazon, you'll grow into the high-impact engineer you know you can be, supported by a culture of learning and mentorship. Every day brings exciting new challenges and opportunities for personal growth.\u003cbr/\u003e\u003cbr/\u003eAmazon internships across all seasons are full-time positions, and interns should expect to work in office, Monday-Friday, up to 40 hours per week typically between 8am-5pm. Specific team norms around working hours will be communicated by your manager. Interns should not have conflicts such as classes or other employment during the Amazon work-day. Applicants should have a minimum of one quarter/semester/trimester remaining in their studies after their internship concludes.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tCollaborate and communicate effectively with experienced cross-disciplinary Amazonians to design, build, and operate innovative products and services that delight our customers, while participating in technical discussions to drive solutions forward.\u003cbr/\u003e•\tDesign and develop scalable solutions using cloud-native architectures and microservices in a large distributed computing environment.\u003cbr/\u003e•\tParticipate in code reviews and contribute to technical documentation.\u003cbr/\u003e•\tBuild and maintain resilient distributed systems that are scalable, fault-tolerant, and cost-effective.\u003cbr/\u003e•\tLeverage and contribute to the development of GenAI and AI-powered tools to enhance development productivity while staying current with emerging technologies. \u003cbr/\u003e•\tWrite clean, maintainable code following best practices and design patterns.\u003cbr/\u003e•\tWork in an agile environment practicing CI/CD principles while participating in operational responsibilities including on-call duties.\u003cbr/\u003e•\tDemonstrate operational excellence through monitoring, troubleshooting, and resolving production issues.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs an intern, you will be matched to a manager and a mentor and will have the opportunity to influence the evolution of Amazon technology and lead critical projects early in your career. \u003cbr/\u003e\u003cbr/\u003eIn addition to working on an impactful project, you will have the opportunity to engage with Amazonians for both personal and professional development, expand your network, and participate in activities with other interns throughout your internship. No matter the location of your internship, we give you the tools to own your project and learn in a real-world setting.\u003cbr/\u003e","department_cost_center":null,"description_short":"Do you want to solve real customer problems through innovative technology? Do you enjoy working on scalable services in a collaborative team environment? Do you want to see your code directly impact millions","display_distance":null,"id":"de464907-1edb-499e-8ce0-1b4af56c44be","id_icims":"3160089","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3160089/software-dev-engineer-internship-ai-ml","job_schedule_type":"full-time","location":"ES, M, Madrid","locations":["{\"normalizedStateName\":\"Community of Madrid\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Madrid\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, M, Madrid\",\"coordinates\":\"40.42024,-3.68755\",\"normalizedCountyName\":\"Madrid\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Madrid, Community of Madrid, ESP\",\"location\":\"ES, M, Madrid\",\"region\":\"M\",\"buildingCodeList\":[\"MAD12\"],\"normalizedCityName\":\"Madrid\"}"],"normalized_location":"Madrid, Community of Madrid, ESP","optional_search_labels":[],"posted_date":"January 15, 2026","preferred_qualifications":"- •\tPrevious technical internship(s) or demonstrated project experience\u003cbr/\u003e- •\tExperience with one or more of the following:\u003cbr/\u003e- o\tAI tools for development productivity\u003cbr/\u003e- o\tCloud platforms (preferably AWS)\u003cbr/\u003e- o\tDatabase systems (SQL and NoSQL)\u003cbr/\u003e- o\tContributing to open-source projects\u003cbr/\u003e- o\tVersion control systems\u003cbr/\u003e- o\tDebugging and troubleshooting complex systems\u003cbr/\u003e- •\tStrong problem-solving and analytical skills\u003cbr/\u003e- •\tExcellent written and verbal communication skills\u003cbr/\u003e- •\tDemonstrated ability to learn and adapt to new technologies quickly\u003cbr/\u003e- •\tBasic understanding of software development lifecycle (SDLC)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"studentprograms.team-internships-for-students","source_system":"JobCreator","state":"M","title":"Software Dev Engineer Internship - AI/ML","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3160089/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-internships-for-students","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Baccalaureate diploma mandatory\u003cbr/\u003e- 2+ years’ experience in account management, sales, supply chain, product management or related fields\u003cbr/\u003e- Demonstrated ability to use data for business decision-making\u003cbr/\u003e- Strong interpersonal and communication capabilities\u003cbr/\u003e- Experience in effectively managing ongoing stakeholder relationships\u003cbr/\u003e- Independent user of English + Italian (minimum B2 level)","business_category":"retail","city":"Virtual","company_name":"Amazon Development Center (Romania) S.R.L.","country_code":"ROU","description":"**Empower Vendors to Thrive on Amazon **\u003cbr/\u003eAs a Vendor Consultant, you'll be the strategic partner transforming vendor relationships and driving business growth in our Amazon Vender Services (AVS) team. You'll leverage data-driven insights to help vendors optimize their performance and create exceptional customer experience. You’ll analyze data to improve vendor performance on Amazon, focusing on traffic, brand awareness, conversions, and revenue. You’ll manage vendor relationships while addressing business challenges and opportunities through strategic analysis.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e-\tDevelop Strategic Partnerships: Build and nurture relationships with vendors to drive mutual growth and success\u003cbr/\u003e-\tData-Driven Insights: Analyze complex business metrics to create actionable recommendations\u003cbr/\u003e-\tPerformance Optimization: Collaborate with internal teams to improve vendor operational effectiveness\u003cbr/\u003e-\tCommunication Excellence: Establish clear communication channels and set strategic expectations\u003cbr/\u003e-\tBusiness Review Management: Conduct comprehensive vendor performance reviews and create forward-looking action plans\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour day will be dynamic and impact focused. You'll dive into data analysis, collaborate with cross-functional teams, and develop strategic plans that unlock vendors' potential. You'll engage in meaningful conversations, solve complex challenges, and create innovative solutions that drive business success. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Vendor Services (AVS) is a paid B2B service dedicated to supporting vendor growth. Our team believes in building strong, sustainable partnerships that create value for vendors, customers, and our organization, all while delivering exceptional customer experiences. Come build the future with us!","department_cost_center":null,"description_short":"**Empower Vendors to Thrive on Amazon **As a Vendor Consultant, you'll be the strategic partner transforming vendor relationships and driving business growth in our Amazon Vender Services (AVS) team. You'll","display_distance":null,"id":"8aac0eea-6511-443f-bdd1-45908eaa27ea","id_icims":"3132071","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Account Management","job_function_id":null,"job_path":"/en/jobs/3132071/vendor-consultant-account-management-with-italian-amazon-vendor-services","job_schedule_type":"full-time","location":"RO, Virtual","locations":["{\"normalizedCountryCode\":\"ROU\",\"city\":\"Timisoara\",\"countryIso3a\":\"ROU\",\"countryIso2a\":\"RO\",\"locationNonStemming\":\"Romania, Timisoara\",\"coordinates\":\"45.75345,21.22333\",\"normalizedCountyName\":\"Timiș\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Romania\",\"normalizedLocation\":\"Timisoara, ROU\",\"location\":\"RO, Timisoara\",\"region\":\"\",\"buildingCodeList\":[\"TSR11\",\"TSR10\",\"TSR12\"],\"normalizedCityName\":\"Timisoara\"}","{\"normalizedCountryCode\":\"ROU\",\"city\":\"Bucharest\",\"countryIso3a\":\"ROU\",\"countryIso2a\":\"RO\",\"locationNonStemming\":\"Romania, Bucharest\",\"coordinates\":\"44.43429,26.10298\",\"normalizedCountyName\":\"Bucharest\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Romania\",\"normalizedLocation\":\"Bucharest, ROU\",\"location\":\"RO, Bucharest\",\"region\":\"\",\"buildingCodeList\":[\"OTP11\",\"iasi3\"],\"normalizedCityName\":\"Bucharest\"}","{\"normalizedCountryCode\":\"ROU\",\"city\":\"Virtual\",\"countryIso3a\":\"ROU\",\"countryIso2a\":\"RO\",\"locationNonStemming\":\"Romania, Virtual\",\"coordinates\":\"44.43429,26.10298\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"Romania\",\"normalizedLocation\":\"ROU\",\"location\":\"RO, Virtual\",\"region\":\"\",\"buildingCodeList\":[\"VIR\"]}","{\"normalizedCountryCode\":\"ROU\",\"city\":\"Iasi\",\"countryIso3a\":\"ROU\",\"countryIso2a\":\"RO\",\"locationNonStemming\":\"Romania, Iasi\",\"coordinates\":\"47.1594,27.58732\",\"normalizedCountyName\":\"Iasi\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Romania\",\"normalizedLocation\":\"Iasi, ROU\",\"location\":\"RO, Iasi\",\"region\":\"\",\"buildingCodeList\":[\"IAS15\",\"IAS13\",\"IAS14\",\"IASI2\",\"IAS12\"],\"normalizedCityName\":\"Iasi\"}"],"normalized_location":"ROU","optional_search_labels":["selling-partner-services.sellers-and-vendors-emea"],"posted_date":"November 25, 2025","preferred_qualifications":"- Experience with data analytics and visualization tools\u003cbr/\u003e- Advanced Excel skills, including statistical and array formulas\u003cbr/\u003e- Knowledge of project management tools such as Sharepoint or SIM-ticketing\u003cbr/\u003e- Proficiency in process improvement methodologies\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"retail.team-avs","source_system":"JobCreator","state":null,"title":"Vendor Consultant/Account Management with Italian, Amazon Vendor Services","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3132071/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-avs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree, or BS degree\u003cbr/\u003e- Experience in English-language communication skills, both written and verbal\u003cbr/\u003e- Experience in data analysis\u003cbr/\u003e- Work flexible schedules/shifts/areas, including weekends, nights, and/or holidays","business_category":"fulfillment-and-operations","city":"Riyadh","company_name":"Afaq - Warehouse Branch","country_code":"SAU","description":"When you join Amazon as an Area Manager, you’ll gain experience leading a large and diverse team to make sure your area of the business keeps pace with demand. In this hands-on role, you’ll learn about the complexity of operations at a global business and what it takes to make everything run seamlessly. While you implement your team’s approach to drive productivity, you’ll also work closely with your colleagues to address challenges, which means no two days will be the same.  \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Promote a culture of safety and wellbeing \u003cbr/\u003e- Analyze and implement corrective actions to make sure quality and productivity are at consistently high levels, and business objectives are met across all shifts \u003cbr/\u003e- Support and lead a team and handle administrative work alongside building and supporting a strong team culture \u003cbr/\u003e- Analyze performance and suggest process improvements to optimize work and improve customer service \u003cbr/\u003e- Collaborate with other managers to standardize shift processes  \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou’ll work shifts and be based at one of our operational sites. Your main focus will be to maintain safety standards within your team and across your site. You’ll also monitor and maintain process efficiency. Your days will always include prioritising routine team management and daily operational tasks, alongside other tasks like individual escalations, process improvement work and wide-scale operational contingency planning.  \u003cbr/\u003e\u003cbr/\u003eBeing a key part of the operations team involves working with colleagues in other teams and external partners to make sure we stay on track to meet our customer demands and targets. This will involve analysing data and performance metrics with leaders in your business area, as well as discussing the operational pros and cons of technical improvements with engineers. ","department_cost_center":null,"description_short":"When you join Amazon as an Area Manager, you’ll gain experience leading a large and diverse team to make sure your area of the business keeps pace with demand. In this hands-on role, you’ll learn about","display_distance":null,"id":"1ce8e411-5c73-44b3-9df0-57f97a6fb797","id_icims":"3171168","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3171168/area-manager-fulfillment-center-operations","job_schedule_type":"full-time","location":"SA, Riyadh","locations":["{\"normalizedCountryCode\":\"SAU\",\"city\":\"Riyadh\",\"countryIso3a\":\"SAU\",\"countryIso2a\":\"SA\",\"locationNonStemming\":\"Saudi Arabia, Riyadh\",\"coordinates\":\"24.68208,46.68723\",\"normalizedCountyName\":\"Riyadh\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Saudi Arabia\",\"normalizedLocation\":\"Riyadh, SAU\",\"location\":\"SA, Riyadh\",\"region\":\"\",\"buildingCodeList\":[\"RDF1\"],\"normalizedCityName\":\"Riyadh\"}"],"normalized_location":"Riyadh, SAU","optional_search_labels":[],"posted_date":"February  1, 2026","preferred_qualifications":"- Experience working and communicating with multiple stakeholders, C-level executives and cross-functional teams\u003cbr/\u003e- Experience in warehouse operations and logistics or equivalent\u003cbr/\u003e- Experience working with the MS Office suite (Word, Excel, Outlook) in a professional environment\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.no-team-listed","source_system":"JobCreator","state":null,"title":"Area Manager, Fulfillment Center, Operations","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3171168/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- Experience with computer hardware troubleshooting and repair\u003cbr/\u003e- Experience in networking","business_category":"aws","city":"Zaragoza","company_name":"Amazon Data Services Spain, S.L.","country_code":"ESP","description":"\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eWe are looking for Data Center Technicians to join our expanding Infrastructure Operations team. Data Center Technicians are the primary resolver and troubleshoot and solve a range of datacenter infrastructure issues including, but not limited to: hardware, fiber, networking, and related problems. You will be part of the Data Center Operations (DCO) team, overseeing the operation and maintenance of the IT infrastructure and hardware for data centers in AWS Cloud regions. You will become the primary resolver for your support team, and gain troubleshooting skills on different hardware and software cases. \u003cbr/\u003eYou will be able to troubleshoot and solve most infrastructure issues and engage other appropriate solutions groups on more complex problems to drive solutions.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tSAFETY\u003cbr/\u003eFollow and maintain the highest safety standards and diligently encourage a world-class safety culture. Own the safety initiatives and projects to foster a strong safety culture.\u003cbr/\u003e\u003cbr/\u003e•\tDATA CENTER OPERATIONS (DCO)\u003cbr/\u003e\u003cbr/\u003eThis position involves: \u003cbr/\u003eo\tDiagnosing hardware and network problems followed by physical repairs\u003cbr/\u003eo\tTroubleshooting events within internal Service Level Agreements (SLAs)\u003cbr/\u003eo\tPerforming root cause analysis of equipment failures\u003cbr/\u003e\u003cbr/\u003e•\tManual handling and lifting of equipment may be required (weight limits in accordance with regulations)\u003cbr/\u003e•\tWorking rotating shifts (morning/late/night) as well as weekends to maintain the 24/7 data center environment \u003cbr/\u003e•\tOn-call rotation reaction to off-duty emergency calls \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"b6398bca-6442-4949-bf2f-6282df967645","id_icims":"3173746","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3173746/data-center-technician-zaragoza-data-center-operations","job_schedule_type":"full-time","location":"ES, Zaragoza","locations":["{\"normalizedStateName\":\"Aragon\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Zaragoza\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, Zaragoza\",\"coordinates\":\"41.65184,-0.8811\",\"normalizedCountyName\":\"Zaragoza\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Zaragoza, Aragon, ESP\",\"location\":\"ES, Zaragoza\",\"region\":\"\",\"buildingCodeList\":[\"ZAZ62\"],\"normalizedCityName\":\"Zaragoza\"}"],"normalized_location":"Zaragoza, Aragon, ESP","optional_search_labels":["aws.team-ais","aws.team-dc","amazon-web-services.data-center-spain"],"posted_date":"February  4, 2026","preferred_qualifications":"- Experience dealing effectively with customers during problem resolution and operating efficiently under pressure\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-it-services","source_system":"JobCreator","state":null,"title":"Data Center Technician (Zaragoza), Data Center Operations","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3173746/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-it-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Murfreesboro","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager. In this role, you will lead a team of hourly workforce and will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e\u003cbr/\u003eOur Operation’s workflow has three major components: First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer.\u003cbr/\u003e\u003cbr/\u003eOur fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Area Managers based on location preference and the business’ current openings.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Support, mentor, and motivate your hourly workforce\u003cbr/\u003e\u003cbr/\u003e* Manage safety, quality, productivity, and customer delivery promises\u003cbr/\u003e\u003cbr/\u003e* Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e\u003cbr/\u003e* Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e\u003cbr/\u003e* Stand/walk for up to 12 hours during shifts\u003cbr/\u003e\u003cbr/\u003e* Work in an environment where the noise level varies and can be loud\u003cbr/\u003e\u003cbr/\u003e* Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e\u003cbr/\u003e* Continuously climb and descend stairs (applies to sites with stairs)","department_cost_center":null,"description_short":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager.","display_distance":null,"id":"47fe40b0-2ce8-43cb-9bbb-99314d8f5098","id_icims":"3170219","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3170219/area-manager-ii","job_schedule_type":"full-time","location":"US, TN, Murfreesboro","locations":["{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Murfreesboro\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Murfreesboro\",\"coordinates\":\"35.84508,-86.39503\",\"normalizedCountyName\":\"Rutherford\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Murfreesboro, Tennessee, USA\",\"location\":\"US, TN, Murfreesboro\",\"region\":\"TN\",\"buildingCodeList\":[\"BNA3\"],\"normalizedCityName\":\"Murfreesboro\"}"],"normalized_location":"Murfreesboro, Tennessee, USA","optional_search_labels":[],"posted_date":"January 30, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 20+ employees\u003cbr/\u003e- Experience with process improvements (Lean process, Kaizen, and/or Six Sigma)\u003cbr/\u003e- Excellent customer service, communication, and interpersonal skills\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Industry experience in: retail, F\u0026B, military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TN, Murfreesboro - 70,000.00 - 90,900.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"TN","title":"Area Manager II","university_job":null,"updated_time":"30 minutes","url_next_step":"https://account.amazon.com/jobs/3170219/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Murfreesboro","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager. In this role, you will lead a team of hourly workforce and will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e\u003cbr/\u003eOur Operation’s workflow has three major components: First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer.\u003cbr/\u003e\u003cbr/\u003eOur fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Area Managers based on location preference and the business’ current openings.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Support, mentor, and motivate your hourly workforce\u003cbr/\u003e\u003cbr/\u003e* Manage safety, quality, productivity, and customer delivery promises\u003cbr/\u003e\u003cbr/\u003e* Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e\u003cbr/\u003e* Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e\u003cbr/\u003e* Stand/walk for up to 12 hours during shifts\u003cbr/\u003e\u003cbr/\u003e* Work in an environment where the noise level varies and can be loud\u003cbr/\u003e\u003cbr/\u003e* Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e\u003cbr/\u003e* Continuously climb and descend stairs (applies to sites with stairs)","department_cost_center":null,"description_short":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager.","display_distance":null,"id":"365c9c1c-760d-409c-98fd-21abee1d6fe2","id_icims":"3170218","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3170218/area-manager-ii","job_schedule_type":"full-time","location":"US, TN, Murfreesboro","locations":["{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Murfreesboro\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Murfreesboro\",\"coordinates\":\"35.84508,-86.39503\",\"normalizedCountyName\":\"Rutherford\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Murfreesboro, Tennessee, USA\",\"location\":\"US, TN, Murfreesboro\",\"region\":\"TN\",\"buildingCodeList\":[\"BNA3\"],\"normalizedCityName\":\"Murfreesboro\"}"],"normalized_location":"Murfreesboro, Tennessee, USA","optional_search_labels":[],"posted_date":"January 30, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 20+ employees\u003cbr/\u003e- Experience with process improvements (Lean process, Kaizen, and/or Six Sigma)\u003cbr/\u003e- Excellent customer service, communication, and interpersonal skills\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Industry experience in: retail, F\u0026B, military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TN, Murfreesboro - 70,000.00 - 90,900.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"TN","title":"Area Manager II","university_job":null,"updated_time":"31 minutes","url_next_step":"https://account.amazon.com/jobs/3170218/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- Experience in communication and presentation skills, both written and verbal in Portuguese \u0026 English\u003cbr/\u003e- Experience in identifying incomplete or inaccurate data, identifying the root cause and creating/implementing an escalation plan, or experience communicating results to senior leadership\u003cbr/\u003e- Experience with reporting and Data Visualization tools such as Quick Sight / Tableau / Power BI or other BI packages\u003cbr/\u003e- Experience in employee and performance management","business_category":"fulfillment-and-operations","city":"São José Dos Pinhais","company_name":"Amazon Servicos de Varejo do Brasil Ltda.","country_code":"BRA","description":"Amazon is seeking an 3P FC Contract Manager to be based at our Fulfillment Center. The 3P FC Contract Manager will have complete responsibility for all services provided by third-party logistics partners within the warehouse environment.\u003cbr/\u003e\u003cbr/\u003eReporting directly to the 3P FC Sr Manager, you will be responsible for ensuring full compliance with the current service agreement. Your role will focus on continuously improving functionality and service levels to exceed productivity goals and deliver on our customer promises, driving the partner to achieve excellence.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eBudget \u0026 Operational Management\u003cbr/\u003e\u003cbr/\u003e- Own and deliver the operational budget for the functional area, encompassing safety, productivity, financial planning, labor planning, and operational goals for third-party fulfillment centers\u003cbr/\u003e\u003cbr/\u003eStrategic Planning\u003cbr/\u003e\u003cbr/\u003e- Provide strategic-level and long-term planning (3, 6, and 12 months ahead), including financial forecasting, rate card projections, and peak season preparation\u003cbr/\u003e\u003cbr/\u003eContinuous Improvement \u0026 Collaboration\u003cbr/\u003e\u003cbr/\u003e - Drive continuous improvement projects in partnership with 3PL providers to optimize operations and enhance productivity, meeting and exceeding business objectives\u003cbr/\u003e - Lead strategic initiatives with total building and network-wide impact\u003cbr/\u003e - Effectively leverage 3P Site Managers to solicit ideas and understand operational challenges within the facility\u003cbr/\u003e\u003cbr/\u003eCross-Network Collaboration\u003cbr/\u003e\u003cbr/\u003e - Network with leaders across the organization to share process improvements, drive operational efficiencies, and identify cost-saving opportunities\u003cbr/\u003e\u003cbr/\u003ePerformance Management\u003cbr/\u003e\u003cbr/\u003e - Establish clear objectives and metrics for safety, quality, productivity, and customer experience\u003cbr/\u003e - Set expectations and goals for 3P leaders in accordance with contractual guidelines\u003cbr/\u003e - Measure performance, provide constructive feedback, and hold leaders accountable for results\u003cbr/\u003e\u003cbr/\u003eLeadership Development\u003cbr/\u003e\u003cbr/\u003e - Mentor and develop leaders and staff to build organizational capability and ensure long-term success","department_cost_center":null,"description_short":"Amazon is seeking an 3P FC Contract Manager to be based at our Fulfillment Center. The 3P FC Contract Manager will have complete responsibility for all services provided by third-party logistics partners","display_distance":null,"id":"ccfe806d-1152-4f60-ba83-dbe484c0a18f","id_icims":"3151326","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3151326/fullfilment-center-management-site-leader-br-ops-fc-region-1","job_schedule_type":"full-time","location":"BR, PR, São José Dos Pinhais","locations":["{\"normalizedStateName\":\"Parana\",\"normalizedCountryCode\":\"BRA\",\"city\":\"Curitiba\",\"countryIso3a\":\"BRA\",\"countryIso2a\":\"BR\",\"locationNonStemming\":\"Brazil, PR, Curitiba\",\"coordinates\":\"-25.43998,-49.27654\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Brazil\",\"normalizedLocation\":\"Curitiba, Parana, BRA\",\"location\":\"BR, PR, Curitiba\",\"region\":\"PR\",\"buildingCodeList\":[\"ECB8\",\"DPR2\",\"CWB251\",\"HPR2\"],\"normalizedCityName\":\"Curitiba\"}","{\"normalizedStateName\":\"Parana\",\"normalizedCountryCode\":\"BRA\",\"city\":\"São José Dos Pinhais\",\"countryIso3a\":\"BRA\",\"countryIso2a\":\"BR\",\"locationNonStemming\":\"Brazil, PR, São José Dos Pinhais\",\"coordinates\":\"-25.53641,-49.20422\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Brazil\",\"normalizedLocation\":\"São José dos Pinhais, Parana, BRA\",\"location\":\"BR, PR, São José Dos Pinhais\",\"region\":\"PR\",\"buildingCodeList\":[\"SBCT\"],\"normalizedCityName\":\"São José dos Pinhais\"}"],"normalized_location":"São José dos Pinhais, Parana, BRA","optional_search_labels":[],"posted_date":"January  2, 2026","preferred_qualifications":"- 3+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.no-team-listed","source_system":"JobCreator","state":"PR","title":"Fullfilment Center Management - Site Leader, BR Ops - FC  Region 1","university_job":null,"updated_time":"38 minutes","url_next_step":"https://account.amazon.com/jobs/3151326/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}