{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 1+ years of computer networking experience\u003cbr/\u003e- 1+ years of Linux operating systems experience\u003cbr/\u003e- Bachelor's degree in Information Technology, Computer Science, or a related field\u003cbr/\u003e- Experience in computer networking\u003cbr/\u003e- Experience working with Linux operating systems\u003cbr/\u003e- Can lift and rack equipment up to 40 pounds\u003cbr/\u003e- Experience with computer hardware troubleshooting and repair","business_category":"aws","city":"Sterling","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Transform network infrastructure by joining our dynamic team! You'll be at the forefront of developing innovative solutions that drive network stability and scalability, using your technical expertise to create automated systems that power global technological advancement. \u003cbr/\u003e \u003cbr/\u003eNetwork Install Technicians will collaborate with cross-functional teams, troubleshoot complex technical scenarios, and implement strategic solutions that keep our network running seamlessly. Expect to engage in hands-on technical work that requires creativity, precision, and a passion for technological innovation. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Moving and implementing large enterprise equipment \u003cbr/\u003e- Installing Fiber and Copper cabling and patching cabling between equipment \u003cbr/\u003e- Ensuring proper safety and security standards are maintained during cabling and rack installation, \u003cbr/\u003e- Following well established hardware installation procedures and break-fix activities \u003cbr/\u003e- Safely using material handling tools and equipment \u003cbr/\u003e- Traveling within and outside of the regional work area is required. \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e- All physical requirements are expected with reasonable accommodations: \u003cbr/\u003e- Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds \u003cbr/\u003e- Ability to work in an environment that operates 24/7 with an ability to participate in primary responder rotation and provide after-hours support as needed \u003cbr/\u003e- Working in cramped and/or elevated and/or noisy environments \u003cbr/\u003e- Bending, lifting, stretching, reaching, standing and walking for up to 8+ hours a day \u003cbr/\u003e- Ascending and descending ladders, stairs, and gangways safely and without limitation \u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. ","department_cost_center":null,"description_short":"Transform network infrastructure by joining our dynamic team! You'll be at the forefront of developing innovative solutions that drive network stability and scalability, using your technical expertise","display_distance":null,"id":"caadd553-e7f5-4241-a03e-80d9a03ae78c","id_icims":"3168924","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3168924/network-install-technician-amazon-web-services","job_schedule_type":"full-time","location":"US, VA, Sterling","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sterling\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Sterling\",\"coordinates\":\"39.03336,-77.40713\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sterling, Virginia, USA\",\"location\":\"US, VA, Sterling\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD90\",\"IAD603\",\"IAD26\",\"IAD57\",\"IAD403\",\"IAD282\",\"IAD12\",\"IAD418\",\"IAD118\",\"IAD182\",\"IAD148\",\"IAD72\",\"IAD56\",\"IAD117\",\"IAD417\",\"IAD119\",\"IAD91\",\"IAD10\",\"IAD116\",\"IAD121\",\"IAD89\",\"IAD181\",\"IAD404\",\"IAD415\",\"IAD146\",\"IAD149\",\"IAD62\",\"IAD140\",\"IAD285\",\"IAD68\",\"IAD229\",\"IAD661\",\"IAD163\",\"IAD414\",\"IAD228\",\"IAD122\",\"IAD128\",\"IAD141\",\"IAD175\",\"IAD147\",\"IAD402\",\"IAD144\",\"IAD58\",\"WAS30\",\"IAD408\",\"IAD33\",\"IAD405\",\"IAD613\",\"IAD213\",\"IAD232\",\"IAD588\",\"IAD99\",\"IAD257\",\"IAD93\",\"IAD609\",\"DDC4\",\"IAD226\",\"IAD190\",\"IAD79\",\"IAD587\",\"IAD81\",\"IAD256\",\"IAD160\",\"IAD17\",\"IAD411\",\"IAD191\",\"IAD586\",\"IAD409\",\"IAD83\",\"IAD244\",\"IAD389\",\"IAD255\",\"IAD258\",\"IAD407\",\"IAD32\",\"IAD192\",\"IAD412\",\"IAD143\",\"IAD51\",\"IAD16\",\"BWI1\",\"IAD129\",\"IAD123\",\"OSU69\",\"IAD231\",\"IAD15\",\"IAD76\",\"IAD92\",\"IAD145\",\"IAD259\",\"IAD571\",\"IAD214\",\"IAD98\",\"IAD406\",\"IAD230\",\"IAD416\",\"IAD410\",\"IAD139\",\"IAD180\",\"IAD419\",\"IAD164\",\"IAD608\",\"IAD413\",\"IAD574\",\"IAD142\",\"IAD88\",\"IAD388\",\"IAD243\",\"IAD69\",\"IAD82\",\"IAD120\",\"IAD681\",\"IAD920\",\"IAD662\",\"IAD246\"],\"normalizedCityName\":\"Sterling\"}","{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sparks\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, Sparks\",\"coordinates\":\"39.54115,-119.74832\",\"normalizedCountyName\":\"Washoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sparks, Nevada, USA\",\"location\":\"US, NV, Sparks\",\"region\":\"NV\",\"buildingCodeList\":[\"RNO144\",\"RNO158\",\"RNO25\",\"RNO143\",\"RNO157\",\"RNO111\",\"RNO160\",\"VUGV\",\"RNO100\",\"RNO109\",\"RNO141\",\"RNO108\",\"SVMT19\",\"RNO147\",\"RNO102\",\"RNO140\",\"RNO146\",\"RNO150\",\"RNO156\",\"RNO153\",\"RNO159\",\"RNO105\",\"RNO152\",\"RNO104\",\"RNO149\",\"RNO151\",\"RNO103\",\"RNO106\",\"RNO155\",\"RNO110\",\"VUAY\",\"RNO154\",\"RNO101\",\"RNO107\",\"RNO142\",\"RNO145\",\"RNO148\"],\"normalizedCityName\":\"Sparks\"}","{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Avondale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Avondale\",\"coordinates\":\"33.44096,-112.34966\",\"normalizedCountyName\":\"Maricopa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Avondale, Arizona, USA\",\"location\":\"US, AZ, Avondale\",\"region\":\"AZ\",\"buildingCodeList\":[\"ONM107\",\"PHX70\",\"PHX71\",\"GYR4\",\"NAS1\",\"PHX69\"],\"normalizedCityName\":\"Avondale\"}"],"normalized_location":"Sterling, Virginia, USA","optional_search_labels":[],"posted_date":"January 28, 2026","preferred_qualifications":"- Can work in cramped spaces or in elevated locations while adhering to health \u0026 safety guidelines\u003cbr/\u003e- Experience dealing effectively with customers during problem resolution and operating efficiently under pressure\u003cbr/\u003e- Experience managing work and priorities through a ticketing system\u003cbr/\u003e- Experience with cabling infrastructure best practices and methodologies\u003cbr/\u003e- Experience working in a data center environment (racking and stacking gear, cable management, hot/cold aisle containment)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, AZ, AVONDALE - 29.00 - 52.00 USD hourly\u003cbr/\u003eUSA, AZ, Avondale - 29.00 - 52.00 USD hourly\u003cbr/\u003eUSA, NV, SPARKS - 29.00 - 52.00 USD hourly\u003cbr/\u003eUSA, NV, Sparks - 29.00 - 52.00 USD hourly\u003cbr/\u003eUSA, VA, Sterling - 29.00 - 52.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"VA","title":"Network Install Technician, Amazon Web Services","university_job":null,"updated_time":"1 minute","url_next_step":"https://account.amazon.com/jobs/3168924/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience working in a data center or mission critical facility (example: hospital, military facility, public safety facility, etc.)\u003cbr/\u003e- Experience in construction or project management\u003cbr/\u003e- 2+ years of construction or project management experience\u003cbr/\u003e- Bachelor's degree in Electrical Engineering, Mechanical Engineering, or a related field, or 3+ years of construction or project management experience\u003cbr/\u003e- Bachelor's degree in Mechanical or Electrical Engineering, or 2+ years of construction or project management experience\u003cbr/\u003e- Experience updating and managing construction data including milestone dates, requests for information (RFI), design changes, and change orders.","business_category":"aws","city":"Atlanta","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAs a Data Center Project Engineer, you will be a part of a creative, diverse team tasked with solving fascinating problems constructing Amazon Data Centers.  Our data centers are industry examples of energy efficient, cost-effective designs.  You will work alongside partner teams such as Operations, Networking, Controls, Security, and Commissioning to build Data Centers that directly support our Customers.  \u003cbr/\u003e\u003cbr/\u003eAs our Data Center Project Engineer, you will support the teams that build some of the most interesting electrical and mechanical systems in the world.  You will be on the construction site, daily interacting with the construction managers and stakeholders and be directly responsible for supporting the fast, high-quality delivery of our data center construction.  The Data Center Project Engineer will be part of the onsite Construction Management team and will own the communication coordination with our vendors, information workflow, and coordination of document management including requests for information (RFI), change orders, report, and schedule updates.\u003cbr/\u003e  \u003cbr/\u003eAt Amazon, we are all Owners and leverage unique opportunities presented to us by owning everything from the design review to construction bidding to construction execution and final hand-off to our customers. We are a diverse, upbeat, creative, team of engineers and managers working on a daily basis to develop innovative data centers for our Customers.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe Data Center Project Engineer will be responsible for:\u003cbr/\u003e - Establishing communication and coordination across a data center region’s general contractors, stakeholders, and internal teams.  Example includes sending out region wide changes to construction trailer setup, COVID-19 testing procedures, or location to access documents.\u003cbr/\u003e - Develop and maintain a tracking system for design changes, RFI’s (requests for information), and change orders and dashboard and track this information for regional leadership review.  Include tracking status of priority and due dates.\u003cbr/\u003e - Requesting and reviewing MOPs (Method of Procedure) for proper detail, necessity, and risk. \u003cbr/\u003e - On-boarding new vendors for badging and orientation.\u003cbr/\u003e - Updating project management software with milestone dates, correspondence, and documents.\u003cbr/\u003e - Monitor delivery of owner furnished material to site.\u003cbr/\u003e - Compiling and storing construction data from vendors.\u003cbr/\u003e - Managing checklist including various checklists including substantial completion checks, safety, and quality.\u003cbr/\u003e   \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003e**Why AWS**\u003cbr/\u003e Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003e*Diverse Experiences*\u003cbr/\u003e Amazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003e*Work/Life Balance*\u003cbr/\u003e We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003e*Inclusive Team Culture*\u003cbr/\u003e Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003e*Mentorship and Career Growth*\u003cbr/\u003e We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"977e8dfd-2879-4daa-a00a-a1ba3ab435e9","id_icims":"3140846","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3140846/project-engineer-data-center-construction","job_schedule_type":"full-time","location":"US, GA, Atlanta","locations":["{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Atlanta\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Atlanta\",\"coordinates\":\"33.74831,-84.39111\",\"normalizedCountyName\":\"Fulton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Atlanta, Georgia, USA\",\"location\":\"US, GA, Atlanta\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL11\"],\"normalizedCityName\":\"Atlanta\"}"],"normalized_location":"Atlanta, Georgia, USA","optional_search_labels":["aws.team-dc","aws.team-ais","aws.team-dcpd-optional"],"posted_date":"December 10, 2025","preferred_qualifications":"- Knowledge of electrical systems in critical Data Center operations that include but are not limited to utility substation feeds, transformers, switchgear, VFI Class UPS, DRUPS, PDUs, ATS, STS, SLA/VRLA batteries and associated systems, diesel/gas turbine generators and related fuel systems, Surge Suppression, Active Harmonic Filtering, battery monitoring systems, branch circuit monitoring systems or SCADA systems\u003cbr/\u003e- Knowledge of mission critical systems (data centers, hospitals, power plants, military facilities, etc.)\u003cbr/\u003e- Experience in vendor negotiation and management for data center or upgrade construction contracts\u003cbr/\u003e- CFC license or PMI qualification (PMP, IPMA, IPMC)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, GA, Atlanta - 96,000.00 - 166,300.00 USD annually","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"GA","title":"Project Engineer, Data Center Construction","university_job":null,"updated_time":"1 minute","url_next_step":"https://account.amazon.com/jobs/3140846/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"•\tServed a full Engineering indentured apprenticeship and/or qualified to a minimum NVQ Level 3 or equivalent in a relevant Engineering subject \u003cbr/\u003e•\tRelevant experience as a qualified engineer \u003cbr/\u003e•\tRelevant experience working in mechanical and/or electrical maintenance \u003cbr/\u003e•\tAdvanced proficiency in the local language verbally and in writing ","business_category":"fulfillment-ops","city":"Coalville","company_name":"Amazon UK Services Ltd.","country_code":"GBR","description":"The Reliability Maintenance Engineering (RME) team at Amazon is fundamental to our operations – they’re the ones keeping vital machinery running at all times. As an RME Technician, you’ll maintain a wide range of equipment and workspaces while upholding Health and Safety best practices. You'll help to keep your colleagues safe and prevent machine downtime. Our RME Technicians boost the availability and quality of our equipment and work to enhance the operational environment too.   \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tProactive and preventative maintenance tasks on a wide range of site equipment \u003cbr/\u003e•\tCarry out reactive repairs and fault diagnosis in a live distribution warehouse \u003cbr/\u003e•\tUse the latest tools to maximise equipment effectiveness \u003cbr/\u003e•\tUphold all health and safety policies and practices  \u003cbr/\u003e•\tSupport the development and progression of on-site apprentices \u003cbr/\u003e•\tWork on continuous improvement projects and roll out best practices across a range of EU sites\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eOur RME Technicians are based on-site, so they can respond quickly to any machinery issues. You’ll carry out a range of planned preventative maintenance to our sites’ equipment to make sure it’s working safely. As an RME Technician, you’ll also respond promptly to breakdowns, investigating, finding, and implementing solutions as quickly as possible.  You’ll also make suggestions for long-term improvements.  \u003cbr/\u003e\u003cbr/\u003eWorking alongside senior colleagues, you’ll undertake day-to-day maintenance tasks and will liaise with contractors if you need external expertise. You’ll work on a range of shifts to make sure our sites are supported around the clock – allowing Amazon to deliver at the speed we’re known for.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur Reliability Maintenance Engineering or RME team keep our equipment performing at its best. We're a technically minded team, made up of excellent team players and guided by experienced leaders. We work together to maintain, troubleshoot and repair equipment across our global network of fulfilment centres. Some of our people are leaders, who oversee the team as they work on exciting technology – some of which only exists at Amazon.\u003cbr/\u003e\u003cbr/\u003eFrom installing automated packaging systems to overseeing the general maintenance of a site to repairing key distribution equipment, our team handles most aspects of Amazon’s technical side. This includes keeping buildings legally compliant, so everyone is safe, and our sites are operating at maximum efficiency. There are lots of opportunities for progression, both within the RME team and more widely across Amazon.\u003cbr/\u003e\u003cbr/\u003eEverything we do focuses on reducing downtime in Amazon’s crucial operations sites, so customers get their orders on time. We often work during early or late hours to carry out maintenance with minimal disruption, including night shifts. If we spot a better way to do something, we have the skills and the opportunity to develop and introduce completely new processes or cutting-edge tech like Amazon Robotics and our Complex Item Sorter.","department_cost_center":null,"description_short":"The Reliability Maintenance Engineering (RME) team at Amazon is fundamental to our operations – they’re the ones keeping vital machinery running at all times. As an RME Technician, you’ll maintain a wide","display_distance":null,"id":"41b7ce7e-1df0-43e0-9d67-436b19186ee8","id_icims":"3048682","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3048682/reliability-maintenance-engineering-technician-bhx2-rme-team","job_schedule_type":"full-time","location":"GB, LEC, Coalville","locations":["{\"normalizedStateName\":\"England\",\"normalizedCountryCode\":\"GBR\",\"city\":\"Coalville\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, LEC, Coalville\",\"coordinates\":\"52.71845,-1.37218\",\"normalizedCountyName\":\"Leicestershire\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"Coalville, England, GBR\",\"location\":\"GB, LEC, Coalville\",\"region\":\"LEC\",\"buildingCodeList\":[\"BHX2\"],\"normalizedCityName\":\"Coalville\"}"],"normalized_location":"Coalville, England, GBR","optional_search_labels":["hourly","military","military-emea","ops.lander-emea-rme-reliability"],"posted_date":"July 31, 2025","preferred_qualifications":"•\tExperience in condition-based monitoring \u003cbr/\u003e•\tExperience working with print and apply machines \u003cbr/\u003e•\tExperience in fault-finding and maintaining conveyor or automation systems \u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":"LEC","title":"Reliability Maintenance Engineering Technician, BHX2 RME Team","university_job":null,"updated_time":"3 minutes","url_next_step":"https://account.amazon.com/jobs/3048682/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Work a rotating, flexible schedule, including nights, overnights, weekends and holidays. Able to work 40 hours/week, and overtime as required","business_category":"transportation-and-logistics","city":"Monterrey","company_name":"Servicios Comerciales Amazon Mexico S. de R.L. de C.V.","country_code":"MEX","description":"At Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. \u003cbr/\u003e \u003cbr/\u003eAmazon is one of the most recognizable brand names in the world and we distribute millions of products each year to our loyal customers. \u003cbr/\u003e\u003cbr/\u003eThree key areas that you will always focus on are safety, service  quality, customer experience, and productivity of your department. \u003cbr/\u003e\u003cbr/\u003eMain  activities are: \u003cbr/\u003e- Review the operational forecast and determine productivity  requirements for sort operation, manage a team group to meet all  building’s goals.  \u003cbr/\u003e- Support all safety programs to ensure a safe work environment for all associates and Delivery service providers.  \u003cbr/\u003e- Proactively identify and lead process improvement initiatives and Lean tools.  \u003cbr/\u003e  \u003cbr/\u003eSUPERVISORY RESPONSIBILITIES:  \u003cbr/\u003e- You will be part of the Amazon Logistics Team, responsible of the  day-to-day management of the delivery station, overseeing the operation  that focuses on the delivery of Amazon orders direct to customers.  \u003cbr/\u003e- Leading a team of Process Assistants and Delivery Service  Providers in daily management of the delivery station, including  meetings, training sessions, assigning job duties, and communicating  with DSPs including management representatives and their drivers.  \u003cbr/\u003e- You are responsible for ensuring that you have a safe work place,  properly trained people, and that their needs are addressed so they can  focus on their jobs.  \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eIn addition, one of the most important aspects of your job is to  lead change at internet speed… innovation has made us the global company  that we are today.  \u003cbr/\u003eHelp in daily operations: Receive, scan, lift and move shipments up to 25 kgs. Each \u003cbr/\u003eRoute shipments within the AMZL coverage area. \u003cbr/\u003eSupport and assign job duties to process assistants. \u003cbr/\u003eDue to the nature of Amazon’s business, being able to adapt to sudden changes and growth according to operational necessities. \u003cbr/\u003eTrack \u0026 monitor sorting operation and driver’s dispatch. \u003cbr/\u003eContinual standing and/or walking an average of 5 miles daily. \u003cbr/\u003eAbility to work in construction /distribution environments that may be noisy, unlit, unheated, not air-conditioned. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eTrain and develop people\u003cbr/\u003eImplement Continue Improvement Projects \u003cbr/\u003eBuild bonds between all stakeholders and peers","department_cost_center":null,"description_short":"At Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people.  Amazon is one of the most recognizable brand names in","display_distance":null,"id":"11dd432c-0058-4240-a46d-dab7730a1bbd","id_icims":"3138350","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3138350/otr-manager-jr-amzl","job_schedule_type":"full-time","location":"MX, Monterrey","locations":["{\"normalizedStateName\":\"Nuevo Leon\",\"normalizedCountryCode\":\"MEX\",\"city\":\"Monterrey\",\"countryIso3a\":\"MEX\",\"countryIso2a\":\"MX\",\"locationNonStemming\":\"Mexico, Monterrey\",\"coordinates\":\"25.67092,-100.30999\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Mexico\",\"normalizedLocation\":\"Monterrey, Nuevo Leon, MEX\",\"location\":\"MX, Monterrey\",\"region\":\"\",\"buildingCodeList\":[\"DMT2\"],\"normalizedCityName\":\"Monterrey\"}"],"normalized_location":"Monterrey, Nuevo Leon, MEX","optional_search_labels":["ops.lander-mexico","hourly"],"posted_date":"December  5, 2025","preferred_qualifications":"- Speak, write, and read fluently in English\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-last-mile-delivery","source_system":"JobCreator","state":null,"title":"OTR Manager Jr., AMZL","university_job":null,"updated_time":"3 minutes","url_next_step":"https://account.amazon.com/jobs/3138350/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-delivery","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- An Associate’s Degree or related work experience \u003cbr/\u003e- CEFR C1+ or equivalent fluency in Dutch language\u003cbr/\u003e- Written and spoken knowledge of English is essential (CEFR C1+)\u003cbr/\u003e- Strong business writing skills with ability to create reports, proposals, and professional correspondence\u003cbr/\u003e- Advanced reading comprehension with ability to analyze complex business documents\u003cbr/\u003e- Developed analytical thinking and structured problem-solving capabilities\u003cbr/\u003e- Strong ability to interpret and implement detailed instructions across various projects\u003cbr/\u003e- Proficient research skills with experience gathering and synthesizing information from multiple sources\u003cbr/\u003e- Proven attention to detail in managing complex tasks and documents","business_category":"amazon-artificial-general-intelligence","city":"Den Haag","company_name":"Amazon Development Center (Netherlands) B.V.","country_code":"NLD","description":"AI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment of large language models (LLMs) across all of our businesses. Come build the future of human-technology interaction with us.\u003cbr/\u003e\u003cbr/\u003eWe are looking for those candidates who just don’t think out of the box, but make the box they are in ‘Bigger’. The future is now, do you want to be a part of it? Then read on! \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Maintain and follow strict confidentiality as customer privacy is our most important tenet\u003cbr/\u003e- Work with a range of different types of data including, but not limited to: text, speech, audio, image, and video\u003cbr/\u003e- Deliver high-quality labelled data, using guidelines provided to meet our KPIs and using in-house tools and software, as part of Amazon's commitment to developing and deploying AI responsibly.\u003cbr/\u003e- Demonstrate proficiency in generating high quality human insight data across a range of modalities, inclusive of text, image video and audio. \u003cbr/\u003e- Capable of making sound judgments and logical decisions when faced with ambiguous or incomplete information while performing tasks.\u003cbr/\u003e- Eye for detail and ability to pivot from one category of requirement to another instantaneously.\u003cbr/\u003e- Demonstrate support on daily operational deliverables for multiple task types assigned to you and the team\u003cbr/\u003e- Analyze root causes, identify error patterns, and propose solutions to enhance the quality of labeling tasks and their outputs.\u003cbr/\u003e- Responsible for identifying day-to-day process and operational issues in Standard Operating Procedure, tools and suggest changes to unblock operations\u003cbr/\u003e- Demonstrate ownership in floor support to clarify internal queries during execution on need basis\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are looking for a Data Entry Clerks to undertake the task of foundational labeling functions, such as dialogue evaluation on speech, text, audio, video data.\u003cbr/\u003e\u003cbr/\u003eYour ability to concentrate, multi-task and your high attention to detail helps you deliver high-quality work as well as maintaining strict confidentiality and follow all applicable Amazon policies for securing confidential information. You will be a part of a diverse team with the shared vision of improving customers’ lives with practical, useful generative AI innovations. An inner drive, individuality, and a creative mind are extremely beneficial.","department_cost_center":null,"description_short":"AI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment","display_distance":null,"id":"685bbc01-dccc-4a0b-bc2c-8171630df7ea","id_icims":"3053633","is_intern":null,"is_manager":null,"job_category":"Editorial, Writing, \u0026 Content Management","job_family":"Machine Learning Data Operatio","job_function_id":null,"job_path":"/en/jobs/3053633/data-entry-clerk-with-dutch-artificial-general-intelligence-data-services","job_schedule_type":"full-time","location":"NL, Den Haag","locations":["{\"normalizedStateName\":\"South Holland\",\"normalizedCountryCode\":\"NLD\",\"city\":\"Den Haag\",\"countryIso3a\":\"NLD\",\"countryIso2a\":\"NL\",\"locationNonStemming\":\"Netherlands, Den Haag\",\"coordinates\":\"52.08408,4.31732\",\"normalizedCountyName\":\"The Hague\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Netherlands\",\"normalizedLocation\":\"The Hague, South Holland, NLD\",\"location\":\"NL, Den Haag\",\"region\":\"\",\"buildingCodeList\":[\"AMS10\"],\"normalizedCityName\":\"The Hague\"}"],"normalized_location":"The Hague, South Holland, NLD","optional_search_labels":["alexa-and-amazon-devices.team-operations-job-family","alexa-and-amazon-devices.team-administrative-support-job-family","amazon.artificial-intelligence"],"posted_date":"August 13, 2025","preferred_qualifications":"- Bachelor’s degree in a relevant field\u003cbr/\u003e- Proven experience with demonstrated task execution ability\u003cbr/\u003e- Proven capacity to leverage open-source resources effectively for comprehensive research purposes\u003cbr/\u003e- Ability to adapt well to fast-paced environments with changing circumstances, direction, and strategy\u003cbr/\u003e- Proven project coordination or management experience (for support functions teams)\u003cbr/\u003e- Experience managing stakeholder relationships across departments\u003cbr/\u003e- Advanced proficiency in Microsoft Office Suite and common business applications.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":null,"title":"Data Entry Clerk with Dutch, Artificial General Intelligence Data Services","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3053633/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- An Associate’s Degree or related work experience \u003cbr/\u003e- CEFR C1+ or equivalent fluency in Dutch language\u003cbr/\u003e- Written and spoken knowledge of English is essential (CEFR C1+)\u003cbr/\u003e- Strong business writing skills with ability to create reports, proposals, and professional correspondence\u003cbr/\u003e- Advanced reading comprehension with ability to analyze complex business documents\u003cbr/\u003e- Developed analytical thinking and structured problem-solving capabilities\u003cbr/\u003e- Strong ability to interpret and implement detailed instructions across various projects\u003cbr/\u003e- Proficient research skills with experience gathering and synthesizing information from multiple sources\u003cbr/\u003e- Proven attention to detail in managing complex tasks and documents","business_category":"amazon-artificial-general-intelligence","city":"Den Haag","company_name":"Amazon Development Center (Netherlands) B.V.","country_code":"NLD","description":"Note: This position is for part-time employment.\u003cbr/\u003e\u003cbr/\u003eAI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment of large language models (LLMs) across all of our businesses. Come build the future of human-technology interaction with us.\u003cbr/\u003e\u003cbr/\u003eWe are looking for those candidates who just don’t think out of the box, but make the box they are in ‘Bigger’. The future is now, do you want to be a part of it? Then read on! \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Maintain and follow strict confidentiality as customer privacy is our most important tenet\u003cbr/\u003e- Work with a range of different types of data including, but not limited to: text, speech, audio, image, and video\u003cbr/\u003e- Deliver high-quality labelled data, using guidelines provided to meet our KPIs and using in-house tools and software, as part of Amazon's commitment to developing and deploying AI responsibly.\u003cbr/\u003e- Demonstrate proficiency in generating high quality human insight data across a range of modalities, inclusive of text, image video and audio. \u003cbr/\u003e- Capable of making sound judgments and logical decisions when faced with ambiguous or incomplete information while performing tasks.\u003cbr/\u003e- Eye for detail and ability to pivot from one category of requirement to another instantaneously.\u003cbr/\u003e- Demonstrate support on daily operational deliverables for multiple task types assigned to you and the team\u003cbr/\u003e- Analyze root causes, identify error patterns, and propose solutions to enhance the quality of labeling tasks and their outputs.\u003cbr/\u003e- Responsible for identifying day-to-day process and operational issues in Standard Operating Procedure, tools and suggest changes to unblock operations\u003cbr/\u003e- Demonstrate ownership in floor support to clarify internal queries during execution on need basis\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are looking for a Data Entry Clerks to undertake the task of foundational labeling functions, such as dialogue evaluation on speech, text, audio, video data.\u003cbr/\u003e\u003cbr/\u003eYour ability to concentrate, multi-task and your high attention to detail helps you deliver high-quality work as well as maintaining strict confidentiality and follow all applicable Amazon policies for securing confidential information. You will be a part of a diverse team with the shared vision of improving customers’ lives with practical, useful generative AI innovations. An inner drive, individuality, and a creative mind are extremely beneficial.","department_cost_center":null,"description_short":"Note: This position is for part-time employment.AI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative","display_distance":null,"id":"a4c890bd-9588-443b-963f-9959847690f6","id_icims":"3053639","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Machine Learning Data Operatio","job_function_id":null,"job_path":"/en/jobs/3053639/data-entry-clerk-with-dutch-part-time-agi-data-services","job_schedule_type":"part-time","location":"NL, Den Haag","locations":["{\"normalizedStateName\":\"South Holland\",\"normalizedCountryCode\":\"NLD\",\"city\":\"Den Haag\",\"countryIso3a\":\"NLD\",\"countryIso2a\":\"NL\",\"locationNonStemming\":\"Netherlands, Den Haag\",\"coordinates\":\"52.08408,4.31732\",\"normalizedCountyName\":\"The Hague\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Netherlands\",\"normalizedLocation\":\"The Hague, South Holland, NLD\",\"location\":\"NL, Den Haag\",\"region\":\"\",\"buildingCodeList\":[\"AMS10\"],\"normalizedCityName\":\"The Hague\"}"],"normalized_location":"The Hague, South Holland, NLD","optional_search_labels":["alexa-and-amazon-devices.team-operations-job-family","alexa-and-amazon-devices.team-administrative-support-job-family","amazon.artificial-intelligence"],"posted_date":"August 18, 2025","preferred_qualifications":"- Bachelor’s degree in a relevant field\u003cbr/\u003e- 2+ years of professional work experience with demonstrated task execution ability\u003cbr/\u003e- Proven capacity to leverage open-source resources effectively for comprehensive research purposes\u003cbr/\u003e- Ability to adapt well to fast-paced environments with changing circumstances, direction, and strategy\u003cbr/\u003e- 2-3 years project coordination or management experience (for support functions teams)\u003cbr/\u003e- Experience managing stakeholder relationships across departments\u003cbr/\u003e- Advanced proficiency in Microsoft Office Suite and common business applications.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":null,"title":"Data Entry Clerk with Dutch (Part-Time), AGI-Data Services","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3053639/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience working with REST API based services, or experience troubleshooting and debugging technical systems and experience that includes strong analytical skills, attention to detail, and effective communication abilities\u003cbr/\u003e- Knowledge of one or more scripting languages (e.g., Python, Ruby, Perl)\u003cbr/\u003e- Experience managing and negotiating contracts and vendor relationships\u003cbr/\u003e- Experience leading technical initiatives and key deliverables\u003cbr/\u003e- Experience in written and verbal communication skills to communicate with technical and non-technical audiences, including senior leadership\u003cbr/\u003e- Experience with reporting and Data Visualization tools such as Quick Sight / Tableau / Power BI or other BI packages\u003cbr/\u003e- Experience with customer support platforms, preferably Intercom","business_category":"amazon-business","city":"Swansea","company_name":"Veeqo Limited - L69","country_code":"GBR","description":"Veeqo Support serves as the first point of contact for Veeqo users through our AI chatbot Vera and our talented team of 1st and 2nd line agents, handling 80k+ tickets annually from our seller base across the UK and US. The team works collaboratively with 1st and 2nd line agents, tech writers, program managers, and leadership, maintaining a relentless focus on AI innovation and driving AI resolution rates so that human agents can concentrate on complex and challenging work that directly improves the seller experience.\u003cbr/\u003e\u003cbr/\u003eWe are seeking a Support Systems Specialist to drive the technical optimisation of our seller support infrastructure. This role is responsible for the day-to-day operation, enhancement, and strategic leverage of Intercom for ticket management and chatbot functionality within Veeqo's support ecosystem as well as several other systems and tools. You will be instrumental in maximising AI resolution rates while maintaining exceptional seller experience through innovative technical solutions.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003ePlatform Management \u0026 Optimisation\u003cbr/\u003e\u003cbr/\u003e* Manage daily operations of Intercom ticket management system and chatbot infrastructure\u003cbr/\u003e* Continuously optimise system performance, workflow efficiency, and user experience\u003cbr/\u003e* Monitor system health, identify bottlenecks, and implement proactive solutions\u003cbr/\u003e* Develop and maintain comprehensive system documentation and best practices\u003cbr/\u003e\u003cbr/\u003eIntegration \u0026 Automation\u003cbr/\u003e\u003cbr/\u003e* Design and implement creative integrations between Intercom and third-party software solutions\u003cbr/\u003e* Build robust API connections that enhance AI resolution capabilities and streamline support processes\u003cbr/\u003e* Develop custom scripts and automations to reduce manual workload and improve response times\u003cbr/\u003e* Ensure seamless data flow between systems while maintaining data integrity and security\u003cbr/\u003e\u003cbr/\u003eAI \u0026 Analytics Enhancement\u003cbr/\u003e\u003cbr/\u003e* Craft innovative approaches to improve AI resolution rates through technical optimisation\u003cbr/\u003e* Develop SQL queries and reports to analyse support metrics, identify trends, and drive data-driven decisions. \u003cbr/\u003e* Create automated quality monitoring systems that protect and enhance seller experience\u003cbr/\u003e* Implement feedback loops that continuously improve AI performance and accuracy\u003cbr/\u003e\u003cbr/\u003eStrategic Partnership \u0026 Vendor Management\u003cbr/\u003e\u003cbr/\u003e* Collaborate with third-party suppliers to negotiate optimal outcomes for Veeqo support operations\u003cbr/\u003e* Evaluate new technologies and tools that could enhance support capabilities\u003cbr/\u003e* Lead technical discussions with vendors to ensure solutions align with business requirements\u003cbr/\u003e* Manage vendor relationships to maximise value and minimise risk\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eVeeqo (https://www.veeqo.com/) is Amazon’s Free Shipping and Inventory Management Software, allowing Amazon sellers to manage orders across a range of ecommerce websites and marketplaces and purchases shipping labels with the lowest commercial rates from major shipping carriers.\u003cbr/\u003e\u003cbr/\u003eWe are a transparent, collaborative organization that values driven, adaptable team members focused on getting the job done. We all approach every task with passion - no matter the scale. Our friendly, supportive team works hard but prioritizes a healthy work-life balance. We care about your personal life, family, and interests outside of work.\u003cbr/\u003e\u003cbr/\u003eThe office has a relaxed and welcoming atmosphere (and is dog-friendly!). We also organize monthly social events for the team to help bond and enjoy each other's company in a more casual setting.","department_cost_center":null,"description_short":"Veeqo Support serves as the first point of contact for Veeqo users through our AI chatbot Vera and our talented team of 1st and 2nd line agents, handling 80k+ tickets annually from our seller base across","display_distance":null,"id":"5084ccf4-313d-4991-82c5-ee75d6ed27af","id_icims":"3149450","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"System Planning/Administration","job_function_id":null,"job_path":"/en/jobs/3149450/support-systems-specialist-veeqo","job_schedule_type":"full-time","location":"GB, Swansea","locations":["{\"normalizedStateName\":\"Wales\",\"normalizedCountryCode\":\"GBR\",\"city\":\"Swansea\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, Swansea\",\"coordinates\":\"51.62315,-3.94083\",\"normalizedCountyName\":\"West Glamorgan\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"Swansea, Wales, GBR\",\"location\":\"GB, Swansea\",\"region\":\"\",\"buildingCodeList\":[\"SWS12\"],\"normalizedCityName\":\"Swansea\"}"],"normalized_location":"Swansea, Wales, GBR","optional_search_labels":[],"posted_date":"December 28, 2025","preferred_qualifications":"- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- Understanding of AI/ML concepts and chatbot optimization\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-business.team-consumer-3p-job-posting","source_system":"JobCreator","state":null,"title":"Support Systems Specialist, Veeqo","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3149450/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-consumer-3p-job-posting","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 4+ years of software development, or 4+ years of technical support experience\u003cbr/\u003e- Experience troubleshooting and debugging technical systems\u003cbr/\u003e- Experience troubleshooting and documenting findings","business_category":"ecp","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Executive Support Engineers work with Amazon Senior Leadership teams to support their IT needs. Our customers need timely, accurate, and professional support to minimize downtime and disruption. A successful Executive Support Engineer excels in a fast-paced, team environment and possesses excellent communication skills. They have a high degree of technical aptitude over a large scope of IT software, hardware, and networking disciplines, and know how to convey that knowledge to customers with all levels of technical knowledge.\u003cbr/\u003eAs an Executive Support Engineer, you will use your technical knowledge and specialized skills to drive solutions across multiple service owners, collaborate to build unique solutions quickly, and improve technology solutions that support all Amazonians. You are able to manage large projects with minimal guidance. You are able to resolve customer issues in time of crisis to get them working again. You are actively expanding your scope of knowledge by learning about software design patterns, data structures, AWS technologies and distributed systems concepts.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eResponsibilities include, but are not limited to \u003cbr/\u003e• Troubleshoot difficult IT problems without SOPs. \u003cbr/\u003e• Collaborate with internal teams or vendors to execute projects and resolve customer issues. \u003cbr/\u003e• Lead continuous improvement efforts. \u003cbr/\u003e• Audit the quality of work performed and provide constructive feedback when necessary. \u003cbr/\u003e• Automate manual tasks; create/improve small tools that help make team operations more efficient. \u003cbr/\u003e• Be the first point of escalation. \u003cbr/\u003e• Own customer issues and drive to completion. \u003cbr/\u003e• Participate in hiring, training and development of others. \u003cbr/\u003e• High attention to detail and capable of managing multiple priorities simultaneously. \u003cbr/\u003e• On-call for high-severity issues outside standard hours. \u003cbr/\u003e• Work with the team onsite in our corporate offices Monday-Friday. \u003cbr/\u003e• Ability to travel up to 30%.\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Executive Support Engineers work with Amazon Senior Leadership teams to support their IT needs. Our customers need timely, accurate, and professional support to minimize downtime and disruption. A successful","display_distance":null,"id":"3f3ae2ef-6deb-4c13-b80f-1d739de334ff","id_icims":"3086869","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Support Engineering","job_function_id":null,"job_path":"/en/jobs/3086869/executive-support-eng-ii-red","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA44\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"September 17, 2025","preferred_qualifications":"- Knowledge of distributed applications/enterprise applications\u003cbr/\u003e- Knowledge of UNIX/Linux operating system\u003cbr/\u003e- Experience in agile/scrum or related collaborative workflow\u003cbr/\u003e- Experience scripting in modern program languages\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 90,400.00 - 158,200.00 USD annually","primary_search_label":"ecp.engine","source_system":"JobCreator","state":"WA","title":"Executive Support Eng II (RED)","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3086869/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"engine","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Knowledge of SQL at an intermediate level, including: compile queries, subqueries, aggregation/grouping, data modification, etc.\u003cbr/\u003e- 2+ years of defining and implementing process improvement initiatives using data and metrics experience\u003cbr/\u003e- 3+ years of supply chain experience\u003cbr/\u003e- Experience defining program requirements and using data and metrics to determine improvements\u003cbr/\u003e- Bachelor's degree in supply chain management, operations, engineering, analytics or related field\u003cbr/\u003e- Knowledge of Microsoft Excel at an advanced level, including: pivot tables, macros, index/match, vlookup, VBA, data links, etc.","business_category":"operations","city":"London","company_name":"Amazon UK Services Ltd.","country_code":"GBR","description":"The OpsTech Solutions - Supply Chain (OTS-SC) team plays a critical role in supporting Amazon's Worldwide (WW) Stores business by overseeing planning, purchasing, procuring, provisioning, assembling, shipping, deploying, and managing IT equipment. This team is responsible for facilitating new site launches, retrofits, expansions, relocations, colocations, decommissions, customer programs, and lifecycle programs.\u003cbr/\u003e\u003cbr/\u003eWithin this dynamic environment, the Supply Chain Mgr will play a crucial role for executing integrated planning activities across demand planning, supply planning, and production scheduling. The role requires hands-on ownership of planning processes to ensure equipment is available and deployed on time, in full (OTIF), and in alignment with evolving business needs.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate brings a strong mix of supply chain expertise, data fluency, and technical acumen. This includes leveraging AI/ML models to enhance forecast accuracy and optimize planning decisions, while driving process automation and systems integration at scale. Acting as a cross-functional bridge between business, operations, and technical teams, the Supply Chain Mgr will play a pivotal role in shaping how OTS-SC anticipates and meets demand with speed, precision, and agility.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Own and execute end-to-end supply chain planning across demand forecasting, supply planning, and production scheduling to ensure on-time, in-full (OTIF) delivery of IT hardware and infrastructure.\u003cbr/\u003e- Translate demand signals and business requirements into executable supply and production plans, collaborating closely with procurement, capital planning, and deployment teams.\u003cbr/\u003e- Develop and maintain data-driven forecasting models that integrate historical trends, project inputs, and operational constraints.\u003cbr/\u003e- Identify and mitigate planning risks including demand variability, supplier lead times, and production capacity limitations through proactive scenario planning and cross-functional alignment.\u003cbr/\u003e- Lead the development and enhancement of internal planning tools and applications that improve forecast accuracy, material visibility, inventory management, and automation of planning processes.\u003cbr/\u003e- Act as the functional owner and product lead for key supply chain systems—gathering requirements, defining roadmaps, and ensuring tools meet the evolving needs of users and stakeholders.\u003cbr/\u003e- Collaborate with technical teams (data engineering, software developers, BI/analytics) to build scalable solutions that integrate ERP, supply chain, and procurement systems.\u003cbr/\u003e- Drive the development and deployment of planning tools and dashboards using platforms such as Redshift, PowerBI, Quicksight, or Tableau to enable real-time visibility and decision-making.\u003cbr/\u003e- Leverage AI/ML models to enhance demand forecasting, anomaly detection, and exception-based planning to reduce manual workload and improve decision-making.\u003cbr/\u003e- Conduct user testing, implement feedback loops, and continuously iterate on tools and features to drive adoption and maximize impact across planning workflows.\u003cbr/\u003e- Partner with cross-functional stakeholders (Product, Operations, Finance, Engineering) to align tool development and planning strategies with broader business objectives.\u003cbr/\u003e- Monitor key planning and system adoption KPIs (forecast accuracy, fill rate, inventory turns, tool usage) and report findings in regular business reviews.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. \u003cbr/\u003e\u003cbr/\u003eAt Amazon, we value people with unique backgrounds, experiences, and skillsets. If you’re passionate about this role and want to make an impact on a global scale, please apply!\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Tech Materials Planning team is a strategic enabler of Amazon's global operations. We manage the end-to-end lifecycle of IT infrastructure—from planning and procurement to configuration and deployment—ensuring that the right equipment gets to the right place, at the right time.\u003cbr/\u003e\u003cbr/\u003eOur team supports a wide range of initiatives, including new site launches, retrofits, data center expansions, relocations, and lifecycle management programs. We operate at the intersection of supply chain, technology, and operations—delivering scalable solutions to support the rapid growth and evolving needs of the business.\u003cbr/\u003e\u003cbr/\u003eOTS-SC thrives on solving complex challenges with speed, precision, and creativity. We are deeply data-driven, customer-obsessed, and constantly pushing the boundaries of what supply chain planning and execution can achieve. Collaboration is at the heart of everything we do—working cross-functionally with engineering, finance, program management, and operations teams to ensure success from plan to deployment.\u003cbr/\u003e\u003cbr/\u003eIf you're excited by solving ambiguous problems, building high-impact planning systems, and driving operational excellence at scale, you’ll find yourself at home on this team.","department_cost_center":null,"description_short":"The OpsTech Solutions - Supply Chain (OTS-SC) team plays a critical role in supporting Amazon's Worldwide (WW) Stores business by overseeing planning, purchasing, procuring, provisioning, assembling, shipping,","display_distance":null,"id":"5c0b4130-3caf-4de3-9c00-df1e4a5cb661","id_icims":"3136854","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Supply Chain Management","job_function_id":null,"job_path":"/en/jobs/3136854/supply-chain-manager-ii-technology-materials-planning","job_schedule_type":"full-time","location":"GB, London","locations":["{\"normalizedStateName\":\"England\",\"normalizedCountryCode\":\"GBR\",\"city\":\"London\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, London\",\"coordinates\":\"51.50643,-0.12719\",\"normalizedCountyName\":\"London\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"London, England, GBR\",\"location\":\"GB, London\",\"region\":\"\",\"buildingCodeList\":[\"LHR16\"],\"normalizedCityName\":\"London\"}"],"normalized_location":"London, England, GBR","optional_search_labels":["ops.lander-corp-emea"],"posted_date":"December  3, 2025","preferred_qualifications":"- 3+ years of driving end to end delivery, and communicating results to senior leadership experience\u003cbr/\u003e- 3+ years of driving process improvements experience\u003cbr/\u003e- Experience in stakeholder management, dealing with multiple stakeholders at varied levels of the organization\u003cbr/\u003e- Experience implementing repeatable processes and driving automation or standardization\u003cbr/\u003e- Master's degree in supply chain management, operations, engineering, analytics or related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"operations.team-ops-it","source_system":"JobCreator","state":null,"title":"Supply Chain Manager II, Technology Materials Planning","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3136854/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-ops-it","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Tracy","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Job summary\u003cbr/\u003eOur WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Operations Manager. In this role, you will lead and develop a team of salaried and hourly talent. You will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. To achieve this, managers are expected to provide their team with the tools needed for success while driving improvements in productivity and efficiency through data-driven decisions and analytical problem-solving. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e   \u003cbr/\u003e  Our Operation’s workflow has three major components:  First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer.\u003cbr/\u003e \u003cbr/\u003e Key Responsibilities and Job Elements:\u003cbr/\u003e - Support, mentor, and motivate your salaried and hourly workforce\u003cbr/\u003e - Lead large-scope projects with site and regional impact\u003cbr/\u003e - Build and execute productivity plans through forecast reviews, determining productivity requirements, and partnering with other Leaders to load balance \u003cbr/\u003e - Manage safety, quality, productivity, and customer delivery promises \u003cbr/\u003e - Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e - Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e - Stand/walk for up to 12 hours during shifts \u003cbr/\u003e - Work in an environment where the noise level varies and can be loud\u003cbr/\u003e - Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e - Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e   Our fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Operations Managers based on location preference and the business’ current openings.  ","department_cost_center":null,"description_short":"Job summaryOur WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Operations","display_distance":null,"id":"c537b8ee-b811-4e1a-a077-30f29cd0818c","id_icims":"3159583","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3159583/operations-manager","job_schedule_type":"full-time","location":"US, CA, Tracy","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Tracy\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Tracy\",\"coordinates\":\"37.7397,-121.42641\",\"normalizedCountyName\":\"San Joaquin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Tracy, California, USA\",\"location\":\"US, CA, Tracy\",\"region\":\"CA\",\"buildingCodeList\":[\"OAK4\"],\"normalizedCityName\":\"Tracy\"}"],"normalized_location":"Tracy, California, USA","optional_search_labels":[],"posted_date":"January 14, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 2+ salaried employees and 70+ indirect employees\u003cbr/\u003e- Experience scoping, leading, and implementing process improvements through: Lean process, Kaizen, and/or Six Sigma.\u003cbr/\u003e- Demonstrated problem solving skills and analytical skills\u003cbr/\u003e- Excellent customer service skills, communication skills and interpersonal skills\u003cbr/\u003e- Track record of meeting or exceeding department performance goals\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Experience in: military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production, or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Tracy - 91,000.00 - 136,500.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"CA","title":"Operations Manager","university_job":null,"updated_time":"19 minutes","url_next_step":"https://account.amazon.com/jobs/3159583/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}