{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Fortgeschrittene Deutschkenntnisse in Wort und Schrift.\u003cbr/\u003e- Erfahrung in der Arbeit mit Datenanalytik und deren Anwendung zur Problemerkennung\u003cbr/\u003e- Erfahrung mit MS Office (Word, Excel, Outlook) im beruflichen Umfeld","business_category":"operations-team","city":"Contwig","company_name":"Amazon Kaiserslautern GmbH - M49","country_code":"DEU","description":"Der operative Geschäftsbereich ist das Herz von Amazon. Ein effektiv ablaufender Betrieb trägt dazu bei, dass Artikel bearbeitet und rechtzeitig an unsere Kund:innen versendet werden. Als Operations Lead erlebst Du, wie alle unterschiedlichen Teile des Betriebs funktionieren und trägst zu einem reibungslosen Ablauf bei.\u003cbr/\u003eDu fungierst als erste:r Ansprechpartner:in für Teammitglieder während ihrer Schicht und hilfst ihnen beim Befolgen der Prozesse, die Deine Manager:innen eingeführt haben. Du sammelst praktische Erfahrung und benutzt analytische Systeme, die zum Erfolg unseres Unternehmens beitragen. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Messung und Überwachung von Arbeitsflüssen, Verfolgen der Leistung am Standort und Bereitstellung wichtiger Schichtinformationen an die Schicht-/Bereichsleiter:innen im Betrieb, um für schichtübergreifende Operational Excellence zu sorgen\u003cbr/\u003e- Unterstützung und Schulung von Mitarbeitenden, damit diese großartige Leistungen erbringen können, und Beaufsichtigung ihrer täglichen Aufgaben\u003cbr/\u003e- Unterstützung des/der Schicht-/Bereichsleiter:in bei Projekten zur Prozessverbesserung, Förderung eines sicheren Arbeitsumfelds und Erhöhung des Mitarbeiterengagements \u003cbr/\u003e- Zusammenarbeit mit anderen Abteilungen, um Lösungen für häufige Probleme zu finden oder Bedürfnisse in wichtigen Leistungsbereichen zu erfüllen\u003cbr/\u003e- Nutzung von Datenanalysen, um Möglichkeiten zur Optimierung von Sicherheit, Qualität und Produktivität zu finden \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAls Operations Lead arbeitest Du an einem unserer Betriebsstandorte. Du unterstützt Deine:n Schicht-/Bereichsleiter:in bei der Durchführung des Schichtplans. Du hilft bei der Vorbereitung von Schichtbesprechungen mit Deinem Team und überwachst Verfahren und Abläufe. Damit stellst du sicher, dass Sicherheitsregeln, Qualitätssicherungsprozesse und die Prioritäten für den Tag befolgt werden.\u003cbr/\u003eProbleme, die Du bemerkst, eskalierst Du an Deine:n Manager:in. Gelegentlich agierst Du auch selbst als Schichtleiter:in und bietest Deinen Mitarbeitenden die notwendige Anleitung, um ihre Aufgaben zu erledigen. Bei Bedarf unterstützt Du Deine:n Schicht-/Bereichsleiter:in bei der Schichtplanung und sorgst dafür, dass zu Stoßzeiten genügend Teammitglieder eingeteilt sind. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eMit der Erfüllung unserer Kundenbestellungen (Customer Fulfillment oder CF) fing für Amazon alles an. Das Customer Fulfillment Team hat sich mittlerweile von einem bescheidenen Team von Buchhändler:innen hin zu einem hocherfahrenen globalen Team gewandelt, das täglich mehr als 1,5 Millionen Bestellungen bearbeitet. Das Team bildet die Grundlage unseres Geschäfts und hat uns bei der Verbreiterung in neue Regionen und Dienstleistungen geholfen. Mithilfe aufkommender Technologie sind wir laufend auf der Suche nach Möglichkeiten, eine größere und bessere Produktauswahl anzubieten – die schnell und erschwinglich geliefert wird.\u003cbr/\u003eDie CF-Teammitglieder sorgen als allererste dafür, dass unsere Kund:innen ihre Bestellungen mit der Geschwindigkeit erhalten, für die wir bekannt sind. Wir arbeiten in Fulfillment-Centern, die das Herzstück von Amazons dynamischem Betriebsnetz bilden. Unsere Fullfilment-Center werden manchmal auch als die „erste Meile“ (First Mile) bezeichnet – hier starten die meisten Amazon-Pakete ihren Versandweg. Wir unterstützen die Verwaltung eines dynamischen Bestands und ermöglichen schnelle Zustellungen rund um die Uhr.\u003cbr/\u003eIn unseren Fulfillment-Centern sind vielfältige Mitarbeitergruppen beschäftigt. Es gibt zahlreiche Möglichkeiten für Menschen mit den verschiedensten Fähigkeiten. Einige von uns arbeiten mit physischen Produkten. Andere analysieren Daten und helfen unternehmensweit dabei, intelligente Entscheidungen zu treffen.","department_cost_center":null,"description_short":"Der operative Geschäftsbereich ist das Herz von Amazon. Ein effektiv ablaufender Betrieb trägt dazu bei, dass Artikel bearbeitet und rechtzeitig an unsere Kund:innen versendet werden. Als Operations Lead","display_distance":null,"id":"cd513eb5-285d-4c07-b6fb-0d6672c739d1","id_icims":"3154217","is_intern":null,"is_manager":null,"job_category":"Fulfillment Associate","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3154217/operations-lead","job_schedule_type":"full-time","location":"DE, Contwig","locations":["{\"normalizedStateName\":\"Rhineland-Palatinate\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Contwig\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, Contwig\",\"coordinates\":\"49.24825,7.42892\",\"normalizedCountyName\":\"Südwestpfalz\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Contwig, Rhineland-Palatinate, DEU\",\"location\":\"DE, Contwig\",\"region\":\"\",\"buildingCodeList\":[\"SCN4\"],\"normalizedCityName\":\"Contwig\"}"],"normalized_location":"Contwig, Rhineland-Palatinate, DEU","optional_search_labels":[],"posted_date":"January  8, 2026","preferred_qualifications":"- Erfahrung im Stakeholdermanagement, einschließlich Aufbau und Pflege professioneller Beziehungen\u003cbr/\u003e- Erfahrung in der Arbeit in einem Betriebsumfeld, beispielsweise in Logistik, Einzelhandel, Gastgewerbe oder im Kundenservice\u003cbr/\u003e- Fortgeschrittene Englischkenntnisse\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"operations-team.transportation-operations-management","source_system":"JobCreator","state":null,"title":"Operations Lead","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3154217/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"transportation-operations-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of electrical or mechanical engineering experience\u003cbr/\u003e- 3+ years of data center or mission critical facilities (example: hospital, military facility, public safety facility, etc.) experience\u003cbr/\u003e- Technical (Military/Trade School) training or degree in a relevant field (for example: electrical, mechanical).","business_category":"aws","city":"New Carlisle","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is looking for a detail-oriented individual to join our Data Center Engineering Operations Team. This committed group works to maintain the critical physical infrastructure that supports Amazon Web Services. Specifically, this team works to ensure that the data center's MEP operates at 100% availability while maintaining first-class customer service to the teams and groups within the data centers.\u003cbr/\u003e\u003cbr/\u003eThe Data Center Chief Engineer (CE) is responsible for ensuring that all electrical, mechanical, and fire/life safety equipment within the data center is operating at peak efficiency. This involves planned preventative maintenance of equipment, daily corrective work, and emergency response. The CE serves as an expert technical resource interacting with onsite Engineering Operations Technicians (EOT) and any third party vendors. They are expected to be a singular focal point for all facility operations within a given data center and to support AWS.\u003cbr/\u003e\u003cbr/\u003eThis position will work with the night teams to ensure training and drills are conducted and completed successfully, ensuring properly trained night staff.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Management and leadership of DCEO Engineering Team\u003cbr/\u003e- Establish performance benchmarks, conduct analyses, and prepare reports on all aspects of the critical facility operations and maintenance\u003cbr/\u003e- Responsible for the on-site management of shift technicians, senior shift technicians, sub-contractors and vendors\u003cbr/\u003e- Oversee operation and management of routine and emergency services on a variety of critical systems such as: switchgear, generators, UPS systems, power distribution equipment, chillers, cooling towers, computer room air handlers, building monitoring systems, etc\u003cbr/\u003e- Data Center capacity planning and reporting\u003cbr/\u003e- May assist in the design and build out of new facilities\u003cbr/\u003e- Work with IT managers and other business leaders to coordinate projects, manage capacity, and optimize plant safety, performance, reliability and efficiency\u003cbr/\u003e- Deliver quality service and ensure all customer demands are met\u003cbr/\u003e- Responsible for asset and inventory management\u003cbr/\u003e- Respond to out of hours emergency calls – first level escalation point for Data Center facilities related issues / failures\u003cbr/\u003e- Primary oncall shift rotation- Training and development of EOTs including night shift personnel.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"cd05c9fb-e8a8-49e4-9e58-cb8c94859193","id_icims":"3101337","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3101337/data-center-chief-engineer-dceo","job_schedule_type":"full-time","location":"US, IN, New Carlisle","locations":["{\"normalizedStateName\":\"Indiana\",\"normalizedCountryCode\":\"USA\",\"city\":\"New Carlisle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, IN, New Carlisle\",\"coordinates\":\"41.70584,-86.51309\",\"normalizedCountyName\":\"St Joseph\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New Carlisle, Indiana, USA\",\"location\":\"US, IN, New Carlisle\",\"region\":\"IN\",\"buildingCodeList\":[\"SBN104\"],\"normalizedCityName\":\"New Carlisle\"}"],"normalized_location":"New Carlisle, Indiana, USA","optional_search_labels":["aws.team-dc","military","aws.team-ais"],"posted_date":"October  5, 2025","preferred_qualifications":"- 4+ years of data center engineering experience\u003cbr/\u003e- Associate's degree, or Bachelor's degree\u003cbr/\u003e- Experience leading a team.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $86,400/year in our lowest geographic market up to $191,200/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"IN","title":"Data Center Chief Engineer, DCEO","university_job":null,"updated_time":"24 minutes","url_next_step":"https://account.amazon.com/jobs/3101337/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- 1+ years of computer/server hardware troubleshooting or related IT experience\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Fairless Hills","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring seamless data center operations that power millions of businesses and services worldwide.\u003cbr/\u003e\u003cbr/\u003eData Center Technicians should be willing to work both independently and with a team. Work prioritization, organizational skills, effective communication, and the ability to react quickly are critical to success. In addition to hardware and network repair, candidates will install equipment, create documentation, innovate solutions, and fix problems within the data center space. This team works in an environment that operates 24/7. Traveling within and outside of the regional work area is required.\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role.\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position.\u003cbr/\u003e\u003cbr/\u003ePhysical requirements:\u003cbr/\u003e•\tRegularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds\u003cbr/\u003e•\tWorking in cramped and/or elevated locations\u003cbr/\u003e•\tBending, lifting, stretching, and reaching\u003cbr/\u003e•\tStanding and walking for up to 8+ hours a day\u003cbr/\u003e•\tAscending and descending ladders, stairs, and gangways safely and without limitation\u003cbr/\u003e•\tWork in a noisy environment\u003cbr/\u003e•\tWork shifts longer than 8 hours to support 24/7 operations (covering both night and day shifts).\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational.\u003cbr/\u003eEssential Requirements: \u003cbr/\u003e•\tAbility to travel to or commute between data center locations as needed \u003cbr/\u003e•\tWillingness to temporarily work at alternative sites during training periods or until assigned facility is operational \u003cbr/\u003e•\tTravel frequency will vary based on business needs and operational status of assigned facility\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tPerforming server rack installations, hardware break-fix on various components, troubleshooting network issues, and responding to operational incidents that impact service availability, escalating to senior technicians and management as needed/required\u003cbr/\u003e•\tServing as a primary contact point for both internal and external stakeholders, including engineers, software developers, vendors, and contractors\u003cbr/\u003e•\tPerforming on-call duties and participating in scheduled maintenance and change management activities\u003cbr/\u003e•\tContributing to documentation and process improvement initiatives based on your analysis of operational issues\u003cbr/\u003e•\tHelping to train and onboard new team members\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Data Center Technician professional, you have industry-leading technical abilities and demonstrate a breadth of knowledge while you:\u003cbr/\u003e•\tTake ownership of technical issues brought by their customer base, engaging other teams when needed to drive resolution\u003cbr/\u003e•\tSolve problems at their root and step back to understand the broader context\u003cbr/\u003e•\tMaintain service level agreements through the implementation of proactive issue detection and reporting\u003cbr/\u003eYou will be required to work shift work that will include days/nights/weekends/holidays. Traveling within and outside of the regional work area is required. You will be responsible for having a reliable personal vehicle and valid driver's license to travel within the regional work area, as company transportation will not be provided.\u003cbr/\u003e","department_cost_center":null,"description_short":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring","display_distance":null,"id":"b0902a5e-e3fc-4a01-b5f6-ab09b7a4e20e","id_icims":"3169396","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3169396/data-center-technician-dcc-communities","job_schedule_type":"full-time","location":"US, PA, Fairless Hills","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Fairless Hills\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Fairless Hills\",\"coordinates\":\"40.17334,-74.85369\",\"normalizedCountyName\":\"Bucks\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Fairless Hills, Pennsylvania, USA\",\"location\":\"US, PA, Fairless Hills\",\"region\":\"PA\",\"buildingCodeList\":[\"PNE101\"],\"normalizedCityName\":\"Fairless Hills\"}"],"normalized_location":"Fairless Hills, Pennsylvania, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"January 29, 2026","preferred_qualifications":"- Experience managing work and priorities through a ticketing system\u003cbr/\u003e- Experience working in a Data Center environment\u003cbr/\u003e- An Associate’s degree, technical certification, or equivalent professional or military experience in a relevant field (e.g., computer science, networking engineering, etc.)\u003cbr/\u003e- Understanding of network design, protocols and layer 1/2 troubleshooting\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, PA, Fairless Hills - 27.00 - 47.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"PA","title":"Data Center Technician , DCC Communities","university_job":null,"updated_time":"24 minutes","url_next_step":"https://account.amazon.com/jobs/3169396/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 7+ years of engineering experience\u003cbr/\u003e- 3+ years of engineering team management experience\u003cbr/\u003e- 8+ years of leading the definition and development of multi tier web services experience\u003cbr/\u003e- Knowledge of engineering practices and patterns for the full software/hardware/networks development life cycle, including coding standards, code reviews, source control management, build processes, testing, certification, and livesite operations\u003cbr/\u003e- Experience partnering with product or program management teams","business_category":"consumerpayments","city":"Bengaluru","company_name":"ADCI - Haryana","country_code":"IND","description":"We are looking for a tenured Software Development Manager to lead our Amazon Payments initiatives across multiple geographies. This is a mission-critical role driving innovation, scale, and compliance for Amazon Payments.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Lead high-performing engineering teams delivering reliable, highly available software for critical and complex systems.\u003cbr/\u003e* Partner with Product Managers and global stakeholders to define strategy and roadmap.\u003cbr/\u003e* Drive architecture and design decisions that shape Amazon’s Payments backbone.\u003cbr/\u003e* Integrate GenAI and predictive analytics to simplify reconciliations, automate workflows, and enable proactive risk management.\u003cbr/\u003e* Hire, coach, and grow talent while instilling a culture of innovation, accountability, and high standards.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Amazon Payments team is responsible for developing the platform and applications used to introduce new and innovative payment methods to customers as well as support Amazon’s global Co Branded and Private label credit cards along with the world’s largest rewards catalog, Shop with Points. ","department_cost_center":null,"description_short":"We are looking for a tenured Software Development Manager to lead our Amazon Payments initiatives across multiple geographies. This is a mission-critical role driving innovation, scale, and compliance","display_distance":null,"id":"98f71481-0644-4830-a897-3e7dbdafad9d","id_icims":"3184612","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3184612/software-development-manager-iii-amazon-payments","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR26\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"February 19, 2026","preferred_qualifications":"- Experience in communicating with users, other technical teams, and senior leadership to collect requirements, describe software product features, technical designs, and product strategy\u003cbr/\u003e- Experience in recruiting, hiring, mentoring/coaching and managing teams of Software Engineers to improve their skills, and make them more effective, product software engineers\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"consumerpayments.no-team-listed","source_system":"JobCreator","state":"KA","title":"Software Development Manager III, Amazon Payments","university_job":null,"updated_time":"28 minutes","url_next_step":"https://account.amazon.com/jobs/3184612/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of analyzing and interpreting data with Redshift, Oracle, NoSQL etc. experience\u003cbr/\u003e- Experience with data visualization using Tableau, Quicksight, or similar tools\u003cbr/\u003e- Experience with one or more industry analytics visualization tools (e.g. Excel, Tableau, QuickSight, MicroStrategy, PowerBI) and statistical methods (e.g. t-test, Chi-squared)\u003cbr/\u003e- Experience with scripting language (e.g., Python, Java, or R)","business_category":"international-stores","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"Amazon’s Consumer Payments organization is seeking a highly quantitative, experienced Business Intelligence Engineer to drive the development of analytics and insights. You will succeed in this role if you are an organized self-starter who can learn new technologies quickly and excel in a fast-paced environment. In this position, you will be a key contributor and sparring partner, developing analytics and insights that global executive management teams and business leaders will use to define global strategies and deep dive businesses.\u003cbr/\u003eOur team offers a unique opportunity to build a new set of analytical experiences from the ground up. You will be part the team that is focused on acquiring new merchants from around the world to payments around the world. The position is based in India but will interact with global leaders and teams in Europe, Japan, US, and other regions. You should be highly analytical, resourceful, customer focused, team oriented, and have an ability to work independently under time constraints to meet deadlines. You will be comfortable thinking big and diving deep. A proven track record in taking on end-to-end ownership and successfully delivering results in a fast-paced, dynamic business environment is strongly preferred.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e - Partnering with engineering, product, business and finance teams to create key performance indicators and new methodologies for measurement\u003cbr/\u003e - Fluency in analytical communication to translate data into actionable insights for stakeholders both in and out of the team, create analytical insights to identify key priorities\u003cbr/\u003e - Proactively make and justify recommendations based on advanced statistical techniques, deep familiarity with the customer or developer experiences, as well as by cross-referencing multiple data sources and comparing against the wider industry\u003cbr/\u003e - Determine best-in-class performance reports and automate reporting for regular metrics, identify areas of opportunity to automate, scale ad-hoc analyses, build and inform BI tool improvements\u003cbr/\u003e - Providing requirements for telemetry and data structure to improve ability to extract data efficiently and provide the team insights faster\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e\u003cbr/\u003e - Analyze data and find insights to either drive strategic business decisions or to drive incremental signups or revenue. \u003cbr/\u003e - Define and develop business critical metrics and reports across all international business levers, key performance indicators, and financials.\u003cbr/\u003e - Own alignment and standardization of analytical initiatives across the global business teams\u003cbr/\u003e - Drive efforts across international business leaders, BI leaders and executive management across Europe, Asia and North America.\u003cbr/\u003e - Own key executive reports and metrics that are consumed by our VPs and Directors\u003cbr/\u003e - Provide thought leadership in global business deep dives across a variety of key performance indicators\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon’s Consumer Payments organization is seeking a highly quantitative, experienced Business Intelligence Engineer to drive the development of analytics and insights. You will succeed in this role if","display_distance":null,"id":"a813d369-3834-4336-93dc-cdab64be5a28","id_icims":"3184611","is_intern":null,"is_manager":null,"job_category":"Business Intelligence","job_family":"Business Intel Engineer","job_function_id":null,"job_path":"/en/jobs/3184611/business-intelligence-engineer-amazon","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR26\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"February 19, 2026","preferred_qualifications":"- Master's degree, or Advanced technical degree\u003cbr/\u003e- Knowledge of data modeling and data pipeline design\u003cbr/\u003e- Experience with statistical analysis, co-relation analysis\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"international-stores.team-amazon-payments","source_system":"JobCreator","state":"KA","title":"Business Intelligence Engineer, Amazon","university_job":null,"updated_time":"29 minutes","url_next_step":"https://account.amazon.com/jobs/3184611/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-payments","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent\u003cbr/\u003e- Speak, write, and read fluently in English","business_category":"fulfillment-and-operations","city":"Hinckley","company_name":"Amazon UK Services Ltd.","country_code":"GBR","description":"  Do you aim to have a dynamic impact on the world? \u003cbr/\u003e  Are you up for creating solutions and solving tomorrow’s problems today? \u003cbr/\u003e  Then we have the opportunity for you! \u003cbr/\u003e   \u003cbr/\u003e We are looking to hire an ICQA Area Manager to be part of our fulfilment centre Inventory Control and Quality Assurance (ICQA) team. Our fulfilment centres sit at the heart of Amazon’s rapidly growing operations network: they are where we manage our fast-moving inventory. In each fulfilment centre, our teams stow deliveries, pick products, package them up and ship them out; each of these groups have played their part in taking us where we are today. \u003cbr/\u003e   \u003cbr/\u003eThese fulfilment centres are fast-paced and high reward environments, where adherence to policies and procedures is key. We need the right type of leader to ensure that we deliver as reliably as ever to our customers, while making sure our teams deliver on customer obsession.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e  Lead and supervise a team of hourly associates in Inventory Control/Quality Assurance operations within the fulfilment centre:\u003cbr/\u003e  ·        Support safety programs and compliance to ensure a safe work environment for all associates\u003cbr/\u003e  ·        Coordinate inventory control maintenance and random counts in  accordance with network count strategies, ensuring compliance and  consistency with SOX\u003cbr/\u003e  ·        Measure quality, inventory integrity, and accuracy while providing  proactive feedback to the operations management team\u003cbr/\u003e  ·        Conduct shift planning and forecasting, alongside assigning  and directing work\u003cbr/\u003e  ·        Plan for and identify root causes of inventory deviation, via cause  and effect analysis\u003cbr/\u003e  ·        Support network-wide fulfilment \u0026 operations-focused quality initiatives\u003cbr/\u003e  ·        Review and analyse customer complaints and process defect data,  followed by development of corresponding action plans to reduce future incidents\u003cbr/\u003e  ·        Drive process improvements and develop team members’ ability to  keep pace with our rapid growth, while motivating others and reducing  employee turnover\u003cbr/\u003e  ·        Appraise the performance of team members; developing, rewarding  and coaching employees ","department_cost_center":null,"description_short":"  Do you aim to have a dynamic impact on the world?   Are you up for creating solutions and solving tomorrow’s problems today?   Then we have the opportunity for you!     We are looking to hire an ICQA","display_distance":null,"id":"e0bfe13e-95ac-4458-9866-caeaa88eaf2b","id_icims":"3177719","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3177719/icqa-area-manager-eu-quality","job_schedule_type":"full-time","location":"GB, Hinckley","locations":["{\"normalizedStateName\":\"England\",\"normalizedCountryCode\":\"GBR\",\"city\":\"Hinckley\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, Hinckley\",\"coordinates\":\"52.54243,-1.37272\",\"normalizedCountyName\":\"Leicestershire\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"Hinckley, England, GBR\",\"location\":\"GB, Hinckley\",\"region\":\"\",\"buildingCodeList\":[\"BHX7\"],\"normalizedCityName\":\"Hinckley\"}"],"normalized_location":"Hinckley, England, GBR","optional_search_labels":[],"posted_date":"February 10, 2026","preferred_qualifications":"- Experience in managing teams\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.quality","source_system":"JobCreator","state":null,"title":"ICQA Area Manager, EU Quality","university_job":null,"updated_time":"29 minutes","url_next_step":"https://account.amazon.com/jobs/3177719/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"quality","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Have an available online portfolio\u003cbr/\u003e- Knowledge of light, color and composition\u003cbr/\u003e- Bachelor's degree in Fine Arts, Fashion Design, Photography, Interior Design or related field (or equivalent experience)\u003cbr/\u003e- 6+ years of experience in either product/fashion photography, Hi-fashion styling, 3D rendering, Interior design, or technical illustration\u003cbr/\u003e- Portfolio demonstrating content creation using AI in fashion /product/ editorial related spaces\u003cbr/\u003e- Advanced AI prompting skills\u003cbr/\u003e- Strong QA mindset with attention to technical accuracy\u003cbr/\u003e- Intermediate to advanced Photoshop retouching capabilities","business_category":"retail","city":"Chennai","company_name":"ADCI MAA 15 SEZ - K20","country_code":"IND","description":"We are seeking a creative AI Content Generation Artist to produce high-quality, visual content that elevates the shopping experience. This role combines artistic vision with AI technology to create compelling imagery at scale. \u003cbr/\u003eThis role requires balancing three core functions:\u003cbr/\u003e•\tContent Creation: AI prompt engineering and initial image generation\u003cbr/\u003e•\tRetouching: Colour correction, lighting adjustments, and detailed editing\u003cbr/\u003e•\tQuality Review: Technical validation, artifact identification, and quality assurance\u003cbr/\u003eIf you’re passionate about both the creative and technical sides of design, eager to work in a team environment, and ready to dive into diverse projects, this role would be suitable. The candidate combines aesthetic sensibility with advanced AI-prompting expertise to generate creatively aesthetic imagery at scale while maintaining hi-fidelity editorial standards for Luxury and Premium brands. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey Responsibilities\u003cbr/\u003e•\tContent Creation:\u003cbr/\u003eo\tGenerate AI product images for various product categories using advanced prompting techniques\u003cbr/\u003eo\tMeet daily image generation targets while minimizing regeneration efforts\u003cbr/\u003eo\t Maintain consistency across product categories while adapting to category-specific requirements\u003cbr/\u003e•\tRetouching \u0026 Enhancement: \u003cbr/\u003eo\tEnhance, correct, and manipulate images for digital media, focusing on color correction, lighting adjustments, and detailed editing \u003cbr/\u003eo\tPerform a variety of procedures with ability to troubleshoot using documentation/SOP \u003cbr/\u003eo\tWork with one or more process paths, generally within a team\u003cbr/\u003e•\tQA \u0026 Technical Review:\u003cbr/\u003eo\tIdentify technical faults, proportion issues, and physical inaccuracies in AI-generated content • Evaluate spatial relationships, scale accuracy, and realistic object placement in AI-generated scenes\u003cbr/\u003eo\tEnsure product dimensions, materials, and functional elements are correctly represented • Identify and flag common AI artifacts including distorted geometry, impossible physics, incorrect shadows/reflections, and material inconsistencies\u003cbr/\u003eo\t Support streamlined review and approval processes for high-volume content generation\u003cbr/\u003e•\tCollaboration:\u003cbr/\u003eo\tCollaborate with team leads/Art Directors to maintain quality standards for AI-generated content\u003cbr/\u003eo\tWork effectively within cross-functional teams\u003cbr/\u003e•\tMay train new team members. \u003cbr/\u003e•\tIdentify and flag common AI artifacts including distorted geometry, impossible physics, incorrect shadows/reflections, and material inconsistencies\u003cbr/\u003e•\tProvide detailed feedback to improve AI model outputs for product accuracy\u003cbr/\u003e•\tSupport streamlined review and approval processes for high-volume content generation\u003cbr/\u003e•\tMaintain consistency across product categories while adapting to category-specific requirements\u003cbr/\u003e","department_cost_center":null,"description_short":"We are seeking a creative AI Content Generation Artist to produce high-quality, visual content that elevates the shopping experience. This role combines artistic vision with AI technology to create compelling","display_distance":null,"id":"46514b01-8f94-4cc5-be32-2dc15939b859","id_icims":"3181531","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Design","job_function_id":null,"job_path":"/en/jobs/3181531/sr-ai-content-generalist-content-generation","job_schedule_type":"full-time","location":"IN, TN, Chennai","locations":["{\"normalizedStateName\":\"Tamil Nadu\",\"normalizedCountryCode\":\"IND\",\"city\":\"Chennai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TN, Chennai\",\"coordinates\":\"13.08404,80.28274\",\"normalizedCountyName\":\"Chennai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Chennai, Tamil Nadu, IND\",\"location\":\"IN, TN, Chennai\",\"region\":\"TN\",\"buildingCodeList\":[\"MAA15\"],\"normalizedCityName\":\"Chennai\"}"],"normalized_location":"Chennai, Tamil Nadu, IND","optional_search_labels":[],"posted_date":"February 16, 2026","preferred_qualifications":"- Familiarity with AI image generation tools and prompting\u003cbr/\u003e- Good understanding of image Retouching workflows\u003cbr/\u003e- Experience working with quality assessment processes within content creation pipelines\u003cbr/\u003e- Ability to work with content management systems\u003cbr/\u003e- Working knowledge of excel\u003cbr/\u003e- Proficiency with Adobe Creative Suite (Photoshop /Lightroom /Illustrator)\u003cbr/\u003e- Certifications in an AI related field would be good to have\u003cbr/\u003e- Preferred Work sample format for review:\u003cbr/\u003e- Before and After examples of samples for retouch outputs\u003cbr/\u003e- GEN AI Samples of Prompt → output → refined output as side-by-side comparisons\u003cbr/\u003e- Examples that demonstrate product accuracy, not just aesthetics\u003cbr/\u003e- Editorial vs. catalog work (on-figure, off-figure, single vs. multi-product)\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"retail.team-us-fashion-softlines","source_system":"JobCreator","state":"TN","title":"Sr. AI Content Generalist , Content Generation","university_job":null,"updated_time":"35 minutes","url_next_step":"https://account.amazon.com/jobs/3181531/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-us-fashion-softlines","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of technical engineering experience\u003cbr/\u003e- Experience with operational parameters and troubleshooting for three (3) of the following: compute/storage/networking/CDN/databases/DevOps/big data and analytics/security/applications development in a distributed systems environment\u003cbr/\u003e- Fluency in Mandarin is required as the role involves liaising with Mandarin-speaking clients/business partners/stakeholders/customers who predominantly communicate in Mandarin.","business_category":"aws","city":"Singapore","company_name":"Amazon Web Services Singapore Private Limited","country_code":"SGP","description":"AWS Global Services includes experts from across AWS who help our customers design, build, operate, and secure their cloud environments. Customers innovate with AWS Professional Services, upskill with AWS Training and Certification, optimize with AWS Support and Managed Services, and meet objectives with AWS Security Assurance Services. Our expertise and emerging technologies include AWS Partners, AWS Sovereign Cloud, AWS International Product, and the Generative AI Innovation Center. You’ll join a diverse team of technical experts in dozens of countries who help customers achieve more with the AWS cloud. \u003cbr/\u003e\u003cbr/\u003eAs a Technical Account Manager you will provide consultative architectural and operational guidance delivered to help customers achieve the greatest value from AWS.\u003cbr/\u003e\u003cbr/\u003eAs we continue to rapidly expand in Singapore, you’ll have plenty of opportunities to develop your technical, consulting and leadership skills. You’ll work with talented cloud technologists whilst expanding your knowledge of AWS products. You’ll also have the chance to receive mentorship and gain AWS certifications.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• You’ll build solutions, provide technical guidance and advocate for the customer\u003cbr/\u003e• Ensure AWS environments remain operationally healthy whilst reducing cost and complexity\u003cbr/\u003e• Develop trusting relationships with customers, understanding their business needs and technical challenges\u003cbr/\u003e• Using your technical acumen and customer obsession, you’ll drive technical discussions regarding incidents, trade-offs, and risk management\u003cbr/\u003e• Consult with a range of partners from developers through to C-suite executives\u003cbr/\u003e• Collaborate with AWS Solutions Architects, Business Developers, Professional Services Consultants, and Sales Account Managers\u003cbr/\u003e• With a bias for action, you'll proactively find opportunities for customers to gain additional value from AWS\u003cbr/\u003e• Provide detailed reviews of service disruptions, metrics, detailed prelaunch planning\u003cbr/\u003e• Being part of a wider Enterprise Support team you’ll provide post-sales, consultative expertise\u003cbr/\u003e• Solve a variety of problems across different customers as they migrate their workloads to the cloud\u003cbr/\u003e• Uplift customer capabilities by running workshops, brown bag sessions.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a trusted advisor you’ll have a direct impact in helping our customers gain the most value from cloud technology. You’ll craft and execute strategies to drive our customers’ adoption and use of AWS services.\u003cbr/\u003e\u003cbr/\u003eOur Technical Account Managers partner with some of the most iconic businesses in the country. These range from rising startups building their business from scratch through to large enterprises going through significant transformation. You’ll provide advice on architecture, support strategy, project, and launch planning as well as ongoing operational issues. Watch a short video about life as a Technical Account Manager team here https://www.youtube.com/watch?v=EBA_8o0F9D0\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"AWS Global Services includes experts from across AWS who help our customers design, build, operate, and secure their cloud environments. Customers innovate with AWS Professional Services, upskill with","display_distance":null,"id":"95ecef6f-7b1d-453c-8c5e-de1d92410ee1","id_icims":"3184607","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Solution Architect","job_function_id":null,"job_path":"/en/jobs/3184607/technical-account-manager-enterprise-support","job_schedule_type":"full-time","location":"SG, Singapore","locations":["{\"normalizedCountryCode\":\"SGP\",\"city\":\"Singapore\",\"countryIso3a\":\"SGP\",\"countryIso2a\":\"SG\",\"locationNonStemming\":\"Singapore, Singapore\",\"coordinates\":\"1.29087,103.85238\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Singapore\",\"normalizedLocation\":\"SGP\",\"location\":\"SG, Singapore\",\"region\":\"\",\"buildingCodeList\":[\"SIN18\"]}"],"normalized_location":"SGP","optional_search_labels":[],"posted_date":"February 19, 2026","preferred_qualifications":"- Experience with AWS services or other cloud offerings\u003cbr/\u003e- Experience in internal enterprise or external customer-facing environment as a technical lead\u003cbr/\u003e- Bachelor's degree or equivalent\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-support","source_system":"JobCreator","state":null,"title":"Technical Account Manager, Enterprise Support","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3184607/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of advising and influencing executive leadership experience\u003cbr/\u003e- 7+ years of progressive corporate or search firm recruiting work with a focus on passive engineering candidate generation in a high tech market experience\u003cbr/\u003e- 7+ years of recruiting with focus on engineering, technical operations, and product management experience\u003cbr/\u003e- Bachelor's degree or above\u003cbr/\u003e- Experience in advising and influencing executive leadership\u003cbr/\u003e- Experience in progressive corporate or search firm recruiting with a focus on passive engineering candidate generation in a high-tech market\u003cbr/\u003e- Experience building and driving talent sourcing initiatives and pipelines\u003cbr/\u003e- Experience creating, measuring and scaling workflow among candidates, hiring managers and the recruiting team\u003cbr/\u003e- Experience managing and prioritizing multiple searches, projects and client relationships\u003cbr/\u003e- Bachelor's degree or equivalent","business_category":"global-corporate","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The Principal Engineer (PE) Recruiting Team sits within Amazon’sGlobal Speciality Recruiting organization. The team hires Principal, Senior Principal, and Distinguished Engineers – the Company's most senior technical contributors. Members of Amazon's Principal Engineering Community are exemplary practitioners and pragmatic visionaries. Our Principal Engineers set the standard for engineering excellence across Amazon. In order to scale Amazon’s Principal Engineering Community, the PE Recruiting Team is looking for a Research Recruiter who shares a passion for hiring the best and the brightest engineers in the world.\u003cbr/\u003e\u003cbr/\u003eThe PE Recruiting Team has the unique ability work across all of Amazon’s businesses and impact each senior leadership team. The Recruiter will be responsible for owning and executing Principal Engineer searches. They will own relationships with senior executives and create robust hiring and candidate development strategies. They will be expected to identify, recruit, and hire world renowned technical candidates. This person will need to be well-versed in all aspects of senior executive technical search, particularly candidate identification, engagement, development, and creative sourcing. They will work with a strong, established recruiting team of Client Lead and Research Recruiters.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eSpecific responsibilities include but, aren’t limited to:\u003cbr/\u003e\u003cbr/\u003e- Developing a robust, multi-channel, search strategy that will attract world class technical contributors.\u003cbr/\u003e- Acting as a talent adviser to Technical and Business Leaders across Amazon – educating Hiring Managers about the external Principal Engineer demographic.\u003cbr/\u003e- Clearly communicating status and progress against open searches. Providing strategic guidance to executive leadership in matters related to top technical talent.\u003cbr/\u003e- Serving as an expert for technology recruiting. Continuous company and talent mapping in key tech areas for the company.\u003cbr/\u003e- Developing prospects into candidates, engaging them and performing assessment/screening and presenting candidates to executive leadership.\u003cbr/\u003e- Continually contributing to the knowledge base of the group and Amazon, as a whole, by providing education on relevant industries and talent pools/profiles.\u003cbr/\u003e- Building out talent networks in technology and product sectors and tapping knowledgeable industry sources to develop an on-going pool of candidates.\u003cbr/\u003e- Supporting client update meetings on active searches with market relevant content.\u003cbr/\u003e- Conducting phone interviews and preparing candidates for on-site interviews, participating in pre-brief meetings.\u003cbr/\u003e- Coaching leaders to continuously improve their talent acquisition capabilities – especially at senior level.\u003cbr/\u003e\u003cbr/\u003eTo be successful in this role, you will bring the following:\u003cbr/\u003e- Research acumen and creativity; An individual who can learn new tech and product domains quickly and understand how to craft effective search strategies within those domains.\u003cbr/\u003e- Superb communication skills; a compelling communicator able to engage the attention of busy, senior executives.\u003cbr/\u003e- Self-assured, not easily thrown, able to think on your feet; this individual may be called upon to work on highly confidential searches with very senior leaders.\u003cbr/\u003e- Inquisitive; a strong desire to learn\u003cbr/\u003e- Demonstrated ability to work in a team environment, as a team leader and member.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThe PE Recruiting team is the talent acquisition engine for Amazon's PE Community. We take a multi-channel (e.g., target company mapping, conference and event engagement, referral and network lead generation) approach to talent identification, engagement, assessment and match-making. As a Senior Executive Research Lead you will set search strategy, identify the right talent ecosystems to engage, and strategize how best to engage technical luminaries externally.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe PE Research Team's mission is to identify, build a relationship with, and hire, every great Principal Engineer in the world. We use several tenets to guide us. Specifically, we believe that:\u003cbr/\u003e\u003cbr/\u003eApplying research yields a healthy search outcome: With a well thought-out search plan, research accelerates ‘time to fill’ and prioritizes quality prospect touchpoints over quantity to create a prospect flywheel that earns customer, and candidate, trust.\u003cbr/\u003e\u003cbr/\u003eWe prioritize time to build a prospect and candidate pipeline as diverse as our customers.\u003cbr/\u003e\u003cbr/\u003eWe balance long-term candidate relationships with quick action on urgent, critical, business needs. Successful Research Recruiters don’t take short cuts, know candidate motivations deeply, and compile accurate market analysis with precise record keeping.\u003cbr/\u003e\u003cbr/\u003eIndividual wins are team wins. We are proud of making hires as a team. We are happy when our research delights our customers and results in a hire.\u003cbr/\u003e\u003cbr/\u003eTurn over every stone: Fear-less curiosity means asking difficult questions to disambiguate search problems, highlight the tradeoffs that need to be made in a search, and zero in on the search objective. We prioritize proactive communication of good and bad news to key stakeholders.\u003cbr/\u003e\u003cbr/\u003ePE Research is grateful for what came before and builds on existing data to deliver candidate and market insights, accelerate, and innovate, but isn't afraid to adapt, and try new directions when a search is stuck. We develop durable research that others want to use.","department_cost_center":null,"description_short":"The Principal Engineer (PE) Recruiting Team sits within Amazon’sGlobal Speciality Recruiting organization. The team hires Principal, Senior Principal, and Distinguished Engineers – the Company's most senior","display_distance":null,"id":"83c82c3f-66ec-4559-9aed-4351c5cd40a8","id_icims":"3184606","is_intern":null,"is_manager":null,"job_category":"Human Resources","job_family":"Human Resources","job_function_id":null,"job_path":"/en/jobs/3184606/sr-executive-research-recruiter-principal-engineer-recruiting","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA48\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February 19, 2026","preferred_qualifications":"- 5+ years of performing team building, coaching and managing experience\u003cbr/\u003e- Experience in performing team building, coaching, and managing\u003cbr/\u003e- Experience recruiting passive candidates who are the most senior experts in their field\u003cbr/\u003e- Experience with executive recruiting in either a blue-chip, global in-house executive search team, or a top executive search firm\u003cbr/\u003e- Experience working with recruiting and people-related tools, CRM systems, and complex spreadsheets\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 142,800.00 - 193,200.00 USD annually","primary_search_label":"global-corporate.team-global-talent-acquisition","source_system":"JobCreator","state":"WA","title":"Sr. Executive Research Recruiter, Principal Engineer Recruiting","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3184606/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-talent-acquisition","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Berwick","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability \u003cbr/\u003e• Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS) \u003cbr/\u003e• Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA) \u003cbr/\u003e• Perform rack installs and rack decommissioning within internal SLA \u003cbr/\u003e• Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment \u003cbr/\u003e• Technical writing to support change management program \u003cbr/\u003e• Monitor daily work requests and manage to resolution, and execute projects from conception to completion \u003cbr/\u003e• On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation \u003cbr/\u003e• Work schedule changes depending on specific site needs. Shifts can be up to 12 hours and may rotate on a predefined schedule. Some locations have on-call rotations. \u003cbr/\u003e• Role may support more than one location/site. \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e• Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodations: \u003cbr/\u003e• Regularly lift and/or move up to 39 pounds independently \u003cbr/\u003e• Participate in group lifts for 40+ pounds \u003cbr/\u003e• Maintain balance and perform construction tasks while on a ladder \u003cbr/\u003e• Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position \u003cbr/\u003e• Work in an environment requiring provided ear protection \u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e• Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e• Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e• Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"dc25c98c-5bac-4dee-aa8c-7865d24c6aa5","id_icims":"3180425","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3180425/engineering-operation-technician","job_schedule_type":"full-time","location":"US, PA, Berwick","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Berwick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Berwick\",\"coordinates\":\"41.05089,-76.24352\",\"normalizedCountyName\":\"Columbia\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Berwick, Pennsylvania, USA\",\"location\":\"US, PA, Berwick\",\"region\":\"PA\",\"buildingCodeList\":[\"PHL122\",\"PHL125\",\"PHL108\",\"PHL99\",\"PHL114\",\"PHL111\",\"PHL119\",\"PHL103\",\"PHL901\",\"PHL100\",\"PHL123\",\"PHL120\",\"PHL126\",\"PHL107\",\"PHL118\",\"PHL115\",\"PHL101\",\"PHL104\",\"PHL112\",\"PHL900\",\"PHL106\",\"PHL109\",\"PHL110\",\"PHL124\",\"PHL116\",\"PHL121\",\"PHL113\",\"PHL117\",\"PHL102\",\"PHL105\"],\"normalizedCityName\":\"Berwick\"}"],"normalized_location":"Berwick, Pennsylvania, USA","optional_search_labels":["aws.team-ais","aws.team-dc","hourly","military"],"posted_date":"February 13, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Technical (Military/Trade School) training\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, PA, Berwick - 32.00 - 57.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"PA","title":"Engineering Operation Technician","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3180425/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}