{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"3+ years of Development and Support experience with SAP S4 and MES data extractions \u0026 analytics.\u003cbr/\u003e3+ years of design and implementation of AWS serverless distributed solutions experience.\u003cbr/\u003e3+ years of Implementation and Enhancement experience with SAP S/4 HANA CDS views\u003cbr/\u003e2+ years’ experience integrating SAP S4 with Non-SAP systems \u003cbr/\u003e5+ years in an information technology role\u003cbr/\u003e","business_category":"alexa-and-amazon-devices","city":"Bellevue","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the capacity, flexibility, and performance to serve a wide range of customers, from individual households to schools, hospitals, businesses, government agencies, and other organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement: Due to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eOur team focuses on extracting data from Enterprise Application systems S4 HANA, MES and GTS to AWS datalake. Our customers are Manufacturing, Operations, Finance and the Supply Chain teams at Leo.\u003cbr/\u003e\u003cbr/\u003eWe are looking to hire an extraction expert, who has a strong overall understanding of functional process and its corresponding mechanism of data persistency along with CRUD operations and be  able to design solutions, enhance and production support. You will work closely with SAP functional, datalake and data analytics teams understand reporting requirements. The enhancement and support of these systems is critical to scalability and cost-effective manufacturing of satellites and ground gateway terminals. \u003cbr/\u003eAs the Data Extraction expert, you would have expertise in designing, implementing, and maintaining robust data persistence mechanisms and design solutions with comprehensive knowledge on functional process. \u003cbr/\u003eThis role is crucial to provide data for manufacturing processes, Operation and Finance analytics. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tDesign and optimize data extraction solutions across enterprise systems SAP S4 HANA, MES, GTS and Non- SAP sources.\u003cbr/\u003e•\tCollaborate with cross-functional teams (SAP, Data Lake, and Analytics) to meet evolving reporting needs. \u003cbr/\u003e•\tConduct Blueprint workshops, fit-gap analysis and produce detailed design documents.\u003cbr/\u003e•\tOpen to learn and scale up to extract non-sap data \u0026 support solution designs across the Leo systems.\u003cbr/\u003e•\tParticipate in strategic planning, roadmap discussions for SAP Manufacturing solutions.\u003cbr/\u003e•\tParticipate in quarter planning, sprint planning, deployment for continuous enhancements.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eCollaborate with functional owners, architects and developers to build scalable and flexible extraction mechanism to meet the emerging demands of data lake and Analytics team. Support production system for Support tickets, bug fixes and identifying optimization opportunities to enhance overall process and system performance. Primary role will be to understand and support data needs through partnering with data hive and Operational Analytics teams to design a scalable \u0026 flexible solution.","department_cost_center":null,"description_short":"Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the capacity,","display_distance":null,"id":"050aee62-bf44-40db-a564-f4f3d2afdc0f","id_icims":"2984042","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"IT Application Engineering","job_function_id":null,"job_path":"/en/jobs/2984042/sap-hana-modeler-amazon-leo-production-operations","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA106\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":["military-tech","military-adapt","military-na","military","military-leadership"],"posted_date":"May 15, 2025","preferred_qualifications":"•Deep understanding of data extraction methodologies, extractions using API/Odata services, real-time extraction, cloud data extraction, Incremental extraction and Database querying (HANA DB). \u003cbr/\u003e•Develop and implement data architectures and infrastructure using AWS services such as S3, glue job, lambda, SQS, SNS, Redshift, and others.\u003cbr/\u003e•Proficiency in database management systems and query languages, SQL, HANA Calculation views \u0026 S4 HANA \u0026 GTS CDS views.\u003cbr/\u003e• Experience working with Analytical tools Tableau \u0026 Quick Sight \u003cbr/\u003e• Experience working in onshore-offshore model \u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $104,300/year in our lowest geographic market up to $185,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"SAP HANA Modeler, Amazon Leo Production Operations","university_job":null,"updated_time":"3 minutes","url_next_step":"https://account.amazon.com/jobs/2984042/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of engineering team management experience\u003cbr/\u003e- 7+ years of working directly within engineering teams experience\u003cbr/\u003e- 3+ years of designing or architecting (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 4+ years of leading the definition and development of multi tier web services experience\u003cbr/\u003e- Knowledge of engineering practices and patterns for the full software/hardware/networks development life cycle, including coding standards, code reviews, source control management, build processes, testing, certification, and livesite operations\u003cbr/\u003e- Experience partnering with product or program management teams","business_category":"selling-partner-services","city":"Detroit","company_name":"Amazon.com Services LLC","country_code":"USA","description":"At Selling Partner Experience, we're seeking a Software Development Manager to lead our dynamic team in technical product development, delivery, and operations of the Next Generation Selling (NGS) Command Center.  You will obsess over and own creating globalized experiences that present tailored and prioritized calls to action, in the form of notifications, insights, and metrics. These experiences enable sellers to understand their business performance and help them decide what goals to achieve. Success in this role is defined by delivering experiences that increase Selling Partner productivity, delivering concrete business outcomes that accelerate the Amazon flywheel.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Lead the development and implementation of desktop and mobile Seller/Vendor experiences within service-oriented and micro-frontend architectures.\u003cbr/\u003e- Manage the entire software development lifecycle, from planning and prioritization to design and delivery.\u003cbr/\u003e- Ensure the delivery of high-quality, scalable, and innovative software solutions.\u003cbr/\u003e- Foster a culture of excellence in software engineering practices.\u003cbr/\u003e- Model Amazon's Leadership Principles to those around you.\u003cbr/\u003e- Challenge the status quo and drive a vision of continuous invention.\u003cbr/\u003e- Collaborate with cross-functional teams to translate complex data dependencies, new AI and ML technologies, and challenging constraints into user-friendly and delightful tools for customers\u003cbr/\u003e- Drive team growth and development through recruiting, mentoring, and leadership.\u003cbr/\u003e- You will collaborate with Product, UX, and Science teams to align customer needs and business goals.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e- As a leader of an Amazon two-pizza software team, you will be responsible for a group of engineers and their development, delivery, and growth. This team is critical in helping Amazon Selling Partners understand clearly \u0026 confidently how their business is doing \u0026 what actions they need to take.\u003cbr/\u003e- This role offers a chance to innovate in developing web and mobile applications at scale, and experiment with new Recommendation/Personalization technologies across complex business domains.\u003cbr/\u003e- You will be an exemplary leader who supports and develops great talent, holds a high bar for technical operations, and continuously delivers what customers need.","department_cost_center":null,"description_short":"At Selling Partner Experience, we're seeking a Software Development Manager to lead our dynamic team in technical product development, delivery, and operations of the Next Generation Selling (NGS) Command","display_distance":null,"id":"ba9e5428-e7e4-4da6-b26e-eb5a4ed96168","id_icims":"3129564","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3129564/software-development-manager-selling-partner-engagement","job_schedule_type":"full-time","location":"US, MI, Detroit","locations":["{\"normalizedStateName\":\"Michigan\",\"normalizedCountryCode\":\"USA\",\"city\":\"Detroit\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MI, Detroit\",\"coordinates\":\"42.33168,-83.048\",\"normalizedCountyName\":\"Wayne\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Detroit, Michigan, USA\",\"location\":\"US, MI, Detroit\",\"region\":\"MI\",\"buildingCodeList\":[\"DTW10\"],\"normalizedCityName\":\"Detroit\"}"],"normalized_location":"Detroit, Michigan, USA","optional_search_labels":[],"posted_date":"November 19, 2025","preferred_qualifications":"- Experience in communicating with users, other technical teams, and senior leadership to collect requirements, describe software product features, technical designs, and product strategy\u003cbr/\u003e- Experience in recruiting, hiring, mentoring/coaching and managing teams of Software Engineers to improve their skills, and make them more effective, product software engineers\u003cbr/\u003e- Experience in many disparate technologies, typically ranging from front-end user interfaces through to back-end systems and all points in between\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MI, Detroit - 184,900.00 - 250,200.00 USD annually","primary_search_label":"selling-partner-services.no-team-listed","source_system":"JobCreator","state":"MI","title":"Software Development Manager, Selling Partner Engagement","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/3129564/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"• Bachelor’s Degree or 2+ years Amazon experience.\r\u003cbr/\u003e• 7+ years direct management experience, including a salaried workforce, in a manufacturing, production or distribution environment.\r\u003cbr/\u003e• Prior experience with performance metrics, process improvement and Lean techniques.\r\u003cbr/\u003e• Prior experience with the full staffing lifecycle, including interviewing, hiring, performance management, promotions and termination.","business_category":"fulfillment-ops","city":"Tanner","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our Sr. Operations Managers responsible for all budgetary, people development and operations objectives. The Sr. Operations Managers is responsible for all aspects of operation or functions  at the site. Additional responsibilities include managing and leading a team of Operations and Area Managers, coaching and mentoring the team to ensure performance objectives are met, building positive employee relations and building leadership bench strength within the Fulfillment Center. \r\u003cbr/\u003e\r\u003cbr/\u003eResponsibilities: \r\u003cbr/\u003e• Drives creation of quality initiatives, process change initiatives and other Lean initiatives to enable their functional area and ultimately the FC to meet and exceed business plan. \r\u003cbr/\u003e• Responsible for the overall safety, quality and performance and customer experience of either Inbound or Outbound operations. \r\u003cbr/\u003e• Will set and clarify requirements and expectations for Operations and Area Managers. Measures performance, provides feedback, and holds Ops Managers accountable for their performance and the performance of their departments. \r\u003cbr/\u003e• Leverages the Operations and Area Managers by sourcing and nurturing ideas, and rolling them into the creation of improvement plans for the functional area. \r\u003cbr/\u003e• Takes proactive steps to ensure that best practices are shared across all departments, shifts and among the network. \r\u003cbr/\u003e• Works closely with support staff (HR, Finance, Facilities, Safety, IT and other Sr. Operations Managers) to build and secure support and resources for projects and initiatives in their area, as well as providing needed support and resources for other staff initiatives.\r\u003cbr/\u003e\r\u003cbr/\u003eAdditional Job Elements: \r\u003cbr/\u003e• Lift and move totes up to 49 pounds each \r\u003cbr/\u003e• Regular bending, lifting, stretching and reaching both below the waist and above the head \r\u003cbr/\u003e• Walking in the FC and around area with great frequency; facilities are over a quarter mile in length \r\u003cbr/\u003e• Continual standing and/or walking an average of 5 miles daily \r\u003cbr/\u003e• Ability to work in construction /distribution environments that may be noisy, unlit, unheated, not air-conditioned \r\u003cbr/\u003e• Able to access all areas of building (ascending and descending ladders, stairs, gangways safely and without limitation)","department_cost_center":null,"description_short":"Our Sr. Operations Managers responsible for all budgetary, people development and operations objectives. The Sr. Operations Managers is responsible for all aspects of operation or functions  at the site.","display_distance":null,"id":"f84970a0-a9fc-47b7-8298-d4c592c9c123","id_icims":"2978118","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/2978118/sr-operations-manager","job_schedule_type":"full-time","location":"US, AL, Tanner","locations":["{\"normalizedStateName\":\"Alabama\",\"normalizedCountryCode\":\"USA\",\"city\":\"Tanner\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AL, Tanner\",\"coordinates\":\"34.73143,-86.97223\",\"normalizedCountyName\":\"Limestone\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Tanner, Alabama, USA\",\"location\":\"US, AL, Tanner\",\"region\":\"AL\",\"buildingCodeList\":[\"HSV1\"],\"normalizedCityName\":\"Tanner\"}"],"normalized_location":"Tanner, Alabama, USA","optional_search_labels":[],"posted_date":"May  9, 2025","preferred_qualifications":"• Degree in Engineering, Operations or related field and MBA preferred\u003cbr/\u003e• Experience with a contingent workforce during peak seasons\u003cbr/\u003e• Ability to handle changing priorities and use good judgment in stressful situations\u003cbr/\u003e• Interest in long-term career development through assignments in multiple FCs across the nation\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, AL, Tanner - 135,000.00 - 182,700.00 USD annually","primary_search_label":"fulfillment-ops.team-global-specialty-fulfillment","source_system":"JobCreator","state":"AL","title":"Sr. Operations Manager","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/2978118/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-specialty-fulfillment","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent, or 2+ years of equivalent experience","business_category":"fulfillment-and-operations","city":"Jupiter","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our Senior Operations Managers play a crucial role in exceeding expectations and providing a superb customer experience; critical to Amazon’s success which is built on a foundation of customer obsession, and innovation. This position is a multi-faceted role requiring the ability to balance strategy and execution. The Senior Operations Manager is responsible for all aspects of the operations of an XL fulfillment center including, people management and development, process, and meeting or exceeding the expectations and promise made to our customers. You will lead a dynamic team of Operations and Area Managers to achieve operational excellence through coaching and mentoring the team; driving employee engagement, and building leadership bench strength within the building.\u003cbr/\u003e\u003cbr/\u003eAs a senior leader you will oversee salaried and hourly employees, in a fast-paced, complex operations facility up to a million square feet.\u003cbr/\u003e\u003cbr/\u003eOur Senior Operations Managers serve as the face of the organization to potentially thousands of employees and the community where the center is located. This position offers unlimited career potential as we continue to grow our global footprint.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Owns and delivers the operational budget for functional area, including safety, productivity, financial and labor planning, and operational goals for outbound, or inbound operations\u003cbr/\u003e- Responsible for providing strategic level/long-term planning (3, 6, and 12 months out) including labor planning, rate forecasting, and peak season planning\u003cbr/\u003e- Drives continuous improvement projects to optimize operations and improve productivity to meet and exceed business objectives; works on strategic projects that have total building and network-wide impact. Effectively leverages the Operations and Area Managers to solicit ideas and understand problems and challenges in the building.\u003cbr/\u003e- Networks with other leaders across the network to solicit and share process improvements and drive efficiencies and cost savings.\u003cbr/\u003e- Establishes objectives and metrics for safety, quality, productivity, and customer experience\u003cbr/\u003e- Sets clear goals and expectations for Operations and Area Managers. Measures performance, provides feedback, and holds leaders accountable\u003cbr/\u003e- Mentors and develops leaders and staff\u003cbr/\u003e- Participates in recruiting to identify and evaluate associates and internal/external candidates for promotion and hire.\u003cbr/\u003e- Works closely with support staff (HR, Finance, Maintenance Engineering, Safety, IT and other leaders) to build and secure support and resources for projects and initiatives","department_cost_center":null,"description_short":"Our Senior Operations Managers play a crucial role in exceeding expectations and providing a superb customer experience; critical to Amazon’s success which is built on a foundation of customer obsession,","display_distance":null,"id":"e1472db1-90a7-485a-81d3-ecd3ab5978f1","id_icims":"3160207","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3160207/sr-operations-manager-xlfc-xlfc-pbi2","job_schedule_type":"full-time","location":"US, FL, Jupiter","locations":["{\"normalizedStateName\":\"Florida\",\"normalizedCountryCode\":\"USA\",\"city\":\"Jupiter\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, FL, Jupiter\",\"coordinates\":\"26.93277,-80.10189\",\"normalizedCountyName\":\"Palm Beach\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Jupiter, Florida, USA\",\"location\":\"US, FL, Jupiter\",\"region\":\"FL\",\"buildingCodeList\":[\"PBI2\"],\"normalizedCityName\":\"Jupiter\"}"],"normalized_location":"Jupiter, Florida, USA","optional_search_labels":[],"posted_date":"January 15, 2026","preferred_qualifications":"- Work flexible hours as business demands, including overnight, weekends and holidays\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, FL, Jupiter - 135,000.00 - 182,700.00 USD annually","primary_search_label":"fulfillment-and-operations.no-team-listed","source_system":"JobCreator","state":"FL","title":"Sr Operations Manager XLFC, XLFC PBI2","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3160207/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in a multi-site environment\u003cbr/\u003e- Bachelor's degree in environmental engineering, chemical engineering, environmental science or related field\u003cbr/\u003e- 5+ years of experience in air quality compliance, specifically with stationary diesel generators\u003cbr/\u003e- Strong knowledge of EPA and state regulations governing diesel generator emissions","business_category":"aws","city":"Herndon","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join a diverse, dynamic, and enthusiastic team of environmental compliance professionals who play a leading role in air quality permitting and compliance at Amazon Web Services (AWS), where we have a history of leading the world in innovative technologies and services. As a member of the Air Permitting team, you will support environmental programs aimed at ensuring compliance with air quality regulations and standards in the Americas while also enabling AWS's growth around the world.\u003cbr/\u003e\u003cbr/\u003eAs an Air Compliance Regional Environmental Engineer (REE), your primary focus will be serving as the air quality compliance subject matter expert (SME) across the Americas region, providing programmatic oversight and ensuring alignment of compliance practices across all AWS data centers. You will work closely with other REEs, operations teams, environmental consultants, and regulatory agencies to ensure consistent application of air quality compliance programs, particularly those related to tier 4 compliant diesel generators. You'll be responsible for developing and maintaining compliance systems and best practices that support AWS growth in the Americas, collaborating with partner teams throughout the data center operational lifecycle. Your role will involve providing technical expertise on local, state, and federal air regulations, establishing standardized audit protocols, developing emissions testing programs, and creating strategies for continuous improvement in air quality management. As the team's air compliance SME, you will support REEs across the region to resolve complex air compliance challenges and drive environmental performance. You will also play a key role in standardizing incident response and reporting protocols related to air quality events.\u003cbr/\u003eThe successful candidate will have extensive knowledge of air quality compliance programs and regulatory requirements in North America, demonstrated ability to develop and standardize complex compliance systems across multiple jurisdictions, and proven experience leading air quality initiatives that drive environmental performance and sustainability. The ideal candidate will excel at providing strategic guidance while maintaining strong attention to technical details and have a track record of successfully collaborating with diverse stakeholders to implement environmental compliance programs at scale.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Lead air quality compliance programs focused on Tier 4 diesel generator operations across multiple data center locations in the United States.\u003cbr/\u003e- Manage and oversee compliance with federal, state, and local air quality regulations related to emergency backup power systems.\u003cbr/\u003e- Ensure compliance with EPA regulations including 40 CFR 60 Subpart IIII (Standards of Performance for Stationary Compression Ignition Internal Combustion Engines).\u003cbr/\u003e- Develop and implement air quality monitoring programs and compliance tracking systems for diesel generators.\u003cbr/\u003e- Coordinate with environmental consultants and testing firms to complete required emissions testing and verify compliance.\u003cbr/\u003e- Provide technical guidance on air quality compliance requirements. \u003cbr/\u003e- Conduct periodic compliance audits of diesel generator operations and oversee corrective action implementation.\u003cbr/\u003e- Support emergency response planning related to air quality incidents.\u003cbr/\u003e- Collaborate with the air permitting team and Regional Environmental Engineers to ensure operational compliance with existing permit conditions.\u003cbr/\u003e- Stay current with evolving air quality regulations and industry best practices for diesel generator management.\u003cbr/\u003e- Develop and deliver air quality compliance training for relevant staff.\u003cbr/\u003e- Establish and track key performance indicators (KPIs) for air quality compliance.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services (AIS) owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e","department_cost_center":null,"description_short":"Join a diverse, dynamic, and enthusiastic team of environmental compliance professionals who play a leading role in air quality permitting and compliance at Amazon Web Services (AWS), where we have a history","display_distance":null,"id":"831e90db-ab68-4920-b283-131d817dd145","id_icims":"3103862","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3103862/regional-environmental-engineer-air-compliance-aws-environmental","job_schedule_type":"full-time","location":"US, VA, Herndon","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Berwick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Berwick\",\"coordinates\":\"41.05089,-76.24352\",\"normalizedCountyName\":\"Columbia\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Berwick, Pennsylvania, USA\",\"location\":\"US, PA, Berwick\",\"region\":\"PA\",\"buildingCodeList\":[\"PHL100\"],\"normalizedCityName\":\"Berwick\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD31\"],\"normalizedCityName\":\"Herndon\"}","{\"normalizedStateName\":\"Maryland\",\"normalizedCountryCode\":\"USA\",\"city\":\"Frederick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MD, Frederick\",\"coordinates\":\"39.41574,-77.41203\",\"normalizedCountyName\":\"Frederick\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Frederick, Maryland, USA\",\"location\":\"US, MD, Frederick\",\"region\":\"MD\",\"buildingCodeList\":[\"IAD245\"],\"normalizedCityName\":\"Frederick\"}"],"normalized_location":"Herndon, Virginia, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"October  7, 2025","preferred_qualifications":"- 3+ years of managing stakeholders in cross-functional project experience\u003cbr/\u003e- Experience leading change in multiple site environments and influenceing those that are not direct reports or within your organization\u003cbr/\u003e- Experience in project management including resource planning, managing schedules, reporting project status and prioritizing tasks\u003cbr/\u003e- Experience with data center or critical infrastructure operations\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MD, Frederick - 109,700.00 - 183,300.00 USD annually\u003cbr/\u003eUSA, PA, Berwick - 109,700.00 - 183,300.00 USD annually\u003cbr/\u003eUSA, VA, Herndon - 109,700.00 - 183,300.00 USD annually","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"VA","title":"Regional Environmental Engineer, Air Compliance, AWS Environmental","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3103862/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of systems design, software development, operations, automation, and process improvement experience\u003cbr/\u003e- Experience designing or implementing integrated automation solutions such as material handling systems, high-speed packaging lines, or manufacturing lines\u003cbr/\u003e- Experience in PLC based controls design, development, implementation and support","business_category":"fulfillment-technology-and-robotics","city":"Bellevue","company_name":"Amazon.com Services LLC - A57","country_code":"USA","description":"Amazon is building the next generation software, hardware, and processes to run our state-of-the-art global fulfillment network that moves many millions of units of inventory, ensuring that customers get what they want when promised. We are constantly innovating in the ways we are automating and accelerating the delivery of packages which includes custom robotics, mechatronics, conveyance, supply chain optimization, machine learning, manipulation, image processing, and real-time data processing using distributed systems.\u003cbr/\u003eWe are looking for a System Development Engineer with a passion for industrial software and control systems to transform the way we integrate robotics within our global network of advanced warehouses. This position is a unique opportunity to be involved in a wide range of automation projects right from the start. You will interface with multiple internal Amazon R\u0026D and design teams as well as the world’s leading automation strategic partners who have the technology and resources to meet Amazon’s growth needs on a global scale.\u003cbr/\u003eThis is a role in a growing team responsible for realizing the convergence of modern software development with traditional industrial control. It is an early-stage initiative with a fast paced, highly collaborative start-up like environment inside Amazon, so be successful you need to be flexible and entrepreneurial. You are a true owner - you are hands on and you lead by example. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e    - Develop core machine control logic for industrial edge devices (e.g. PLCs, IPCs)\u003cbr/\u003e   -  Design, simplify and continuously improve system controls architecture including machine control code, networking, electrical design and safety design\u003cbr/\u003e   -  Identify and implement system optimizations\u003cbr/\u003e  -  Integrate control systems with a diverse array of sensors, actuators, motors, and software services\u003cbr/\u003e  -   Work closely with deployment teams to implement end-to-end solutions in the field\u003cbr/\u003e -    50% travel expected to support onsite system testing","department_cost_center":null,"description_short":"Amazon is building the next generation software, hardware, and processes to run our state-of-the-art global fulfillment network that moves many millions of units of inventory, ensuring that customers get","display_distance":null,"id":"d2fd4aa3-5fb0-4e78-849c-f96dc646a78b","id_icims":"3168874","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"System Development Engineering","job_function_id":null,"job_path":"/en/jobs/3168874/system-development-engineer-automation-integration-technologies-rios","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS18\",\"MMY2\",\"WAS26\",\"WAS17R\",\"WAS35\",\"WAS21\",\"WFM531\",\"MAR9\",\"WAS17\",\"WAS25\",\"WFM870\",\"ZDC2\",\"WAS22\",\"LCYC\",\"ONM257\",\"WAS19\",\"WAS16\",\"LBAL\",\"WFM042\",\"WAS27\",\"WAS32\",\"WAS24\",\"ONM256\",\"WAS14\",\"MAX1\",\"MRG5\",\"WAS28\",\"USF5\",\"DDI4\",\"DCA25\",\"LARG\",\"MMY1\",\"LARL\",\"DCA14\",\"WFM797\",\"MRG4\",\"WAS23\",\"DCA57\",\"WAS20\"],\"normalizedCityName\":\"Arlington\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"JSE3\",\"ZBL2\",\"SEA105\",\"SEA119\",\"FLR5\",\"SEA123\",\"SEA127\",\"SPP67\",\"MAB2\",\"SEA6\",\"NST5\",\"KFTS\",\"LBV5\",\"SEA107\",\"SEA94\",\"CWA12\",\"SEA104\",\"SEA132\",\"ZSE2\",\"SEA121\",\"ZBL1\",\"SEA8\",\"ONM123\",\"SEA113\",\"NST3\",\"UNP1\",\"SEA108\",\"NST9\",\"SEA120\",\"SEA112\",\"WFM657\",\"IBF2\",\"WFM153\",\"SEA82\",\"SEA93\",\"SEA106\",\"METR1\",\"ZBL3\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"January 28, 2026","preferred_qualifications":"- Experience with design-in-safety\u003cbr/\u003e- Experience in embedded development in C/C++, or experience programming with at least one software programming language\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, ARLINGTON - 99,100.00 - 160,000.00 USD annually\u003cbr/\u003eUSA, VA, Arlington - 99,100.00 - 160,000.00 USD annually\u003cbr/\u003eUSA, WA, BELLEVUE - 99,100.00 - 160,000.00 USD annually\u003cbr/\u003eUSA, WA, Bellevue - 99,100.00 - 160,000.00 USD annually","primary_search_label":"fulfillment-technology-and-robotics.one-material-handling-system","source_system":"JobCreator","state":"WA","title":"System Development Engineer, Automation Integration Technologies, RIOS","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3168874/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"one-material-handling-system","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Sparks","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"5e87d1ca-5054-4367-83f3-31dbfe78a5dd","id_icims":"3169293","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3169293/engineering-operations-technician-dcc-communities","job_schedule_type":"full-time","location":"US, NV, Sparks","locations":["{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sparks\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, Sparks\",\"coordinates\":\"39.54115,-119.74832\",\"normalizedCountyName\":\"Washoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sparks, Nevada, USA\",\"location\":\"US, NV, Sparks\",\"region\":\"NV\",\"buildingCodeList\":[\"RNO100\"],\"normalizedCityName\":\"Sparks\"}"],"normalized_location":"Sparks, Nevada, USA","optional_search_labels":["aws.team-ais","aws.team-dc","hourly","military"],"posted_date":"January 29, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Technical (Military/Trade School) training\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NV, Sparks - 31.00 - 55.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"NV","title":"Engineering Operations Technician, DCC Communities ","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3169293/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"• Bachelor’s Degree or 2+ years Amazon experience.\u003cbr/\u003e• 7+ years direct management experience, including a salaried workforce, in a manufacturing, production or distribution environment.\u003cbr/\u003e• Prior experience with performance metrics, process improvement and Lean techniques.\u003cbr/\u003e• Prior experience with the full staffing lifecycle, including interviewing, hiring, performance management, promotions and termination.","business_category":"fulfillment-ops","city":"Carencro","company_name":"Amazon.com Services LLC - A57","country_code":"USA","description":"Our Sr. Operations Managers responsible for all budgetary, people development and operations objectives. The Sr. Operations Managers is responsible for all aspects of operation or functions at the site. Additional responsibilities include managing and leading a team of Operations and Area Managers, coaching and mentoring the team to ensure performance objectives are met, building positive employee relations and building leadership bench strength within the Fulfillment Center.\u003cbr/\u003e\u003cbr/\u003eResponsibilities:\u003cbr/\u003e• Drives creation of quality initiatives, process change initiatives and other Lean initiatives to enable their functional area and ultimately the FC to meet and exceed business plan.\u003cbr/\u003e• Responsible for the overall safety, quality and performance and customer experience of either Inbound or Outbound operations.\u003cbr/\u003e• Will set and clarify requirements and expectations for Operations and Area Managers. Measures performance, provides feedback, and holds Ops Managers accountable for their performance and the performance of their departments.\u003cbr/\u003e• Leverages the Operations and Area Managers by sourcing and nurturing ideas, and rolling them into the creation of improvement plans for the functional area.\u003cbr/\u003e• Takes proactive steps to ensure that best practices are shared across all departments, shifts and among the network.\u003cbr/\u003e• Works closely with support staff (HR, Finance, Facilities, Safety, IT and other Sr. Operations Managers) to build and secure support and resources for projects and initiatives in their area, as well as providing needed support and resources for other staff initiatives.\u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements:\u003cbr/\u003e• Lift and move totes up to 49 pounds each\u003cbr/\u003e• Regular bending, lifting, stretching and reaching both below the waist and above the head\u003cbr/\u003e• Walking in the FC and around area with great frequency; facilities are over a quarter mile in length\u003cbr/\u003e• Continual standing and/or walking an average of 5 miles daily\u003cbr/\u003e• Ability to work in construction /distribution environments that may be noisy, unlit, unheated, not air-conditioned\u003cbr/\u003e• Able to access all areas of building (ascending and descending ladders, stairs, gangways safely and without limitation)\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Our Sr. Operations Managers responsible for all budgetary, people development and operations objectives. The Sr. Operations Managers is responsible for all aspects of operation or functions at the site.","display_distance":null,"id":"bb25c711-cd42-4514-a91d-5ad12ae80bba","id_icims":"2897419","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/2897419/sr-operations-manager","job_schedule_type":"full-time","location":"US, LA, Carencro","locations":["{\"normalizedStateName\":\"Louisiana\",\"normalizedCountryCode\":\"USA\",\"city\":\"Carencro\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, LA, Carencro\",\"coordinates\":\"30.32198,-92.04401\",\"normalizedCountyName\":\"Lafayette\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Carencro, Louisiana, USA\",\"location\":\"US, LA, Carencro\",\"region\":\"LA\",\"buildingCodeList\":[\"LFT1\"],\"normalizedCityName\":\"Carencro\"}"],"normalized_location":"Carencro, Louisiana, USA","optional_search_labels":[],"posted_date":"February 10, 2025","preferred_qualifications":"• Degree in Engineering, Operations or related field and MBA preferred\u003cbr/\u003e• Experience with a contingent workforce during peak seasons\u003cbr/\u003e• Ability to handle changing priorities and use good judgment in stressful situations\u003cbr/\u003e• Interest in long-term career development through assignments in multiple FCs across the nation\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, LA, Carencro - 135,000.00 - 182,700.00 USD annually","primary_search_label":"fulfillment-ops.team-global-specialty-fulfillment","source_system":"JobCreator","state":"LA","title":"Sr. Operations Manager","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/2897419/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-specialty-fulfillment","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of Microsoft Office products and applications experience\u003cbr/\u003e- 2+ years of electrical and mechanical experience\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends","business_category":"aws","city":"Sparks","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e- Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"6fbde57a-2466-4876-90b1-40c4f18c82b1","id_icims":"3168283","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3168283/engineering-operations-technician-dcc-communities","job_schedule_type":"full-time","location":"US, NV, Sparks","locations":["{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sparks\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, Sparks\",\"coordinates\":\"39.54115,-119.74832\",\"normalizedCountyName\":\"Washoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sparks, Nevada, USA\",\"location\":\"US, NV, Sparks\",\"region\":\"NV\",\"buildingCodeList\":[\"RNO100\"],\"normalizedCityName\":\"Sparks\"}"],"normalized_location":"Sparks, Nevada, USA","optional_search_labels":["military","aws.team-dc","hourly","aws.team-ais"],"posted_date":"January 28, 2026","preferred_qualifications":"- Experience working in a data center or mission critical facility (example: hospital, military facility, public safety facility, etc.)\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e- Experience with reading and writing procedures, technical documents, and engineering drawings\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NV, Sparks - 36.00 - 63.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"NV","title":"Engineering Operations Technician, DCC Communities ","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3168283/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent, or 2+ years of full-time Amazon experience\u003cbr/\u003e- - 7+ years’ direct management experience, including a salaried, hourly and agency workforce, in a logistics, fulfillment, last-mile manufacturing, engineering, production or distribution environment\u003cbr/\u003e- - Demonstrated track record of delivering performance and financial based results in high pressure environments\u003cbr/\u003e- - Experience with performance metrics and process improvement and lean techniques\u003cbr/\u003e- - Experience with the full lifecycle staffing, including interviewing, hiring, performance management, promotions and terminations\u003cbr/\u003e- - Strong analytical capability; track record of digging into data and finding solutions for a variety of operational problems\u003cbr/\u003e- - Excellent communication skills (including local language and English, written and verbal)\u003cbr/\u003e- - Experience managing third party resources on a regional/national scale\u003cbr/\u003e- - Experience managing contingent workforce in a business with peak seasons\u003cbr/\u003e- - Candidates must be flexible to work a variety of hours as business demands, including overnight, weekends and holidays","business_category":"fulfillment-and-operations","city":"Morrisville","company_name":"Amazon.com Services LLC","country_code":"USA","description":"AMZL Sr. Station Leaders are responsible for all budgetary, people development and operations objectives for an Amazon Logistics Delivery Station (DS). Additional responsibilities include managing and leading a team of Operations, Area and Shift Managers, coaching and mentoring the team to ensure performance objectives are met, building positive employee relations and building leadership bench strength within the DS.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e - Responsible for the overall safety, quality, performance, customer experience and people development for all delivery station operations\u003cbr/\u003e - Drives vision for station team and creation of quality initiatives, process change initiatives and other lean initiatives to enable their functional area and ultimately the DS to meet and exceed business plan\u003cbr/\u003e - Problem-solves for closing gaps between performance and goals\u003cbr/\u003e - Will set and clarify requirements and expectations for Operations, Area and Shift Managers. Measures performance, provides feedback, and holds Ops Managers accountable for their performance and the performance of their departments\u003cbr/\u003e - Manages an environment concerning the delivery of Amazon orders direct to our customers, subject to ever rising volume and complexity, operating on a 24/7 basis\u003cbr/\u003e - Manages day-to-day relationships with multiple Delivery Service Providers (DSPs)\u003cbr/\u003e - Presents operational metrics regularly to the senior leadership team\u003cbr/\u003e - Hires and develops top talent. Creates and implements a talent plan for the site including talent acquisition, performance and career management, learning and development, succession planning, and employee engagement\u003cbr/\u003e - Leverages the Operations, Area and Shift Managers by sourcing and nurturing ideas, and rolling them into the creation of improvement plans for the functional area\u003cbr/\u003e - Cultivates strong culture and engagement throughout all levels of the delivery station team\u003cbr/\u003e - Takes proactive steps to ensure that best practices are shared across all departments, shifts and among the network.\u003cbr/\u003e - Works with key business partners such as Transport \u0026 Sortation, DSP Management, Finance, Loss Prevention, IT, HR, ACES and Engineering to build and secure support and resources for projects and initiatives in their area, as well as providing needed support and resources for other staff initiatives\u003cbr/\u003e","department_cost_center":null,"description_short":"AMZL Sr. Station Leaders are responsible for all budgetary, people development and operations objectives for an Amazon Logistics Delivery Station (DS). Additional responsibilities include managing and","display_distance":null,"id":"654e162d-d640-4479-a032-d71fa38d16df","id_icims":"3159686","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3159686/senior-station-manager","job_schedule_type":"full-time","location":"US, NC, Morrisville","locations":["{\"normalizedStateName\":\"North Carolina\",\"normalizedCountryCode\":\"USA\",\"city\":\"Morrisville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NC, Morrisville\",\"coordinates\":\"35.82305,-78.83015\",\"normalizedCountyName\":\"Wake\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Morrisville, North Carolina, USA\",\"location\":\"US, NC, Morrisville\",\"region\":\"NC\",\"buildingCodeList\":[\"DRT9\"],\"normalizedCityName\":\"Morrisville\"}"],"normalized_location":"Morrisville, North Carolina, USA","optional_search_labels":[],"posted_date":"January 14, 2026","preferred_qualifications":"- - Degree in Engineering, Operations or related field and MBA preferred\u003cbr/\u003e- - Experience in a startup environment\u003cbr/\u003e- - Ability to handle changing priorities and use good judgment in stressful situations\u003cbr/\u003e- - Interest in long-term career development\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NC, Morrisville - 135,000.00 - 182,700.00 USD annually","primary_search_label":"fulfillment-and-operations.no-team-listed","source_system":"JobCreator","state":"NC","title":"Senior Station Manager","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3159686/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}