{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Bachelor's degree or above in engineering, technology, computer science, machine learning, robotics, operations research, statistics, mathematics or equivalent quantitative field\u003cbr/\u003e- 5+ years of relevant professional experience\u003cbr/\u003e- Experience planning, managing, and delivering customer-focused documentation across multiple teams\u003cbr/\u003e- Experience scripting with Python, Perl, Bash or PowerShell\u003cbr/\u003e- Experience in Linux OS and network troubleshooting, or experience with programming/scripting (Batch, VB, PowerShell, Java, C#, Chef, Perl, Ruby and/or PHP) and experience in Ubuntu/Solaris\u003cbr/\u003e- Experience managing lab resources, equipment, and supplies\u003cbr/\u003e- Experience using common electronics test equipment (oscilloscopes, power supplies, function generators, etc)","business_category":"aws","city":"Pasadena","company_name":"Amazon Development Center U.S., Inc.","country_code":"USA","description":"The Amazon Center for Quantum Computing (CQC) is a multi-disciplinary team of scientists, engineers, and technicians, on a mission to develop a fault-tolerant quantum computer.\u003cbr/\u003e\u003cbr/\u003eWe are looking for a Last Mile Integration Engineer to ensure the successful deployment and integration of instruments and computing infrastructure in our quantum computing labs. As a part of the Signals team, you will serve as the critical link between hardware/software development and operational readiness, ensuring that our scientists have reliable, well-configured systems to conduct experiments. The ideal candidate combines hands-on hardware skills with software proficiency and IT/networking knowledge to deploy, configure, troubleshoot, and maintain complex laboratory systems.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eOwn end-to-end integration of RF test systems including spectrum analyzers, signal generators, network analyzers, oscilloscopes, DMMs, and power meters\u003cbr/\u003eDesign, develop, and maintain automation scripts and frameworks leveraging industry-standard protocols (SCPI, VISA, GPIB, LXI, USB-TMC)\u003cbr/\u003eDrive root cause analysis for system-level integration failures spanning hardware and software; implement corrective actions and document findings for future reference\u003cbr/\u003ePartner with hardware, software, and operations engineering teams to identify and resolve blocking issues in test infrastructure\u003cbr/\u003eDefine and implement lab infrastructure management processes including inventory tracking, equipment lifecycle management, and spare parts optimization\u003cbr/\u003eLead calibration activities, measurement validation, and continuous improvement of test automation capabilities\u003cbr/\u003eEstablish remote debugging capabilities and participate in on-call rotation to ensure operational readiness\u003cbr/\u003eChampion lab safety standards and ensure compliance with ESD, RF exposure, and high-voltage protocols\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou will collaborate daily with cross-functional engineering teams—including hardware, software, and operations—to drive hands-on integration and troubleshooting in a fast-paced lab environment. This role requires a bias for action, the ability to operate independently under tight deadlines, and a proven track record of delivering results when the pressure is highest.\u003cbr/\u003e\u003cbr/\u003eThe Signals develops and deploys hardware used in the control and readout of Amazon super-conducting quantum processors.  We are a team with diverse talent set, spanning embedded software to cryogenic microwave design and device bring-up.   \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS. Within AWS UC, Amazon Dedicated Cloud (ADC) roles engage with AWS customers who require specialized security solutions for their cloud services.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be either a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum, or be able to obtain a US export license. If you are unsure if you meet these requirements, please apply and Amazon will review your application for eligibility.\u003cbr/\u003e\u003cbr/\u003eInternal job description","department_cost_center":null,"description_short":"The Amazon Center for Quantum Computing (CQC) is a multi-disciplinary team of scientists, engineers, and technicians, on a mission to develop a fault-tolerant quantum computer.We are looking for a Last","display_distance":null,"id":"2fefe349-bd31-4448-b2ad-ec6a96a1dbf6","id_icims":"3174217","is_intern":null,"is_manager":null,"job_category":"Research Science","job_family":"Research Science","job_function_id":null,"job_path":"/en/jobs/3174217/last-mile-integration-engineer-amazon-center-for-quantum-computing","job_schedule_type":"full-time","location":"US, CA, Pasadena","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Pasadena\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Pasadena\",\"coordinates\":\"34.14745,-118.14427\",\"normalizedCountyName\":\"Los Angeles\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Pasadena, California, USA\",\"location\":\"US, CA, Pasadena\",\"region\":\"CA\",\"buildingCodeList\":[\"LAX43\"],\"normalizedCityName\":\"Pasadena\"}"],"normalized_location":"Pasadena, California, USA","optional_search_labels":["amazon.artificial-intelligence"],"posted_date":"February  4, 2026","preferred_qualifications":"- Experience with CloudFormation, Chef, Puppet, Salt, or Ansible in production environments\u003cbr/\u003e- Previous experience with RF test methods and high-speed DAQ systems.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Pasadena - 136,000.00 - 184,000.00 USD annually","primary_search_label":"aws.team-data-science-primary","source_system":"JobCreator","state":"CA","title":"Last Mile Integration Engineer, Amazon Center for Quantum Computing","university_job":null,"updated_time":"1 minute","url_next_step":"https://account.amazon.com/jobs/3174217/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-data-science-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- 1+ year of experience in any of the following or similar technical or vocational roles: Computer Hardware Repair, Infrastructure Cabling, Network Deployment, Data Center Operations","business_category":"aws","city":"Sterling","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Transform network infrastructure by joining our dynamic team! You'll be at the forefront of developing innovative solutions that drive network stability and scalability, using your technical expertise to create automated systems that power global technological advancement. \u003cbr/\u003e \u003cbr/\u003eInfra Delivery Install Technicians will collaborate with cross-functional teams, troubleshoot complex technical scenarios, and implement strategic solutions that keep our network running seamlessly. Expect to engage in hands-on technical work that requires creativity, precision, and a passion for technological innovation. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Moving and implementing large enterprise equipment \u003cbr/\u003e- Installing Fiber and Copper cabling and patching cabling between equipment \u003cbr/\u003e- Ensuring proper safety and security standards are maintained during cabling and rack installation, \u003cbr/\u003e- Following well established hardware installation procedures and break-fix activities \u003cbr/\u003e- Safely using material handling tools and equipment \u003cbr/\u003e- Traveling within and outside of the regional work area is required. You will be responsible for having a reliable personal vehicle and valid driver's license to travel within the regional work area, as company transportation will not be provided \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e- Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds \u003cbr/\u003e- Ability to work in an environment that operates 24/7 with an ability to participate in primary responder rotation and provide after-hours support as needed \u003cbr/\u003e- Working in cramped and/or elevated and/or noisy environments \u003cbr/\u003e- Bending, lifting, stretching, reaching, standing and walking for up to 8+ hours a day \u003cbr/\u003e- Ascending and descending ladders, stairs, and gangways safely and without limitation \u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. ","department_cost_center":null,"description_short":"Transform network infrastructure by joining our dynamic team! You'll be at the forefront of developing innovative solutions that drive network stability and scalability, using your technical expertise","display_distance":null,"id":"8dc8fc85-7eba-473f-beea-6c4c6dc04ec8","id_icims":"3169163","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3169163/infra-delivery-install-technician","job_schedule_type":"full-time","location":"US, VA, Sterling","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sterling\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Sterling\",\"coordinates\":\"39.03336,-77.40713\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sterling, Virginia, USA\",\"location\":\"US, VA, Sterling\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD90\",\"IAD603\",\"IAD26\",\"IAD57\",\"IAD403\",\"IAD282\",\"IAD12\",\"IAD418\",\"IAD118\",\"IAD182\",\"IAD148\",\"IAD72\",\"IAD56\",\"IAD117\",\"IAD417\",\"IAD119\",\"IAD91\",\"IAD10\",\"IAD116\",\"IAD121\",\"IAD89\",\"IAD181\",\"IAD404\",\"IAD415\",\"IAD146\",\"IAD149\",\"IAD62\",\"IAD140\",\"IAD285\",\"IAD68\",\"IAD229\",\"IAD661\",\"IAD163\",\"IAD414\",\"IAD228\",\"IAD122\",\"IAD128\",\"IAD141\",\"IAD175\",\"IAD147\",\"IAD402\",\"IAD144\",\"IAD58\",\"WAS30\",\"IAD408\",\"IAD33\",\"IAD405\",\"IAD613\",\"IAD213\",\"IAD232\",\"IAD588\",\"IAD99\",\"IAD257\",\"IAD93\",\"IAD609\",\"DDC4\",\"IAD226\",\"IAD190\",\"IAD79\",\"IAD587\",\"IAD81\",\"IAD256\",\"IAD160\",\"IAD17\",\"IAD411\",\"IAD191\",\"IAD586\",\"IAD409\",\"IAD83\",\"IAD244\",\"IAD389\",\"IAD255\",\"IAD258\",\"IAD407\",\"IAD32\",\"IAD192\",\"IAD412\",\"IAD143\",\"IAD51\",\"IAD16\",\"BWI1\",\"IAD129\",\"IAD123\",\"OSU69\",\"IAD231\",\"IAD15\",\"IAD76\",\"IAD92\",\"IAD145\",\"IAD259\",\"IAD571\",\"IAD214\",\"IAD98\",\"IAD406\",\"IAD230\",\"IAD416\",\"IAD410\",\"IAD139\",\"IAD180\",\"IAD419\",\"IAD164\",\"IAD608\",\"IAD413\",\"IAD574\",\"IAD142\",\"IAD88\",\"IAD388\",\"IAD243\",\"IAD69\",\"IAD82\",\"IAD120\",\"IAD681\",\"IAD920\",\"IAD662\",\"IAD246\"],\"normalizedCityName\":\"Sterling\"}"],"normalized_location":"Sterling, Virginia, USA","optional_search_labels":[],"posted_date":"January 28, 2026","preferred_qualifications":"- Knowledge of network cabling, optic types, and test equipment\u003cbr/\u003e- Industry standard certifications (CompTIA, CCENT, Network+)\u003cbr/\u003e- Experience with cabling infrastructure best practices and methodologies\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Sterling - 27.00 - 47.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"VA","title":"Infra Delivery Install Technician","university_job":null,"updated_time":"1 minute","url_next_step":"https://account.amazon.com/jobs/3169163/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- 1+ year of experience in any of the following or similar technical or vocational roles: Computer Hardware Repair, Infrastructure Cabling, Network Deployment, Data Center Operations","business_category":"aws","city":"Sterling","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Transform network infrastructure by joining our dynamic team! You'll be at the forefront of developing innovative solutions that drive network stability and scalability, using your technical expertise to create automated systems that power global technological advancement. \u003cbr/\u003e \u003cbr/\u003eInfra Delivery Install Technicians will collaborate with cross-functional teams, troubleshoot complex technical scenarios, and implement strategic solutions that keep our network running seamlessly. Expect to engage in hands-on technical work that requires creativity, precision, and a passion for technological innovation. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Moving and implementing large enterprise equipment \u003cbr/\u003e- Installing Fiber and Copper cabling and patching cabling between equipment \u003cbr/\u003e- Ensuring proper safety and security standards are maintained during cabling and rack installation, \u003cbr/\u003e- Following well established hardware installation procedures and break-fix activities \u003cbr/\u003e- Safely using material handling tools and equipment \u003cbr/\u003e- Traveling within and outside of the regional work area is required. You will be responsible for having a reliable personal vehicle and valid driver's license to travel within the regional work area, as company transportation will not be provided \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e- Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds \u003cbr/\u003e- Ability to work in an environment that operates 24/7 with an ability to participate in primary responder rotation and provide after-hours support as needed \u003cbr/\u003e- Working in cramped and/or elevated and/or noisy environments \u003cbr/\u003e- Bending, lifting, stretching, reaching, standing and walking for up to 8+ hours a day \u003cbr/\u003e- Ascending and descending ladders, stairs, and gangways safely and without limitation \u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. ","department_cost_center":null,"description_short":"Transform network infrastructure by joining our dynamic team! You'll be at the forefront of developing innovative solutions that drive network stability and scalability, using your technical expertise","display_distance":null,"id":"56437c1b-0584-4c8d-bb09-2a922ee82a53","id_icims":"3168709","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3168709/infra-delivery-install-technician","job_schedule_type":"full-time","location":"US, VA, Sterling","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sterling\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Sterling\",\"coordinates\":\"39.03336,-77.40713\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sterling, Virginia, USA\",\"location\":\"US, VA, Sterling\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD90\",\"IAD603\",\"IAD26\",\"IAD57\",\"IAD403\",\"IAD282\",\"IAD12\",\"IAD418\",\"IAD118\",\"IAD182\",\"IAD148\",\"IAD72\",\"IAD56\",\"IAD117\",\"IAD417\",\"IAD119\",\"IAD91\",\"IAD10\",\"IAD116\",\"IAD121\",\"IAD89\",\"IAD181\",\"IAD404\",\"IAD415\",\"IAD146\",\"IAD149\",\"IAD62\",\"IAD140\",\"IAD285\",\"IAD68\",\"IAD229\",\"IAD661\",\"IAD163\",\"IAD414\",\"IAD228\",\"IAD122\",\"IAD128\",\"IAD141\",\"IAD175\",\"IAD147\",\"IAD402\",\"IAD144\",\"IAD58\",\"WAS30\",\"IAD408\",\"IAD33\",\"IAD405\",\"IAD613\",\"IAD213\",\"IAD232\",\"IAD588\",\"IAD99\",\"IAD257\",\"IAD93\",\"IAD609\",\"DDC4\",\"IAD226\",\"IAD190\",\"IAD79\",\"IAD587\",\"IAD81\",\"IAD256\",\"IAD160\",\"IAD17\",\"IAD411\",\"IAD191\",\"IAD586\",\"IAD409\",\"IAD83\",\"IAD244\",\"IAD389\",\"IAD255\",\"IAD258\",\"IAD407\",\"IAD32\",\"IAD192\",\"IAD412\",\"IAD143\",\"IAD51\",\"IAD16\",\"BWI1\",\"IAD129\",\"IAD123\",\"OSU69\",\"IAD231\",\"IAD15\",\"IAD76\",\"IAD92\",\"IAD145\",\"IAD259\",\"IAD571\",\"IAD214\",\"IAD98\",\"IAD406\",\"IAD230\",\"IAD416\",\"IAD410\",\"IAD139\",\"IAD180\",\"IAD419\",\"IAD164\",\"IAD608\",\"IAD413\",\"IAD574\",\"IAD142\",\"IAD88\",\"IAD388\",\"IAD243\",\"IAD69\",\"IAD82\",\"IAD120\",\"IAD681\",\"IAD920\",\"IAD662\",\"IAD246\"],\"normalizedCityName\":\"Sterling\"}"],"normalized_location":"Sterling, Virginia, USA","optional_search_labels":[],"posted_date":"January 28, 2026","preferred_qualifications":"- Knowledge of network cabling, optic types, and test equipment\u003cbr/\u003e- Industry standard certifications (CompTIA, CCENT, Network+)\u003cbr/\u003e- Experience with cabling infrastructure best practices and methodologies\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Sterling - 27.00 - 47.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"VA","title":"Infra Delivery Install Technician","university_job":null,"updated_time":"1 minute","url_next_step":"https://account.amazon.com/jobs/3168709/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of program or project management experience\u003cbr/\u003e- 5+ years of supply chain experience\u003cbr/\u003e- Experience using data and metrics to determine and drive improvements\u003cbr/\u003e- Experience owning program strategy, end to end delivery, and communicating results to senior leadership","business_category":"transportation-and-logistics","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join Amazon's dynamic environment as a Senior Supply Chain Manager with a Network Capacity planning background, where you will play a crucial role in shaping and optimizing various facets of our operations, concentrating on optimizing and managing the flow of goods, information, or services within the supply chain network. We have exciting opportunities across different business units, each seeking a skilled professional to lead strategic initiatives and drive process improvements, with a specific focus on network capacity and expansion and the physical flow of goods or services within the supply chain network. As a Strategic Senior Supply Chain Manager with a Network Capacity Background, you'll take end-to-end ownership of operations, emphasizing capacity planning, logistics optimization, network design, new launch expansion and analysis of operational efficiency.\u003cbr/\u003e\u003cbr/\u003eIn this role, you will collaborate with cross-functional teams, including Business, Operations, Supply Chain, Start Up Planning, Launch and more. Utilize your analytical prowess to identify opportunities for operational improvements, implement scalable systems, and drive automation to enhance efficiency, with a particular focus on optimizing the physical flow and operations within the supply chain network. Whether you're managing network capacity initiatives, overseeing cross-functional programs, or focusing on strategic projects, your impact will be visible, ongoing, and contribute directly to our commitment to being the most customer-centric company on earth.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Lead strategic initiatives related to network capacity within Amazon's various business units.\u003cbr/\u003e- Concentrate on optimizing and managing the flow of goods, information, or services within the supply chain network by analyzing topology for new site expansion opportunities.\u003cbr/\u003e- Balance supply and demand, assess and improve the efficiency of distribution networks, warehouses, or logistics operations.\u003cbr/\u003e- Analyze and synthesize data to identify opportunities for enhancing customer experiences and operational efficiency in network capacity.\u003cbr/\u003e- Define metrics, develop program management mechanisms, and invent/simplify processes to drive decision-making in complex network capacity situations.\u003cbr/\u003e- Manage cross-functional network capacity initiatives, ensuring continuous improvement and adherence to lean philosophy at scale.\u003cbr/\u003e- Own a portfolio of cross-functional programs related to network capacity, driving performance improvement and efficiency in project delivery (New Launch, EV, ADTA, Retrofit Projects)\u003cbr/\u003e- Monitor and optimize key network capacity metrics to ensure the smooth flow of goods or services through the supply chain network.","department_cost_center":null,"description_short":"Join Amazon's dynamic environment as a Senior Supply Chain Manager with a Network Capacity planning background, where you will play a crucial role in shaping and optimizing various facets of our operations,","display_distance":null,"id":"98952039-8adc-45fb-b282-20a0611fa431","id_icims":"3163497","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Supply Chain Management","job_function_id":null,"job_path":"/en/jobs/3163497/senior-supply-chain-manager-last-mile-topology","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA82\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"January 21, 2026","preferred_qualifications":"- 2+ years of driving process improvements experience\u003cbr/\u003e- Master's degree, or MBA in business, operations, human resources, adult education, organizational development, instructional design or related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Bellevue - 115,400.00 - 160,000.00 USD annually","primary_search_label":"transportation-and-logistics.team-na-operations","source_system":"JobCreator","state":"WA","title":"Senior Supply Chain Manager, Last Mile Topology","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3163497/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-na-operations","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- 1+ year of experience in any of the following or similar technical or vocational roles: Computer Hardware Repair, Infrastructure Cabling, Network Deployment, Data Center Operations","business_category":"aws","city":"Sterling","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Transform network infrastructure by joining our dynamic team! You'll be at the forefront of developing innovative solutions that drive network stability and scalability, using your technical expertise to create automated systems that power global technological advancement. \u003cbr/\u003e \u003cbr/\u003eInfra Delivery Install Technicians will collaborate with cross-functional teams, troubleshoot complex technical scenarios, and implement strategic solutions that keep our network running seamlessly. Expect to engage in hands-on technical work that requires creativity, precision, and a passion for technological innovation. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Moving and implementing large enterprise equipment \u003cbr/\u003e- Installing Fiber and Copper cabling and patching cabling between equipment \u003cbr/\u003e- Ensuring proper safety and security standards are maintained during cabling and rack installation, \u003cbr/\u003e- Following well established hardware installation procedures and break-fix activities \u003cbr/\u003e- Safely using material handling tools and equipment \u003cbr/\u003e- Traveling within and outside of the regional work area is required. You will be responsible for having a reliable personal vehicle and valid driver's license to travel within the regional work area, as company transportation will not be provided \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e- Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds \u003cbr/\u003e- Ability to work in an environment that operates 24/7 with an ability to participate in primary responder rotation and provide after-hours support as needed \u003cbr/\u003e- Working in cramped and/or elevated and/or noisy environments \u003cbr/\u003e- Bending, lifting, stretching, reaching, standing and walking for up to 8+ hours a day \u003cbr/\u003e- Ascending and descending ladders, stairs, and gangways safely and without limitation \u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. ","department_cost_center":null,"description_short":"Transform network infrastructure by joining our dynamic team! You'll be at the forefront of developing innovative solutions that drive network stability and scalability, using your technical expertise","display_distance":null,"id":"69a8a5ef-7803-4b20-aef5-3f56ded6d011","id_icims":"3169147","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3169147/infra-delivery-install-technician","job_schedule_type":"full-time","location":"US, VA, Sterling","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sterling\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Sterling\",\"coordinates\":\"39.03336,-77.40713\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sterling, Virginia, USA\",\"location\":\"US, VA, Sterling\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD90\",\"IAD603\",\"IAD26\",\"IAD57\",\"IAD403\",\"IAD282\",\"IAD12\",\"IAD418\",\"IAD118\",\"IAD182\",\"IAD148\",\"IAD72\",\"IAD56\",\"IAD117\",\"IAD417\",\"IAD119\",\"IAD91\",\"IAD10\",\"IAD116\",\"IAD121\",\"IAD89\",\"IAD181\",\"IAD404\",\"IAD415\",\"IAD146\",\"IAD149\",\"IAD62\",\"IAD140\",\"IAD285\",\"IAD68\",\"IAD229\",\"IAD661\",\"IAD163\",\"IAD414\",\"IAD228\",\"IAD122\",\"IAD128\",\"IAD141\",\"IAD175\",\"IAD147\",\"IAD402\",\"IAD144\",\"IAD58\",\"WAS30\",\"IAD408\",\"IAD33\",\"IAD405\",\"IAD613\",\"IAD213\",\"IAD232\",\"IAD588\",\"IAD99\",\"IAD257\",\"IAD93\",\"IAD609\",\"DDC4\",\"IAD226\",\"IAD190\",\"IAD79\",\"IAD587\",\"IAD81\",\"IAD256\",\"IAD160\",\"IAD17\",\"IAD411\",\"IAD191\",\"IAD586\",\"IAD409\",\"IAD83\",\"IAD244\",\"IAD389\",\"IAD255\",\"IAD258\",\"IAD407\",\"IAD32\",\"IAD192\",\"IAD412\",\"IAD143\",\"IAD51\",\"IAD16\",\"BWI1\",\"IAD129\",\"IAD123\",\"OSU69\",\"IAD231\",\"IAD15\",\"IAD76\",\"IAD92\",\"IAD145\",\"IAD259\",\"IAD571\",\"IAD214\",\"IAD98\",\"IAD406\",\"IAD230\",\"IAD416\",\"IAD410\",\"IAD139\",\"IAD180\",\"IAD419\",\"IAD164\",\"IAD608\",\"IAD413\",\"IAD574\",\"IAD142\",\"IAD88\",\"IAD388\",\"IAD243\",\"IAD69\",\"IAD82\",\"IAD120\",\"IAD681\",\"IAD920\",\"IAD662\",\"IAD246\"],\"normalizedCityName\":\"Sterling\"}"],"normalized_location":"Sterling, Virginia, USA","optional_search_labels":[],"posted_date":"January 28, 2026","preferred_qualifications":"- Knowledge of network cabling, optic types, and test equipment\u003cbr/\u003e- Industry standard certifications (CompTIA, CCENT, Network+)\u003cbr/\u003e- Experience with cabling infrastructure best practices and methodologies\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Sterling - 27.00 - 47.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"VA","title":"Infra Delivery Install Technician","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3169147/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Aurora","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Application deadline: Feb 9, 2026\u003cbr/\u003e\u003cbr/\u003eOur WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager. In this role, you will lead a team of hourly workforce and will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e\u003cbr/\u003eOur Operation’s workflow has three major components: First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Support, mentor, and motivate your hourly workforce\u003cbr/\u003e* Manage safety, quality, productivity, and customer delivery promises\u003cbr/\u003e* Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e* Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e* Stand/walk for up to 12 hours during shifts\u003cbr/\u003e* Work in an environment where the noise level varies and can be loud\u003cbr/\u003e* Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e* Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e\u003cbr/\u003eOur fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Area Managers based on location preference and the business’ current openings.","department_cost_center":null,"description_short":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager.","display_distance":null,"id":"7a8def69-6652-4061-8e1f-7c1e3ed7f4e6","id_icims":"3173711","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3173711/area-manager-ii","job_schedule_type":"full-time","location":"US, CO, Aurora","locations":["{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Aurora\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Aurora\",\"coordinates\":\"39.70932,-104.81458\",\"normalizedCountyName\":\"Arapahoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Aurora, Colorado, USA\",\"location\":\"US, CO, Aurora\",\"region\":\"CO\",\"buildingCodeList\":[\"EIK2\"],\"normalizedCityName\":\"Aurora\"}"],"normalized_location":"Aurora, Colorado, USA","optional_search_labels":[],"posted_date":"February  4, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 20+ employees\u003cbr/\u003e- Experience with process improvements (Lean process, Kaizen, and/or Six Sigma)\u003cbr/\u003e- Excellent customer service, communication, and interpersonal skills\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Industry experience in: retail, F\u0026B, military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Aurora - 70,000.00 - 90,900.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"CO","title":"Area Manager II ","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3173711/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of computer hardware troubleshooting and repair experience\u003cbr/\u003e- 1+ years of computer networking experience\u003cbr/\u003e- High school or equivalent diploma","business_category":"aws","city":"Atlanta","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is seeking Data Center Technicians to support our customers in multiple locations. This position requires the successful candidate report to a site location.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is a fast-paced technology company and a leader in the world of data centers. The position will help ensure overall availability and reliability to meet or exceed defined service levels of data center operations. This position may involve participation in an primary responder rotation, which includes monitoring the data center infrastructure, coordinating response to operational incidents, and partnering with other teams to rapidly resolve issues that impact service availability. Primary responder responsibilities may require evening, weekend, holiday, and/or night work to ensure our global data centers are operating at the highest levels of reliability for our customers. All candidates should be willing to work both independently and with a team. Work prioritization, organizational skills, effective communication, and the ability to react quickly are critical to success. \u003cbr/\u003e\u003cbr/\u003eIn addition to hardware and network repair candidates will install equipment, create documentation, innovate solutions, and fix problems within the data center space. This team works in an environment that operates 24/7. Traveling within and outside of regional work area is required.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAll physical requirements are expected with reasonable accommodations:\u003cbr/\u003e•\tRegularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds\u003cbr/\u003e•\tAbility to work in an environment that operates 24/7 with an ability to participate in primary responder rotation and provide after-hours support as needed\u003cbr/\u003e•\tWorking in cramped and/or elevated and/or noisy environments\u003cbr/\u003e•\tBending, lifting, stretching, reaching, standing and walking for up to 8+ hours a day\u003cbr/\u003e•\tAscending and descending ladders, stairs, and gangways safely and without limitation\u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon is not able to provide sponsorship now or in the future for these positions. Eligible candidates must have work authorization without employer intervention to be considered.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tPerforming server rack installations, hardware break-fix on various components, troubleshooting network issues, and responding to operational incidents that impact service availability, escalating to senior technicians and management as needed/required\u003cbr/\u003e•\tServing as a primary contact point for both internal and external stakeholders, including engineers, software developers, vendors, and contractors\u003cbr/\u003e•\tPerforming on-call duties and participating in scheduled maintenance and change management activities\u003cbr/\u003e•\tContributing to documentation and process improvement initiatives based on your analysis of operational issues\u003cbr/\u003e•\tHelping to train and onboard new team members\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Data Center Technician professional, you have industry-leading technical abilities and demonstrate a breadth of knowledge while you:\u003cbr/\u003e•\tTake ownership of technical issues brought by their customer base, engaging other teams when needed to drive resolution\u003cbr/\u003e•\tSolve problems at their root and step back to understand the broader context\u003cbr/\u003e•\tMaintain service level agreements through the implementation of proactive issue detection and reporting\u003cbr/\u003e\u003cbr/\u003eYou will be required to work shift work that will include days/nights/weekends/holidays. Traveling within and outside of regional work area is required.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"571be1cb-9f13-4248-b983-56e8a1c6b97f","id_icims":"3172673","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3172673/data-center-technician-night-shift-dcc-communities","job_schedule_type":"full-time","location":"US, GA, Atlanta","locations":["{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Atlanta\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Atlanta\",\"coordinates\":\"33.74831,-84.39111\",\"normalizedCountyName\":\"Fulton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Atlanta, Georgia, USA\",\"location\":\"US, GA, Atlanta\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL75\"],\"normalizedCityName\":\"Atlanta\"}"],"normalized_location":"Atlanta, Georgia, USA","optional_search_labels":["aws.team-ais","aws.team-dc","hourly"],"posted_date":"February  3, 2026","preferred_qualifications":"- Experience dealing effectively with customers during problem resolution and operating efficiently under pressure\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, GA, Atlanta - 27.00 - 47.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"GA","title":"Data Center Technician - Night Shift, DCC Communities ","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3172673/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent, or 2+ years of Amazon experience\u003cbr/\u003e- 2+ years of relevant work experience\u003cbr/\u003e- Speak, write, and read fluently in English\u003cbr/\u003e- Speak, write, and read fluently in Spanish\u003cbr/\u003e- 1+ year of direct management experience for employees and their performance.","business_category":"fulfillment-and-operations","city":"Cuauhtémoc","company_name":"Servicios Comerciales Amazon Mexico S. de R.L. de C.V.","country_code":"MEX","description":"When you join Amazon as an Area Shift Manager, you’ll gain experience leading a large and diverse team to make sure your area of the business keeps pace with demand. In this hands-on role, you’ll learn about the complexity of operations at a global business and what it takes to make everything run seamlessly. While you implement your team’s approach to drive productivity, you’ll also work closely with your colleagues to address challenges, which means no two days will be the same.  \u003cbr/\u003eAmazon is looking for high-potential leaders, who are ready to own their impact in Amazon Operations as an entry-level manager working to be the most customer-centric company on earth. You will have your leadership capacity stretched to its full potential, As a front-line leader, you will have an opportunity to truly invest in others and develop a people-focused leadership style, while mastering the tools, processes, and operations that have created the most customer-centric company on Earth. If you want to be involved in continuing to define the future of online retail, and are dynamic and an organized self-starter, join our team in Amazon Operations.\u003cbr/\u003eJob Specifics:\u003cbr/\u003e-\tThis role is fully onsite and requires flexibility to work and rotate shifts: weekends, holidays, and/or overnight shifts, and Ability to work overtime both in peak season and as needed.\u003cbr/\u003e- This role can be hired for any of following locations: Mexico City, Mexico State, Queretaro, Puebla or Morelos.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Promote a culture of safety and wellbeing \u003cbr/\u003e- Analyze and implement corrective actions to make sure quality and productivity are at consistently high levels, and business objectives are met across all shifts \u003cbr/\u003e- Support and lead a team and handle administrative work alongside building and supporting a strong team culture \u003cbr/\u003e- Analyze performance and suggest process improvements to optimize work and improve customer service \u003cbr/\u003e- Promote best practice and continuous process improvements across your team in areas like health and safety and productivity\u003cbr/\u003e- Collaborate with other managers to standardize shift processes  \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou’ll work shifts and be based at one of our operational sites. Your main focus will be to maintain safety standards within your team and across your site. You’ll also monitor and maintain process efficiency. Your days will always include prioritizing routine team management and daily operational tasks, alongside other tasks like individual escalations, process improvement work and wide-scale operational contingency planning.  \u003cbr/\u003e\u003cbr/\u003eBeing a key part of the operations team involves working with colleagues in other teams and external partners to make sure we stay on track to meet our customer demands and targets. This will involve analyzing data and performance metrics with leaders in your business area, as well as discussing the operational pros and cons of technical improvements with engineers. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Logistics, or AMZL, handles ‘last mile’ delivery duties in partnership with third-party distribution businesses. We utilise creative thinking and continuous improvement initiatives to get millions of physical products into the hands of our customers. Our goal is to make our customers’ delivery experience as smooth as possible and roll out global delivery solutions for our newest concepts, like Amazon Fresh, Prime Now and Amazon Restaurants.\u003cbr/\u003e\u003cbr/\u003eThere are two sides to what we do. Our ‘under the roof’ associates process millions of products for dispatch to our delivery teams. Our team is people-focused and supportive, particularly as lots of our people work through the night. We focus mostly on operations, with 24/7 shifts in most of our locations.\u003cbr/\u003e\u003cbr/\u003eMeanwhile, our ‘on the road’ people work with Amazon Flex - a network of delivery contractors. Every year, we continually raise the bar for customer experience with new, innovative delivery services. We look for new ways to overcome industry wide logistics challenges and new ideas to reduce our carbon footprint, supported by a portfolio of cutting-edge vehicles (including Electric Vehicles) and technology to help us do just that.\u003cbr/\u003e\u003cbr/\u003eInclusive team culture \u003cbr/\u003eAt Amazon we embrace our differences and we are committed to furthering our culture of inclusion. We host annual and ongoing learning experiences. Amazon’s culture of inclusion is reinforced within our 14 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.\u003cbr/\u003e \u003cbr/\u003eWork Life Balance \u003cbr/\u003eWe believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfillment. We offer flexibility in working hours and encourage you to find your own balance between your work and personal lives.\u003cbr/\u003e \u003cbr/\u003eMentorship \u0026 Career Growth \u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded professional.","department_cost_center":null,"description_short":"When you join Amazon as an Area Shift Manager, you’ll gain experience leading a large and diverse team to make sure your area of the business keeps pace with demand. In this hands-on role, you’ll learn","display_distance":null,"id":"dc1d9d62-5232-4659-adc8-a078844e6754","id_icims":"3123741","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3123741/shift-area-manager-last-mile-operations","job_schedule_type":"full-time","location":"MX, Cuauhtémoc","locations":["{\"normalizedStateName\":\"Mexico City\",\"normalizedCountryCode\":\"MEX\",\"city\":\"Cuauhtémoc\",\"countryIso3a\":\"MEX\",\"countryIso2a\":\"MX\",\"locationNonStemming\":\"Mexico, Cuauhtémoc\",\"coordinates\":\"19.42964,-99.16575\",\"normalizedCountyName\":\"Mexico City\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Mexico\",\"normalizedLocation\":\"Cuauhtémoc, Mexico City, MEX\",\"location\":\"MX, Cuauhtémoc\",\"region\":\"\",\"buildingCodeList\":[\"DXX1\"],\"normalizedCityName\":\"Cuauhtémoc\"}"],"normalized_location":"Cuauhtémoc, Mexico City, MEX","optional_search_labels":["ops.lander-mexico"],"posted_date":"November 10, 2025","preferred_qualifications":"- MBA\u003cbr/\u003e- Experience in Lean methodologies\u003cbr/\u003e- Experience in project management\u003cbr/\u003e- Experience managing department´s KPIs and driven results\u003cbr/\u003e- Bachelor's degree in business, engineering, operations, supply chain, transportation or related.\u003cbr/\u003e- Logistics Background from Operations environment, preferably from First-Middle Mile Ops.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-last-mile-delivery","source_system":"JobCreator","state":null,"title":"Shift Area Manager, Last Mile Operations","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3123741/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-delivery","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Aurora","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Application deadline: Feb 9, 2026\u003cbr/\u003e\u003cbr/\u003eOur WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager. In this role, you will lead a team of hourly workforce and will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e\u003cbr/\u003eOur Operation’s workflow has three major components: First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Support, mentor, and motivate your hourly workforce\u003cbr/\u003e* Manage safety, quality, productivity, and customer delivery promises\u003cbr/\u003e* Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e* Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e* Stand/walk for up to 12 hours during shifts\u003cbr/\u003e* Work in an environment where the noise level varies and can be loud\u003cbr/\u003e* Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e* Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e\u003cbr/\u003eOur fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Area Managers based on location preference and the business’ current openings.","department_cost_center":null,"description_short":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager.","display_distance":null,"id":"5afa40d1-2d23-4788-a30a-af3e7d3087e2","id_icims":"3146061","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3146061/area-manager-ii","job_schedule_type":"full-time","location":"US, CO, Aurora","locations":["{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Aurora\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Aurora\",\"coordinates\":\"39.70932,-104.81458\",\"normalizedCountyName\":\"Arapahoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Aurora, Colorado, USA\",\"location\":\"US, CO, Aurora\",\"region\":\"CO\",\"buildingCodeList\":[\"EIK2\"],\"normalizedCityName\":\"Aurora\"}"],"normalized_location":"Aurora, Colorado, USA","optional_search_labels":[],"posted_date":"December 19, 2025","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 20+ employees\u003cbr/\u003e- Experience with process improvements (Lean process, Kaizen, and/or Six Sigma)\u003cbr/\u003e- Excellent customer service, communication, and interpersonal skills\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Industry experience in: retail, F\u0026B, military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Aurora - 70,000.00 - 90,900.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"CO","title":"Area Manager II ","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3146061/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- 3+ years of increasing responsibilities in WHS and/or environmental programs in manufacturing, production, or service operations\u003cbr/\u003e- 3+ years of increasing responsibilities in people and performance management, or 2+ years of Amazon Safety (blue badge/FTE) experience","business_category":"fulfillment-and-operations","city":"Jackson","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We're seeking a dedicated Workplace Health \u0026 Safety (WHS) Manager to join our mission of creating the world's safest work environment. This role offers an exciting opportunity to directly impact associate wellbeing while driving operational excellence.\u003cbr/\u003e\u003cbr/\u003eAs a WHS Manager, you'll be the site's safety champion, leading our Global WHS Program implementation. You'll combine hands-on safety management with strategic thinking to protect our most valuable asset – our people. Your role bridges the gap between safety requirements and operational success, requiring both technical expertise and strong interpersonal skills. Working closely with Operations leadership, you'll drive safety initiatives that make a real difference. You'll conduct comprehensive risk assessments, analyze safety data, and implement practical solutions that protect associates while supporting productivity. Your ability to build relationships and influence positive change will be essential as you help shape our safety culture. You'll lead safety compliance efforts, conduct thorough site audits, and analyze incident trends to target improvements where they matter most. Managing our first aid program and emergency response capabilities, you'll ensure immediate care is always available. Your analytical skills will transform safety data into actionable insights, while your leadership abilities will help engage associates in our safety mission. \u003cbr/\u003e\u003cbr/\u003eCore Impact Areas:\u003cbr/\u003eSafety Leadership \u0026 Innovation - Transform safety culture through leadership and innovative solutions. Drive continuous improvement initiatives that set new benchmarks in workplace safety. Leverage technology and data analytics to drive preventive safety measures that protect our associates while enhancing operational excellence. Develop leadership plans, communicate expectations, and drive initiatives to create a safe work environment. Measure performance against WHS policies, analyze metrics, and conduct site audits to address non-compliance issues. \u003cbr/\u003e\u003cbr/\u003eStrategic Partnership \u0026 Influence - Build partnerships with Operations leadership to integrate safety into every aspect of our business. Use compelling data analysis and risk insights to influence positive change and drive strategic decision-making. Establish yourself as a trusted advisor who balances safety excellence with operational demands. Oversee recordkeeping, workplace organization, and WHS training programs.\u003cbr/\u003e\u003cbr/\u003eThis position requires the flexibility to travel 50-70% of the time and work various shifts.\u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements include: \u003cbr/\u003e- Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Stand/walk for up to 12 hours during shifts\u003cbr/\u003e- Work in an environment where the noise level varies \u003cbr/\u003e- Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e- Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e\u003cbr/\u003eFor those that do not have an adult First Aid, CPR, AED certification from the American Heart Association or American Red Cross, must obtain within 3 weeks of start date.\u003cbr/\u003e","department_cost_center":null,"description_short":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We're seeking","display_distance":null,"id":"2c07f934-b118-4b90-b8ad-9b802468ab43","id_icims":"2997778","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/2997778/multi-site-ehs-manager-ii","job_schedule_type":"full-time","location":"US, MS, Jackson","locations":["{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Moselle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Moselle\",\"coordinates\":\"31.50517,-89.27892\",\"normalizedCountyName\":\"Jones\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Moselle, Mississippi, USA\",\"location\":\"US, MS, Moselle\",\"region\":\"MS\",\"buildingCodeList\":[\"WMS2\"],\"normalizedCityName\":\"Moselle\"}","{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Saltillo\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Saltillo\",\"coordinates\":\"34.37676,-88.68425\",\"normalizedCountyName\":\"Lee\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Saltillo, Mississippi, USA\",\"location\":\"US, MS, Saltillo\",\"region\":\"MS\",\"buildingCodeList\":[\"WMS4\"],\"normalizedCityName\":\"Saltillo\"}","{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Jackson\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Jackson\",\"coordinates\":\"32.29896,-90.18044\",\"normalizedCountyName\":\"Hinds\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Jackson, Mississippi, USA\",\"location\":\"US, MS, Jackson\",\"region\":\"MS\",\"buildingCodeList\":[\"WMS1\"],\"normalizedCityName\":\"Jackson\"}"],"normalized_location":"Jackson, Mississippi, USA","optional_search_labels":[],"posted_date":"June  2, 2025","preferred_qualifications":"- Distribution Center or manufacturing safety experience with mix of exempt and non-exempt employees at a site of at least 250 people preferred.\u003cbr/\u003e- Master’s degree preferred\u003cbr/\u003e- Experience in a fast-paced, changing/growing organization\u003cbr/\u003e- Certified Safety Professional preferred\u003cbr/\u003e- Excellent written and verbal communication skills, including comfort collaborating with site leaders.\u003cbr/\u003e- Ability to develop and implement department goals and strategies.\u003cbr/\u003e- Strong analytical skills with demonstrated problem solving ability.\u003cbr/\u003e- Ability to adapt well to fast-paced environments with changing circumstances, direction, and strategy\u003cbr/\u003e- Proficient in Microsoft Office and the use of pivot tables and the development of charts and graphics.\u003cbr/\u003e- Ability to manage multiple sites/remotely.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MS, Jackson - 70,100.00 - 105,200.00 USD annually\u003cbr/\u003eUSA, MS, Moselle - 63,100.00 - 94,700.00 USD annually\u003cbr/\u003eUSA, MS, Saltillo - 63,100.00 - 94,700.00 USD annually","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"MS","title":"Multi-Site EHS Manager II ","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/2997778/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}