{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Experience programming with at least one modern language such as Java, C++, or C# including object-oriented design\u003cbr/\u003e- Experience contributing to the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems\u003cbr/\u003e- Bachelor's degree in a relevant field or equivalent work experience\u003cbr/\u003e- Experience (non-internship) in professional software development","business_category":"entertainment","city":"Tel Aviv","company_name":"Amazon Development Center (Tel Aviv)","country_code":"ISR","description":"Come build the future of entertainment with us. Are you interested in helping shape the future of live sports streaming? Do you want to help define how millions of Amazon customers discover and watch live sports events?\u003cbr/\u003e\u003cbr/\u003ePrime Video is a premium streaming service that offers customers a vast collection of TV shows and movies - all with the ease of finding what they love to watch in one place. We offer customers thousands of popular movies and TV shows including Amazon Originals and exclusive licensed content, as well as exciting live sports events including NFL Thursday Night Football, NBA, MLB, and more. Prime Video is a fast-paced, growth business - available in over 240 countries and territories worldwide. The team works in a dynamic environment where innovating on behalf of our customers is at the heart of everything we do.\u003cbr/\u003e\u003cbr/\u003eWe are looking for a Software Engineer to join our Live Events Discovery team in Israel. Our team owns and operates tier-1 services that are critical to Prime Video's live sports business, serving millions of customers globally with strict availability and latency requirements. We are responsible for connecting customers to live sports experiences through content discovery and personalization. Our service powers the carousels and content discovery features across Prime Video's home page, sports pages, and subscription pages.\u003cbr/\u003e\u003cbr/\u003eThis role offers the opportunity to work on services where every decision matters - from architectural choices to caching strategies to error handling - because our services are in the critical path for customer experience during the biggest moments in sports.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Build architecture and feature development for our Tier-1 service\u003cbr/\u003e- Build and maintain highly resilient distributed systems that handle millions of requests during peak live sports events\u003cbr/\u003e- Design and implement sophisticated content curation and filtering logic that integrates with multiple upstream services for entitlements, blackouts, recommendations, and playability\u003cbr/\u003e- Partner with other engineers to ideate, design, and build scalable solutions\u003cbr/\u003e- Tackle complex technical challenges across the stack - from service APIs to data orchestration\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a member of our team, you will:\u003cbr/\u003e\u003cbr/\u003e- Own and operate mission-critical, Tier-1 services with stringent availability and performance requirements\u003cbr/\u003e- Build and scale high-throughput, low-latency content discovery services deployed across multiple AWS regions globally\u003cbr/\u003e- Drive operational excellence for services during peak live sports events\u003cbr/\u003e- Architect solutions that integrate with multiple upstream services for content filtering, entitlements, blackouts, and recommendations\u003cbr/\u003e- Work on intelligent content curation systems that surface the right live sports content to the right customers at the right time\u003cbr/\u003e- Collaborate with merchandising, recommendation, and content teams to deliver personalized sports discovery experiences\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eIn September 2018 Prime Video launched its first full-scale live streaming experience to world-wide Prime customers with NFL Thursday Night Football. That was just the start. Now Amazon has exclusive broadcasting rights to major leagues and events including NFL Thursday Night Football, NBA, NASCAR, the Olympics, tennis majors like Roland-Garros, and English Premier League, and is broadcasting live events across 30+ sports world-wide. Prime Video is expanding not just the breadth of live content that it offers, but the depth of the experience. This is a transformative opportunity, the chance to be at the vanguard of a program that will revolutionize Prime Video, and the live streaming experience of customers everywhere.","department_cost_center":null,"description_short":"Come build the future of entertainment with us. Are you interested in helping shape the future of live sports streaming? Do you want to help define how millions of Amazon customers discover and watch live","display_distance":null,"id":"30700d59-c686-4cf9-aa30-a37716edd0e1","id_icims":"3157858","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3157858/software-development-engineer-prime-video-sports","job_schedule_type":"full-time","location":"IL, Tel Aviv","locations":["{\"normalizedStateName\":\"Tel Aviv\",\"normalizedCountryCode\":\"ISR\",\"city\":\"Tel Aviv\",\"countryIso3a\":\"ISR\",\"countryIso2a\":\"IL\",\"locationNonStemming\":\"Israel, Tel Aviv\",\"coordinates\":\"32.08556,34.78953\",\"normalizedCountyName\":\"Tel Aviv\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Israel\",\"normalizedLocation\":\"Tel Aviv-Yafo, Tel Aviv, ISR\",\"location\":\"IL, Tel Aviv\",\"region\":\"\",\"buildingCodeList\":[\"TLV14\"],\"normalizedCityName\":\"Tel Aviv-Yafo\"}"],"normalized_location":"Tel Aviv-Yafo, Tel Aviv, ISR","optional_search_labels":["entertainment.team-pvs-live-events"],"posted_date":"January 13, 2026","preferred_qualifications":"- Experience leading and influencing your team or organization, or experience with Machine Learning and Large Language Model fundamentals, including architecture, training/inference lifecycles, and optimization of model execution\u003cbr/\u003e- Experience prioritizing and delivering projects on time in a fast-moving environment\u003cbr/\u003e- An  interest or experience in the field of Computer Vision and/or  Recommendation Systems.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"entertainment.team-primevideo","source_system":"JobCreator","state":null,"title":"Software Development Engineer, Prime Video Sports","university_job":null,"updated_time":"2 minutes","url_next_step":"https://account.amazon.com/jobs/3157858/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-primevideo","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in Data Center Engineering Operations, with a deep understanding of electrical and mechanical data center infrastructure\u003cbr/\u003e- Knowledge of mechanical or electrical systems design\u003cbr/\u003e- Experience working with a queue of requests with Service Level Agreements (SLA) and accuracy targets against Standard Operating Procedures (SOP)","business_category":"aws","city":"Dublin","company_name":"Amazon Data Services Ireland Limited","country_code":"IRL","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eThe Data Center Global Services organization is looking for an individual with proven and tested leadership skills to help bring to fruition a newly developed Facilities Operations Center. The Facility Operations Center is responsible for 24X7 monitoring of the data center’s physical infrastructure and will serve as a facilitator for all Large Scale Events. This team will ensure that the customer experience will be optimal and gratifying by way of consistency, reliability and attention to detail.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will need to have an understanding of data center IT Infrastructure and data center Facilities infrastructure and how the two entities co-exist. The successful candidate will be responsible for providing assistance and support to the onsite team. The position will help ensure overall availability and reliability to meet or exceed defined service levels. Qualified candidates must also have experience functioning in a large-scale data center and have demonstrated and displayed the ability to think outside of the box. This skill is essential, as the candidate will assist with aligning the Facility Operations Center with the larger objectives of other business and peer organizations. You will need to play a role with growing the team to a standard of operational excellence.\u003cbr/\u003e\u003cbr/\u003eIf you are passionate about the Customer Experience; you think and act globally; and you want to contribute to the operational excellence of Amazon Data Centers, then this may be the challenge you’ve been looking for!\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eMonitors the global data center Amazon facilities infrastructure platform\u003cbr/\u003eServes as a Point of Contact for internal and external teams\u003cbr/\u003eAssists with the development of communication and escalation protocols designed to improve the team’s performance\u003cbr/\u003eContributes to outage post mortem analysis\u003cbr/\u003eEnsures records are updated in a timely manner\u003cbr/\u003eAssists with coordination and communication during emergency recovery efforts\u003cbr/\u003eAssists with the development of tools that will enhance the team’s performance\u003cbr/\u003eAbility to support a 24X7 environment (This is shift work which may require that you work weekends and holidays)\u003cbr/\u003eInternal job description\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"43a9288e-1305-4502-9560-f96957d6edc6","id_icims":"3161728","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3161728/facility-operations-center-eng-facilities-operation-center","job_schedule_type":"full-time","location":"IE, D, Dublin","locations":["{\"normalizedCountryCode\":\"IRL\",\"city\":\"Dublin\",\"countryIso3a\":\"IRL\",\"countryIso2a\":\"IE\",\"locationNonStemming\":\"Ireland, D, Dublin\",\"coordinates\":\"53.34807,-6.24827\",\"normalizedCountyName\":\"County Dublin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Ireland\",\"normalizedLocation\":\"Dublin, IRL\",\"location\":\"IE, D, Dublin\",\"region\":\"D\",\"buildingCodeList\":[\"DUB50\"],\"normalizedCityName\":\"Dublin\"}"],"normalized_location":"Dublin, IRL","optional_search_labels":[],"posted_date":"January 19, 2026","preferred_qualifications":"- 3+ years' experience working in a large scale Data center\u003cbr/\u003e- 3+ years’ experience in a NOC (Network Operations Centre) or similar\u003cbr/\u003e- 3+ years' experience in Data Center Engineering / Operations environment\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"D","title":"Facility Operations Center Eng, Facilities Operation Center","university_job":null,"updated_time":"2 minutes","url_next_step":"https://account.amazon.com/jobs/3161728/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of sales experience\u003cbr/\u003e- Bachelor's degree","business_category":"transportation-and-logistics","city":"Ahmedabad","company_name":"ASSPL - Gujarat - D34","country_code":"IND","description":"At Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Team leads for our transportation team. Amazon is one of the most recognizable brand names in the world and we distribute millions of products each year to our loyal customers . \u003cbr/\u003e\u003cbr/\u003eWe're seeking a Team lead for our Delivery center. In this role you will be responsible for shift operations at our DCs and support the DC manager in performance management and driving the operational plan.\u003cbr/\u003e\u003cbr/\u003eTitle: Channel Team Lead\u003cbr/\u003eLocation: Vadodara, Gujarat\u003cbr/\u003e\u003cbr/\u003e  Essential Functions \u003cbr/\u003e\u003cbr/\u003e-Job Description  ·         Account Identification \u0026 Acquisition:  Market mapping and Identification of potential retail stores for time  bound Acquisition, induction and onboarding of new accounts (I.H.S  stores) in the assigned territory. \u003cbr/\u003e  ·         Account Management: Managing and  driving the growth of the Channel partners/stores’ business with Amazon.  Build and execute on a strategic account plan that delivers on key  business opportunities for the stores and Amazon. \u003cbr/\u003e  ·         Field Visits: Visiting targeted number of stores on a daily/weekly/monthly basis. \u003cbr/\u003e  ·         Training: Deliver training \u0026 coaching of Amazon processes, products, operating model and SOPs. \u003cbr/\u003e  ·         Work on the ground to enable network with new product launches and partner with the operations and other teams. \u003cbr/\u003e  ·         Reporting: Maintaining \u0026 publishing  routine reporting on the stores current performance \u0026 business with  Amazon. Publish recommendations and action plans based on data.  Reporting the overall Network Health in the assigned territory. \u003cbr/\u003e  ·         Team Management: Building and managing a  multi-layer team and manage performance through on-the job coaching and  mentoring. Driving team of associates for managing their targets. \u003cbr/\u003e  ·         Set proper expectations, provide clear status  communications, and manage relationships with the acquired/assigned  stores for a mutual growth. \u003cbr/\u003e  ·         Work with Stores/channel partners to improve operational  aspects of their business in providing a great delivery experience and  consistently enhance efficiency. \u003cbr/\u003e  ·         Enhance Engagement with accounts to improve business and increase retention. \u003cbr/\u003e  ·         Drive stores against goals (Volume, FTR and other key metrics). \u003cbr/\u003e  ·         Handling day to day operational escalations and be available to round the clock to manage the issues. \u003cbr/\u003e  ·         Internal/External Stake holder management. \u003cbr/\u003e  ·         Support station operations and/or customer deliveries. \u003cbr/\u003eEssential Skills\u003cbr/\u003e     - Strong leadership capabilities and people management      skills\u003cbr/\u003e   - Ability to work under pressure situations\u003cbr/\u003e   - Ability to work in ambiguous situations \u003cbr/\u003e   - Good communication skills. Ability to communicate and      explain to individuals \u0026 the team, what needs to be achieved for the      Delivery Center /Amazon to achieve its objectives. Listening skills: Gains      input and commitment from all involved in delivering their specific part.\u003cbr/\u003e   - Strong Bias for great customer service: Engage the Team      in developing their understanding of Customer Experience and knowledge of      what Customers actually needs/expects.\u003cbr/\u003e   - High Ownership: Follows through to ensure the delivery      of changes/solutions/services that fulfill the Customer’s needs.\u003cbr/\u003e   Analytical Skills: Effectively analyse and interpret information, identifying \u0026 validating the key facts, including reviewing alternatives to determine advantages and associated risks.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eGood in communication skill, People management , Stake holder management , Data analysis \u0026 Expert in Microsoft Excel.  \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eDaily report to be share to Stake holder \u0026 Daily Performance tracking to manage \u0026 drive growth of External Delivery Service Providers within Amazon and responsible for all aspects of last mile operations i.e sourcing, contracting, monitoring of performance, and planning of capacity.","department_cost_center":null,"description_short":"At Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Team leads for our transportation team.","display_distance":null,"id":"76d9cf90-5af6-455b-8295-d5c2bbe484d1","id_icims":"3143678","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Sales/Account Management","job_function_id":null,"job_path":"/en/jobs/3143678/channel-team-lead-atspl-gj","job_schedule_type":"full-time","location":"IN, GJ, Ahmedabad","locations":["{\"normalizedStateName\":\"Gujarat\",\"normalizedCountryCode\":\"IND\",\"city\":\"Ahmedabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, GJ, Ahmedabad\",\"coordinates\":\"23.02778,72.60032\",\"normalizedCountyName\":\"Ahmedabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Ahmedabad, Gujarat, IND\",\"location\":\"IN, GJ, Ahmedabad\",\"region\":\"GJ\",\"buildingCodeList\":[\"GNN86\"],\"normalizedCityName\":\"Ahmedabad\"}"],"normalized_location":"Ahmedabad, Gujarat, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"December 16, 2025","preferred_qualifications":"- Experience in written and verbal communication skills to communicate with technical and non-technical audiences, including senior leadership\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-last-mile-delivery","source_system":"JobCreator","state":"GJ","title":"Channel Team Lead, ATSPL - GJ","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3143678/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-delivery","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of software development, or 2+ years of technical support experience\u003cbr/\u003e- Experience scripting in modern program languages\u003cbr/\u003e- Experience troubleshooting and debugging technical systems","business_category":"international-stores","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"Amazon Cross border (Translational Services) is looking for a seasoned Application Support Engineer, who has strong hands-on experience in managing incidents, operational issues and driving operational excellence for large-scale services/systems. \u003cbr/\u003e\u003cbr/\u003eAmazon Global Store (Translational Services) enables cross-border customers to purchase products on Amazon Marketplaces with guaranteed shipping and import duty fees. We seek to provide a customized experience that allows customers anywhere in the world to buy products from all of Amazon marketplaces. Our mission is to provide a one-stop shopping experience to international customers that includes:\u003cbr/\u003e\u003cbr/\u003e1. Build solutions that reach customers all over the world, providing them with a world class shopping experience in their local language, payments, and currencies\u003cbr/\u003e\u003cbr/\u003e2. Work across all tiers leveraging Service-Oriented Architecture, mobile platforms, user experience, analytics and data mining\u003cbr/\u003e\u003cbr/\u003e3. Drive customer experience technology for supporting customers all over the world.\u003cbr/\u003e\u003cbr/\u003e4. Work closely with the business to figure out innovative solutions to help improve the customer experience.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThis job requires you to hit the ground running and your ability to learn quickly and work on disparate and overlapping tasks that will define your success. Some of the key job functions of the application support engineer are:\u003cbr/\u003e\u003cbr/\u003e1. Provide first level of support for handling tickets, operational issues from production services\u003cbr/\u003e\u003cbr/\u003e2. Provide engineering support of our incoming tickets, including extensive troubleshooting and debugging, with responsibilities covering multiple product lines.\u003cbr/\u003e\u003cbr/\u003e3. Work on maintenance driven coding projects, primarily in Perl or shell scripts, web technologies, and Java based projects.\u003cbr/\u003e\u003cbr/\u003e4. Read and understand complex application code and make code fixes to resolve support issues\u003cbr/\u003e\u003cbr/\u003e5. Software deployment support in staging and production environments.\u003cbr/\u003e\u003cbr/\u003e6. Develop tools and automate manual operational tasks and easy maintenance of our services.\u003cbr/\u003e\u003cbr/\u003e7. Build monitoring metrics dashboard, and report System health and Support status metrics.\u003cbr/\u003e\u003cbr/\u003e8. Work with remote development (Seattle) teams for handing-off or taking over active support issues and to create a team specific knowledge base and skill set.","department_cost_center":null,"description_short":"Amazon Cross border (Translational Services) is looking for a seasoned Application Support Engineer, who has strong hands-on experience in managing incidents, operational issues and driving operational","display_distance":null,"id":"2034f04c-dd44-47d2-92ca-93b72b97747b","id_icims":"3138704","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Support Engineering","job_function_id":null,"job_path":"/en/jobs/3138704/application-engineer-global-store","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR22\"],\"normalizedCityName\":\"Bengaluru\"}","{\"normalizedStateName\":\"Tamil Nadu\",\"normalizedCountryCode\":\"IND\",\"city\":\"Chennai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TN, Chennai\",\"coordinates\":\"13.08404,80.28274\",\"normalizedCountyName\":\"Chennai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Chennai, Tamil Nadu, IND\",\"location\":\"IN, TN, Chennai\",\"region\":\"TN\",\"buildingCodeList\":[\"MAA15\"],\"normalizedCityName\":\"Chennai\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"December  8, 2025","preferred_qualifications":"- Knowledge of web services, distributed systems, and web application development\u003cbr/\u003e- Experience troubleshooting \u0026 maintaining hardware \u0026 software RAID\u003cbr/\u003e- Experience with REST web services, XML, JSON\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"international-stores.team-international-sellers-group","source_system":"JobCreator","state":"KA","title":"Application Engineer, Global Store","university_job":null,"updated_time":"27 minutes","url_next_step":"https://account.amazon.com/jobs/3138704/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-international-sellers-group","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years previous experience in Environment, Health \u0026 Safety or ME in Industrial Safety Engineering · Bachelor’s degree in engineering or a related field required. · Experience in reputed private or government organizations · Experience managing multiple direct reports. · Must be flexible regarding shifts. · Experience implementing lean principles and process improvement in an operational environment. · Experience managing multiple direct reports","business_category":"fulfillment-and-operations","city":"Chennai","company_name":"ATSPL - Tamil Nadu - D14","country_code":"IND","description":"The Multi Site WHS officer will be responsible for partnering with a site operations team in a Delivery Station to execute company safety policies and ensure compliance to all applicable local and regional regulations. By leveraging lean principles and kaizens, this individual will lead continuous improvement initiatives to reduce conditional and ergonomic risk in our processes to ensure a safe and healthful working environment for our Associates. The Multi Site WHS officer must demonstrate the ability to build trust and confidence with the Operations Team and influence change through providing comprehensive risk assessments and safety data analysis. The Multi Site WHS officer must be an effective communicator and send clear, concise and consistent messages, both verbally and in writing. This individual must instruct and train Operations Leaders in company safety policies and assist the operations site teams in incorporating our safety standards at their site. The Multi Site WHS officer will be required to identify best practices and incorporate these best practices into our standards to continuously improve company safety policies. The Multi Site WHS officer will be required to possess excellent safety program and relevant safety, environmental and ergonomic knowledge and demonstrates this expertise when working with Operations. The Multi Site WHS officer will be responsible to lead a safety team members: Safety Specialist, Safety Coordinators, Onsite first aid Associates. This individual must create and execute leadership development plans for their Safety Associates on their team. They must communicate safety team expectations and give frequent and appropriate feedback to their safety teams and ensure they are executing to the core competencies of an Amazon safety professional.","department_cost_center":null,"description_short":"The Multi Site WHS officer will be responsible for partnering with a site operations team in a Delivery Station to execute company safety policies and ensure compliance to all applicable local and regional","display_distance":null,"id":"9855c61c-4ad7-45fb-a3ca-b9e2742ca38a","id_icims":"3134858","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Real Estate/facilities","job_function_id":null,"job_path":"/en/jobs/3134858/whs-officer-whs","job_schedule_type":"full-time","location":"IN, TN, Chennai","locations":["{\"normalizedStateName\":\"Tamil Nadu\",\"normalizedCountryCode\":\"IND\",\"city\":\"Chennai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TN, Chennai\",\"coordinates\":\"13.08404,80.28274\",\"normalizedCountyName\":\"Chennai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Chennai, Tamil Nadu, IND\",\"location\":\"IN, TN, Chennai\",\"region\":\"TN\",\"buildingCodeList\":[\"MAA44\"],\"normalizedCityName\":\"Chennai\"}"],"normalized_location":"Chennai, Tamil Nadu, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"December  2, 2025","preferred_qualifications":"- Supply chain, Construction or Manufacturing Safety experience with mix of exempt and non-exempt employees at a site of at least 200 people preferred. · Master’s degree preferred · Experience in a fast paced, changing/growing organization · Government Certified Safety Professional preferred · Excellent written and verbal communication skills, including comfort interfacing with site leaders. · Ability to develop and implement department goals and strategies. · Strong analytical skills with demonstrated problem solving ability. · Ability to adapt well to fast-paced environments with changing circumstances, direction, and strategy Our inclusive culture empowers Amazonians to deliver the best results for our customers\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"TN","title":"WHS Officer, WHS","university_job":null,"updated_time":"28 minutes","url_next_step":"https://account.amazon.com/jobs/3134858/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Electrical Engineering or a related field\u003cbr/\u003e- Experience with industry standard tools and scripting languages (Python or Perl) for automation\u003cbr/\u003e- 5+ years of FPGA design or FPGA-based ASIC prototyping\u003cbr/\u003e- Experience with FPGA build flows\u003cbr/\u003e- Experience with writing and debugging bring-up / test code for embedded systems (C/C++)\u003cbr/\u003e- Experience in prototype bring-up with strong hardware debug skills","business_category":"alexa-and-amazon-devices","city":"Bengaluru","company_name":"ADCI - BLR 14 SEZ","country_code":"IND","description":"The Amazon Devices team designs and engineers high-profile consumer electronics, including the best-selling Kindle family of products. We have also produced ground-breaking devices like Fire tablets, Fire TV, and Amazon Echo, and the Astro personal robot. What will you help us create? As an FPGA Engineer, you will be part of an advanced architecture team that is exploring new hardware designs to improve our devices. In this role, you will be responsible for defining the FPGA bring up environment for ASIC and system prototyping. You will participate in the design, verification and bring-up of IPs in FPGA by writing relevant scripts, debugging code, test benches, test harnesses, and otherwise interacting with the extended team. You will responsible for the lab bring-up of these blocks. You will work closely with multi-disciplinary groups including Product Design, Audio Technology, Computer Vision, Hardware Engineering, and Software Engineering, to architect and implement FPGA solutions that enable development of world-class hardware devices. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tDesign world class hardware and software\u003cbr/\u003e•\tCommunicate and work with team members across multiple disciplines\u003cbr/\u003e•\tDeliver IP's in FPGA platforms for software teams\u003cbr/\u003e•\tCreate and enhance verification of these IP's by leveraging the FPGA environment\u003cbr/\u003e•\tIdentify and write all types tests for stimulus and corner-cases\u003cbr/\u003e•\tDebug tests with design engineers to deliver functionally correct design blocks\u003cbr/\u003e","department_cost_center":null,"description_short":"The Amazon Devices team designs and engineers high-profile consumer electronics, including the best-selling Kindle family of products. We have also produced ground-breaking devices like Fire tablets, Fire","display_distance":null,"id":"433f223b-0cc3-48fc-a88b-8a7f8d7fc56a","id_icims":"3107795","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"ASIC","job_function_id":null,"job_path":"/en/jobs/3107795/sr-fpga-prototyping-engineer-silicon-and-systems-group","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR14\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"October 13, 2025","preferred_qualifications":"- Master's degree or Ph.D. degree in Electrical Engineering or related field\u003cbr/\u003e- Experience in system-level debugging\u003cbr/\u003e- Experience working with high-performance industry standard buses like AMBA AXI4\u003cbr/\u003e- Experience with post-silicon validation\u003cbr/\u003e- Experience with embedded systems\u003cbr/\u003e- Experience with transaction level modeling\u003cbr/\u003e- Knowledge of SoC architecture\u003cbr/\u003e- 7+ years or more of FPGA design or FPGA-based ASIC prototyping\u003cbr/\u003e- Experience with ARM and various DSP ISA\u003cbr/\u003e- Good programming skills in C/C++ and scripting skills in Python, Tcl, and/or Perl\u003cbr/\u003e- Experience with industry standard I/O interfaces\u003cbr/\u003e- Experience with ASIC prototyping on FPGAs\u003cbr/\u003e- Experience with Synopsys HAPS\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"alexa-and-amazon-devices.team-hardware-and-eero","source_system":"JobCreator","state":"KA","title":"Sr. FPGA Prototyping Engineer, Silicon and Systems Group","university_job":null,"updated_time":"31 minutes","url_next_step":"https://account.amazon.com/jobs/3107795/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-hardware-and-eero","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in Machine Learning/Data Labeling operations Strong analytical and problem-solving skills Excellent attention to detail CEFR C1+ or equivalent fluency in language that you will be processing Experience with quality management tools and systems Ability to work in strict compliance with internal guidelines Understanding of data annotation and quality metrics Proficiency in Excel and data analysis tools Ability to work effectively in a team environment Adaptability to changing priorities and workloads","business_category":"amazon-artificial-general-intelligence","city":"Amman","company_name":"Nuqtat Al Taknalojia - F65","country_code":"JOR","description":"We are seeking a detail-oriented Quality Auditor to join our team at AGI-DS. As a Quality Auditor, you will perform systematic quality assessments within our global network of Data Associates, providing manual review and validation of automated quality measurements. This role is critical in maintaining high standards in data quality for AI development and training.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eConduct quality audits on individual workflows and units delivered by Data Associates\u003cbr/\u003eProvide detailed insights on Data Associate-level quality and identify root causes of issues\u003cbr/\u003ePerform manual reviews to validate automated quality measurement systems\u003cbr/\u003eDocument and report quality findings accurately and efficiently\u003cbr/\u003ePerform audits to support deep dives and escalations as needed\u003cbr/\u003eCoach and calibrate Data Associates co-located at your site to improve performance\u003cbr/\u003eMaintain strict compliance with quality standards and procedures\u003cbr/\u003eWork closely with Quality Audit Managers to improve processes and implement best practices\u003cbr/\u003eContribute to continuous improvement initiatives within the quality assurance team\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou'll be auditing data from Data Associates, ensuring the data aligns with our Quality standards and providing detailed feedback to annotators if the data does not meet our standards. You'll collaborate with Quality Specialists to affirm audit strategies, provide insights, and discuss trends.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe are a specialized team of Quality Auditors whose strength lies in our attention to detail and documenting feedback for relevant stakeholders. We approach each audit with singular focus and apply our findings to a broad perspective, certifying if data quality is at our standards. Our collaborative methods ensure that insights are refined and lead to comprehensive and reliable audit results.","department_cost_center":null,"description_short":"We are seeking a detail-oriented Quality Auditor to join our team at AGI-DS. As a Quality Auditor, you will perform systematic quality assessments within our global network of Data Associates, providing","display_distance":null,"id":"56ec0185-2610-4569-a4e7-56deafe20d84","id_icims":"3160098","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Machine Learning Data Operatio","job_function_id":null,"job_path":"/en/jobs/3160098/quality-auditor-german-agi-data-services-ground-truth-quality-agi-data-services-alexa-ops","job_schedule_type":"full-time","location":"JO, Amman","locations":["{\"normalizedCountryCode\":\"JOR\",\"city\":\"Amman\",\"countryIso3a\":\"JOR\",\"countryIso2a\":\"JO\",\"locationNonStemming\":\"Jordan, Amman\",\"coordinates\":\"31.9518,35.94042\",\"normalizedCountyName\":\"Amman Governorate\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Jordan\",\"normalizedLocation\":\"Amman, JOR\",\"location\":\"JO, Amman\",\"region\":\"\",\"buildingCodeList\":[\"AMM1\",\"OUTJO\",\"AMM13\",\"AMM10\",\"AMM15\"],\"normalizedCityName\":\"Amman\"}"],"normalized_location":"Amman, JOR","optional_search_labels":[],"posted_date":"January 15, 2026","preferred_qualifications":"- Prior experience in a quality assurance role within the tech industry Familiarity with AI and machine learning concepts Experience with speech or language data Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":null,"title":"Quality Auditor - German, AGI Data Services - Ground Truth Quality, AGI Data Services-Alexa OPs ","university_job":null,"updated_time":"33 minutes","url_next_step":"https://account.amazon.com/jobs/3160098/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years previous experience in Environment, Health \u0026 Safety or ME in Industrial Safety Engineering · Bachelor’s degree in engineering or a related field required. · Experience in reputed private or government organisations · Must be flexible regarding shifts. · Experience implementing lean principles and process improvement in an operational environment. ·","business_category":"operations","city":"Ahmedabad","company_name":"ASSPL - Gujarat - D34","country_code":"IND","description":"The Site WHS officer will be responsible for partnering with a site operations team in a Sort Center to execute company safety policies and ensure compliance to all applicable local and regional regulations. By leveraging lean principles and kaizens, this individual will lead continuous improvement initiatives to reduce conditional and   ergonomic risk in our processes to ensure a safe and healthful working   environment for our Associates. The Site WHS officer must  demonstrate  the ability to build trust and confidence with the  Operations Team and  influence change through providing comprehensive  risk assessments and  safety data analysis. \u003cbr/\u003e \u003cbr/\u003e The Site WHS officer must be an  effective communicator and send clear, concise and  consistent messages,  both verbally and in writing. This individual must  instruct and train  Operations Leaders in company safety policies and  assist the operations  site teams in incorporating our safety standards  at their site. The Site WHS officer will be required to identify  best practices and  incorporate these best practices into our standards  to continuously  improve company safety policies. The Site WHS officer will be  required to possess excellent safety program and  relevant safety,  environmental and ergonomic knowledge and demonstrates  this expertise  when working with Operations. \u003cbr/\u003e \u003cbr/\u003e The Site WHS officer will be  responsible to lead a safety team members: Safety  Specialist, Safety  Coordinators, Onsite first aid Associates. This  individual must create  and execute leadership development plans for  their Safety Associates on  their team. They must communicate safety  team expectations and give  frequent and appropriate feedback to their  safety teams and ensure they  are executing to the core competencies of  an Amazon safety professional.","department_cost_center":null,"description_short":"The Site WHS officer will be responsible for partnering with a site operations team in a Sort Center to execute company safety policies and ensure compliance to all applicable local and regional regulations.","display_distance":null,"id":"2f4c7a11-9557-4c1f-b9e8-54cbe3744756","id_icims":"3138697","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Real Estate/facilities","job_function_id":null,"job_path":"/en/jobs/3138697/whs-officer","job_schedule_type":"full-time","location":"IN, GJ, Ahmedabad","locations":["{\"normalizedStateName\":\"Gujarat\",\"normalizedCountryCode\":\"IND\",\"city\":\"Ahmedabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, GJ, Ahmedabad\",\"coordinates\":\"23.02778,72.60032\",\"normalizedCountyName\":\"Ahmedabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Ahmedabad, Gujarat, IND\",\"location\":\"IN, GJ, Ahmedabad\",\"region\":\"GJ\",\"buildingCodeList\":[\"MAMA\"],\"normalizedCityName\":\"Ahmedabad\"}"],"normalized_location":"Ahmedabad, Gujarat, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"December  8, 2025","preferred_qualifications":"- Experience managing multiple direct reports\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"operations.team-whs","source_system":"JobCreator","state":"GJ","title":"WHS Officer","university_job":null,"updated_time":"39 minutes","url_next_step":"https://account.amazon.com/jobs/3138697/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-whs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Marketing, Advertising, or Business\u003cbr/\u003e- Experience in advertising solutions including sales, ad operations, and online marketing\u003cbr/\u003e- MBA or other related Master's degree, Strong communication skills (written and verbal), Confidence in the analysis of number-based reports and experience in MS Office (esp. Excel), An organized approach and a real team player who is willing to roll up sleeves.","business_category":"advertising","city":"Bengaluru","company_name":"ASSPL - Karnataka - B56","country_code":"IND","description":"Amazon Advertising operates at the intersection of advertising and ecommerce and offers advertisers a rich array of innovative advertising solutions across Amazon’s mobile and desktop websites, proprietary  devices and DSP solution. We believe that advertising, when done well, can enhance the customer experience and generate a positive return on investment for our advertising partners. We are looking for a highly motivated Ad Sales Specialist to join our talented team to help scale our growing Advertising program. Ad Sales Specialists partner with category team and other internal Amazon business stakeholders to drive advertiser success.\u003cbr/\u003e   \u003cbr/\u003eAs an Ad Sales Specialist you must be passionate about understanding the range of advertising products, business drivers for performance etc. and act as a consultant to advertisers and enable them for success.\u003cbr/\u003e   \u003cbr/\u003eYou will play a key role in the Ad Sales team for growing the business by being the subject matter expect \u0026 owner of advertising related initiatives for your category. \u003cbr/\u003e   \u003cbr/\u003eYou possess strong analytical ability, and will develop deep expertise in Amazon’s products and proprietary metrics to build winning campaigns  and optimizing performance to derive insights and meet our advertisers’  needs. You also thrive in ambiguous situations, with exemplary stakeholder management and communication skills, helping you work across global locations.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Build solid relationships with advertisers, advertising agencies, medium and small brands/ clients, displaying a dedication to delivering first-class service and online advertising solutions\u003cbr/\u003e- Liaise with Marketing, Product management, and Ad operations to help Brand launch on Amazon Advertising by formulating brand-centric projects/program for adoption\u003cbr/\u003e- Educate brands on Amazon Advertising offering. Also help analyze campaign performance against key metrics to identify, recommend, and implement optimizations to help Medium/small brands to increase efficiency, drive high renewal rate and meet clients’ KPIs\u003cbr/\u003e- Leverage our suite of rich data, targeting and product channels to collaborate with the other teams in the development of tailored solutions that meets advertisement goals\u003cbr/\u003e - Troubleshoot any technical or implementation issues, collaborating with internal teams\u003cbr/\u003e- Serve as a source of market intelligence for other areas of the advertising team (e.g., product development, product marketing, pricing) and assist in the development of best practices and operational efficiencies","department_cost_center":null,"description_short":"Amazon Advertising operates at the intersection of advertising and ecommerce and offers advertisers a rich array of innovative advertising solutions across Amazon’s mobile and desktop websites, proprietary","display_distance":null,"id":"71102e14-1a6d-4cd6-ac53-21add7363f72","id_icims":"3172561","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Ad Sales","job_function_id":null,"job_path":"/en/jobs/3172561/advertising-account-specialist-amazon-ads","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR37\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"February  3, 2026","preferred_qualifications":"- 1+ years of B2B sales, account manager experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"advertising.team-amazon-ads","source_system":"JobCreator","state":"KA","title":"Advertising Account Specialist, Amazon Ads","university_job":null,"updated_time":"40 minutes","url_next_step":"https://account.amazon.com/jobs/3172561/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-ads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of with Excel experience\u003cbr/\u003e- 5+ years of retail, operations, product or program management, or business management/consulting with negotiations and delivering results experience\u003cbr/\u003e- Experience with financial analysis and P\u0026L ownership\u003cbr/\u003e- Experience in vendor management","business_category":"amazon-business","city":"Riyadh","company_name":"Afaq Q Tech General Trading","country_code":"SAU","description":"Interested in working on an innovative and high-impact business that is changing the way customers think about grocery? The MENA Grocery team (Amazon now SA) is offering a role to own building new business from ground Zero. We are seeking a self-starter who can quickly familiarize themselves with this fast-paced environment, build relationships/trust with cross-functional teams, and assume ownership within the program which will require understanding of complex business/Tech/Ops processes at Amazon and our partners and devising an optimal engagement model. You must be able to thrive and succeed in an entrepreneurial environment, and not be hindered by ambiguity or competing priorities. High judgment, analytical talent and good document writing skills with concise communication are essential to success in this role.\u003cbr/\u003e\u003cbr/\u003eIn this role, You will influence internal and external stakeholders and leadership to buy in to your strategic direction, build a buying and sourcing strategy for a new category while ensuring flawless execution and continuously analyzing key metrics to drive improvements for your business.\u003cbr/\u003e\u003cbr/\u003eThe VM will be responsible for building relationships with vendors, adding selection, managing category profitability, optimizing pricing, and developing their team. The best candidate will have a broad skill set including leadership development, analytical horsepower, excellent business judgment, strong vendor management and negotiations skills, deep curiosity about how things work, and a passion for creating a world class shopping experience for our customers. The position requires a leader who can work autonomously in a fast paced, highly demanding and ambiguous environment. \u003cbr/\u003e\u003cbr/\u003eThe successful candidate would possess great business judgment, with a track record of strong project delivery, commercial negotiations and relationship management along with deep analytical acumen. Additionally, this position involves working with multiple stakeholders (marketing, marketplace, legal, supply chain, operations among others). \u003cbr/\u003e\u003cbr/\u003eThe position requires a leader who can work autonomously in a fast paced, highly demanding and ambiguous environment. The successful candidate would possess great business judgment, with a track record of strong project delivery, commercial negotiations and relationship management along with deep analytical acumen. Additionally, this position involves working with multiple stakeholders (marketing, marketplace, legal, supply chain, operations among others).\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThis is an external facing role with close collaboration with external vendors to build seasonal selection and long shelf-life Fresh/Frozen space. The role has potential to build Amazon now SA Retail business from scratch, define SOP for scaling the business on long term. \u003cbr/\u003e- Support Category leader to drive new strategic initiatives and business opportunities\u003cbr/\u003e- Negotiations- Build strategic partnership, align and close an end to end vendor relationship and terms of trade, operating model contracts from vendors\u003cbr/\u003e- Build the annual seasonal portfolio to drive continuous traffic and engagement to the store-front  \u003cbr/\u003e- Identify automation opportunities to offer scalable solutions, improve all key inputs metrics such as Selection, profitability, Pricing, Availability\u003cbr/\u003e- Post launches, Own the P\u0026L for hitting top and bottom-line targets and drive projects to improve profitability with critical stakeholders (Vendor, Ops, Advertising)\u003cbr/\u003e- Define selection assortment, continuously refine the mix at dark store level to reduce shrinkage \u0026 improve CX\u003cbr/\u003e- Source deals during Tier 1/2 events to ensure we continue to offer value to our Prime Customers\u003cbr/\u003e- Negotiate marketing funds from vendors for category visibility during BAU/Events. \u003cbr/\u003e- Prepare, Pitch \u0026 close Annual JBP. ","department_cost_center":null,"description_short":"Interested in working on an innovative and high-impact business that is changing the way customers think about grocery? The MENA Grocery team (Amazon now SA) is offering a role to own building new business","display_distance":null,"id":"9e19a93f-3064-4394-8607-ea2e618d8520","id_icims":"3162025","is_intern":null,"is_manager":null,"job_category":"Buying, Planning, \u0026 Instock Management","job_family":"Buying/Planning","job_function_id":null,"job_path":"/en/jobs/3162025/vendor-manager-amazon-now-sa","job_schedule_type":"full-time","location":"SA, Riyadh","locations":["{\"normalizedCountryCode\":\"SAU\",\"city\":\"Riyadh\",\"countryIso3a\":\"SAU\",\"countryIso2a\":\"SA\",\"locationNonStemming\":\"Saudi Arabia, Riyadh\",\"coordinates\":\"24.68208,46.68723\",\"normalizedCountyName\":\"Riyadh\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Saudi Arabia\",\"normalizedLocation\":\"Riyadh, SAU\",\"location\":\"SA, Riyadh\",\"region\":\"\",\"buildingCodeList\":[\"RUH14\"],\"normalizedCityName\":\"Riyadh\"}"],"normalized_location":"Riyadh, SAU","optional_search_labels":["ops.lander-saudization"],"posted_date":"January 20, 2026","preferred_qualifications":"- Experience managing large data sets and utilizing to drive performance and process improvements\u003cbr/\u003e- Experience driving direction and alignment with cross-functional teams\u003cbr/\u003e- Knowledge and experience in Saudi retail and Quick Commerce market\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-business.team-consumer-3p-job-posting","source_system":"JobCreator","state":null,"title":"Vendor Manager, Amazon Now SA","university_job":null,"updated_time":"42 minutes","url_next_step":"https://account.amazon.com/jobs/3162025/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-consumer-3p-job-posting","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}