{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Bachelor's degree, or experience in an industry role\u003cbr/\u003e- 2+ years of data center engineering or operations experience\u003cbr/\u003e- 2+ years of team management experience\u003cbr/\u003e- 2+ years of networking (such as DNS, DHCP, SSL, OSI Model, and TCP/IP) experience","business_category":"aws","city":"Herndon","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Amazon Web Services (AWS) is a fast paced technology company and a leader in the world of data centers. We are currently expanding our infrastructure management team within Amazon Web Services and are looking for a proven technology manager with experience in people management, robust technical understanding and the drive and vision to take AWS Data Center Operations to the next level. The successful candidate for this role will create sustainable processes and standards; and drive automation opportunities to reduce delivery cycle times and to improve quality without impacting network availability.\u003cbr/\u003e\u003cbr/\u003eThe mission of the team is to deliver network capacity on time with zero rework. The Infrastructure Delivery Manager will manage the implementation and delivery of inbound capacity and equipment. This manager will be responsible for a growing a team and will oversee their development and growth. The successful candidate will have experience managing and mentoring people, tracking budgets, providing strategic direction and proposing technical solutions. This manager will ultimately be responsible for installing and delivering our network equipment and related infrastructures, as well as responsible for driving low voltage structured cabling across the Amazon data center platform.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003ePrioritize and assign tasks to data center technicians and operators, project management, coaching and creating documentation.\u003cbr/\u003e\u003cbr/\u003eManage inbound capacity from receiving through deployment stages\u003cbr/\u003e\u003cbr/\u003eManage the installation network and cabling infrastructure in a data center environment\u003cbr/\u003e\u003cbr/\u003eGuide, train and educate staff on the best practices related to all service owner issues\u003cbr/\u003e\u003cbr/\u003eManage tasks and deliverables across small to large-size projects\u003cbr/\u003e\u003cbr/\u003eRecommend, document, and oversee policies and procedures to meet industry best practices and to meet required SLAs\u003cbr/\u003e\u003cbr/\u003eProvide weekly report to the data center manager\u003cbr/\u003e\u003cbr/\u003eCoordinate team resources to support project and delivery needs, to include emergency projects, change management and maintenance window support, and potential off-hours and on-call needs.\u003cbr/\u003e\u003cbr/\u003eRecruit and train data technicians to ensure appropriate staffing levels\u003cbr/\u003e\u003cbr/\u003eHost weekly staff meetings\u003cbr/\u003e\u003cbr/\u003eDrive compliance to Amazon performance management requirements\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role requires managers to conduct daily in person safety inspections, meetings, and operational tasks across Northern Virginia data center locations. Attendance in person at weekly regional manager staff meetings at AWS corporate locations (Herndon, VA) may be required.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.","department_cost_center":null,"description_short":"Amazon Web Services (AWS) is a fast paced technology company and a leader in the world of data centers. We are currently expanding our infrastructure management team within Amazon Web Services and are","display_distance":null,"id":"80a08ad6-70f6-46c8-999a-9ed36c5eea7a","id_icims":"3123248","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3123248/infrastructure-delivery-manager-infrastructure-delivery","job_schedule_type":"full-time","location":"US, VA, Herndon","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD31\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Herndon, Virginia, USA","optional_search_labels":[],"posted_date":"November  7, 2025","preferred_qualifications":"- 6+ years in a data center technology role\u003cbr/\u003e- Experience with building physical data center such as copper/fiber cabling\u003cbr/\u003e- Experience developing operational metrics to drive efficiencies\u003cbr/\u003e- Experience representing your team/technical area to senior management\u003cbr/\u003e- Experience in contributing to the definition and implementation of automation opportunities within an deployment/build environment\u003cbr/\u003e- Experience with lean methodologies and Six-Sigma or similar qualification\u003cbr/\u003e- Organizational and planning skills\u003cbr/\u003e- Broad understanding of infrastructure technologies installation and design\u003cbr/\u003e- Knowledge of network cabling, optic types, and test equipment\u003cbr/\u003e- Meets/exceeds Amazon’s leadership principles requirements for this role\u003cbr/\u003e- Meets/exceeds Amazon’s functional/technical depth and complexity for this role\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $70,700/year in our lowest geographic market up to $158,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"VA","title":"Infrastructure Delivery Manager, Infrastructure Delivery","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3123248/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of engineering team management experience\u003cbr/\u003e- 7+ years of working directly within engineering teams experience\u003cbr/\u003e- 3+ years of designing or architecting (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 8+ years of leading the definition and development of multi tier web services experience\u003cbr/\u003e- Knowledge of engineering practices and patterns for the full software/hardware/networks development life cycle, including coding standards, code reviews, source control management, build processes, testing, certification, and livesite operations\u003cbr/\u003e- Experience partnering with product or program management teams","business_category":"aws","city":"Seattle","company_name":"Amazon Development Center U.S., Inc.","country_code":"USA","description":"Amazon ElastiCache is a massive at-scale In-memory data store powering some of the top companies around the world. At Amazon ElastiCache, we build some of the largest distributed systems in the world, and we're deeply committed to advancing open source innovation through our work with Valkey, a high-performance open source In-memory data store.\u003cbr/\u003e\u003cbr/\u003eWe are looking for a leader who is passionate about open source software, solving challenges in distributed systems, and building highly talented teams. In this role, you will lead a team chartered to advance Valkey open source development. You will be responsible for delivering foundational software to grow both the open source community and our business over the next decade.\u003cbr/\u003e\u003cbr/\u003eYou are expected to draw from deep and broad technical expertise to mentor engineers, complete hands-on technical work, and provide leadership on complex technical issues. You will manage a team of engineers and be responsible for delivering some of our most strategic technical projects, designing new software systems at the forefront of distributed database technology, and having a significant impact on both the Valkey OSS community and ElastiCache.\u003cbr/\u003e\u003cbr/\u003eAs a manager of software development in Amazon Elasticache, you will be part of the larger technical leadership community that you will work closely with the Valkey OSS community, maintainers, and Technical Steering Committee (TSC), serving as a key interface between Valkey open source and Amazon ElastiCache. This role involves influencing the long-term technical strategy for both the open source project and our service offerings, collaborating with community leaders on roadmap priorities, helping us hire a talented team of engineers passionate about open source, and ultimately enabling us to deliver innovative solutions that benefit both the Valkey community and AWS customers.\u003cbr/\u003e\u003cbr/\u003ePosition Responsibilities:\u003cbr/\u003e\u003cbr/\u003eBuild and Lead an Open Source-Focused Team: \u003cbr/\u003eHire, mentor, and lead a database software development team committed to open source principles and community collaboration.\u003cbr/\u003e\u003cbr/\u003eDrive Open Source Innovation: \u003cbr/\u003eLead design, implementation, and deployment of successful highly distributed, large-scale services that contribute to both Valkey OSS and Amazon ElastiCache.\u003cbr/\u003e\u003cbr/\u003eBridge Community and AWS: \u003cbr/\u003eServe as the primary interface between the Valkey open source community (including maintainers and TSC) and Amazon ElastiCache, ensuring alignment on technical direction and fostering strong relationships.\u003cbr/\u003e\u003cbr/\u003eLead Complex, High-Impact Projects: \u003cbr/\u003eIdentify and lead work on complex, large-scale systems that have major impact on both the open source project and the company.\u003cbr/\u003e\u003cbr/\u003eCollaborate Across Teams and Communities: \u003cbr/\u003eServe as a lead on demanding, multi-team, cross-functional projects that span internal teams and external open source contributors.\u003cbr/\u003e\u003cbr/\u003eGrow Talent: \u003cbr/\u003eActively participate in hiring and growing talented engineers passionate about open source, assist in career development of others both on and outside your team.\u003cbr/\u003e\u003cbr/\u003eShape Technical Strategy: \u003cbr/\u003ePlay a critical role in business planning and open source roadmap development, working with Valkey community leaders and internal stakeholders to develop technical goals, business targets, and resource requirements.\u003cbr/\u003e\u003cbr/\u003eContribute to Open Source Governance: \u003cbr/\u003eParticipate in Valkey TSC discussions, contribute to project governance, and help shape the future direction of the open source project.\u003cbr/\u003e\u003cbr/\u003eDemonstrate Technical Excellence: \u003cbr/\u003eShow high levels of creativity and sound judgment in balancing open source community needs with business objectives.\u003cbr/\u003e\u003cbr/\u003eStay Current: \u003cbr/\u003eMaintain deep understanding of open source trends, distributed systems technology, and in-memory database innovations.\u003cbr/\u003e\u003cbr/\u003eAdvance Innovation: \u003cbr/\u003eContribute to both Amazon's Intellectual Property and the Valkey open source project through patents, code contributions, and external publications.\u003cbr/\u003e\u003cbr/\u003eWhat Makes This Role Unique:\u003cbr/\u003eThis position offers the rare opportunity to work at the intersection of planet-scale cloud services and  open source community development. You'll help shape the future of Valkey while delivering world-class managed services to AWS customers, making meaningful contributions to both the open source ecosystem and Amazon's business success.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS \u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon  conferences, inspire us to never stop embracing our uniqueness. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon ElastiCache is a massive at-scale In-memory data store powering some of the top companies around the world. At Amazon ElastiCache, we build some of the largest distributed systems in the world,","display_distance":null,"id":"fa10be2c-05a2-4ee0-a207-1c5edf409dd8","id_icims":"3153439","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3153439/software-development-manager-amazon-elasticache","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA43\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["aws.team-database"],"posted_date":"January  6, 2026","preferred_qualifications":"- Experience in communicating with users, open source community members, other technical teams, and senior leadership to collect requirements, describe software product features, technical designs, and product strategy\u003cbr/\u003e- Experience in recruiting, hiring, mentoring/coaching and managing teams of Software Engineers to improve their skills, and make them more effective, product software engineers, with a track record of building teams that contribute to open source projects\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $166,400/year in our lowest geographic market up to $287,700/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-aws-sdm","source_system":"JobCreator","state":"WA","title":"Software Development Manager, Amazon ElastiCache","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3153439/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-aws-sdm","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- Experience in creating process improvements with automation and analysis, or experience delivering results for large, cross-functional initiatives/projects\u003cbr/\u003e- Experience with SQL and advanced Excel\u003cbr/\u003e- 4+ years experience in Data Analytics, Finance, Retail Operations or Supply Chain Management","business_category":"retail","city":"Sydney","company_name":"Amazon Commercial Services Pty Ltd","country_code":"AUS","description":"We are looking for a high-ownership Program Manager to lead availability, forecasting, and inventory decisions for a retail category in Amazon Australia. This role sits at the center of customer experience, revenue, and working capital efficiency. You will operate at scale—managing hundreds of thousands of products using our proprietary automated systems while also building offline solutions when needed.\u003cbr/\u003e\u003cbr/\u003eThe successful candidate will independently own business outcomes, make data-driven decisions, and influence senior stakeholders across Retail, Supply Chain, Finance, and Tech teams in a fast-paced, ambiguous environment.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Own end-to-end performance for your category, including forecasting accuracy, buying, and inventory health. Your primary deliverable is measured through product availability, while actively managing overstocks and working capital efficiency.\u003cbr/\u003e- Make weekly and monthly business decisions that balance customer experience, cost, and operational constraints. Extract and analyze data independently to identify root causes of instock gaps, then lead process improvements or automation initiatives.\u003cbr/\u003e- Partner globally with technical teams developing our buying systems, while demystifying these systems for commercial teams. Acquire deep technical expertise to guide Retail partners through inventory outcomes and system navigation.\u003cbr/\u003e- Connect directly with vendors to resolve execution issues and drive supply improvements. Represent the team across departments including leadership, using clear written narratives and data-backed recommendations.\u003cbr/\u003e- Challenge the status quo to improve existing workflows and enhance the customer experience. Share best practices and collaborate on projects with peers in other countries.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour day is filled with a variety of tasks and responsibilities centered around improving product availability and enhancing the customer experience. A key part of your role is collaborating cross-functionally with stakeholders across the business. You meet with vendor management, operations, product management and other retail teams to discuss implementing new automation to streamline our forecasting and buying processes.\u003cbr/\u003e\u003cbr/\u003eData analysis is also a critical component of your day. You closely monitor customer experience metrics, then work closely with the relevant stakeholders to develop action plans for driving improvements. You also help build reporting to equip the Australia leadership with timely, data-driven insights.\u003cbr/\u003e\u003cbr/\u003eThroughout the day, you balance urgent operational needs with longer-term strategic projects. This could involve joining global calls to contribute your local market expertise as the team develops the roadmap for supply chain automation initiatives. You also spend time responding to stakeholder inquiries and summarizing key activities to share with country leadership.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe are a collaborative team focused on building strong relationships with vendors and internal partners to ensure seamless product availability. Our mission is to create efficient supply chain solutions that benefit both our vendors and customers. We value innovative thinking and embrace diverse perspectives to continuously improve our processes.\u003cbr/\u003e\u003cbr/\u003eCurious about life at Amazon Stores Australia? Visit \u003ca href=\" https://amazon.jobs/content/en/teams/international-stores/australia/consumer\"\u003ethis link\u003c/a\u003e to explore our culture, leadership principles, and commitment to sustainability. Join one of LinkedIn's top-ranked companies in Australia and help shape the future of ecommerce alongside some of the brightest minds in the industry.","department_cost_center":null,"description_short":"We are looking for a high-ownership Program Manager to lead availability, forecasting, and inventory decisions for a retail category in Amazon Australia. This role sits at the center of customer experience,","display_distance":null,"id":"7e5cfc13-9613-4c88-b2aa-dc2731a4a60b","id_icims":"3176635","is_intern":null,"is_manager":null,"job_category":"Buying, Planning, \u0026 Instock Management","job_family":"Buying/Planning","job_function_id":null,"job_path":"/en/jobs/3176635/program-manager-availability-and-inventory-strategy-au-retail","job_schedule_type":"full-time","location":"AU, NSW, Sydney","locations":["{\"normalizedStateName\":\"New South Wales\",\"normalizedCountryCode\":\"AUS\",\"city\":\"Sydney\",\"countryIso3a\":\"AUS\",\"countryIso2a\":\"AU\",\"locationNonStemming\":\"Australia, NSW, Sydney\",\"coordinates\":\"-33.87073,151.20788\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Australia\",\"normalizedLocation\":\"Sydney, New South Wales, AUS\",\"location\":\"AU, NSW, Sydney\",\"region\":\"NSW\",\"buildingCodeList\":[\"SYD15\"],\"normalizedCityName\":\"Sydney\"}"],"normalized_location":"Sydney, New South Wales, AUS","optional_search_labels":["stores.lander-australia","international-stores.australia-consumer"],"posted_date":"February  9, 2026","preferred_qualifications":"- 5+ years of doing one of several roles: quantitative/financial analysis, retail buying, retail planning \u0026 allocation, product/project management, pricing, marketing or e-commerce experience\u003cbr/\u003e- Experience using Python or R for data analysis or statistical tools such as SAS\u003cbr/\u003e\u003cbr/\u003eAcknowledgement of country:\u003cbr/\u003eIn the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.\u003cbr/\u003e\u003cbr/\u003eIDE statement:\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"retail.no-team-listed","source_system":"JobCreator","state":"NSW","title":"Program Manager- Availability and Inventory Strategy, AU Retail","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3176635/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or above in computer science, engineering, analytics, mathematics, statistics, IT or equivalent\u003cbr/\u003e- 7+ years of industry experience with at least 5+ years in Technical product management and 3+ years of software development\u003cbr/\u003e- Experience with technical product management for developer-facing products\u003cbr/\u003e- Experience with resource management and orchestration systems (such as SLURM and Kubernetes schedulers), including monitoring, observability, and resilience\u003cbr/\u003e- Excellent written and verbal communication abilities","business_category":"aws","city":"Cupertino","company_name":"Annapurna Labs (U.S.) Inc.","country_code":"USA","description":"AWS Trainium is deployed at scale, with millions of chips in production, and has been used for training and inference of frontier models. AWS Neuron is the software stack for Trainium, enabling customers to run deep learning and generative AI workloads with optimal performance and cost efficiency.\u003cbr/\u003e\u003cbr/\u003eAWS Neuron is hiring a Technical Product Manager to work backward from Trainium customers and drive the developer experience for running high-performance ML workloads at scale on AWS Trainium, from getting started with Neuron Deep Learning Containers, AMIs, and AWS services to operating at scale through orchestration, resiliency, and observability.\u003cbr/\u003e\u003cbr/\u003eYou will drive the product strategy for how developers interact with Trainium through container ecosystems, resource management platforms, and AWS services. This includes Neuron integration with orchestration tools (SLURM, Kubernetes), AWS services (EKS, SageMaker), Neuron Deep Learning Containers and AMIs, and Linux distribution support. You will also drive the strategy for resiliency and observability tools that enable system diagnostics, performance monitoring, health monitoring, automated recovery, and telemetry, allowing customers to operate AI training and inference workloads with maximum uptime and efficiency, as well as how Neuron Runtime System interacts with ML frameworks to ensure scale and high performance execution of models.\u003cbr/\u003e\u003cbr/\u003eTo be successful in this role, you will partner with engineering teams and PMs responsible for training, inference, and performance tools, Marketing, Business Development, and Solution Architects supporting customers, and develop deep knowledge and understanding of Trainium Architecture and Neuron Runtime System (including Neuron Runtime Library, Neuron Kernel Driver and Collective Communication Stack) to effectively define product strategy and make informed technical decisions.\u003cbr/\u003e\u003cbr/\u003eThe Ideal Candidate\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate can balance competing customer priorities and drive alignment across engineering and business stakeholders in a fast-moving, early-stage product environment, with excellent written and verbal communication abilities.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate has experience with:\u003cbr/\u003e\u003cbr/\u003e* Technical product management for developer-facing runtime and infrastructure products\u003cbr/\u003e* Developer tools (SDKs, libraries, APIs) with focus on developer experience\u003cbr/\u003e* Resource management and orchestration systems (SLURM, Kubernetes schedulers)\u003cbr/\u003e* ML monitoring, observability, and resilience\u003cbr/\u003e* Distributed systems and high-performance computing (HPC) environments\u003cbr/\u003e* AWS cloud services and infrastructure\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout AWS Neuron\u003cbr/\u003e\u003cbr/\u003eAWS Neuron is the software stack for running deep learning and generative AI workloads on AWS Trainium and AWS Inferentia. It includes a compiler, runtime, training and inference libraries, and developer tools for monitoring, profiling, and debugging. Built on an open source foundation, Neuron supports native PyTorch and JAX frameworks and popular ML libraries without code modification. Neuron enables rapid experimentation, distributed training across multiple chips and nodes, and cost-optimized inference powered by optimized kernels. For performance optimization, Neuron provides the Neuron Kernel Interface (NKI) for direct hardware access and a suite of profiling and debugging tools.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eProduct Strategy \u0026 Vision: Own product strategy and roadmap. Guide trade-offs between performance, scalability, and developer experience. Write PRFAQs and PRDs.\u003cbr/\u003e\u003cbr/\u003eCustomer Discovery: Understand deployment challenges, orchestration needs, and infrastructure pain points. Represent customer needs in executive prioritization.\u003cbr/\u003e\u003cbr/\u003eTechnical Leadership: Drive alignment across Neuron components (Runtime, Kernel Driver, Collective Communication, container infrastructure) and AWS services. Partner with training, inference, and performance PMs. Write user stories and define success metrics.\u003cbr/\u003e\u003cbr/\u003eImpact: Enable customers (Anthropic, Databricks, AWS teams) to deploy, monitor, and operate ML workloads at scale through container orchestration, resource management, health monitoring, and observability.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we're building an environment that celebrates knowledge-sharing and mentorship. Our senior members enjoy one-on-one mentoring and thorough, but kind, code reviews. We care about your career growth and strive to assign projects that help our team members develop your engineering expertise so you feel empowered to take on more complex tasks in the future.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003e\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn't followed a traditional path, or includes alternative experiences, don't let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003e\u003cbr/\u003eHere at AWS, it's in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there's nothing we can't achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003e\u003cbr/\u003eWe're continuously raising our performance bar as we strive to become Earth's Best Employer. That's why you'll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eAbout Amazon Annapurna Labs\u003cbr/\u003e\u003cbr/\u003eAmazon Annapurna Labs team (our organization within AWS UC) is responsible for building innovation in silicon and software for our AWS customers. We are at the forefront of innovation by combining cloud scale with the world's most talented engineers. Our team covers multiple disciplines including silicon engineering, hardware design, software and operations. Because of our teams breadth of talent, we have been able to improve AWS cloud infrastructure in high-performance machine learning with AWS Neuron, Inferentia and Trainium ML chips, in networking and security with products such as AWS Nitro, Enhanced Network Adapter (ENA), and Elastic Fabric Adapter (EFA), and in computing with AWS Graviton and F1 EC2 instances.\u003cbr/\u003e\u003cbr/\u003eAbout AWS Utility Computing (UC)\u003cbr/\u003e\u003cbr/\u003eAWS Utility Computing (UC) provides product innovations that continue to set AWS's services and features apart in the industry. As a member of the UC organization, you'll support the development and management of Compute, Database, Storage, Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for their cloud services. Additionally, this role may involve exposure to and experience with Amazon's growing suite of generative AI services and other cloud computing offerings across the AWS portfolio.\u003cbr/\u003e\u003cbr/\u003eAbout AWS\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the world's most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that's why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Trainium is deployed at scale, with millions of chips in production, and has been used for training and inference of frontier models. AWS Neuron is the software stack for Trainium, enabling customers","display_distance":null,"id":"f97fb74e-c4b1-46a4-8b54-03162fa16ec6","id_icims":"3161106","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Product Management - Technical","job_function_id":null,"job_path":"/en/jobs/3161106/sr-tech-product-manager-neuron-runtime-and-cloud-ml-infrastructure-annapurna-labs","job_schedule_type":"full-time","location":"US, CA, Cupertino","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA42\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Cupertino\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Cupertino\",\"coordinates\":\"37.31913,-122.02929\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Cupertino, California, USA\",\"location\":\"US, CA, Cupertino\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC29\"],\"normalizedCityName\":\"Cupertino\"}"],"normalized_location":"Cupertino, California, USA","optional_search_labels":["aws.team-annapurna-labs"],"posted_date":"January 16, 2026","preferred_qualifications":"- Distributed computing and parallel processing, Collective communication libraries (NCCL, MPI) and communication patterns (all-reduce, all-gather, reduce-scatter)\u003cbr/\u003e- Experience with Linux systems, kernel development, and device drivers\u003cbr/\u003e- Deep learning model training and inference deployments at scale; Container orchestration (Kubernetes), computer architecture fundamentals\u003cbr/\u003e- Developer tools (SDKs, libraries, APIs) with focus on developer experience\u003cbr/\u003e- Track record of driving developer libraries, open standards, and ecosystem integration\u003cbr/\u003e- High-performance networking technologies (RDMA, EFA)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Cupertino - 173,900.00 - 235,200.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 151,200.00 - 204,600.00 USD annually","primary_search_label":"aws.team-aws-cloud-management","source_system":"JobCreator","state":"CA","title":"Sr. Tech Product Manager - Neuron Runtime and Cloud ML Infrastructure, Annapurna Labs","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/3161106/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-aws-cloud-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"alexa-and-amazon-devices","city":"Pune","company_name":"ADCI - Maharashtra","country_code":"IND","description":"Join the team that brought you the Echo Show, a touch-screen enabled Alexa device that supports video calling, music, weather, and more! Our Echo Software team works on not only the Echo Show but other high-profile consumer electronics products including Fire TV, Kindle, and the Echo family of devices. We’d love to have you join us to bring innovative experiences to millions of customers. As a software engineer in the Alexa Devices team, you will help drive innovation by developing features that present innovative speech-backed visuals on our Echo Show and similar screened Alexa devices.\u003cbr/\u003eSpecifically, you will be responsible for maintaining \u0026 developing new systems, partnering with other Amazon and third-party services and device teams as required. You will ensure that Alexa almost never drops her end of the conversation, delivering services that respond with minimal latency at Amazon scale. You may work on device frameworks, APIs and more. If being at the forefront of new innovation for Alexa sounds exciting, we'd love to talk to you!\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eJoin the team that brought you the Echo Show, a touch-screen enabled Alexa device that supports video calling, music, weather, and more! Our Echo Software team works on not only the Echo Show but other high-profile consumer electronics products including Fire TV, Kindle, and the Echo family of devices. We’re just getting started, and we’d love to have you join us to bring innovative experiences to millions of customers.\u003cbr/\u003e\u003cbr/\u003eYou don’t need any experience in those specific technologies, just an enthusiasm to build state of the art software particularly around user interfaces, cross-device APIs, or cloud-based services. If this sounds appealing to you, please contact us and we’d love to chat!\u003cbr/\u003e\u003cbr/\u003eIf you join us, your opportunities will include:\u003cbr/\u003e• Invent a novel delightful Android-based experience for our customers.\u003cbr/\u003e• Collaborate with UX and Product owners to define customer experience and product direction.\u003cbr/\u003e• Deliver high quality software through working in a dynamic, team-focused Agile/Scrum environment.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou will be responsible for developing and maintaining new systems, partnering with other Amazon and third-party services and device teams as required. You will ensure that Alexa almost never drops her end of the conversation, delivering services that respond with minimal latency at Amazon scale. You will work on device frameworks, APIs and more.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe are the team that brought you the Echo Show, a touch-screen enabled Alexa device that supports video calling, music, weather, and more! Our Echo Software team works on not only the Echo Show but other high-profile consumer electronics products including Fire TV, Kindle, and the Echo family of devices. We’re just getting started, and we’d love to have you join us to bring innovative experiences to millions of customers","department_cost_center":null,"description_short":"Join the team that brought you the Echo Show, a touch-screen enabled Alexa device that supports video calling, music, weather, and more! Our Echo Software team works on not only the Echo Show but other","display_distance":null,"id":"cca0b38c-b6c7-406b-bbfd-aeb06de98c9f","id_icims":"3157233","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3157233/software-development-engineer-ii-alexa-endpoint-experiences","job_schedule_type":"full-time","location":"IN, MH, Pune","locations":["{\"normalizedStateName\":\"Maharashtra\",\"normalizedCountryCode\":\"IND\",\"city\":\"Pune\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, MH, Pune\",\"coordinates\":\"18.50419,73.85286\",\"normalizedCountyName\":\"Pune\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Pune, Maharashtra, IND\",\"location\":\"IN, MH, Pune\",\"region\":\"MH\",\"buildingCodeList\":[\"PNQ18\"],\"normalizedCityName\":\"Pune\"}"],"normalized_location":"Pune, Maharashtra, IND","optional_search_labels":["alexa-and-amazon-devices.team-software-development-job-family"],"posted_date":"January 12, 2026","preferred_qualifications":"- 4+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"alexa-and-amazon-devices.devices-and-services-teams","source_system":"JobCreator","state":"MH","title":"Software Development Engineer II, Alexa Endpoint Experiences","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3157233/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"devices-and-services-teams","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language\u003cbr/\u003e- Bachelor's degree or equivalent","business_category":"subsidiaries","city":"Madison","company_name":"Zappos.com LLC","country_code":"USA","description":"The FaST (Fashion Subsidiary Tech) CS-Tech team owns Customer Service support for subsidiaries Shopbop and Zappos. As an Amazon subsidiary, we leverage best-in-class technology from the inside; analyze and iterate existing and new opportunities, and scale them to continually improve the customer experience for their entire journey at Shopbop.com and Zappos.com. \u003cbr/\u003e\u003cbr/\u003eOn the CS-Tech team, you’ll get to build critical services that impact every Shopbop  and Zappos customer, work directly with stakeholders, and take responsibility for scoping projects, completing design, and building systems for launch. You will directly support our internal stakeholders in Fashion \u0026 Fitness Customer Service to ensure we build the right tooling. Come to work with us and help define the next generation customer experiences for the fashion-obsessed! \u003cbr/\u003e \u003cbr/\u003e\u003cbr/\u003eWork/Life Harmony \u003cbr/\u003eOur team puts a high value on work-life harmony. Our team is located on-site in Madison, WI. We generally keep core in-office hours from 9am to 5pm, M-F. \u003cbr/\u003e \u003cbr/\u003eMentorship \u0026 Career Growth \u003cbr/\u003eWe’re building an environment that celebrates knowledge sharing and mentorship. Our team truly enjoys mentoring more junior engineers and engineers from non-traditional backgrounds through one-on-one mentoring and thorough, but kind, code reviews. \u003cbr/\u003e \u003cbr/\u003eWe care about your career growth. We try to assign projects and tasks based on what will help each team member develop into a better-rounded engineer and enable them to take on more complex tasks in the future. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eIn this position, you'll use a variety of tools to build, provision, and test a variety of API's and services with a heavy lean towards server-side work. In this position, you'll use a variety of tools to build, provision, and test a variety of API's and services with a heavy lean towards server-side work.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou start the day by finishing up the work you had in motion yesterday and pushing a CR for review. You notice a CR a teammate has submitted and provide them with feedback, suggesting a small change based on your knowledge of the system they are working with. At daily stand-up, you provide an update on your overall project, report what you’re picking up today, and point out to a teammate that they should connect with a stakeholder to unblock themselves. After standup, you see someone has approved your CR so you kickoff the process to push code to production. You head over to a meeting discussing the teams initiatives to reduce technical debt, calling out some process improvements you believe would be helpful in stopping it from emerging in the first place and ensuring they are filed correctly to be evaluated for next sprint. After that, you head back to your desk where you finish your day with some heads-down time working on the stories that you had mentioned picking up at standup this morning. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur team is intentional about attracting, developing, and retaining amazing talent from diverse backgrounds. Yes we do get to work on really cool services, but we also think a big reason for that is the inclusive and welcoming culture we try to cultivate every day. We’re looking for a new teammate who is enthusiastic, empathetic, curious, motivated, reliable, and able to work effectively with a diverse team of peers; someone who will help us amplify the positive \u0026 inclusive team culture we’ve been building.","department_cost_center":null,"description_short":"The FaST (Fashion Subsidiary Tech) CS-Tech team owns Customer Service support for subsidiaries Shopbop and Zappos. As an Amazon subsidiary, we leverage best-in-class technology from the inside; analyze","display_distance":null,"id":"be34f925-1c87-4ccd-9326-4959e1cdac53","id_icims":"3124062","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3124062/software-development-engineer-ii-fast-fashion-subsidiary-tech","job_schedule_type":"full-time","location":"US, WI, Madison","locations":["{\"normalizedStateName\":\"Wisconsin\",\"normalizedCountryCode\":\"USA\",\"city\":\"Madison\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WI, Madison\",\"coordinates\":\"43.07313,-89.38644\",\"normalizedCountyName\":\"Dane\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Madison, Wisconsin, USA\",\"location\":\"US, WI, Madison\",\"region\":\"WI\",\"buildingCodeList\":[\"MSN4\"],\"normalizedCityName\":\"Madison\"}"],"normalized_location":"Madison, Wisconsin, USA","optional_search_labels":[],"posted_date":"November 11, 2025","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WI, Madison - 143,700.00 - 194,400.00 USD annually","primary_search_label":"subsidiaries.team-zappos","source_system":"JobCreator","state":"WI","title":"Software Development Engineer II, FaST (Fashion Subsidiary Tech)","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3124062/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-zappos","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"alexa-and-amazon-devices","city":"Pune","company_name":"ADCI - Maharashtra","country_code":"IND","description":"This position is for Echo Show Home team which owns the face of the device through home screen being one of the most monetized surface on EFD. Home coupled with Alexa+ agent (proactive and persistent content in ambient state) is the spring board for all of the interaction points from Echo Show devices.\u003cbr/\u003e\u003cbr/\u003eSuccessful candidates will be able to lead by example, balancing their technical depth with customer focused acumen to deliver products which delight our customers.\u003cbr/\u003eIf being at the forefront of new innovation for Alexa sounds exciting, we would love to talk to you!\u003cbr/\u003e\u003cbr/\u003eAs a software engineer in the Alexa Devices team, you will help drive innovation by developing features that present innovative speech-backed visuals on our Echo Show, Echo Spot, and similar screened Alexa devices.\u003cbr/\u003eSpecifically, you will be responsible for developing and maintaining new systems, partnering with other Amazon and third-party services and device teams as required. You will ensure that Alexa almost never drops her end of the conversation, delivering services that respond with minimal latency at Amazon scale. You may work on device frameworks, web services, APIs, large scale data infrastructure, and more. If being at the forefront of new innovation for Alexa sounds exciting, we'd love to talk to you!","department_cost_center":null,"description_short":"This position is for Echo Show Home team which owns the face of the device through home screen being one of the most monetized surface on EFD. Home coupled with Alexa+ agent (proactive and persistent content","display_distance":null,"id":"9c63e855-4a67-4f8f-9cd2-975c6d2b4f14","id_icims":"3136027","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3136027/software-development-engineer-alexa-endpoint-experiences","job_schedule_type":"full-time","location":"IN, MH, Pune","locations":["{\"normalizedStateName\":\"Maharashtra\",\"normalizedCountryCode\":\"IND\",\"city\":\"Pune\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, MH, Pune\",\"coordinates\":\"18.50419,73.85286\",\"normalizedCountyName\":\"Pune\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Pune, Maharashtra, IND\",\"location\":\"IN, MH, Pune\",\"region\":\"MH\",\"buildingCodeList\":[\"PNQ18\"],\"normalizedCityName\":\"Pune\"}"],"normalized_location":"Pune, Maharashtra, IND","optional_search_labels":["alexa-and-amazon-devices.team-software-development-job-family"],"posted_date":"December  2, 2025","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"alexa-and-amazon-devices.devices-and-services-teams","source_system":"JobCreator","state":"MH","title":"Software Development Engineer, Alexa Endpoint Experiences","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3136027/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"devices-and-services-teams","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"alexa-and-amazon-devices","city":"Pune","company_name":"ADCI - Maharashtra","country_code":"IND","description":"This position is for Echo Show Home team which owns the face of the device through home screen being one of the most monetized surface on EFD. Home coupled with Alexa+ agent (proactive and persistent content in ambient state) is the spring board for all of the interaction points from Echo Show devices.\u003cbr/\u003e\u003cbr/\u003eSuccessful candidates will be able to lead by example, balancing their technical depth with customer focused acumen to deliver products which delight our customers.\u003cbr/\u003eIf being at the forefront of new innovation for Alexa sounds exciting, we would love to talk to you!\u003cbr/\u003e\u003cbr/\u003eAs a software engineer in the Alexa Devices team, you will help drive innovation by developing features that present innovative speech-backed visuals on our Echo Show, Echo Spot, and similar screened Alexa devices.\u003cbr/\u003eSpecifically, you will be responsible for developing and maintaining new systems, partnering with other Amazon and third-party services and device teams as required. You will ensure that Alexa almost never drops her end of the conversation, delivering services that respond with minimal latency at Amazon scale. You may work on device frameworks, web services, APIs, large scale data infrastructure, and more. If being at the forefront of new innovation for Alexa sounds exciting, we'd love to talk to you!","department_cost_center":null,"description_short":"This position is for Echo Show Home team which owns the face of the device through home screen being one of the most monetized surface on EFD. Home coupled with Alexa+ agent (proactive and persistent content","display_distance":null,"id":"8d7d99e2-b5fd-4c05-bbd3-4e446a96e9de","id_icims":"3136026","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3136026/software-development-engineer-alexa-endpoint-experiences","job_schedule_type":"full-time","location":"IN, MH, Pune","locations":["{\"normalizedStateName\":\"Maharashtra\",\"normalizedCountryCode\":\"IND\",\"city\":\"Pune\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, MH, Pune\",\"coordinates\":\"18.50419,73.85286\",\"normalizedCountyName\":\"Pune\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Pune, Maharashtra, IND\",\"location\":\"IN, MH, Pune\",\"region\":\"MH\",\"buildingCodeList\":[\"PNQ18\"],\"normalizedCityName\":\"Pune\"}"],"normalized_location":"Pune, Maharashtra, IND","optional_search_labels":["alexa-and-amazon-devices.team-software-development-job-family"],"posted_date":"December  2, 2025","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"alexa-and-amazon-devices.devices-and-services-teams","source_system":"JobCreator","state":"MH","title":"Software Development Engineer, Alexa Endpoint Experiences","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3136026/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"devices-and-services-teams","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"alexa-and-amazon-devices","city":"Pune","company_name":"ADCI - Maharashtra","country_code":"IND","description":"This position is for Echo Show Home team which owns the face of the device through home screen being one of the most monetized surface on EFD. Home coupled with Alexa+ agent (proactive and persistent content in ambient state) is the spring board for all of the interaction points from Echo Show devices.\u003cbr/\u003e\u003cbr/\u003eSuccessful candidates will be able to lead by example, balancing their technical depth with customer focused acumen to deliver products which delight our customers.\u003cbr/\u003eIf being at the forefront of new innovation for Alexa sounds exciting, we would love to talk to you!\u003cbr/\u003e\u003cbr/\u003eAs a software engineer in the Alexa Devices team, you will help drive innovation by developing features that present innovative speech-backed visuals on our Echo Show, Echo Spot, and similar screened Alexa devices.\u003cbr/\u003eSpecifically, you will be responsible for developing and maintaining new systems, partnering with other Amazon and third-party services and device teams as required. You will ensure that Alexa almost never drops her end of the conversation, delivering services that respond with minimal latency at Amazon scale. You may work on device frameworks, web services, APIs, large scale data infrastructure, and more. If being at the forefront of new innovation for Alexa sounds exciting, we'd love to talk to you!","department_cost_center":null,"description_short":"This position is for Echo Show Home team which owns the face of the device through home screen being one of the most monetized surface on EFD. Home coupled with Alexa+ agent (proactive and persistent content","display_distance":null,"id":"2ba3ffe5-f037-4fc9-a6fe-a0f18e1c177f","id_icims":"3136023","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3136023/software-development-engineer-alexa-endpoint-experiences","job_schedule_type":"full-time","location":"IN, MH, Pune","locations":["{\"normalizedStateName\":\"Maharashtra\",\"normalizedCountryCode\":\"IND\",\"city\":\"Pune\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, MH, Pune\",\"coordinates\":\"18.50419,73.85286\",\"normalizedCountyName\":\"Pune\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Pune, Maharashtra, IND\",\"location\":\"IN, MH, Pune\",\"region\":\"MH\",\"buildingCodeList\":[\"PNQ18\"],\"normalizedCityName\":\"Pune\"}"],"normalized_location":"Pune, Maharashtra, IND","optional_search_labels":["alexa-and-amazon-devices.team-software-development-job-family"],"posted_date":"December  2, 2025","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"alexa-and-amazon-devices.devices-and-services-teams","source_system":"JobCreator","state":"MH","title":"Software Development Engineer, Alexa Endpoint Experiences","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3136023/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"devices-and-services-teams","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"alexa-and-amazon-devices","city":"Pune","company_name":"ADCI - Maharashtra","country_code":"IND","description":"This position is for Echo Show Home team which owns the face of the device through home screen being one of the most monetized surface on EFD. Home coupled with Alexa+ agent (proactive and persistent content in ambient state) is the spring board for all of the interaction points from Echo Show devices.\u003cbr/\u003e\u003cbr/\u003eSuccessful candidates will be able to lead by example, balancing their technical depth with customer focused acumen to deliver products which delight our customers.\u003cbr/\u003eIf being at the forefront of new innovation for Alexa sounds exciting, we would love to talk to you!\u003cbr/\u003e\u003cbr/\u003eAs a software engineer in the Alexa Devices team, you will help drive innovation by developing features that present innovative speech-backed visuals on our Echo Show, Echo Spot, and similar screened Alexa devices.\u003cbr/\u003eSpecifically, you will be responsible for developing and maintaining new systems, partnering with other Amazon and third-party services and device teams as required. You will ensure that Alexa almost never drops her end of the conversation, delivering services that respond with minimal latency at Amazon scale. You may work on device frameworks, web services, APIs, large scale data infrastructure, and more. If being at the forefront of new innovation for Alexa sounds exciting, we'd love to talk to you!","department_cost_center":null,"description_short":"This position is for Echo Show Home team which owns the face of the device through home screen being one of the most monetized surface on EFD. Home coupled with Alexa+ agent (proactive and persistent content","display_distance":null,"id":"7abb13bc-a462-4895-8eed-ba4314548b4e","id_icims":"3136024","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3136024/software-development-engineer-alexa-endpoint-experiences","job_schedule_type":"full-time","location":"IN, MH, Pune","locations":["{\"normalizedStateName\":\"Maharashtra\",\"normalizedCountryCode\":\"IND\",\"city\":\"Pune\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, MH, Pune\",\"coordinates\":\"18.50419,73.85286\",\"normalizedCountyName\":\"Pune\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Pune, Maharashtra, IND\",\"location\":\"IN, MH, Pune\",\"region\":\"MH\",\"buildingCodeList\":[\"PNQ18\"],\"normalizedCityName\":\"Pune\"}"],"normalized_location":"Pune, Maharashtra, IND","optional_search_labels":["alexa-and-amazon-devices.team-software-development-job-family"],"posted_date":"December  2, 2025","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"alexa-and-amazon-devices.devices-and-services-teams","source_system":"JobCreator","state":"MH","title":"Software Development Engineer, Alexa Endpoint Experiences","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3136024/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"devices-and-services-teams","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}