{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 3+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"transportation-and-logistics","city":"Lacey","company_name":"Amazon.com Services LLC","country_code":"USA","description":"\u003cbr/\u003eAt Amazon, we are working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Transportation Operations Managers to work in out sites across the country. Amazon is one of the most recognizable brand names in the world and we distribute over a billion shipments each year to our loyal customers.\u003cbr/\u003e\u003cbr/\u003eThe Transportation Operations Manager has complete responsibility for Transportation Operations at a number of sites within a pre-defined region of the country. This position requires a candidate with the proven ability to drive process improvements and the ability to keep pace with our explosive growth while motivating others to meet the challenges of an extremely deadline-driven environment. \u003cbr/\u003e\u003cbr/\u003eSupervisory Responsibilities: \u003cbr/\u003e•\tLead and supervise a team of Transportation Area Managers that are located within the individual sites in an effort to streamline logistics within each individual operation\u003cbr/\u003e•\tResponsible for the overall safety, quality and performance and customer experience of your region\u003cbr/\u003e•\tCarry out supervisory responsibilities in accordance with the organization’s policies and procedures \u003cbr/\u003e•\tAccountability for meeting and exceeding operational goals\u003cbr/\u003e•\tStrategic planning and forecasting; appraise performance; reward and coach employees; resolve problems; address staffing needs\u003cbr/\u003e•\tMentor, train and develop teammates for career progression and learning \u003cbr/\u003e•\tAbility to develop and share best practices across the shifts and network\u003cbr/\u003e•\tTravel up to 50% may be required\u003cbr/\u003e•\tCandidates must be flexible to work a variety of hours as business demands, including overnight, weekends and holidays\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"At Amazon, we are working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Transportation Operations Managers","display_distance":null,"id":"734c4592-8611-4b69-9023-223035b7c1f5","id_icims":"3101011","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3101011/transportation-operations-manager","job_schedule_type":"full-time","location":"US, WA, Lacey","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Lacey\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Lacey\",\"coordinates\":\"47.04437,-122.82324\",\"normalizedCountyName\":\"Thurston\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Lacey, Washington, USA\",\"location\":\"US, WA, Lacey\",\"region\":\"WA\",\"buildingCodeList\":[\"OLM1\"],\"normalizedCityName\":\"Lacey\"}"],"normalized_location":"Lacey, Washington, USA","optional_search_labels":[],"posted_date":"October  3, 2025","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience scoping, leading, and implementing process improvements through: Lean process, Kaizen, and/or Six Sigma.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Lacey - 91,000.00 - 136,500.00 USD annually","primary_search_label":"transportation-and-logistics.team-na-operations","source_system":"JobCreator","state":"WA","title":"Transportation Operations Manager","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3101011/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-na-operations","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Hollister","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager. In this role, you will lead a team of hourly workforce and will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e\u003cbr/\u003eOur Operation’s workflow has three major components: First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Support, mentor, and motivate your hourly workforce\u003cbr/\u003e* Manage safety, quality, productivity, and customer delivery promises\u003cbr/\u003e* Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e* Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e* Stand/walk for up to 12 hours during shifts\u003cbr/\u003e* Work in an environment where the noise level varies and can be loud\u003cbr/\u003e* Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e* Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e\u003cbr/\u003eOur fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Area Managers based on location preference and the business’ current openings.","department_cost_center":null,"description_short":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager.","display_distance":null,"id":"9a52488f-3ac8-4c1b-8ac7-5881db3840c3","id_icims":"3130780","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3130780/area-manager-ii","job_schedule_type":"full-time","location":"US, CA, Hollister","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Hollister\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Hollister\",\"coordinates\":\"36.85254,-121.40363\",\"normalizedCountyName\":\"San Benito\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Hollister, California, USA\",\"location\":\"US, CA, Hollister\",\"region\":\"CA\",\"buildingCodeList\":[\"HLI2\"],\"normalizedCityName\":\"Hollister\"}"],"normalized_location":"Hollister, California, USA","optional_search_labels":[],"posted_date":"December 18, 2025","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 20+ employees\u003cbr/\u003e- Experience with process improvements (Lean process, Kaizen, and/or Six Sigma)\u003cbr/\u003e- Excellent customer service, communication, and interpersonal skills\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Industry experience in: retail, F\u0026B, military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Hollister - 72,500.00 - 90,900.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"CA","title":"Area Manager II ","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3130780/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Degree or technical certification (Military or Trade school).\u003cbr/\u003e- Mechanical/HVAC/Electrical engineering or experience at technician level in a critical environment.\u003cbr/\u003e- 2+ years of maintenance experience on mechanical or electrical equipment.\u003cbr/\u003e- Experience operating electrical or mechanical systems in a mission critical environment (i.e. Data Centre, telecom, etc.).","business_category":"aws","city":"Melbourne","company_name":"Amazon Corporate Services Pty Ltd","country_code":"AUS","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eWe are looking for a Data Centre Engineering Operations Technician (EOT). Our EOT's are Amazon’s front line responders for hands-on electrical and mechanical equipment troubleshooting and operation. This equipment includes, but is not limited to, stand-by diesel generators, switchboards/switchgears, UPSs, PDUs, AHUs, pumps, motors, VFDs, and building automation systems. They provide 24/7 shift coverage which could include 12 hour shifts, rotating shifts, 3, 4, or 5 day work weeks.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Review  the management of both routine and corrective maintenance on a variety of  critical systems such as: switch gear, generators, UPS systems, power  distribution equipment, chillers, cooling towers, computer room air  handlers, building monitoring systems, etc.\u003cbr/\u003e- Establish  performance benchmarks, conduct analyses \u0026 prepare reports on all  aspects of the critical facility infrastructure operations \u0026  maintenance.\u003cbr/\u003e- Help  with the design, implementation, commissioning and build out of new  facilities.\u003cbr/\u003e- Create  and implement projects to increase current facility capacity, efficiency,  sustainability \u0026 reliability. \u003cbr/\u003e- Manage  the facility assets and the provision of infrastructure \u0026 inventory  asset management.\u003cbr/\u003e- Manage the on-site management of contractors, sub-contractors and vendors,  ensuring that all work performed, is observing established practices,  procedures \u0026 local legislation.\u003cbr/\u003e- Work  with other business leaders to coordinate projects, manage capacity, and optimise plant safety, performance, reliability, sustainability and  efficiency.· \u003cbr/\u003e\u003cbr/\u003eHold or be able to attain an Australian Government Security Vetting Agency clearance (see https://www.agsva.gov.au/applicants/eligibility-and-suitability)\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe are experiencing rapid growth, therefore your onboarding will be dynamic in nature, where you will gain diverse experience working in new and established AWS data centre's. These future Amazonians will rotate through various AWS locations to complete training as part of their onboarding to prepare for deployment in a data centre region. This training will be completed over a duration of 6-12 months. Once training is completed, individuals will be relocated to the permanent location.\u003cbr/\u003e\u003cbr/\u003eEngineering Operations Technicians support the data centre building and the critical equipment that keeps it running. This includes diesel power generators, HVAC and fire suppression systems. They’re responsible for the day-to-day operations and maintenance of the critical infrastructure, supervising specialist vendors, acting as first responders to incidents, and becoming subject matter experts for the facility.\u003cbr/\u003e\u003cbr/\u003eAbout AWS:\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"a8ecf7a8-c264-40b9-9f26-cca16c2671c0","id_icims":"3114816","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3114816/engineering-operations-technician-data-center-engineering-operations","job_schedule_type":"full-time","location":"AU, VIC, Melbourne","locations":["{\"normalizedStateName\":\"Victoria\",\"normalizedCountryCode\":\"AUS\",\"city\":\"Melbourne\",\"countryIso3a\":\"AUS\",\"countryIso2a\":\"AU\",\"locationNonStemming\":\"Australia, VIC, Melbourne\",\"coordinates\":\"-37.81736,144.96755\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Australia\",\"normalizedLocation\":\"Melbourne, Victoria, AUS\",\"location\":\"AU, VIC, Melbourne\",\"region\":\"VIC\",\"buildingCodeList\":[\"MEL12\"],\"normalizedCityName\":\"Melbourne\"}"],"normalized_location":"Melbourne, Victoria, AUS","optional_search_labels":["aws.adc-australia"],"posted_date":"October 24, 2025","preferred_qualifications":"- Ability to participate in a 24 x 7 rotating shift roster.\u003cbr/\u003e- 2+ years of operations experience in a data centre or critical environment.\u003cbr/\u003e- Experience with the development of MOPs \u0026 SWMS for planned works.\u003cbr/\u003e- Familiar with the concepts and interaction of Service Management systems (Problem \u0026 Change).\u003cbr/\u003e- Business-level verbal and written communication skills.\u003cbr/\u003e- Proven leadership and excellent attention to detail.\u003cbr/\u003e- Ability to prioritise multiple requests in complex, fast-paced environment.\u003cbr/\u003e\u003cbr/\u003eAcknowledgement of country:\u003cbr/\u003eIn the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.\u003cbr/\u003e\u003cbr/\u003eIDE statement:\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"VIC","title":"Engineering Operations Technician, Data Center Engineering Operations","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3114816/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of Microsoft Office products and applications experience\u003cbr/\u003e- High school or equivalent\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- Can lift up to 49 pounds, stand/walk during shifts lasting up to 12 hours, and be able to frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Work 40 hours/week, and overtime as required\u003cbr/\u003e- Are 18 years of age or older","business_category":"fulfillment-ops-team","city":"Hollister","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Lead Fulfillment Associate \u003cbr/\u003e\u003cbr/\u003eThe Amazon operations team is looking for Lead Fulfillment Associates with a strong record of achieving results to join the expanding team supporting operations leaders and associates in delivering strong operations results within our fulfillment centers. Lead Fulfillment Associates hold various roles within the Fulfillment Center including, but not limited to: Trainer, Process Assistant and Shipping Clerk. All role types will include performing production duties as needed: pick/pack orders, receive/stow product, ensure inventory accuracy, and unload/load trucks. Lead Fulfillment Associates will also be responsible for communicating instructions to other associates, motivating them and keeping their work areas safe.\u003cbr/\u003e\u003cbr/\u003eSince opening our virtual doors in 1995, Amazon has been pushing the boundaries of ‘possible’ further and further. Our entire business works hard to delight our customers – from the second an order is placed online to the seamless coordination of that order behind the scenes, we strive to stay agile, fluid and intentional. Our teams band together, roll up their sleeves, and aren’t content with just standing still. We’re aiming to become the most customer-centric company on Earth.\u003cbr/\u003e\u003cbr/\u003eLead Fulfillment Associates hold various roles within the Fulfillment Center. There are several types of roles that hold different job-specific responsibilities including:\u003cbr/\u003e\u003cbr/\u003eISS Representative:\u003cbr/\u003ePower connector. Maintaining the link between Corporate Retail Teams and the FC, as well as the reporting \u0026 re-escalation of tickets submitted to Retail, Vendor Management and Catalog. Plays an integral role in the RC by facilitating resolution or directly resolving problem items that cannot be received in the RC under the normal conditions of receiving. Responsible for the tactical and strategic handling of Retail Request Tickets submitted to them from Corporate.\u003cbr/\u003e\u003cbr/\u003eProcess Assistant: \u003cbr/\u003eSmooth operator. Helping support daily management of department duties, including allocating labor, leading meetings, assigning job duties and communicating with internal and external suppliers. Escalates barriers to Operations leaders. Drives and executes standard work in the areas of Safety, Quality and Productivity to meet daily operational goals.\u003cbr/\u003e\u003cbr/\u003eDock Clerk:\u003cbr/\u003eDock star. Manage inbound flow from scheduling appointments to time of receives. Duties also include regular communication with carriers, the corporate transportation group, management and dock personnel. The Dock Clerk will be responsible for planning inbound arrivals, ensuring carrier compliance, managing buffers and leading dock personnel.\u003cbr/\u003e\u003cbr/\u003eReceiving Clerk:\u003cbr/\u003eMega monitor. Scheduling inbound deliveries in dock master using Advance Ship Notices. Duties also include regular communication with carriers, the corporate transportation group and receivers. Responsible for keeping an up to date knowledge of scheduled appointments, monitoring new releases and communicating with other departments, will also be responsible for training back-up clerks.\u003cbr/\u003e\u003cbr/\u003eShipping Clerk:\u003cbr/\u003eSuper shipper. Correspond with multiple shipping companies and their contacts. Use multiple shipping company’s software to ship and track packages. Coordinate trailers to corresponding dock doors and cross docks using OMA tool. Ensure proper processes are followed with the Trailer Dock Release program\u003cbr/\u003e\u003cbr/\u003eNon-Inventory Receive Clerk:\u003cbr/\u003eNon-Inventory guru. Work in a team environment with Procurement to administer the flow of non-inventory goods. Organize supplies, corrugate, safety equipment, and tools. Research missing shipments. Staging product in work areas. Operate PIT equipment to move goods. Use computer skills to track and receive non-inventory goods.\u003cbr/\u003e\u003cbr/\u003eThe Regulated Waste Coordinator:\u003cbr/\u003eFunctions as the lead for the Waste Program within the FC where product and hazardous waste sent for resale, donation, or disposal are properly managed in a manner compliant with all applicable federal, state, and local regulations. The Regulated Waste Coordinator provides technical support and tactical execution of the Regulated Waste Procedure, and works in partnership with both Operations and the EHS Teams to maintain compliance while providing oversight over the waste process.\u003cbr/\u003e\u003cbr/\u003eAmazon Robotics (AR) Quarterback:\u003cbr/\u003eQuarterbacks (QB) main responsibility will be monitoring overall floor health of the robotic field and leading the safe and effective work dispatch for Amnesty Floor Monitors, while ensuring minimum impact on downstream operations. QB will coordinate with the local learning, RME, and operations team, using real-time data and dashboards during shifts to drive standard work practices in supporting the building to achieve daily operational goals.\u003cbr/\u003e\u003cbr/\u003eFloor Health Monitor:\u003cbr/\u003eAutonomous, self-sufficient operator. Amnesty Floor Monitor (AFMs) are associates that have undergone specific training to be able to safely access the Amazon Robotic floors and perform a wide range of tasks. Responsibilities for Amnesty Floor Monitors can be from resolving issues on the Amazon Robotics (AR) floor such as restarting a drive, to helping associates at stations with amnesty processing and prevention.\u003cbr/\u003e\u003cbr/\u003eData Analyst:\u003cbr/\u003eThis Data Analyst role will work closely with the ICQA and operations teams in Inbound and Outbound to provide data and analytical support for ACES initiatives, root cause investigation of defects, and will provide support to insure compliance to ICQA-related SoX requirements. This Data Analyst role will work closely with the ICQA and operations teams in Inbound and Outbound to provide data and analytical support for ACES initiatives, root cause investigation of defects, and will provide support to insure compliance to ICQA-related SoX requirements\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eThings to know about working in an Amazon Fulfillment Center:\u003cbr/\u003e• We’re committed to providing a safe work environment. This means you wear a reflective vest, stretch and recognize others for working safely.\u003cbr/\u003e• We have a relaxed, casual dress code (as long as your attire meets our safety requirements).\u003cbr/\u003e• We work to regulate our sites as much as possible, but even with climate controls the noise and temperature levels can vary day to day. Hearing protection is available.\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Lead Fulfillment Associate The Amazon operations team is looking for Lead Fulfillment Associates with a strong record of achieving results to join the expanding team supporting operations leaders and associates","display_distance":null,"id":"056fa57e-50ff-462f-99de-7fac5daa6b58","id_icims":"3136628","is_intern":null,"is_manager":null,"job_category":"Leadership Development \u0026 Training","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3136628/lead-fulfillment-associate","job_schedule_type":"full-time","location":"US, CA, Hollister","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Hollister\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Hollister\",\"coordinates\":\"36.85254,-121.40363\",\"normalizedCountyName\":\"San Benito\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Hollister, California, USA\",\"location\":\"US, CA, Hollister\",\"region\":\"CA\",\"buildingCodeList\":[\"HLI2\"],\"normalizedCityName\":\"Hollister\"}"],"normalized_location":"Hollister, California, USA","optional_search_labels":["hourly"],"posted_date":"December  3, 2025","preferred_qualifications":"- A completed Associate’s or Bachelor’s Degree\u003cbr/\u003e- 1+ year of leadership experience directly managing others\u003cbr/\u003e- 1+ year working in a like environment (manufacturing/distribution/warehousing/large retail)\u003cbr/\u003e- Experience with performance metrics and lean process improvement\u003cbr/\u003e- Excellent written and verbal communication and interpersonal skills to coach, train and assist team members\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below including the base pay rate plus the highest available shift differential which applies depending on the shift you select. As a total compensation company, you are eligible for additional earnings including overtime pay and performance bonuses. Final pay will be based on factors including shift selection and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Hollister - 26.00 - 26.00 USD hourly","primary_search_label":"fulfillment-ops-team.fulfillment-associates","source_system":"JobCreator","state":"CA","title":"Lead Fulfillment Associate","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3136628/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"fulfillment-associates","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent\u003cbr/\u003e- 5+ years of building a strong Brand with the strategy and execution built for product and services.\u003cbr/\u003e- 5+ years of experience in the area of brand marketing, product marketing, and performance marketing.\u003cbr/\u003e- Experience working and negotiating with agencies.Bachelor's degree or equivalent\u003cbr/\u003e- Experience owning/driving roadmap strategy and definition\u003cbr/\u003e- Experience with end to end product delivery\u003cbr/\u003e- Experience with feature delivery and tradeoffs of a product\u003cbr/\u003e- Experience as a product manager or owner\u003cbr/\u003e- Experience owning technology products\u003cbr/\u003e- Experience using English/Japanese communication skills, both written and verbal, to foster seamless interaction with stakeholders at all levels","business_category":"alexa-and-amazon-devices","city":"Tokyo","company_name":"Amazon Japan G.K.","country_code":"JPN","description":"As a Sr. Marketing Manager, you will develop marketing strategies of Ring to grow brand awareness and drive new customer acquisition across multiple traffic channels. You will initiate, plan and execute multiple, highly visible Ring brand campaign and merchandising activities including raising the new product launch promotions. At the same time, you will be expected to come up with creative solutions to solve many non-standard and unique business problems and to deliver actionable output to further enhance customer usages and satisfactions. This is an opportunity to join a growing team and make a significant contribution to building smart, innovative marketing programs that are demonstrably impactful to the business.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will be metrics-driven with strong ownership and focus, self-starter comfortable with ambiguity, excellent attention to detail, and the ability to work in a fast-paced environment. You will need to be able to prioritize effectively in a fast-moving environment, and communicate clearly and persuasively. This person can drive focus and excellence within the programs they own, with their colleagues in marketing and product management and with colleagues across the Amazon organization\u003cbr/\u003e\u003cbr/\u003eYou are the perfect candidate for this role if: \u003cbr/\u003e•\tYou have built a strategy and execute brand marketing campaign, ran omni-channel marketing strategies, and have driven product positioning and messaging development.\u003cbr/\u003e•\tYou owned design, development, and maintenance of ongoing marketing and traffic metrics, reports, analyses, dashboards, etc. to make key business decisions.\u003cbr/\u003e•\tYou have an experienced-on planning, coordinate and execute innovative marketing and merchandising initiatives to generate traffic, revenue and conversion.\u003cbr/\u003e•\tYou use data to make the best decisions for your customer, and act as the voice of the customer in understanding their behavior and needs.\u003cbr/\u003e•\tYou are a self-starter and can juggle multiple priorities and make things happen in a fast-paced, dynamic and often ambiguous environment\u003cbr/\u003e•\tYou enjoy solving problems and are good at crafting solutions\u003cbr/\u003e•\tYou like getting your hands dirty in day-to-day tasks to get things done\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tDrive performance marketing goals across paid search, digital display, paid social and video advertising, including managing media budgets and forecasting channel efficiency\u003cbr/\u003e•\tDevelop recommendations for new growth initiatives, platforms and programs based on business goals, competitive analysis/benchmarking and emerging trends\u003cbr/\u003e•\tPartner with a variety of stakeholders across product manager, marketing, designers, tech/analytics and finance to drive innovative launch and always-on marketing programs that are impactful to the business and increase brand and product awareness.\u003cbr/\u003e•\tServe as a subject matter expert for performance marketing, articulate tradeoffs, and communicate plans\u003cbr/\u003e•\tImprove performance of paid traffic channels by partnering with all traffic-driving mechanisms (Search, Affiliates, Email, SEO etc.)\u003cbr/\u003e•\tResearch and identify new marketing/merchandising opportunities for Amazon Devices on Amazon.co.jp; communicate opportunities effectively; drive execution of approved projects. \u003cbr/\u003e•\tIdentify customer triggers and barriers by using surveys, in-depth research and customer immersions\u003cbr/\u003e•\tAble to listen to insights from multiple stakeholders and have high judgment. \u003cbr/\u003e•\tAble to speak and write in English and Japanese fluently to negotiate and present our strategy.\u003cbr/\u003e","department_cost_center":null,"description_short":"As a Sr. Marketing Manager, you will develop marketing strategies of Ring to grow brand awareness and drive new customer acquisition across multiple traffic channels. You will initiate, plan and execute","display_distance":null,"id":"2b584924-1b4e-4754-adc3-cf1d228d4eb2","id_icims":"3177473","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Product Management","job_function_id":null,"job_path":"/en/jobs/3177473/sr-marketing-manager-ring-ring-jp-amazon-devices","job_schedule_type":"full-time","location":"JP, 13, Tokyo","locations":["{\"normalizedStateName\":\"Tokyo\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Tokyo\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, 13, Tokyo\",\"coordinates\":\"35.68946,139.69172\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Tokyo, JPN\",\"location\":\"JP, 13, Tokyo\",\"region\":\"13\",\"buildingCodeList\":[\"HND17\"]}"],"normalized_location":"Tokyo, JPN","optional_search_labels":["alexa-and-amazon-devices.team-product-project-program-management-job-family","devices-apjc"],"posted_date":"February 10, 2026","preferred_qualifications":"- Experience in influencing senior leadership through data driven insights\u003cbr/\u003e- Experience working across functional teams and senior stakeholders\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"alexa-and-amazon-devices.team-ring-key-blink","source_system":"JobCreator","state":"13","title":"Sr. Marketing Manager - Ring, Ring JP, Amazon Devices","university_job":null,"updated_time":"21 minutes","url_next_step":"https://account.amazon.com/jobs/3177473/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-ring-key-blink","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent practical experience\u003cbr/\u003e- 3+ years of direct people management experience, including conducting performance reviews and employee development\u003cbr/\u003e- Hands-on operational experience within the logistics industry, combined with team leadership and people management\u003cbr/\u003e- Fluency in Japanese and English with strong written and verbal communication skills","business_category":"fulfillment-and-operations","city":"Ota","company_name":"Amazon Japan G.K.","country_code":"JPN","description":"※このポジションの勤務地は東京都大田区です。\u003cbr/\u003e\u003cbr/\u003eアマゾンでは日本のAmazon Logistics （AMZL）チームの家具家電配送を行うデリバリーステーション・オペレーションとソートセンターのデュアルオペレーションセンターのマネージャーを募集しています。AMZLのゴールはお客様に荷物をお届けする物流の最後の区間、ラストマイルにおいて、世界水準のオペレーションを構築することです。アマゾンではお客様により速く、正確に、そして効果的な方法でお届けすることで、お客様の期待を上回るサービスを提供することに重点的に取り組んでおり、日本でもAMZLが急速に拡大しています。\u003cbr/\u003e\u003cbr/\u003eオペレーションマネージャーは、出入荷、ソートオペレーションに対する責任を負い、大きな裁量を任される仕事です。デリバリーステーション（DS）のオペレーションマネージャーはセンター長として、マネージャーレベルの部下を持ち、ソート（仕分け）やディスパッチ（配送ドライバーへの荷物の引き渡し）のオペレーションを指揮します。また、DSで働くメンバーのエンゲージメントを高め、日々のオペレーションの目標を確実に遂行することに加え、さらなる高みを目指してオペレーションの改善や新しいサービスの導入を進めていく改善スキル、推進力が期待されています。\u003cbr/\u003e\u003cbr/\u003e【具体的な業務内容】\u003cbr/\u003e・ソートおよびディスパッチオペレーションのリードおよび監督\u003cbr/\u003e・シフト全体の安全性、品質、パフォーマンス、カスタマーサービス向上\u003cbr/\u003e・組織の方針と手順に従っての監督責任\u003cbr/\u003e・オペレーション目標の達成、および、それを上回る成果の実現\u003cbr/\u003e・物量等の予測に基づく、戦略的な計画立案、パフォーマンスの評価、問題の解決および人材配置に関するニーズへの対応\u003cbr/\u003e・チームメンバーのキャリア向上、指導、トレーニングおよび育成\u003cbr/\u003e・Learning and Talent Developmentチームとのパートナーシップにより、人材の獲得、パフォーマンスとキャリア開発、育成、サクセッションプランに関する計画の立案と実行\u003cbr/\u003e・シフトとネットワーク全体にわたってのベストプラクティスの創出・展開\u003cbr/\u003e\u003cbr/\u003eこのポジションに求められるのは、経験に裏打ちされたプロセスの改善能力と、アマゾンの成長速度に合わせ、メンバーのモチベーションを高めながらさまざまなチャレンジに対して短期間で成果を出していく能力を持つ候補者です。また、さまざまな経験、バックグラウンドを持つ多様なメンバーと協業していく柔軟性が求められます。\u003cbr/\u003eまだ若い組織であり、組織やビジネスとともに成長できる高い意欲とポテンシャルをもった方を求めています。\u003cbr/\u003e\u003cbr/\u003e※こちらの職種は日勤帯を中心としたシフト勤務（（土日祝日含む交替制勤務）となりますが、職務遂行上必要な場合には夜勤帯で勤務していただく場合もございます。\u003cbr/\u003e\u003cbr/\u003e本ポジションの所属部門等に関する詳細は、下記リンク先をご参照ください。\u003cbr/\u003e■部門(トランスポーテーション）紹介：https://www.amazon.co.jp/b?node=5637343051\u003cbr/\u003e■職種(オペレーション)紹介：　https://www.amazon.co.jp/b?node=5609898051\u003cbr/\u003e■アマゾンロジスティクス：\u003cbr/\u003ehttps://www.youtube.com/watch?v=1UCUT9Tfq0U\u0026feature=youtu.be\u003cbr/\u003e■アマゾンDay1ブログ\u003cbr/\u003eオペレーションズ：https://blog.aboutamazon.jp/ops\u003cbr/\u003e\u003cbr/\u003e===================================\u003cbr/\u003e*Working location for this position is Ota Tokyo.\u003cbr/\u003e\u003cbr/\u003eAmazon seeks a Senior Operations Manager to join our Japan Amazon Logistics team. The goal of Amazon Logistics (AMZL) is to build a world class last mile operation delivering to customers. Amazon aims to exceed the expectations of our customers by ensuring that their orders are delivered as quickly, accurately, and in the most cost effective way as possible and we are expanding rapidly in Japan.\u003cbr/\u003e\u003cbr/\u003eThe Station Operations Manager has complete responsibility for inbound, outbound and sortation operations. Delivery Stations (DS) represent the last leg of our delivery network. Customer packages travel from our Fulfillment Centers to regional Sort Centers and finally end up at our local DS where packages are sorted and dispatched directly to the customer via delivery service providers (couriers). Station Operations Managers are the right hand person for the Site Leaders and will lead the entire sortation and dispatch operations leading multiple mangers in their reporting line. They will engage all members working at the station and ensure achievement of daily and longer-term operation goals. Additionally, they will actively engage with site and regional operations leadership to implement new operational improvements and new services. We expect our managers to continually identify ways to improve our operations.\u003cbr/\u003e\u003cbr/\u003eResponsibilities:\u003cbr/\u003eLead and supervise a team of managers and associates in sortation and dispatch operations\u003cbr/\u003eResponsible for the overall safety, quality, performance and customer experience of the shift.\u003cbr/\u003eCarry out supervisory responsibilities in accordance with the organization’s policies and procedures.\u003cbr/\u003eAccountability for meeting and exceeding operational goals.\u003cbr/\u003eStrategic planning and forecasting; appraise performance, resolve problems; and address staffing needs.\u003cbr/\u003eMentor, train and develop teammates for career progression and learning\u003cbr/\u003ePartner with Learning and Talent Development Team on creating and implementing talent plans for their sites including talent acquisition, performance and career management, learning and development, succession planning, and employee engagement.\u003cbr/\u003eAbility to develop and share best practices across the shifts and network.\u003cbr/\u003e\u003cbr/\u003eThis position requires a candidate with the proven ability to drive process improvements and the ability to keep pace with our growth while motivating others to meet challenges in a deadline-driven environment. We are also looking for a candidate who excel in an environment where talents with diverse experience and background work together. Our organization is still young and we are looking for a talent who has enthusiasm and high potential to growth with our organization and business.\u003cbr/\u003e\u003cbr/\u003e※This position has to work in shift including weekends and holidays, mainly during the day, but may also cover night shifts as needed.\u003cbr/\u003ePlease refer to below links for details:\u003cbr/\u003e■Introduction of Transportation Dept..：https://www.amazon.co.jp/b?node=5637343051\u003cbr/\u003e■Introduction of Operations Jobs：　https://www.amazon.co.jp/b?node=5609898051\u003cbr/\u003e■Introduction of AMZL：\u003cbr/\u003ehttps://www.youtube.com/watch?v=1UCUT9Tfq0U\u0026feature=youtu.be\u003cbr/\u003e■Amazon Day 1 blog about Operations:\u003cbr/\u003ehttps://blog.aboutamazon.jp/ops\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Own and deliver operational budget for functional area, including safety, productivity, financial and labor planning, and operational goals for delivery station and  sort center\u003cbr/\u003e• Responsible for providing strategic level/long-term planning (3, 6, and 12 months out), including labor planning, rate forecasting, and peak season planning\u003cbr/\u003e• Be accountable for operational leadership by measuring performance, offering feedback, and providing development support\u003cbr/\u003e• Drive continuous improvement projects to optimize operations and improve productivity to meet and exceed business objectives; work on strategic projects that have total building and network-wide impact\u003cbr/\u003e• Communicate with other leaders across the network to solicit and share process improvements and drive efficiencies and cost savings\u003cbr/\u003e• Establish objectives and metrics for safety, quality, availability, productivity, cost and customer experience\u003cbr/\u003e• Works closely with support staff (HR, Finance, Facilities, Safety, IT and Other Team manager) to build and secure support and resources for projects and initiatives, as well as providing needed support and resources for other network initiatives\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou spend time visiting or building multiple Amazon owned Delivery Station and sort centers in Japan reviewing the operations and setting up the right processes and mechanisms to drive safety, cost, speed and availability at every instance. You hire, develop and motivate your team to deliver against the same goals using the Amazon leadership principles that you truly embody with all your actions.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout the team\u003cbr/\u003eAMXL JP team is a single threaded organization that owns Amazon's end-to-end Heavy \u0026 Bulky (H\u0026B) logistics network with our willing and equally customer obsessed partners, offering shipping, service \u0026 support for consumers and companies in a safe, reliable, seamless, standardized, and sustainable way that surprises and delights our customers. Our delivery partners are experienced in H\u0026B deliveries, providing special handling services such as Room of Choice Delivery, Installation/Assembly and Recycling/Haul-Away.\u003cbr/\u003eOur team is made up of a diverse group of individuals across operations, supply chain, tech, finance, planning, customer experience, business intelligence and program management that work closely and collaboratively across Amazon to constantly improve and scale our operations, always insisting on the highest standards and obsessing over delivering bigger smiles for our customers.","department_cost_center":null,"description_short":"※このポジションの勤務地は東京都大田区です。アマゾンでは日本のAmazon Logistics （AMZL）チームの家具家電配送を行うデリバリーステーション・オペレーションとソートセンターのデュアルオペレーションセンターのマネージャーを募集しています。AMZLのゴールはお客様に荷物をお届けする物流の最後の区間、ラストマイルにおいて、世界水準のオペレーションを構築することです。アマゾンではお客様により速く、正確に、そして効果的な方法でお届けすることで、お客様の期待を上回るサービスを提供することに重点的に取り組んでおり、日本でもAMZLが急速に拡大しています。オペレーションマネージャーは、出入荷、","display_distance":null,"id":"e4b4f3f1-5cc7-408c-8365-e57265d8c14f","id_icims":"3177475","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3177475/operations-manager-delivery-stations-amxl-jp","job_schedule_type":"full-time","location":"JP, 13, Ota","locations":["{\"normalizedStateName\":\"Osaka\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Daito\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, 27, Daito\",\"coordinates\":\"34.712,135.62346\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Daito-shi, Osaka, JPN\",\"location\":\"JP, 27, Daito\",\"region\":\"27\",\"buildingCodeList\":[\"KIX2\"],\"normalizedCityName\":\"Daito-shi\"}","{\"normalizedStateName\":\"Tokyo\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Ota\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, 13, Ota\",\"coordinates\":\"35.56136,139.71608\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Ota-ku, Tokyo, JPN\",\"location\":\"JP, 13, Ota\",\"region\":\"13\",\"buildingCodeList\":[\"HTY4\"],\"normalizedCityName\":\"Ota-ku\"}"],"normalized_location":"Ota-ku, Tokyo, JPN","optional_search_labels":[],"posted_date":"February 10, 2026","preferred_qualifications":"- 3+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-last-mile-delivery","source_system":"JobCreator","state":"13","title":"デリバリーステーション・オペレーションマネージャー/Operations Manager, Delivery Stations, AMXL JP","university_job":null,"updated_time":"24 minutes","url_next_step":"https://account.amazon.com/jobs/3177475/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-delivery","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 4年制大卒、またはそれに準ずる経験\u003cbr/\u003e- 3年以上の人事経験またはそれに準ずる経験（大学等卒業後3年以内の場合は問わない）\u003cbr/\u003e- ビジネスレベルの日本語力、読み書きと日常会話レベルの英語力\u003cbr/\u003e- Word, Excel, PPT使用経験","business_category":"fulfillment-and-operations","city":"Yotsukaido","company_name":"Amazon Japan G.K.","country_code":"JPN","description":"千葉県四街道市のデリバリーステーション（以下DS）にて、ハンズオンで業務遂行が可能なHR Business Partner（HRBP）を募集しています。\u003cbr/\u003eHRBPは、担当するデリバリーステーション（DS）で働く従業員をカスタマーと考え、DSのリーダーの戦略パートナーとしてビジネス成長に欠かせない組織・人材面の意思決定をサポートします。組織開発、人材育成・配置、キャリア形成の機会、組織文化の醸成など、短期・中長期にわたるさまざまなHRソリューションを人事部門の他チームやメンバーと連携・協働しながら提供します。また、様々なプロジェクトを通じて全国にあるDSの Networkに貢献する機会があります。\u003cbr/\u003e\u003cbr/\u003eこのポジションでは、採用、評価、配置、代謝といった一連の人事管理とDSで働く従業員の勤怠や労務管理について、ハンズオンなアプローチで責任を持って業務遂行して頂きます。具体的には、人事データを分析し、組織における問題点を特定し、タレントマネジメントを行うことで、組織横断的に戦略的な人員配置や人材開発を行ないます。また、パフォーマンスや言動に問題のある社員の対応等（Employee Relations(ER)）についても、専門性を持ってマネージャーを導き、解決します。これらの業務を遂行するため、高いコミュニケーション能力、論理的思考、ハンズオンのアプローチが必要です。また、人事領域における法律、組織開発、報酬・福利厚生等の幅広い知識が求められます。\u003cbr/\u003e\u003cbr/\u003eDSの従業員構成は、製造業・物流業・小売業等と類似しており、年俸制の社員に加え、時間給パートタイマーや、派遣社員・請負労働者を含みます。上記業界での経験は、Amazonのオペレーションにおけるビジネス環境に適応することに役立ちます。\u003cbr/\u003e\u003cbr/\u003eHRBPとして働くやりがいとチャレンジは、急速に成長する会社の人事として、ビジネス感覚を鍛えることができることです。拠点唯一のHRBPとして、責任ある業務がアサインされ、DSのトップからもHRの専門家、パートナーとして頼られる立場となります。また、HR組織自体も拡大しており、将来ピープルマネジメントに携わる可能性も十分にあります。さらにグローバルのチームと連携し、ベストプラクティスを共有しあったり、新しい施策の日本への導入に携わる機会も魅力のひとつです。\u003cbr/\u003e\u003cbr/\u003e我々はHRBPのDiversity拡大にも取り組んでいます。HRジェネラリストだけでなく、特定エリアのスペシャリストで、HRBPになることを目指している方も歓迎します。\u003cbr/\u003eこのようなバックグラウンドの方々には、培ったスキルを発揮し、私たちのHR Operationをより高いレベルに引き上げていただくことを期待しています。\u003cbr/\u003e\u003cbr/\u003eAmazon は多様かつインクルーシブな職場づくりを目指しています。Amazonは男女雇用機会均等法を順守しています。人種、 出身国、性別、性的指向、障がい、年齢、その他の属性によって差別することなく、平等に採用選考の機会を提供しています。障がいをお持ちの方は、以下をご覧ください。https://www.amazon.jobs/disability/jp\u003cbr/\u003e\u003cbr/\u003e＜More Information＞\u003cbr/\u003e・採用に関する詳細は、下記サイトをご参照ください。\u003cbr/\u003e■人事部門/勤務地紹介\u003cbr/\u003e＜人事部門＞https://www.amazon.co.jp/b?node=5609908051\u003cbr/\u003e＜勤務地＞https://www.amazon.co.jp/b?node=8521082051\u003cbr/\u003e\u003cbr/\u003e■社員紹介 https://www.amazon.co.jp/b?node=5589775051","department_cost_center":null,"description_short":"千葉県四街道市のデリバリーステーション（以下DS）にて、ハンズオンで業務遂行が可能なHR Business Partner（HRBP）を募集しています。HRBPは、担当するデリバリーステーション（DS）で働く従業員をカスタマーと考え、DSのリーダーの戦略パートナーとしてビジネス成長に欠かせない組織・人材面の意思決定をサポートします。組織開発、人材育成・配置、キャリア形成の機会、組織文化の醸成など、短期・中長期にわたるさまざまなHRソリューションを人事部門の他チームやメンバーと連携・協働しながら提供します。また、様々なプロジェクトを通じて全国にあるDSの","display_distance":null,"id":"d12a76b2-fecb-4530-9722-c4164def4b22","id_icims":"3125916","is_intern":null,"is_manager":null,"job_category":"Human Resources","job_family":"Human Resources","job_function_id":null,"job_path":"/en/jobs/3125916/hr-business-partner-amzl-hr","job_schedule_type":"full-time","location":"JP, 13, Yotsukaido","locations":["{\"normalizedStateName\":\"Chiba\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Yotsukaido\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, 13, Yotsukaido\",\"coordinates\":\"35.67016,140.16833\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Yotsukaido-shi, Chiba, JPN\",\"location\":\"JP, 13, Yotsukaido\",\"region\":\"13\",\"buildingCodeList\":[\"DKJ4\"],\"normalizedCityName\":\"Yotsukaido-shi\"}","{\"normalizedStateName\":\"Ibaraki\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Tsukuba\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, 8, Tsukuba\",\"coordinates\":\"36.08348,140.07645\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Tsukuba-shi, Ibaraki, JPN\",\"location\":\"JP, 8, Tsukuba\",\"region\":\"8\",\"buildingCodeList\":[\"DKJ1\"],\"normalizedCityName\":\"Tsukuba-shi\"}"],"normalized_location":"Yotsukaido-shi, Chiba, JPN","optional_search_labels":[],"posted_date":"November 13, 2025","preferred_qualifications":"- 候補者に求める能力 ① 一貫性と柔軟性のバランス HRBPとして就業規則をはじめ人事制度のゲートキーパーとして一貫性が求められますが、カスタマーであるビジネスリーダーや従業員の要望に耳を傾け柔軟に対応することも期待されます。 ② あいまいさに対して寛大で、スピードの速さや変化を楽しみながら、結果が出るまであきらめない精神力。 HRBPが関わる業務は多岐に渡るので、その場に応じて、緊急性が高い業務を見極めて優先的に行う/急な変更にも臨機応変に対応する力が求められています。時には方向性が明確でない中、業務を進めるための大胆な判断力とリスクを計算する慎重さが求められます。 ③ 実践的なコミュニケーション能力 DSの統括責任者であるステーションオペレーションズマネージャーから現場で働くスタッフまで異なるレイヤーの社員との情報伝達、他部署との連携も多いため、分かりやすい、誤解のない、コミュニケーション能力が期待されます。また、業務によっては報告先や相談先が変わるので、注意深さも必要となります。 その他： ・部下をマネジメントした経験 ・グローバル環境、異文化環境での業務経験 ・変化が速く、あいまいな環境での業務経験 ・修士や経営学修士尚可 ・ビジネスレベルの英語力 ・データ収集とデータ分析経験 ・インクルーシブなカルチャーへの貢献や多様性に富んだグループで働くことに対して前向きであること。 Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-global-fulfillment-human-resources","source_system":"JobCreator","state":"13","title":"HR Business Partner, AMZL HR","university_job":null,"updated_time":"30 minutes","url_next_step":"https://account.amazon.com/jobs/3125916/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-fulfillment-human-resources","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"transportation-and-logistics","city":"Visalia","company_name":"Amazon.com Services LLC","country_code":"USA","description":"At Amazon, we’re working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and dependable people. Amazon is seeking Transportation Area Managers to work throughout the country. Amazon is one of the most recognizable brand names in the world and we distribute over a billion shipments each year to our loyal customers.\u003cbr/\u003e\u003cbr/\u003eFour key areas that you’ll always focus on are the safety, quality, customer experience, and productivity of your department. Key responsibilities include:\u003cbr/\u003e•\tCollaborate with site leadership on quality and Customer Experience metrics, including the root cause analysis of problem areas\u003cbr/\u003e•\tStreamline logistics in the operation through the implementation of standard work and team leadership\u003cbr/\u003e•\tSupport and commit to all safety programs and OSHA compliance to ensure a safe work environment for all associates\u003cbr/\u003e•\tProactively identify and lead process improvement initiatives and Lean tools\u003cbr/\u003e\u003cbr/\u003eSupervisory Responsibilities: \u003cbr/\u003eYou and your team of Transportation Associates are responsible for Amazon customers receiving their orders. You are responsible for ensuring that you have properly trained people, and that their needs are addressed so they can focus on their jobs. Support, mentor, and motivate your hourly workforce. Manage safety, quality, productivity, and customer delivery promises. In addition, one of the most important aspects of your job is to lead change at internet speed because innovation has made us the global company that we are today. \u003cbr/\u003e\u003cbr/\u003eAmazon offers competitive packages, growth potential and a challenging and inclusive work environment.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003ePlease review the Field Ops Transfer Policy on Inside to ensure you are eligible to apply for this role.  https://inside.hr.amazon.dev/us/en/employment/policies-global/l4-l7-field-ops-transfer.html\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"At Amazon, we’re working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and dependable people. Amazon is seeking Transportation Area Managers to","display_distance":null,"id":"d8da3970-97bd-416b-9342-06aafb0b3382","id_icims":"3137036","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3137036/transportation-area-manager","job_schedule_type":"full-time","location":"US, CA, Visalia","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Visalia\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Visalia\",\"coordinates\":\"36.33377,-119.29259\",\"normalizedCountyName\":\"Tulare\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Visalia, California, USA\",\"location\":\"US, CA, Visalia\",\"region\":\"CA\",\"buildingCodeList\":[\"HLA6\"],\"normalizedCityName\":\"Visalia\"}"],"normalized_location":"Visalia, California, USA","optional_search_labels":[],"posted_date":"December  4, 2025","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Visalia - 72,500.00 - 90,900.00 USD annually","primary_search_label":"transportation-and-logistics.team-na-operations","source_system":"JobCreator","state":"CA","title":"Transportation Area Manager","university_job":null,"updated_time":"33 minutes","url_next_step":"https://account.amazon.com/jobs/3137036/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-na-operations","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Minimum 3 years’ experience, ideally in a corporate, safety, health and wellbeing program management role\u003cbr/\u003e- Knowledge of Workplace/Occupational Health and Safety legislation in Australia\u003cbr/\u003e- Bachelor's degree or above","business_category":"fulfillment-and-operations","city":"Ravenhall","company_name":"Amazon Commercial Services Pty Ltd","country_code":"AUS","description":"At Amazon we believe that every day is still day one; a day to take a first step; a day to look forwards to new challenges; and today is that day for you. It’s your day to be part of something great; a day to make your ideas come to life; and your day to join a company that redefines itself every day. That’s the energy and passion behind Amazon. We are currently looking to hire a Sr. Workplace Health, Safety and Wellness (WHSW) Specialist to join the team and play a critical role in supporting the WHS function. This role will have a strong focus on psychosocial and mental health strategies, the coordination of Return to Work requirements and the implementation of global health and wellness programs. The successful candidate will be an experienced, innovative, hands-on and customer obsessed individual, passionate about WHS, injury prevention, effective management of, and engaged return to work processes. Be able to identify, coordinate and drive improvements in WHS whilst engaging Operational and other Support Function stakeholders. The candidate will be keen to grow their career with Amazon as we continue to expand in Australia, and globally.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eDevelop strategy and provide technical subject matter expertise in the development of physical and psychosocial risk and work design strategy across Amazon AU\u003cbr/\u003eAssist the WHS Manager to ensure delivery of Health, Safety and Wellness performance in line with personal, team and functional goals and objectives, programs and projects\u003cbr/\u003eBe a key driver in the development and implementation of programs specific to occupational health, wellness, injury prevention, injury management, and return to work\u003cbr/\u003eSupporting the implementation of WHS and Wellness programs within site operations\u003cbr/\u003eSupporting the site with key risk assessment activities including proactively analyze tasks for potential psychosocial issues, and execute other Amazon injury prevention activities\u003cbr/\u003eParticipate in incident investigation process, especially those related to MSD or psychosocial-related health injuries\u003cbr/\u003eSupporting the business to ensure compliance to state and Australian WHS legislation\u003cbr/\u003eEnsuring that WHS systems are kept accurate at all time with completed incident reports and all required supporting documentation, with metrics compiled on key data points to help the WHS Manager prepare/issue regular and ad hoc reports and metric documents\u003cbr/\u003eAssisting the WHS Manager with the construction of incident prevention programs, contributing to operational requests to improve on site Safety and positively impact accident trends as well as facilitating incident investigation processes\u003cbr/\u003eParticipating in WHS Safety Audits and Inspection programs as required\u003cbr/\u003eCoordinating, training and coaching team members as required\u003cbr/\u003e","department_cost_center":null,"description_short":"At Amazon we believe that every day is still day one; a day to take a first step; a day to look forwards to new challenges; and today is that day for you. It’s your day to be part of something great; a","display_distance":null,"id":"4a08b562-5c47-4246-bb1b-632c1dd41212","id_icims":"3161612","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3161612/sr-whs-specialist-health-wellbeing","job_schedule_type":"full-time","location":"AU, VIC, Ravenhall","locations":["{\"normalizedStateName\":\"Victoria\",\"normalizedCountryCode\":\"AUS\",\"city\":\"Dandenong South\",\"countryIso3a\":\"AUS\",\"countryIso2a\":\"AU\",\"locationNonStemming\":\"Australia, VIC, Dandenong South\",\"coordinates\":\"-38.0124,145.20594\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Australia\",\"normalizedLocation\":\"Melbourne, Victoria, AUS\",\"location\":\"AU, VIC, Dandenong South\",\"region\":\"VIC\",\"buildingCodeList\":[\"XAU4\",\"XME6\",\"MEL1\",\"XAU2\",\"XME7\",\"EVT2\"],\"normalizedCityName\":\"Melbourne\"}","{\"normalizedStateName\":\"Victoria\",\"normalizedCountryCode\":\"AUS\",\"city\":\"Ravenhall\",\"countryIso3a\":\"AUS\",\"countryIso2a\":\"AU\",\"locationNonStemming\":\"Australia, VIC, Ravenhall\",\"coordinates\":\"-37.75304,144.72893\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Australia\",\"normalizedLocation\":\"Ravenhall, Victoria, AUS\",\"location\":\"AU, VIC, Ravenhall\",\"region\":\"VIC\",\"buildingCodeList\":[\"DVT4\",\"MEL5\"],\"normalizedCityName\":\"Ravenhall\"}","{\"normalizedStateName\":\"New South Wales\",\"normalizedCountryCode\":\"AUS\",\"city\":\"Horsley Park\",\"countryIso3a\":\"AUS\",\"countryIso2a\":\"AU\",\"locationNonStemming\":\"Australia, NSW, Horsley Park\",\"coordinates\":\"-33.84119,150.85396\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Australia\",\"normalizedLocation\":\"Sydney, New South Wales, AUS\",\"location\":\"AU, NSW, Horsley Park\",\"region\":\"NSW\",\"buildingCodeList\":[\"BWU4\"],\"normalizedCityName\":\"Sydney\"}","{\"normalizedStateName\":\"New South Wales\",\"normalizedCountryCode\":\"AUS\",\"city\":\"Moorebank\",\"countryIso3a\":\"AUS\",\"countryIso2a\":\"AU\",\"locationNonStemming\":\"Australia, NSW, Moorebank\",\"coordinates\":\"-33.95,150.92267\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Australia\",\"normalizedLocation\":\"Sydney, New South Wales, AUS\",\"location\":\"AU, NSW, Moorebank\",\"region\":\"NSW\",\"buildingCodeList\":[\"BWU1\"],\"normalizedCityName\":\"Sydney\"}"],"normalized_location":"Ravenhall, Victoria, AUS","optional_search_labels":["stores.lander-australia","international-stores.australia-whs"],"posted_date":"January 19, 2026","preferred_qualifications":"- Experience in occupational safety, health and wellbeing program management or in workplace health \u0026 safety (WHS) related field\u003cbr/\u003e- Strong communication, teamwork, analysis, judgment, and customer focus skills\u003cbr/\u003e\u003cbr/\u003eAcknowledgement of country:\u003cbr/\u003eIn the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.\u003cbr/\u003e\u003cbr/\u003eIDE statement:\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"VIC","title":"Sr. WHS Specialist - Health \u0026 Wellbeing","university_job":null,"updated_time":"35 minutes","url_next_step":"https://account.amazon.com/jobs/3161612/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 薬剤師免許の資格を有していること","business_category":"healthcare","city":"Higashi Osaka","company_name":"Amazon Japan G.K.","country_code":"JPN","description":"Amazonの医薬品専用物流センターにて薬剤師職を募集致します。\u003cbr/\u003e（このポジションの勤務地は大阪府東大阪市です。）\u003cbr/\u003e\u003cbr/\u003eAmazonで医薬品販売するために医薬品専用物流センターにおいて、医薬品販売するために必要な、お客様への情報提供、適正販売の判断、薬機法遵守した販売のサポート等をおこなっていただく業務となります。\u003cbr/\u003e\u003cbr/\u003e特に医薬品に関するプロジェクトにおいて、医薬品販売に関わる業務となります。主にウェブサイトを通じてお客様が医薬品を購入する際に、適正販売の判断を中心に担当していただきます。\u003cbr/\u003e薬機法遵守の上で適正販売を判断することで、お客様に販売できる商品のセレクションの拡大に貢献頂きます。\u003cbr/\u003e\u003cbr/\u003eこのポジションでは、お客様から医薬品に関する電話での問合せ業務もありますので、お客様と円滑にコミュニケーションする必要がございます。電話を通しお客様への正しい情報提供を行うことで、セルフメディケーションを推進してくことが重要となります。 \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eチームとしての職責\u003cbr/\u003e・ Customerへの正しい情報提供と適正販売を行う。\u003cbr/\u003e・ Amazon.co.jp上の医薬品商品説明に責任を持つ。\u003cbr/\u003e・ 医薬品、医療機器等の出荷業務を確認する。\u003cbr/\u003e・ 物流センターにおける安全および衛生に関する助言および安全衛生活動を実施する。\u003cbr/\u003e\u003cbr/\u003eMedical Specialistとしての職責\u003cbr/\u003e・ 薬機法関連法規の遵守\u003cbr/\u003e・ 問い合わせが合ったお客様の症状により、お客様の求めている医薬品の服用可否の判断を行う。\u003cbr/\u003e・ 医薬品を適正に使用するための服薬指導、情報提供を実施する。\u003cbr/\u003e・ 医薬品の購入者ごとに提供すべき情報の範囲を判断する。\u003cbr/\u003e・ 医薬品の購入者から、医薬品副作用の苦情や相談を受け付ける。\u003cbr/\u003e・ 一般用医薬品で対応できないと判断した場合、医療機関への受診を勧める。\u003cbr/\u003e・ コミュニケーションを通じ、副作用相談など、購入者のアフターケアを実施する。\u003cbr/\u003e・ 必要に応じてPMDAへの報告を実施する \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e業務内容\u003cbr/\u003e60% 医薬品に関するプロジェクトにおいて医薬品適正販売の判断\u003cbr/\u003e30% Customerとのコミュニケーション\u003cbr/\u003e10% CSチームとのCustomer対応に関するコミュニケーション\u003cbr/\u003e\u003cbr/\u003e勤務形態：シフト勤務になりますが、ご都合に合うシフトを複数ご用意しております。\u003cbr/\u003e面接時にご希望シフトを確認させていただきます。\u003cbr/\u003e※基本2か月前にシフト作成。勤務日希望、応相談\u003cbr/\u003e・1日5時間勤務　週4日　週20時間\u003cbr/\u003e・1日10時間勤務　週3日　週30時間 \u003cbr/\u003e・1日6時間勤務　週4日　週24時間 \u003cbr/\u003e・1日7時間勤務　週4日　週28時間 \u003cbr/\u003e・1日8時間勤務　週4日　週32時間 \u003cbr/\u003e・1日8時間勤務　週3日　週24時間 \u003cbr/\u003e・1日7時間勤務　週3日　週21時間 \u003cbr/\u003e\u003cbr/\u003e雇用形態：契約社員 / 時給 2,400円\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003e■フルフィルメントセンター部門のご紹介：フルフィルメントセンター (FC)\u003cbr/\u003e■職種：その他\u003cbr/\u003e\u003cbr/\u003e✓ Amazon は男女雇用機会均等法を順守しています。 人種、 出身国、性別、性的指向、障がい、年齢、その他の属性によって差別することなく、 平等に採用選考の機会を提供しています。障がいをお持ちの方は、\u003ca href=\"https://www.amazon.jobs/en/disability/jp/\"\u003eDisability Accommodations\u003c/a\u003e\u003cbr/\u003eをご覧ください。\u003cbr/\u003e✓ Amazon は地球上で最高の雇用主となることを目指しています。Amazonで働く社員の多様性と包括性についての取り組みをご覧ください。\u003ca href=\"https://www.aboutamazon.jp/news/working-at-amazon/?utm_source=hr\u0026utm_medium=owned\u0026utm_campaign=working2022\"\u003e Amazonで働くということ\u003c/a\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazonの医薬品専用物流センターにて薬剤師職を募集致します。（このポジションの勤務地は大阪府東大阪市です。）Amazonで医薬品販売するために医薬品専用物流センターにおいて、医薬品販売するために必要な、お客様への情報提供、適正販売の判断、薬機法遵守した販売のサポート等をおこなっていただく業務となります。特に医薬品に関するプロジェクトにおいて、医薬品販売に関わる業務となります。主にウェブサイトを通じてお客様が医薬品を購入する際に、適正販売の判断を中心に担当していただきます。薬機法遵守の上で適正販売を判断することで、お客様に販売できる商品のセレクションの拡大に貢献頂きます。このポジションでは、","display_distance":null,"id":"efce2917-dc5e-464c-ba7d-097f0ac2886e","id_icims":"3160127","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Catalog","job_function_id":null,"job_path":"/en/jobs/3160127/junior-medical-specialist","job_schedule_type":"part-time","location":"JP, 27, Higashi Osaka","locations":["{\"normalizedStateName\":\"Osaka\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Higashi Osaka\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, 27, Higashi Osaka\",\"coordinates\":\"34.6794,135.60101\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Higashiosaka-shi, Osaka, JPN\",\"location\":\"JP, 27, Higashi Osaka\",\"region\":\"27\",\"buildingCodeList\":[\"VJMY\"],\"normalizedCityName\":\"Higashiosaka-shi\"}"],"normalized_location":"Higashiosaka-shi, Osaka, JPN","optional_search_labels":[],"posted_date":"January 15, 2026","preferred_qualifications":"- 電話対応しながら、Webサイト内で調査や、記録をする程度のPC経験 - ドラッグストア・コールセンターでの経験\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"healthcare.team-pharmacy","source_system":"JobCreator","state":"27","title":"Junior Medical Specialist","university_job":null,"updated_time":"39 minutes","url_next_step":"https://account.amazon.com/jobs/3160127/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-pharmacy","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}