{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- High school or equivalent\u003cbr/\u003e- A minimum of 1 year in an Environmental Health \u0026 Safety (EHS) related field OR; A Bachelor’s degree in EHS-relevant background OR; 6 months experience performing in a safety-related role within Amazon\u003cbr/\u003e- Knowledge of OSHA regulations specifically 29 CFR 1910\u003cbr/\u003e- Experience using Microsoft Word and Excel in a professional capacity\u003cbr/\u003e- Experience maintaining confidentiality in matter involving security and/or personnel issues in the workplace","business_category":"fulfillment-and-operations","city":"Mount Joy","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. As a Workplace Health \u0026 Safety Specialist (WHSS), you'll be at the forefront of transforming workplace safety culture at one of the world's most innovative companies. Your expertise and dedication will directly protect employees, ensuring they return home safely to their families every day. You'll facilitate new approaches to safety, combining technology with human-centered solutions to create an environment where safety and productivity thrive together. This isn't just about maintaining safety standards – it's about revolutionizing how we think about and implement workplace safety, making a lasting impact on our people and operations. As your building's designated safety champion, you'll have the unique opportunity to build relationships, influence positive change, and help write the next chapter in Amazon's commitment to becoming Earth's Safest Place to Work.\u003cbr/\u003e\u003cbr/\u003eCore Impact Areas:\u003cbr/\u003eSafety Program Excellence \u0026 Implementation - Drive comprehensive safety programs through data-driven strategies. Lead daily safety audits, incident investigations, and risk assessments while implementing innovative solutions to prevent injuries. Deliver engaging safety training that resonates with associates and promotes a proactive safety culture. Champion continuous improvement initiatives that enhance workplace safety while maintaining operational efficiency.\u003cbr/\u003e\u003cbr/\u003eAssociate Advocacy \u0026 Cultural Leadership -  Serve as a trusted safety advisor and advocate for associate wellbeing, building strong partnerships across all levels of the organization. Foster a culture where safety is everyone's priority through effective communication, coaching, and positive reinforcement. Develop strong relationships with frontline associates and leadership to drive behavioral changes and ensure safety best practices become natural habits. Transform safety data into compelling narratives that influence positive change and drive engagement in safety initiatives.\u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements include: \u003cbr/\u003e- Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Stand/walk for up to 12 hours during shifts\u003cbr/\u003e- Work in an environment where the noise level varies \u003cbr/\u003e- Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e- Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e- Maintain effective care delivery in emergencies and assist emergency response at the site\u003cbr/\u003e\u003cbr/\u003eMust be available to work flexible shifts including days, nights and/or weekends. \u003cbr/\u003e\u003cbr/\u003eFor those that do not have an adult First Aid, CPR, AED certification from the American Heart Association or American Red Cross, must obtain within 3 weeks of start date.","department_cost_center":null,"description_short":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. As a Workplace","display_distance":null,"id":"45ab8384-650a-4ec5-bfb9-45ac773b6bd2","id_icims":"3136509","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3136509/ehs-specialist","job_schedule_type":"full-time","location":"US, PA, Mount Joy","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Mount Joy\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Mount Joy\",\"coordinates\":\"40.11073,-76.50774\",\"normalizedCountyName\":\"Lancaster\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Mt Joy, Pennsylvania, USA\",\"location\":\"US, PA, Mount Joy\",\"region\":\"PA\",\"buildingCodeList\":[\"DPL7\"],\"normalizedCityName\":\"Mt Joy\"}"],"normalized_location":"Mt Joy, Pennsylvania, USA","optional_search_labels":[],"posted_date":"December  3, 2025","preferred_qualifications":"- Bachelor’s degree or higher, preferably in a safety related field\u003cbr/\u003e- Strong communication, teamwork, analysis, judgment, and customer focus skills\u003cbr/\u003e- Experience leading and managing a team, ability to analyze accident data, new processes, and machinery for potential safety concerns, and conduct job hazard and job safety analyses\u003cbr/\u003e- Experience in emergency response and currently holds First Aid and CPR certificates\u003cbr/\u003e- Experience in workers compensation case management\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, PA, Mount Joy - 27.00 - 33.00 USD hourly","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"PA","title":"EHS Specialist ","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3136509/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or above in Engineering, Computer Science, or a related field\u003cbr/\u003e- Experience in delivering design solutions for projects of large scope and complexity\u003cbr/\u003e- Experience managing large teams across multiple locations and languages, or experience as an acting operations manager\u003cbr/\u003e- Experience in written and verbal communication skills to communicate with technical and non-technical audiences, including senior leadership\u003cbr/\u003e- 5+ years of analytical, quantitative, communication, and presentations experience\u003cbr/\u003e- 10+ years of relevant work in a data center or other critical environment experience","business_category":"aws","city":"Mansfield","company_name":"Amazon Data Services, Inc. - A19","country_code":"USA","description":"Amazon Web Services (AWS) is a fast-paced technology company and a leader in the world of data centers. AWS is growing rapidly, and we are looking for a Senior Manager to join our expanding Infrastructure Operations team.\u003cbr/\u003e\u003cbr/\u003eThe Senior Manager is one of our most senior management roles in the data center environment. In this role, you will be responsible for leading a large organization, managing department heads who own data center facility infrastructure including the operational availability of mechanical, electrical and plumbing systems. The pace, scale, and growth of Amazon’s data center platform will challenge you. Our uncompromisingly high standards as we continually seek to innovate on behalf of our customers will push you to new levels of creativity. At this level, Amazon is unique in that we seek experienced senior leaders who have evolved to be highly strategic in their approach to managing their business unit, yet understand how to lead large teams by example who will not hesitate to roll up their sleeves when tactical needs dictate it.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate for this role will understand data center IT infrastructure, data center facilities infrastructure and understand how the two coexist.\u003cbr/\u003e\u003cbr/\u003eIf you are passionate about Customer Experience, think and act globally and want to contribute to the operational excellence of Amazon.com data centers. This may be the challenge you’ve been looking for!\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software/hardware, and network engineers, supply chain specialists, security experts, engineering technicians, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eHiring, managing, and developing the operations management team including facilities managers, chief engineering managers and engineering operations technicians.\u003cbr/\u003e\u003cbr/\u003eAttainment of organizational performance goals and objectives relating to safety, security, availability, scaling, and efficiency in support of our data center operations.\u003cbr/\u003e\u003cbr/\u003ePlanning and executing the Infrastructure Operations component of new AWS data center build-outs, new colocation build-outs, AWS data center expansions, and colocation expansions, including the entire mechanical/electrical/plumbing infrastructure to facilitate the daily operation.\u003cbr/\u003e\u003cbr/\u003eOperation and maintenance of mechanical, electrical, and controls systems for Amazon data centers to include preventive maintenance, corrective maintenance, and change management.\u003cbr/\u003e\u003cbr/\u003eVendor management of colocation data center services providers, if required,  to meet or exceed contracted performance SLA’s.\u003cbr/\u003e\u003cbr/\u003eOversight of a preventative maintenance system and the adherence to schedules, evaluation and performance of our infrastructure supporting the data center operations.\u003cbr/\u003e\u003cbr/\u003eExperience in successful insourcing and/or outsourcing specific maintenance task balancing internal skillsets with frugality.\u003cbr/\u003e\u003cbr/\u003eSafety, security, and availability incident response, incident management, and incident resolution.\u003cbr/\u003e\u003cbr/\u003eContinuous improvement of operational processes, procedures, methods, and tools.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"Amazon Web Services (AWS) is a fast-paced technology company and a leader in the world of data centers. AWS is growing rapidly, and we are looking for a Senior Manager to join our expanding Infrastructure","display_distance":null,"id":"570e0ece-52c5-425e-b80a-f892dbdc9385","id_icims":"3139930","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3139930/data-center-cluster-operations-leader-mansfield-tx-amer-mlzs","job_schedule_type":"full-time","location":"US, TX, Mansfield","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Mansfield\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Mansfield\",\"coordinates\":\"32.56517,-97.14185\",\"normalizedCountyName\":\"Tarrant\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Mansfield, Texas, USA\",\"location\":\"US, TX, Mansfield\",\"region\":\"TX\",\"buildingCodeList\":[\"DFW70\"],\"normalizedCityName\":\"Mansfield\"}"],"normalized_location":"Mansfield, Texas, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"December  9, 2025","preferred_qualifications":"- Experience with continuous improvement methods such as Kaizen, Lean, DMAIC, etc.\u003cbr/\u003e- Knowledge of mechanical, electrical, and controls systems for critical infrastructures\u003cbr/\u003e- Experience in one or more IT infrastructure domains (storage, compute, networking, security, software development, systems administration, database engineering or administration, machine learning, cloud infrastructure, big data, DevOps, or other IT infrastructure domain)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Mansfield - 170,000.00 - 265,000.00 USD annually","primary_search_label":"aws.team-it-services","source_system":"JobCreator","state":"TX","title":"Data Center Cluster Operations Leader, Mansfield, TX, AMER MLZs","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3139930/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-it-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of management experience\u003cbr/\u003e- 2+ years’ experience in Clean Room Manufacturing environment.\u003cbr/\u003e- 2+ years’ experience in Environmental Test.\u003cbr/\u003e- 4+ Experience manufacturing in high traceability environment","business_category":"alexa-and-amazon-devices","city":"Kirkland","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is an initiative to increase global broadband access through a constellation of 3,236 satellites in low Earth orbit (LEO). Its mission is to bring fast, affordable broadband to unserved and underserved communities around the world. Amazon Leo will help close the digital divide by delivering fast, affordable broadband to a wide range of customers, including consumers, businesses, government agencies, and other organizations operating in places without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eAmazon Leo is seeking a Production Supervisor to join the Space Simulation Test Lab to support production on the Sunday - Wednesday 4:00pm-2:30am shift. This role will work closely with management to supervise a technician team that supports environmental test or satellite components as well as full vehicle testing. The individual will have strong leadership skills and be required to work on multiple projects in a fast-paced environment where communication and organization will be critical. This position will also utilize a variety of analytical tools as well as aid in creating a variety of laboratory procedures which they will help to draft and maintain. This will require supervisory duties as well as working as an operator in the test lab. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Test sub assemblies and vehicle in development and production environment. \u003cbr/\u003e- Supervise a team of technicians focused on early production and scaling output.\u003cbr/\u003e- Work with management to plan and coordinate daily tasks for technicians and activities of all operations with an ability to adapt to changing schedules and other dynamic priorities.\u003cbr/\u003e- Work cross-functionally with management, facilities, and supply chain to maintain operations and materials the Space Simulation Test Lab\u003cbr/\u003e- Ability to provide timely feedback on designs, processes, and custom equipment used in routine prototyping, fabrication, and characterization.\u003cbr/\u003e- Author, maintain, and train others to all relevant process documentation, including Assembly, Inspection, Testing/In-Process Characterization, and Packaging Procedures.\u003cbr/\u003e- Review and approve rework to ensure accuracy and enforce traceability.\u003cbr/\u003e- Comply with all Company Policies including Health, Safety, and Environmental Regulations, Personal Protective Equipment Requirements, and Standard Operating Procedures.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eA Production Supervisor in this role will play a valuable part in ensuring hardware is ready to be integrated on a satellite. You will have to be comfortable in a high paced environment and be able to multitask while still being able to produce high quality work. You will be leading a group of technicians expected to test and deliver hardware at a high rate while maintaining quality. You will be working to constantly improve processes that will make impacts on the efficiency of the lab. You will also play a key role in the career growth of technicians on your team.  ","department_cost_center":null,"description_short":"Amazon Leo is an initiative to increase global broadband access through a constellation of 3,236 satellites in low Earth orbit (LEO). Its mission is to bring fast, affordable broadband to unserved and","display_distance":null,"id":"11851718-836f-4b74-994d-57642792f83a","id_icims":"3152146","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Manufacturing","job_function_id":null,"job_path":"/en/jobs/3152146/production-supervisor-first-shift-night-fhn-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Kirkland","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Kirkland\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Kirkland\",\"coordinates\":\"47.67887,-122.2066\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Kirkland, Washington, USA\",\"location\":\"US, WA, Kirkland\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA133\"],\"normalizedCityName\":\"Kirkland\"}"],"normalized_location":"Kirkland, Washington, USA","optional_search_labels":["kuiper-mfg","devices-manufacturing","devices-services.kuiper-prod-ops"],"posted_date":"January  5, 2026","preferred_qualifications":"- B.S. in Business/Engineering, or relevant field.\u003cbr/\u003e- Experience with TVAC, Thermal, Vibration, Shock and Halt/Hass testing.\u003cbr/\u003e- Experience working with hand tools.\u003cbr/\u003e- Experience commissioning test equipment.\u003cbr/\u003e- Strong verbal and written communications skills with ability to effectively communicate with multiple teams.\u003cbr/\u003e- Conflict management and interpersonal skills.\u003cbr/\u003e- Ability to work in a fast-paced environment and multitask, comfortable with changing work environments and priorities.\u003cbr/\u003e- Proven ability to monitor own work product, ensuring quality, accuracy, and thoroughness; able to self-motivate and work independently or as part of a larger team.\u003cbr/\u003e- Manual dexterity to handle tools, and other equipment, of varying sizes.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Kirkland - 100,000.00 - 150,000.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Production Supervisor - First Shift Night (FHN), Amazon Leo ","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3152146/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Liberty","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for s motivated, customer-focused individual who wants to join our team as an Operations Manager. In this role, you will lead and develop a team of salaried and hourly talent and will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. To achieve this, managers are expected to provide their team with the tools needed for success while driving improvements in productivity and efficiency through data-driven decisions and analytical problem-solving. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e\u003cbr/\u003eOur Operations workflow has three major components: First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. This position falls with first mile – we are an XL fulfillment center which handles heavy/bulky products. Please note that while all workflows have slight building variations, one thing is constant: our vision and dedication to the customer.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e· Support, mentor, and motivate your salaried and hourly workforce\u003cbr/\u003e· Lead large-scope projects with site and regional impact\u003cbr/\u003e· Build and execute productivity plans through forecast reviews, determining productivity requirements, and partnering with other Leaders to load balance\u003cbr/\u003e· Manage safety, quality, productivity, and customer delivery promises\u003cbr/\u003e· Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e· Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e· Stand/walk for up to 12 hours during shifts\u003cbr/\u003e· Work in an environment where the noise level varies and can be loud\u003cbr/\u003e· Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e· Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003eOur fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Operations Managers based on location preference and the business’ current openings.\u003cbr/\u003eTo learn more about Amazon’s operations and see how our fulfillment centers in the U.S. and Canada work, watch a short video or take part in a live virtual tour.\u003cbr/\u003eVideo with subtitles: https://www.amazon.com/videotour\u003cbr/\u003eLive virtual tours: https://www.amazon.com/virtualtours\u003cbr/\u003eBasic qualifications\u003cbr/\u003e\u003cbr/\u003e- 3+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003ePreferred qualifications\u003cbr/\u003e\u003cbr/\u003e- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $81,900/year in our lowest geographic market up to $150,100/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e· Support, mentor, and motivate your salaried and hourly workforce\u003cbr/\u003e· Lead large-scope projects with site and regional impact\u003cbr/\u003e· Build and execute productivity plans through forecast reviews, determining productivity requirements, and partnering with other Leaders to load balance\u003cbr/\u003e· Manage safety, quality, productivity, and customer delivery promises\u003cbr/\u003e· Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e· Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e· Stand/walk for up to 12 hours during shifts\u003cbr/\u003e· Work in an environment where the noise level varies and can be loud\u003cbr/\u003e· Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e· Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003eOur fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Operations Managers based on location preference and the business’ current openings.\u003cbr/\u003eTo learn more about Amazon’s operations and see how our fulfillment centers in the U.S. and Canada work, watch a short video or take part in a live virtual tour.\u003cbr/\u003eVideo with subtitles: https://www.amazon.com/videotour\u003cbr/\u003eLive virtual tours: https://www.amazon.com/virtualtours\u003cbr/\u003eBasic qualifications\u003cbr/\u003e\u003cbr/\u003e    3+ years of employee and performance management experience\u003cbr/\u003e    Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e    Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","department_cost_center":null,"description_short":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for s motivated, customer-focused individual who wants to join our team as an Operations","display_distance":null,"id":"f66399e5-be47-4f79-bbfa-bf38f10fd4cd","id_icims":"3139926","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3139926/operations-manager-amxl-fulfillment-field-fixed-mci3","job_schedule_type":"full-time","location":"US, MO, Liberty","locations":["{\"normalizedStateName\":\"Missouri\",\"normalizedCountryCode\":\"USA\",\"city\":\"Liberty\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MO, Liberty\",\"coordinates\":\"39.24538,-94.41942\",\"normalizedCountyName\":\"Clay\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Liberty, Missouri, USA\",\"location\":\"US, MO, Liberty\",\"region\":\"MO\",\"buildingCodeList\":[\"MCI3\"],\"normalizedCityName\":\"Liberty\"}"],"normalized_location":"Liberty, Missouri, USA","optional_search_labels":[],"posted_date":"December  9, 2025","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $81,900/year in our lowest geographic market up to $150,100/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"fulfillment-ops.team-amxl","source_system":"JobCreator","state":"MO","title":"Operations Manager, AMXL Fulfillment- Field Fixed, MCI3","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3139926/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amxl","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of industry work experience\u003cbr/\u003e- High school or equivalent\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- 1+ years experience with MRP/ERP systems","business_category":"alexa-and-amazon-devices","city":"Kirkland","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon Leo will serve people and organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eWe are hiring a Production Coordinator for our Back-half day shift (Wed-Sat 6am-4:30pm) that will streamline the movement of parts between departments, areas, processes, and systems and be a creator of the systems necessary to minimize overhead, reduce non-value-add processes, improve on-time delivery of product to downstream customers, and invent methods for flexible but efficient production.\u003cbr/\u003e\u003cbr/\u003eThis will require a knowledgeable person of many aspects of aerospace production, including traceability, demand planning, flexible but efficient change management, broad aerospace assembly, testing, and handling requirements, application of six sigma and lean methodologies while enabling faster design changes and improvements and reducing the need for reviews, approvals, and manual interactions.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Work cross functionally to develop and improve production scheduling tools and WIP tracking.\u003cbr/\u003e- Develop processes/strategies to handle work order material discrepancies within production cells.\u003cbr/\u003e- Coordinate the schedule, plan, and initial staging of material/kits to all vital areas of production and test.\u003cbr/\u003e- Monitor, track, and move parts as required through the production flow to ensure timely delivery to next production location.\u003cbr/\u003e- Coordinate physical movement of parts from warehouse through production resources.\u003cbr/\u003e- Ensure parts are handled and protected properly.\u003cbr/\u003e- Work with the planning to resolve immediate floor shortages on work orders.\u003cbr/\u003e- Work with planning and production personnel to maintain floor stock inventory as required\u003cbr/\u003e- Move parts electronically through the MES system at transaction points\u003cbr/\u003e- Work with production personnel to ensure schedule/metric goals are understood.\u003cbr/\u003e- Support logistics process through innovative staging of workflow as required.\u003cbr/\u003e- Support management of material certifications as required – prevent use of un-certified materials.\u003cbr/\u003e- Support production and inventory personnel with “return to stock” and inventory purge actions.\u003cbr/\u003e- Support assigned production cells with work order management activities as required.\u003cbr/\u003e- Communicate part status and estimated completion dates to leadership weekly.\u003cbr/\u003e- Assist production leadership and project teams with action item updates as required.\u003cbr/\u003e- Develop and maintain reports to highlight needs, deliverables and constraints as required for internal and customer use.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThe Production Coordinator role is critical to streamlining part movement throughout the factory. This includes the monitoring of the factory operation and addressing logistical problems inside the factory.\u003cbr/\u003e\u003cbr/\u003eThis means regularly interacting with warehouse and logistics teams when parts are missing, late, or blocked, both physically and electronically, and then permanently solving the root cause.\u003cbr/\u003e\u003cbr/\u003eThis includes interfacing with the test lab for staging/queuing of products with specific focus on improved flexibility of operation while minimizing non-value add communication and operation.\u003cbr/\u003e\u003cbr/\u003eIt also entails constantly reducing \"red tape\" and overhead needed to maintain and improve quality, requiring work with automation, quality, enterprise technology, and manufacturing teams.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThis is a fast-paced, intellectually challenging position, and you’ll work with leaders in multiple technology areas. You’ll have relentlessly high standards for yourself and everyone you work with, and you’ll be constantly looking for ways to remove non-value-add operations, reduce down-time, improve quality of the products, and reduce lead-time of builds and tests. We want individuals who are ready for this challenge and want to reach beyond what is possible today.","department_cost_center":null,"description_short":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to","display_distance":null,"id":"431158e8-7bfb-41c6-8c11-ede8e9b50157","id_icims":"3161012","is_intern":null,"is_manager":null,"job_category":"Buying, Planning, \u0026 Instock Management","job_family":"Program Management","job_function_id":null,"job_path":"/en/jobs/3161012/production-coordinator-1st-shift-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Kirkland","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Kirkland\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Kirkland\",\"coordinates\":\"47.67887,-122.2066\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Kirkland, Washington, USA\",\"location\":\"US, WA, Kirkland\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA133\"],\"normalizedCityName\":\"Kirkland\"}"],"normalized_location":"Kirkland, Washington, USA","optional_search_labels":["kuiper-mfg","military-spouse","military-operations","military-tech","military-na","military","devices-manufacturing","devices-services.kuiper-prod-ops"],"posted_date":"January 16, 2026","preferred_qualifications":"- 5+ years of manufacturing, process, industrial engineering experience\u003cbr/\u003e- Bachelor's degree, or BS degree\u003cbr/\u003e- Experience with high-volume, high-velocity, large-scale file management (workflow orchestration, file-movement, permission management, etc.)\u003cbr/\u003e- Experience managing inventory in warehousing, retail or distribution setting\u003cbr/\u003e- 4+ years of hardware development, test lab, space/aerospace maintenance or hands-on engineering environment experience\u003cbr/\u003e- Experience with SQL and data visualization tools such as Tableau\u003cbr/\u003e- Experience with computer skills, including proficiency in MS Office (Word, Excel, PowerPoint)\u003cbr/\u003e- APICS certification.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Kirkland - 80,200.00 - 97,400.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Production Coordinator - 1st Shift, Amazon Leo","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3161012/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of tax, finance or a related analytical field experience\u003cbr/\u003e- Bachelor's degree in engineering, statistics or business, or Bachelor's degree and 5+ years of quantitative role (engineering, process re-engineering, quality assurance) experience","business_category":"finance","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The Sustainability Finance team is looking for a Finance Manager to lead the finance support for the Global Sustainability Waste partner strategies. The role will support a growing team across North America, EU, and globally. \u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will be a well-rounded athlete willing to go beyond their core responsibilities, nimbly overcome barriers, and deliver business results. The person must be a constant learner, knowledgeable of industry trends, and effective at partnering with business leadership to accomplish goals. This Finance Manager must be a skilled communicator effective at working through formal and informal channels to set and drive strategy with a proven track record working effectively across geographically dispersed cross-functional teams. The ideal candidate will be a trusted advisor that steadily delivers commitments and is able to influence senior executives to facilitate the achievement of their business partners’ objectives. \u003cbr/\u003e\u003cbr/\u003eThe Finance Manager will play a critical role in the Sustainability team's Waste initiatives and as a role model for controllership. This individual will also have experience in designing and enforcing policies and processes that will protect and enhance the integrity of Amazon’s financial records and increase organizational efficiency. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•Managing and reporting business performance, including goal development and tracking\u003cbr/\u003e•Developing rhythm of business and strategy documents (i.e. Annual, 3-year Operating Plans, Long range vision) \u003cbr/\u003e•Managing operating expenses including COP and headcount\u003cbr/\u003e•Supporting assurance/audit engagements and contract negotiation\u003cbr/\u003e•Driving investment appraisal based on NPV and tracking FCF\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Sustainability Finance Manager, you will serve as leader for Amazon’s Waste global business spanning across multiple geographies. You will partner with key business leaders to identify opportunities to drive growth, productivity, and controllership for Waste. This role has P\u0026L and Balance Sheet responsibility for owned initiatives globally, and is a critical partner to the Sustainability Leadership team.","department_cost_center":null,"description_short":"The Sustainability Finance team is looking for a Finance Manager to lead the finance support for the Global Sustainability Waste partner strategies. The role will support a growing team across North America,","display_distance":null,"id":"bc9228d8-a8f8-4834-a17e-a1d6f246b7dd","id_icims":"3164019","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/Planning","job_function_id":null,"job_path":"/en/jobs/3164019/finance-manager-worldwide-sustainability-finance","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA41\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS19\"],\"normalizedCityName\":\"Arlington\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"January 22, 2026","preferred_qualifications":"- 6+ years of identifying incomplete or inaccurate data, identifying the root cause and creating/implementing an escalation plan experience\u003cbr/\u003e- 6+ years of solving complex business challenges by delivering accurate and timely financial models, analysis, and recommendations that have a proven impact on business (e.g., financial savings, operational improvements, or customer benefits) experience\u003cbr/\u003e- MBA, or CPA\u003cbr/\u003e- Knowledge of SQL/ETL\u003cbr/\u003e- Experience working with large-scale data mining and reporting tools (examples: SQL, MS Access, Essbase, Cognos) and other financial systems (examples: Oracle, SAP, Lawson, JD Edwards)\u003cbr/\u003e- Experience delivering forecasting, budgeting, and variance analysis, and data interpretation of results\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Arlington - 95,400.00 - 163,200.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 95,400.00 - 163,200.00 USD annually","primary_search_label":"finance.team-aws","source_system":"JobCreator","state":"WA","title":"Finance Manager, Worldwide Sustainability Finance","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3164019/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-aws","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of tax, finance or a related analytical field experience\u003cbr/\u003e- Bachelor's degree in finance, accounting, business, economics, or a related analytical field (e.g., engineering, math, computer science)","business_category":"finance","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The Sustainability Finance team is looking for a Senior Financial Analyst to lead finance support for Amazon’s sustainability regulatory disclosure readiness and Climate Risk assessments. This will include working closely with stakeholders across the central Sustainability organization to track in-force regulations in markets where Amazon operates, synthesizing insights extracted from large and complex data, calculating metrics relevant to regulations including owning Amazon's climate risk modeling, presenting results to VP-level executives, and working with 3rd party assurance partners. This role requires a high degree of ownership and ability to work independently.\u003cbr/\u003e\u003cbr/\u003eBeyond these core responsibilities, this individual will have the opportunity to influence strategic decision-making, build and establish workstreams, and provide insights cross-organizationally that drive meaningful financial and sustainability value. This will require the ideal candidate to leverage  their expertise in areas like financial modeling, accounting, project management, and executive-level communication skills.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• End to end ownership of sustainability financial disclosure metrics for Amazon\u003cbr/\u003e• Coordinate with business partners to ensure preparedness for disclosure for all required sustainability regulations\u003cbr/\u003e • Manage  Amazon's Physical Climate Risk Model, which estimates financial risks and opportunities from changing climatic patterns\u003cbr/\u003e• Socialize sustainability financial disclosures with internal stakeholders to ensure alignment with finance inputs and outputs\u003cbr/\u003e• Establish mechanisms and processes that are repeatable and scalable to gain efficiencies as Amazon's regulatory reporting requirements increase\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Sustainability Finance team supports the management of Amazon’s social and environmental impact globally and partners to drive solutions that enable our customers and our business to become more sustainable. With the Climate Pledge, Amazon publicly committed to measure and report greenhouse gas emissions and to achieve net-zero emissions in 2040 by physically de-carbonizing its business activities and neutralize remaining residual emissions. Executing this plan is a complex strategic and financial undertaking that requires thorough and careful financial consideration.","department_cost_center":null,"description_short":"The Sustainability Finance team is looking for a Senior Financial Analyst to lead finance support for Amazon’s sustainability regulatory disclosure readiness and Climate Risk assessments. This will include","display_distance":null,"id":"66b19455-0d4f-4b6e-8298-d944e76c4316","id_icims":"3123132","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/Planning","job_function_id":null,"job_path":"/en/jobs/3123132/senior-financial-analyst-sustainability-finance","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA41\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS17\"],\"normalizedCityName\":\"Arlington\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"November  7, 2025","preferred_qualifications":"- Experience in financial modeling, P\u0026L management or analysis\u003cbr/\u003e- Experience applying key financial performance indicators (KPIs) to analyses\u003cbr/\u003e- Experience in sales, business, or corporate strategy\u003cbr/\u003e- Knowledge of voluntary and compliance carbon credit markets\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Arlington - 66,900.00 - 117,100.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 82,700.00 - 117,100.00 USD annually","primary_search_label":"finance.team-aws","source_system":"JobCreator","state":"WA","title":"Senior Financial Analyst, Sustainability Finance","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3123132/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-aws","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Can lift and rack equipment up to 40 pounds\u003cbr/\u003e- High school or equivalent diploma\u003cbr/\u003e- Experience with network hardware: copper and optical fiber cabling, switches, routers","business_category":"aws","city":"Berwick","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003eAmazon is looking for an Infrastructure Delivery Installation Technician to join our growing team within infrastructure operations. You will work with minimum supervision in a dynamic environment to drive the stability and sustainability of our next-generation networks and assist in the development of innovative ways to automate and scale our network.\u003cbr/\u003eTo be successful in this role you should possess technical aptitude, written and oral communications skills and the ability to deal effectively with people in a wide variety of situations. In addition, you must possess strong analytical skills with demonstrated problem solving ability. You will be able to leverage your experience exercising high levels of initiative, judgment, and diplomacy.\u003cbr/\u003eAdditionally, all candidates should be willing to work both independently and with a team. Work prioritization, organizational skills, effective communication, and the ability to react quickly are critical to being successful.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eAll physical requirements are expected with reasonable accommodations:\u003cbr/\u003e• Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds\u003cbr/\u003e• Ability to work in an environment that operates 24/7 with an ability to participate in primary responder rotation and provide after-hours support as needed\u003cbr/\u003e• Working in cramped and/or elevated and/or noisy environments\u003cbr/\u003e• Bending, lifting, stretching, reaching, standing and walking for up to 8+ hours a day\u003cbr/\u003e• Ascending and descending ladders, stairs, and gangways safely and without limitation\u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon is not able to provide sponsorship now or in the future for these positions. Eligible candidates must have work authorization without employer intervention to be considered.\u003cbr/\u003eNOTE: If applying for positions in Oregon (OR) and Ohio (OH), these sites are within AWS GovCloud region. Effective May 15, 2017, logical access to the AWS GovCloud region will be restricted to Amazon employees who are U.S. Citizens (GovCloud may NOT be accessed from outside of the United States).\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Moving and implementing large enterprise equipment\u003cbr/\u003e• Installing Fiber and Copper cabling and patching cabling between equipment\u003cbr/\u003e• Ensuring proper safety and security standards are maintained during cabling and rack installation,\u003cbr/\u003e• Following well established hardware installation procedures and break-fix activities\u003cbr/\u003e• Safely using material handling tools and equipment\u003cbr/\u003eTraveling within and outside of regional work area is required.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eA network cabling technician installs, terminates, and tests network cables. Following detailed plans and maintaining strict safety and quality standards. Their day involves working in various environments, managing tools and documentation, troubleshooting issues, and ensuring clean, well-organized cable infrastructure\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"06463330-a1f7-4355-b2fd-98a9eeab056c","id_icims":"3151431","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3151431/cable-installation-technician-infra-gnd-gnd-cabling-team","job_schedule_type":"full-time","location":"US, PA, Berwick","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Berwick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Berwick\",\"coordinates\":\"41.05089,-76.24352\",\"normalizedCountyName\":\"Columbia\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Berwick, Pennsylvania, USA\",\"location\":\"US, PA, Berwick\",\"region\":\"PA\",\"buildingCodeList\":[\"PHL122\",\"PHL125\",\"PHL108\",\"PHL99\",\"PHL114\",\"PHL111\",\"PHL119\",\"PHL103\",\"PHL901\",\"PHL100\",\"PHL123\",\"PHL120\",\"PHL126\",\"PHL107\",\"PHL118\",\"PHL115\",\"PHL101\",\"PHL104\",\"PHL112\",\"PHL900\",\"PHL106\",\"PHL109\",\"PHL110\",\"PHL124\",\"PHL116\",\"PHL121\",\"PHL113\",\"PHL117\",\"PHL102\",\"PHL105\"],\"normalizedCityName\":\"Berwick\"}"],"normalized_location":"Berwick, Pennsylvania, USA","optional_search_labels":["aws.team-ais"],"posted_date":"January  3, 2026","preferred_qualifications":"- Experience with fiber optic and copper cabling standards, testing equipment \u0026 troubleshooting methodologies\u003cbr/\u003e- Experience with cabling infrastructure best practices and methodologies\u003cbr/\u003e- Experience managing medium to large-scale projects\u003cbr/\u003e- • Industry standard certifications (BICSI, CompTIA, CCENT, Network+)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, PA, Berwick - 27.00 - 47.00 USD hourly","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"PA","title":"Cable Installation Technician, Infra - GND, GND Cabling Team","university_job":null,"updated_time":"19 minutes","url_next_step":"https://account.amazon.com/jobs/3151431/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 1+ years of software development engineer or related occupational experience\u003cbr/\u003e- 1+ years of designing and developing large-scale, multi-tiered, multi-threaded, embedded or distributed software applications, tools, systems, and services using: C#, C++, Java, or Perl experience\u003cbr/\u003e- 1+ years of Object Oriented Design experience\u003cbr/\u003e- Bachelor's degree or foreign equivalent in Computer Science, Engineering, Mathematics, or a related field\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"aws","city":"New York","company_name":"Amazon.com Services LLC","country_code":"USA","description":"As part of the AWS Applied AI Solutions organization, we have a vision to provide business applications, leveraging Amazon’s unique experience and expertise, that are used by millions of companies worldwide to manage day-to-day operations. We will accomplish this by accelerating our customers’ businesses through delivery of intuitive and differentiated technology solutions that solve enduring business challenges. We blend vision with curiosity and Amazon’s real-world experience to build opinionated, turnkey solutions. Where customers prefer to buy over build, we become their trusted partner with solutions that are no-brainers to buy and easy to use. \u003cbr/\u003e\u003cbr/\u003eWe’re on the lookout for the curious, those who think big and want to define the world of tomorrow. At Amazon, you will grow into the high impact person you know you’re ready to be. Every day will be filled with exciting new challenges, developing new skills, and achieving personal growth. How often can you say that your work changes the world? At Amazon, you’ll say it often. Join us and define tomorrow.\u003cbr/\u003e\u003cbr/\u003eDo you want to solve business challenges through innovative technology? Do you enjoy working on  scalable services technology in a team environment? Do you like working on industry-defining projects that move the needle?\u003cbr/\u003eAt Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. The focus we have on our customers is why we are one of the world’s most beloved brands – customer obsession is part of our company DNA. Our Software Development Engineers (SDEs) use  technology to solve complex problems and get to see the impact of their work first-hand.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tCollaborate with experienced cross-disciplinary Amazonians to conceive, design, and bring innovative products and services to market.\u003cbr/\u003e•\tDesign and build innovative technologies in a large distributed computing environment and help lead fundamental changes in the industry.\u003cbr/\u003e•\tCreate solutions to run predictions on distributed systems with exposure to innovative technologies at incredible scale and speed.\u003cbr/\u003e•\tBuild distributed storage, index, and query systems that are scalable, fault-tolerant, low cost, and easy to manage/use.\u003cbr/\u003e•\tDesign and code the right solutions starting with broadly defined problems.\u003cbr/\u003e•\tWork in an agile environment to deliver high-quality software.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThe challenges SDEs solve for at Amazon are big and influence millions of customers, sellers, and products around the world. We are looking for individuals who are passionate about creating new products, features, and services from scratch while managing ambiguity and the pace of a company where development cycles are measured in weeks, not years.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e \u003cbr/\u003eWhy AWS \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e \u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. ","department_cost_center":null,"description_short":"As part of the AWS Applied AI Solutions organization, we have a vision to provide business applications, leveraging Amazon’s unique experience and expertise, that are used by millions of companies worldwide","display_distance":null,"id":"b06fc005-2851-4138-a981-28f9d7418caf","id_icims":"3171036","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3171036/software-dev-engineer-amazon-connect-aws","job_schedule_type":"full-time","location":"US, NY, New York","locations":["{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK14\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"New York, New York, USA","optional_search_labels":["aws.team-connect"],"posted_date":"January 30, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, New York - 158,100.00 - 213,800.00 USD annually","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"NY","title":"Software Dev Engineer, Amazon Connect (AWS)","university_job":null,"updated_time":"22 minutes","url_next_step":"https://account.amazon.com/jobs/3171036/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Electrical Engineering, Mechanical Engineering, or a related field, or 5+ years of relevant discipline work experience\u003cbr/\u003e- 3+ years of relevant work in a data center or other critical environment experience\u003cbr/\u003e- 2+ years of vendor management experience\u003cbr/\u003e- 2+ years of construction or project management experience","business_category":"aws","city":"Atlanta","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"As part of the global controls team, you will work with highly motivated experts and innovators in the data center industry. You will be responsible for troubleshooting, project management, and maintaining the building management system (BMS) and electrical power monitoring system (EPMS). Using Amazon leadership principles, you will develop new processes and standards while innovating in the controls space. AWS Data centers have multiple components such as generators, uninterruptable power sources, diesel generators, electrical switchgear, power distribution units, variable frequency drives, automatic/static transfer switches, chillers [air-cooled and water-cooled], pumps, cooling towers, heat exchangers, CRAHs, air economizers, etc. All these components have local control systems that interact with each other via open and/or proprietary communications protocols. The BMS is the primary method of control of all mechanical systems within a data center. The EPMS is the primary method of monitoring all electrical systems within a data center.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tTrain and assist internal customers and stakeholders with the creation, design, configuration, validation, installation, commissioning and operation of BMS and EPMS systems.\u003cbr/\u003e•\tProvide technical assistance and support to operations during life cycle of the data center. Review results and action items from the quarterly maintenance for BMS and EPMS and take actions to get them resolved. \u003cbr/\u003e•\tDevelop BMS \u0026 EPMS projects scope of work, schedule, budget, and level of efforts (LOE) to projects requested by customers and stakeholders. \u003cbr/\u003e•\tManage scope, schedule, finance and execution of BMS and EPMS improvement projects in AWS data centers. \u003cbr/\u003e•\tAssist in procurement related activities including request for quotation/proposals, responding to request for information, review of vendors proposal and issuance of purchase orders. \u003cbr/\u003e•\tParticipate in AWS global on-call schedule to provide immediate BMS and EPMS technical support to in- service data centers. Attend project related meetings, coordinate with project leaders and regularly report status to Controls and stakeholders management. \u003cbr/\u003e•\tSupport Controls projects related commissioning activities in the data centers. \u003cbr/\u003e•\tReview, implement, troubleshoot and iterate on the controls sequence of operation (SOO) and provide necessary feedback to the design team. \u003cbr/\u003e•\tDevelop and modify controls logic programming and graphical user interfaces. \u003cbr/\u003e•\tManage multiple stakeholder deliverables, requirements and navigate challenging situations. \u003cbr/\u003e•\tFinancially manage BMS and EPMS service contracts. \u003cbr/\u003e•\tFrequently visit assigned in-operation data centers locally and throughout the AMER region to troubleshoot, meet customers, supervise vendor’s work to ensure compliance with the scope, design, SOO and applicable local codes.\u003cbr/\u003e•\tTravel required: 50% to 75% travel to construction job sites across United States, Canada, and Latin American countries to support construction and data center product delivery. Must have valid passport, be able to obtain visas, and be able to meet travel, entry, and re-entry requirements for travel between the United States and destination countries.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"As part of the global controls team, you will work with highly motivated experts and innovators in the data center industry. You will be responsible for troubleshooting, project management, and maintaining","display_distance":null,"id":"382ba988-1692-47d7-9b95-bfe6a0b08648","id_icims":"3154512","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3154512/dc-controls-engineer-colo-dcc-communities","job_schedule_type":"full-time","location":"US, GA, Atlanta","locations":["{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Atlanta\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Atlanta\",\"coordinates\":\"33.74831,-84.39111\",\"normalizedCountyName\":\"Fulton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Atlanta, Georgia, USA\",\"location\":\"US, GA, Atlanta\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL11\"],\"normalizedCityName\":\"Atlanta\"}"],"normalized_location":"Atlanta, Georgia, USA","optional_search_labels":[],"posted_date":"January  7, 2026","preferred_qualifications":"- Master's degree in Electrical Engineering, Mechanical Engineering, or a related field\u003cbr/\u003e- 4+ years of military experience\u003cbr/\u003e- Experience with Industrial control systems, both hardware and software\u003cbr/\u003e- 1+ years of Amazon experience, or experience with AWS services or other cloud offerings\u003cbr/\u003e- Experience in Industrial networking and communications\u003cbr/\u003e- Experience managing competing priorities across a wide range of stakeholders\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, GA, Atlanta - 96,000.00 - 166,300.00 USD annually","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"GA","title":"DC Controls Engineer - Colo, DCC Communities","university_job":null,"updated_time":"25 minutes","url_next_step":"https://account.amazon.com/jobs/3154512/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}