{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Technical (Military/Trade School) training or 2+ years’ of equivalent experience in a relevant industry (for example: electrical or mechanical)\u003cbr/\u003e- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products (including Excel, Word and PowerPoint)","business_category":"aws","city":"Berwick","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support  the operations of some of the world’s most powerful data centers. Our Data Center Engineering Operations team maintain and operate our  critical infrastructure systems so that they are prepared to stand up  against any situation.  \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAWS has the world’s largest cloud computing portfolio. As an  Amazonian you will work in some of the most sophisticated, safe, and  secure data centers in the world. Our Engineering Operations Technicians  I (EOT’s) help keep them that way by working with the brightest minds  from around the globe to help test and implement the newest technology  and work practices to meet the demands of a changing market. \u003cbr/\u003e\u003cbr/\u003eWe have a passion for learning and evolving, it’s how we have helped  define ourselves as leaders in the industry.  Let’s work hard, have  fun, and make history! \u003cbr/\u003e   \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003e - Tasked with driving innovation while reducing operational costs in the facilities. \u003cbr/\u003e - Drive projects with moderate complexity.\u003cbr/\u003e - Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA).\u003cbr/\u003e - Perform rack installs, rack decommissioning, operational readings and facility management.\u003cbr/\u003e - Provide key performance indicators to senior engineers. \u003cbr/\u003e - Responsible for the on-site management of contractors,  sub-contractors and vendors, ensuring that all work performed is in  accordance with established practices, procedures \u0026 local  legislation. \u003cbr/\u003e - Performance and oversight of maintenance and operations on all  electrical, mechanical, and fire/life safety equipment within the data  center.\u003cbr/\u003e - Ensure all safety procedures are adhered to while performing work.\u003cbr/\u003e - Perform basic support concepts such as ticketing systems, root  cause analysis, change management creation, writing procedures and  building management systems.\u003cbr/\u003e - Work schedule changes depending on specific site needs. Shifts  can be up to 12-hours and may rotate on a predefined schedule. Some  locations have on-call rotations.\u003cbr/\u003e - Maintain data center critical infrastructure equipment ensuring  99.999% up-time of the world's largest cloud computing portfolio.\u003cbr/\u003e - Role may support more than one location/site. \u003cbr/\u003e - Walk job sites in uneven terrain. Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e - Regularly lift and/or move up to 39 pounds unassisted and participate in group lifts for 40+ pounds\u003cbr/\u003e - Regularly walk, use hands and fingers, handle or feel, reach  with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist,  bend, work above shoulders, grasp, carry, push and pull\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e \u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e","department_cost_center":null,"description_short":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support  the operations of some of the world’s most powerful data centers.","display_distance":null,"id":"53426385-8bb3-4382-883a-d6fc474bebf7","id_icims":"3095370","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3095370/engineering-operations-technician-data-center-engg-ops","job_schedule_type":"full-time","location":"US, PA, Berwick","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Berwick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Berwick\",\"coordinates\":\"41.05089,-76.24352\",\"normalizedCountyName\":\"Columbia\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Berwick, Pennsylvania, USA\",\"location\":\"US, PA, Berwick\",\"region\":\"PA\",\"buildingCodeList\":[\"PHL101\"],\"normalizedCityName\":\"Berwick\"}"],"normalized_location":"Berwick, Pennsylvania, USA","optional_search_labels":[],"posted_date":"October  7, 2025","preferred_qualifications":"- 2+ years of Data Center Engineering experience\u003cbr/\u003e- Associates or Bachelor’s Degree\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, PA, Berwick - 31.00 - 55.00 USD hourly","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"PA","title":"Engineering Operations Technician ,  Data Center Engg Ops","university_job":null,"updated_time":"25 minutes","url_next_step":"https://account.amazon.com/jobs/3095370/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- 1+ year of experience in any of the following or similar technical or vocational roles: Computer Hardware Repair, Infrastructure Cabling, Network Deployment, Data Center Operations","business_category":"aws","city":"Avondale","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Transform network infrastructure by joining our dynamic team! You'll be at the forefront of developing innovative solutions that drive network stability and scalability, using your technical expertise to create automated systems that power global technological advancement. \u003cbr/\u003e \u003cbr/\u003eNetwork Install Technicians will collaborate with cross-functional teams, troubleshoot complex technical scenarios, and implement strategic solutions that keep our network running seamlessly. Expect to engage in hands-on technical work that requires creativity, precision, and a passion for technological innovation. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Moving and implementing large enterprise equipment \u003cbr/\u003e- Installing Fiber and Copper cabling and patching cabling between equipment \u003cbr/\u003e- Ensuring proper safety and security standards are maintained during cabling and rack installation, \u003cbr/\u003e- Following well established hardware installation procedures and break-fix activities \u003cbr/\u003e- Safely using material handling tools and equipment \u003cbr/\u003e- Traveling within and outside of the regional work area is required. You will be responsible for having a reliable personal vehicle and valid driver's license to travel within the regional work area, as company transportation will not be provided \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e\u003cbr/\u003e- Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds \u003cbr/\u003e- Ability to work in an environment that operates 24/7 with an ability to participate in primary responder rotation and provide after-hours support as needed \u003cbr/\u003e- Working in cramped and/or elevated and/or noisy environments \u003cbr/\u003e- Bending, lifting, stretching, reaching, standing and walking for up to 8+ hours a day \u003cbr/\u003e- Ascending and descending ladders, stairs, and gangways safely and without limitation \u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Transform network infrastructure by joining our dynamic team! You'll be at the forefront of developing innovative solutions that drive network stability and scalability, using your technical expertise","display_distance":null,"id":"3526c28c-429a-4969-843a-c0d54bd01490","id_icims":"3153496","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3153496/network-install-technician-dcc-communities","job_schedule_type":"full-time","location":"US, AZ, Avondale","locations":["{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Avondale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Avondale\",\"coordinates\":\"33.44096,-112.34966\",\"normalizedCountyName\":\"Maricopa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Avondale, Arizona, USA\",\"location\":\"US, AZ, Avondale\",\"region\":\"AZ\",\"buildingCodeList\":[\"PHX69\"],\"normalizedCityName\":\"Avondale\"}"],"normalized_location":"Avondale, Arizona, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"January  6, 2026","preferred_qualifications":"- Knowledge of network cabling, optic types, and test equipment\u003cbr/\u003e- Industry standard certifications (CompTIA, CCENT, Network+)\u003cbr/\u003e- Experience with cabling infrastructure best practices and methodologies\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, AZ, Avondale - 27.00 - 47.00 USD hourly","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"AZ","title":"Network Install Technician, DCC Communities ","university_job":null,"updated_time":"26 minutes","url_next_step":"https://account.amazon.com/jobs/3153496/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school diploma, or equivalent\u003cbr/\u003e- 1+ year of experience in any of the following or similar technical or vocational roles: Computer Hardware Repair, Infrastructure Cabling, Network Deployment, Data Center Operations\"","business_category":"aws","city":"Mesa","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Transform network infrastructure by joining our dynamic team! You'll be at the forefront of developing innovative solutions that drive network stability and scalability, using your technical expertise to create automated systems that power global technological advancement. \u003cbr/\u003e \u003cbr/\u003eNetwork Install Technicians will collaborate with cross-functional teams, troubleshoot complex technical scenarios, and implement strategic solutions that keep our network running seamlessly. Expect to engage in hands-on technical work that requires creativity, precision, and a passion for technological innovation. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Moving and implementing large enterprise equipment \u003cbr/\u003e- Installing Fiber and Copper cabling and patching cabling between equipment \u003cbr/\u003e- Ensuring proper safety and security standards are maintained during cabling and rack installation, \u003cbr/\u003e- Following well established hardware installation procedures and break-fix activities \u003cbr/\u003e- Safely using material handling tools and equipment \u003cbr/\u003e- Traveling within and outside of the regional work area is required. You will be responsible for having a reliable personal vehicle and valid driver's license to travel within the regional work area, as company transportation will not be provided \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e\u003cbr/\u003e- Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds \u003cbr/\u003e- Ability to work in an environment that operates 24/7 with an ability to participate in primary responder rotation and provide after-hours support as needed \u003cbr/\u003e- Working in cramped and/or elevated and/or noisy environments \u003cbr/\u003e- Bending, lifting, stretching, reaching, standing and walking for up to 8+ hours a day \u003cbr/\u003e- Ascending and descending ladders, stairs, and gangways safely and without limitation \u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Transform network infrastructure by joining our dynamic team! You'll be at the forefront of developing innovative solutions that drive network stability and scalability, using your technical expertise","display_distance":null,"id":"572198e8-9416-453e-b195-4d9e02b7a77f","id_icims":"3153172","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3153172/network-installation-technician","job_schedule_type":"full-time","location":"US, AZ, Mesa","locations":["{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Mesa\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Mesa\",\"coordinates\":\"33.41704,-111.83146\",\"normalizedCountyName\":\"Maricopa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Mesa, Arizona, USA\",\"location\":\"US, AZ, Mesa\",\"region\":\"AZ\",\"buildingCodeList\":[\"PHX53\"],\"normalizedCityName\":\"Mesa\"}"],"normalized_location":"Mesa, Arizona, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"January  6, 2026","preferred_qualifications":"- Knowledge of network cabling, optic types, and test equipment\u003cbr/\u003e- Industry standard certifications (CompTIA, CCENT, Network+)\u003cbr/\u003e- Experience with cabling infrastructure best practices and methodologies\"\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, AZ, Mesa - 27.00 - 47.00 USD hourly","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"AZ","title":"Network Installation Technician ","university_job":null,"updated_time":"29 minutes","url_next_step":"https://account.amazon.com/jobs/3153172/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 7+ years of engineering experience\u003cbr/\u003e- 3+ years of engineering team management experience\u003cbr/\u003e- 8+ years of leading the definition and development of multi tier web services experience\u003cbr/\u003e- Knowledge of engineering practices and patterns for the full software/hardware/networks development life cycle, including coding standards, code reviews, source control management, build processes, testing, certification, and livesite operations\u003cbr/\u003e- Experience partnering with product or program management teams","business_category":"operations","city":"Bengaluru","company_name":"ADCI - Karnataka - A66","country_code":"IND","description":"Amazon Fulfilment Technologies (AFT) is seeking an innovative and results-driven software manager to join our team. AFT is the backbone of Amazon's global operations, developing modern software, hardware, and processes that power our vast network of fulfilment centers that move billions of units of inventory, employs tens of thousands of people, and ensures that customers get what they want when promised. We do this by building automated solutions to handle things that technology does well, while relying on people to handle things that humans do well.\u003cbr/\u003e\u003cbr/\u003eWe're looking for an experienced software manager with a proven track record in delivering complex distributed software systems. The ideal candidate should have a comprehensive understanding of the entire software development and deployment lifecycle, including: system design and architecture, development, comprehensive documentation, rigorous testing methodologies and efficient operations. You must possess strong verbal and written communication skills, be self-driven and deliver high quality results in a fast paced environment. You'll be joining a team responsible for a wide range of receive services that form the foundation of Amazon's Fulfillment operations and its Inventory systems. In this role, you'll contribute to our mission of reinventing Amazon Fulfilment Inventory systems to provide best in class selection for our end customers while ensuring the highest standards of experience for our vendors and sellers. Your work will directly impact the efficiency and effectiveness of Amazon's global fulfillment network, ensuring we continue to meet and exceed customer expectations.\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Fulfilment Technologies (AFT) is seeking an innovative and results-driven software manager to join our team. AFT is the backbone of Amazon's global operations, developing modern software, hardware,","display_distance":null,"id":"3fe608ba-eb1f-4675-a459-19959ee7ad2c","id_icims":"3123709","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3123709/amazon-fulfilment-tech-software-development-manager-inventory","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR18\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"November 10, 2025","preferred_qualifications":"- Experience in communicating with users, other technical teams, and senior leadership to collect requirements, describe software product features, technical designs, and product strategy\u003cbr/\u003e- Experience in recruiting, hiring, mentoring/coaching and managing teams of Software Engineers to improve their skills, and make them more effective, product software engineers\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"operations.team-amazon-fulfillment-technology","source_system":"JobCreator","state":"KA","title":"Amazon Fulfilment Tech - Software Development Manager, Inventory","university_job":null,"updated_time":"43 minutes","url_next_step":"https://account.amazon.com/jobs/3123709/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-fulfillment-technology","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 10+ years of program management, tech program management, or related experience","business_category":"alexa-and-amazon-devices","city":"Sunnyvale","company_name":"Amazon.com Services LLC","country_code":"USA","description":"As a Senior Manager, Product Operations Management, you will engage with an experienced cross-disciplinary staff to conceive, design and develop innovative consumer products. You must be responsive, flexible and able to succeed within an open collaborative peer environment.\u003cbr/\u003e \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e The Role:\u003cbr/\u003e \u003cbr/\u003eThe Operations group is looking for an individual who wants to work on a cool product that is growing at a rapid pace. We are a critical part of the hardware development process. We ensure ongoing support, grow the capabilities of our current systems to meet our needs, and drive continuous improvement for the company.\u003cbr/\u003e - Deliver results on complex projects involving teams across the company.\u003cbr/\u003e - Work with stakeholders to define business requirements.\u003cbr/\u003e - Understand current system capabilities and limitations.\u003cbr/\u003e - Problem solve and explore solutions to current processes and systems.\u003cbr/\u003e - Coordinate with cross functional teams to implementation.\u003cbr/\u003e - Drive continuous improvements.\u003cbr/\u003e - Monitor supply and fulfillment of devices.\u003cbr/\u003e - Television industry work experience will \u003cbr/\u003e  be helpful.\u003cbr/\u003e - This role will require some travel\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Senior Manager, Product Operations Management you will engage with an experienced cross-disciplinary staff to conceive, design and develop innovative consumer products. You must be responsive, flexible and able to succeed within an open collaborative peer environment. ","department_cost_center":null,"description_short":"As a Senior Manager, Product Operations Management, you will engage with an experienced cross-disciplinary staff to conceive, design and develop innovative consumer products. You must be responsive, flexible","display_distance":null,"id":"d2062020-8cbe-4b30-9d8e-01842f5321c7","id_icims":"3173462","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Tech Infrastructure Prgrm Mgmt","job_function_id":null,"job_path":"/en/jobs/3173462/sr-mgr-opm-fire-tv-product-operations","job_schedule_type":"full-time","location":"US, CA, Sunnyvale","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sunnyvale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Sunnyvale\",\"coordinates\":\"37.37188,-122.03751\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sunnyvale, California, USA\",\"location\":\"US, CA, Sunnyvale\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC31\"],\"normalizedCityName\":\"Sunnyvale\"}"],"normalized_location":"Sunnyvale, California, USA","optional_search_labels":["military","alexa-and-amazon-devices.team-operations-job-family"],"posted_date":"February  4, 2026","preferred_qualifications":"- Experience in written and verbal communication skills to communicate with technical and non-technical audiences, including senior leadership\u003cbr/\u003e- Experience as a technical lead, systems engineer, or technical program manager with significant experience in complex systems\u003cbr/\u003e- Experience selling nascent products and services Ability to drive solutions to difficult problems\u003cbr/\u003e- Knowledge of standard software including Excel, Access, Oracle, Essbase, SQL and VBA skills\u003cbr/\u003e- Preferred qualifications\u003cbr/\u003e- Master's degree or above in management, business administration, economics, engineering, marketing\u003cbr/\u003e- Experience influencing senior leaders/stakeholders\u003cbr/\u003e- 1+ years of studio, production company or television network experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Sunnyvale - 223,800.00 - 302,800.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-operations-and-supply-chain","source_system":"JobCreator","state":"CA","title":"Sr Mgr, OPM, Fire TV Product Operations","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3173462/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-operations-and-supply-chain","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of engineering team management experience\u003cbr/\u003e- 7+ years of engineering experience\u003cbr/\u003e- Knowledge of engineering practices and patterns for the full software/hardware/networks development life cycle, including coding standards, code reviews, source control management, build processes, testing, certification, and livesite operations\u003cbr/\u003e- Experience partnering with product or program management teams\u003cbr/\u003e- Experience designing or architecting (design patterns, reliability and scaling) of new and existing systems\u003cbr/\u003e- Bachelor's degree or foreign equivalent in Computer Science, Engineering, Mathematics, or a related field","business_category":"operations","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"Ever wondered how millions of sellers build their business using Amazons marketplace and fulfillment capabilities? Our group is at the center of the action, building systems that enable sellers to fulfill orders leveraging Amazon’s vast network of warehouses.\u003cbr/\u003e\u003cbr/\u003eYou'll be leading development teams that are building highly distributed systems to enable merchants to deliver orders to their customers with incredible speed.\u003cbr/\u003e\u003cbr/\u003eAs the Software Development Manager, you will be a leader who is known for hiring, developing and retaining the best talent. This leader will have a reputation as a team builder and someone who is very good at acquiring and developing great talent. This leader consistently builds high-performing teams by attracting and developing top-tier talent. They will possess the ability to motivate, build rapport and communicate effectively with all employees. To be successful in this role you will need to be an innovator, communicator, influencer and problem solver. The right individual will also have solid technical judgment, effectively communicate goals, and drive a fast-paced organization to deliver results with a focused and pragmatic approach to the business.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eDrive the development of systems that enable sellers to leverage Amazons fulfillment capabilities.\u003cbr/\u003e\u003cbr/\u003eHiring and developing the best talent, and creating an environment which motivates people to thrive in their expertise and deliver results.\u003cbr/\u003e\u003cbr/\u003eDefine and constantly monitor metrics to improve performance and reduce cost.\u003cbr/\u003e\u003cbr/\u003ePrepare executive level communications to share tactical plans, estimates, justify investment, and highlight product performance.\u003cbr/\u003e","department_cost_center":null,"description_short":"Ever wondered how millions of sellers build their business using Amazons marketplace and fulfillment capabilities? Our group is at the center of the action, building systems that enable sellers to fulfill","display_distance":null,"id":"7f1a0e1c-fbe7-456f-afed-4b5b6a8d07d2","id_icims":"3173461","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3173461/software-development-manager-amazon-supply-chain-services","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR26\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"February  4, 2026","preferred_qualifications":"- Experience in communicating with users, other technical teams, and senior leadership to collect requirements, describe software product features, technical designs, and product strategy\u003cbr/\u003e- Experience in recruiting, hiring, mentoring/coaching and managing teams of Software Engineers to improve their skills, and make them more effective, product software engineers\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"operations.team-global-fulfillment-services","source_system":"JobCreator","state":"KA","title":"Software Development Manager , Amazon Supply Chain Services","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3173461/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-fulfillment-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 機械や電気機器の保全や保守、または生産技術・設備導入や立ち上げを1年以上ご経験された方\u003cbr/\u003e- PCを使用した作業のご経験のある方。（エクセル、ワード、Outlook）\u003cbr/\u003e- ビジネスレベルの日本語力（メールの読み書き、報告、連絡、相談ができる）","business_category":"fulfillment-and-operations","city":"Sagamihara","company_name":"Amazon Japan G.K.","country_code":"JPN","description":"このポジションの勤務地は、神奈川県相模原市にある物流拠点（フルフィルメントセンター）になります。\u003cbr/\u003e　\u003cbr/\u003eAmazonの入荷・出荷のプロセスを行うFCには、世界最先端の自動化物流設備が導入されています。コンベア、ロボット、自動仕分けシステムなど、最新テクノロジーを活用し、商品の入出荷を効率的に行っています。このような先進的な環境で、次世代の物流技術に携わることができます。\u003cbr/\u003e　\u003cbr/\u003eRME（Reliability and Maintenance Engineering）部門は、日々物流設備の保全と保守、改善を行い、お客様に満足いただけるように努めております。 今回、RME部門が募集する職種はFCに導入されている物流設備の保全と保守、および設備の安全性や生産性を向上させるための改善を担当いただく「サイトメンテナンスシニアテクニシャン」というポジションになります。 \u003cbr/\u003e　\u003cbr/\u003e本ポジションは物流設備の保全経験者だけでなく、異業界・異職種からのキャリアチェンジをお考えの方も広く募集しています。これまでのエンジニアとしての経験を活かしながら、次のステージへと成長できる環境をご用意しております。入社後は体系的な教育プログラムに加え、豊富な経験を持つ先輩社員によるさぽーとにより、確かな技術力と自信を着実に身につけていただけます。\u003cbr/\u003e　\u003cbr/\u003eRMEにて技術力と現場感を身に着けることで将来的なキャリア選択肢は大きく広がります。マネジメント職や技術スペシャリストへのキャリアアップはもちろん、社内公募制度を通じて設備導入、設計、開発など、幅広いフィールドでの活躍も可能です。\u003cbr/\u003e    \u003cbr/\u003e【More Information】\u003cbr/\u003e■メンテナンス部門について\u003cbr/\u003e　・\u003ca href=\"https://www.amazon.co.jp/career/jprme\"\u003eメンテナンスエンジニア特設サイト\u003c/a\u003e\u003cbr/\u003e　・\u003ca href=\"https://www.amazon.co.jp/b?node=5653623051\"\u003e社員インタビュー/堺FC勤務の社員T.S.さん\u003c/a\u003e\u003cbr/\u003e　・\u003ca href=\"https://www.amazon.co.jp/b?node=10581432051\"\u003e社員インタビュー/堺FC勤務の社員E.M.さん\u003c/a\u003e\u003cbr/\u003e■勤務地について\u003cbr/\u003e　・\u003ca href=\"https://www.amazon.co.jp/b/?\u0026node=5637337051\"\u003eフルフィルメントセンター (FC)\u003c/a\u003e\u003cbr/\u003e　・勤務地：\u003ca href=\"https://www.amazon.co.jp/b/?_encoding=UTF8\u0026node=10538718051\"\u003e相模原FC\u003c/a\u003e\u003cbr/\u003e　\u003cbr/\u003eAmazon は多様かつインクルーシブな職場づくりを目指しています。Amazonは男女雇用機会均等法を順守しています。人種、 出身国、性別、性的指向、障がい、年齢、その他の属性によって差別することなく、平等に採用選考の機会を提供しています。障がいをお持ちの方は、以下をご覧ください。https://www.amazon.jobs/disability/jp\u003cbr/\u003e\u003ca href=\"https://www.amazon.co.jp/career/DEI\"\u003eオペレーション部門のDEIの取り組み\u003c/a\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e【具体的な業務内容】\u003cbr/\u003e下記業務をチームで対応いただきます。\u003cbr/\u003e■60%：日常点検・異常対応…稼働監視/巡回による設備点検/異常対応、故障復旧/オーバーホール、部品修繕  \u003cbr/\u003e■20%：メンテナンス業務…予防保全/定期保全/状態保全/事後保全  \u003cbr/\u003e■10%：安全対策…設備・作業環境の安全対策/5S活動  \u003cbr/\u003e■5%：カイゼン活動…機械、電気、制御（PLC）と広い範囲でカイゼンや改造を実施  \u003cbr/\u003e■5%：その他…メンテナンス計画/デザインレビュー  \u003cbr/\u003e　\u003cbr/\u003e【取り扱う設備の一例（FCによって異なる）】\u003cbr/\u003e■Amazon Robotics（商品棚を持ち上げて移動させるロボット）\u003cbr/\u003e■荷合わせシステム（同じお客様が注文された商品を一つにまとめる設備）\u003cbr/\u003e■パッキング設備（荷合わせした商品をまとめて梱包する設備）\u003cbr/\u003e■仕分け設備（宛先ラベルの印刷と貼り付けを行い、配送方面毎に仕分けを行う設備）\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e【教育・研修】\u003cbr/\u003e・入社後は、体系化された教育プログラムに沿って、安全ルール、保全作業、専門的な技術習得（機械・電気・制御）を進めていただきます。同時に所属拠点ではOJTを通して実務を習得いただきます。まずは物流設備の軽微なエラー対応や保全・保守の補佐業務を担当いただき、バディー制度により先輩社員がサポートをいたしますので、不明点の確認や相談がしやすい環境となります。その後は今までのキャリアの中で培ってきたスキルを応用し、改善や安全対策、効率化施策を手掛けることで幅広い領域で活かしていただくことができます。\u003cbr/\u003e　\u003cbr/\u003e【働き方】\u003cbr/\u003e本ポジションは、シフト勤務になり「3交代・早番専属・夜勤専属」のシフトパターンがあります。\u003cbr/\u003eシフトパターンは希望を考慮の上、決定させていただきますが、将来的なシフト勤務形態の変更の可能性もございます。\u003cbr/\u003e＜シフト例＞※シフトは拠点によって異なります。\u003cbr/\u003e　・3交代  　6:00-15:00, 14:30-23:30, 23:00-8:00\u003cbr/\u003e　・早番専属　6:00-15:00\u003cbr/\u003e　・夜勤専属　23:00-8:00\u003cbr/\u003eシフトは1か月以上前に事前に周知される為、休暇の計画が立てやすく、チームで調整することで休暇が取得しやすい環境です。\u003cbr/\u003e退勤時間には次の班が出勤し引継ぎを行う為、残業時間が少なく、急な呼び出しも発生しません。\u003cbr/\u003e公共交通機関が運行しない時間帯でも交代勤務に出社できるようお願いいたします。\u003cbr/\u003e（自家用車・自転車は可（入社前に要申請・許可制）、バイク・タクシーは不可）","department_cost_center":null,"description_short":"このポジションの勤務地は、神奈川県相模原市にある物流拠点（フルフィルメントセンター）になります。　Amazonの入荷・出荷のプロセスを行うFCには、世界最先端の自動化物流設備が導入されています。コンベア、ロボット、自動仕分けシステムなど、最新テクノロジーを活用し、商品の入出荷を効率的に行っています。このような先進的な環境で、次世代の物流技術に携わることができます。　RME（Reliability and","display_distance":null,"id":"48be9388-c0d4-42b4-bd55-cfc78725d841","id_icims":"3138711","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/facilities","job_function_id":null,"job_path":"/en/jobs/3138711/","job_schedule_type":"full-time","location":"JP, 14, Sagamihara","locations":["{\"normalizedStateName\":\"Kanagawa\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Sagamihara\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, 14, Sagamihara\",\"coordinates\":\"35.57143,139.373\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Sagamihara-shi, Kanagawa, JPN\",\"location\":\"JP, 14, Sagamihara\",\"region\":\"14\",\"buildingCodeList\":[\"CPR1\",\"DHJ1\",\"HTY8\",\"NRT601\",\"TYO8\",\"QCB5\"],\"normalizedCityName\":\"Sagamihara-shi\"}"],"normalized_location":"Sagamihara-shi, Kanagawa, JPN","optional_search_labels":[],"posted_date":"December  8, 2025","preferred_qualifications":"- 物流設備の保守保全、もしくはフィールドエンジニアの経験\u003cbr/\u003e- 機械部品の取扱経験・知識（モーター・エアシリンダー・動力伝達機構・バルブなど）\u003cbr/\u003e- 電気部品の取扱経験・知識（インバーター・光学センサー・BCR・温度センサーなど）\u003cbr/\u003e- 制御機器の取扱経験・知識（PLC・サーボアンプ・タッチパネル・調節計など）\u003cbr/\u003e- 機械工学、もしくは電気工学の基礎知識 （工業高校または専門学校卒業程度）\u003cbr/\u003e- 労働安全衛生基礎知識　（製造工場・生産設備での安全知識）\u003cbr/\u003e- 英語でのコミュニケーション能力\u003cbr/\u003e- オーナーシップ：自ら課題を見つけ、責任を持って解決できる。\u003cbr/\u003e- 探究心と向上心：いままで経験がない業務においても新しい知識を学ぶことに意欲的で、何事にも前向きに取組むことができる。\u003cbr/\u003e- チームワーク：リスペクトを持ってメンバーと協働でき、報連相ができる。\u003cbr/\u003e- 機敏性と柔軟性：変化する状況や環境に機敏、且つ柔軟に対応できる。\u003cbr/\u003e- インクルーシブなカルチャーへの貢献や多様性に富んだグループで働くことに対して前向きであること。\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-jp-fulfillment-center-management","source_system":"JobCreator","state":"14","title":"サイトメンテナンスシニアテクニシャン","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3138711/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-jp-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team\u003cbr/\u003e- Proven track record of delivering complex software systems in production environments\u003cbr/\u003e- Strong understanding of computer science fundamentals including data structures, algorithms, and distributed systems.\u003cbr/\u003e- Experience building and operating software systems that meet business goals and operational requirements","business_category":"subsidiaries","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Industrial Robotics is building the future of manufacturing and industrial operations. Our team combines cutting-edge robotics technology with world-class software engineering to deliver AI-native solutions that operate on an unprecedented scale. We're pioneering high-performance, low-latency systems (\u003c100ms) that coordinate complex robotic operations while continuously learning and improving from production data. You'll work with passionate builders who are customer-obsessed and committed to technical excellence in applying buffer-centric and flow optimization principles to create manufacturing environments where humans and robots work safely and efficiently together. In this environment, your contributions directly impact Amazon's ability to serve customers worldwide by optimizing entire systems rather than individual components.\u003cbr/\u003e\u003cbr/\u003eAmazon Industrial Robotics is seeking an exceptional Senior Software Development Engineer to build and scale software systems that enable advanced manufacturing capabilities and industrial operations. You will architect, design and deliver critical components of our software stack, from real-time operational systems to enterprise-scale platforms, working at the forefront of AI-driven robotics and automation technology that orchestrates sophisticated operations at unprecedented scale.\u003cbr/\u003e\u003cbr/\u003eAs a Senior SDE, you will leverage deep technical expertise to solve complex problems in areas where solutions may not be well-defined. You will work independently with high judgment, taking ownership of significant technical domains while collaborating with cross-functional teams including Principal Engineers, Software Development Managers, Technical Program Managers, and technology partners. You understand how to leverage AI both in development practices (enabling 3x productivity gains through AWS Kiro and other AI-native development tools) and in product capabilities (such as closed-loop learning systems that automatically improve from production data). This is a ground-floor opportunity to shape the technical foundation of a strategic robotics initiative that combines cutting-edge AI, distributed systems, and advanced manufacturing processes to create adaptable automation solutions.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Architect, design, develop, and extend high-performance, test-driven code that is scalable, maintainable, and meets business requirements for industrial robotics systems\u003cbr/\u003e- Design and implement solutions that are highly scalable, cost-effective, and operate reliably at Amazon scale\u003cbr/\u003e- Lead technical design reviews and drive architectural decisions for complex distributed systems supporting manufacturing operations\u003cbr/\u003e- Build AI-native software solutions, leveraging AI in both development practices and in product capabilities (intelligent decision-making, optimization, predictive systems)\u003cbr/\u003e- Own end-to-end delivery of software components from design through deployment, including production support and operational excellence\u003cbr/\u003e- Establish and maintain technical standards for code quality, testing, deployment, and monitoring\u003cbr/\u003e- Mentor and provide technical guidance to other engineers, raising the bar for engineering excellence across the team\u003cbr/\u003e- Partner with cross-functional stakeholders to translate business requirements into technical solutions\u003cbr/\u003e- Work in an Agile/Scrum environment to deliver high-quality software with aggressive timelines\u003cbr/\u003e- Mitigate complexity risks by deconstructing significantly complex problems into straightforward solutions\u003cbr/\u003e- Actively participate in technical reviews across teams and provide critical feedback\u003cbr/\u003e- Drive continuous improvement in development processes, tools, and practices to increase team velocity and quality","department_cost_center":null,"description_short":"Amazon Industrial Robotics is building the future of manufacturing and industrial operations. Our team combines cutting-edge robotics technology with world-class software engineering to deliver AI-native","display_distance":null,"id":"4a31510a-ba86-472a-9f2e-d367b39f6e6a","id_icims":"3173457","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3173457/senior-software-development-engineer-amazon-industrial-robotics","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA90\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February  4, 2026","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in Computer Science, Engineering, a related field, or equivalent experience\u003cbr/\u003e- Experience building and operating AI-native software development practices and leveraging AI tools for productivity gains (e.g., Amazon Kiro, Amazon Q Developer, Amazon CodeWhisperer, Cline, Wasabi)\u003cbr/\u003e- Experience integrating AI/ML capabilities into production software systems\u003cbr/\u003e- Experience with cloud platforms (AWS preferred) and building scalable distributed systems\u003cbr/\u003e- Knowledge of flow optimization, theory of constraints, or manufacturing/industrial systems\u003cbr/\u003e- Experience with complex partner integrations and enterprise software systems\u003cbr/\u003e- Experience with robotics systems, autonomous agents, or industrial automation\u003cbr/\u003e- Experience influencing technical priorities and business strategy through data-driven contributions\u003cbr/\u003e- Ability to make trade-offs between opportunity, resources, and sustainability\u003cbr/\u003e- Demonstrated ability to work in highly ambiguous, fast-paced environments with changing priorities\u003cbr/\u003e- Strong problem-solving skills with ability to think creatively and propose innovative solutions\u003cbr/\u003e- Excellent written and verbal communication skills, with ability to present technical concepts to diverse audiences\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 168,100.00 - 227,400.00 USD annually","primary_search_label":"subsidiaries.team-amazon-robotics","source_system":"JobCreator","state":"WA","title":"Senior Software Development Engineer, Amazon Industrial Robotics","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3173457/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-robotics","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 設備保全活動の計画、作業スケジュールの立案など現場業務マネジメントの経験\u003cbr/\u003e- MS Excelの使用経験（表の作成、四則演算、簡単な関数計算など）\u003cbr/\u003e- 現場で必要な日本語コミュニケーション能力（ビジネスレベル）と英語文書を理解できるレベルの英語スキル\u003cbr/\u003e- データ解析スキルと、データに基づいた技術的な改善アプローチ","business_category":"fulfillment-ops","city":"Tokyo","company_name":"Amazon Japan G.K.","country_code":"JPN","description":"このポジションの勤務地は、東京都大田区のデリバリーステーションになります。\u003cbr/\u003e\u003cbr/\u003eアマゾンジャパンでは、全国で20拠点以上のフルフィルメントセンター（FC）、50拠点以上のデリバリーステーション（DS）が稼働し、数千の機械、数万の従業員が、正しい商品を正しい人、正しい場所、正しい時間に届けるために、調和を保ちながら働いています。私たちReliability \u0026 Maintenance Engineering – Maintenance (RME-M) は、グローバルなAmazonの倉庫・デリバリーネットワークの技術を維持し、最適化しています。\u003cbr/\u003eJapan Customer Fulfillment Solutions (JCFS) は、AmazonのFulfillment Solutionを追求するオペレーション技術統括本部です。Amazon Operations業務の中核部門として、オペレーションの各部門と効率的に連携することによりカスタマーに貢献しています。JCFS RME-Mは、全国に展開されているAmazonサイトにおける物流設備の保全・保守・改善を行い、お客様に満足いただけるように努めています。DSは、Amazonの商品を在庫しているFCから出荷された商品を、配送するルート別に仕分けをするお客様に最も近い配送拠点です。\u003cbr/\u003eRME-Mは、生産設備または物流設備のエンジニアリング経験のある、やる気にあふれたお客様思考のリーダーを求めています。具体的には機械工学、電気工学、生産工学、制御工学の知識があるエンジニア、生産工場などでの設備改善・品質改善の経験があるエンジニアです。メンテナンスの予算計画、人員計画を策定・実行する責任もあります。\u003cbr/\u003e\u003cbr/\u003e今回募集する職種である設備資産管理プランナーは、Amazonのグローバル資産管理システムであるAPM (Asset Performance Management) を介して標準化された資産（設備、機器）管理、予防保全計画、在庫部品管理、外注費管理を行うことで、データをエビデンスに人件費、パーツコスト、サービス（アウトソーシング）コストを管理し、継続的に改善するポジションです。DSの比較的規模の大きい拠点（10拠点前後）をネットワークレベルで担当し、故障や不具合の履歴管理、計画される予防保全のスケジューリングと実施状況の追跡を実行します。APMに蓄積された大量のデータを解析およびメトリクスやKPI、ダッシュボードを活用することで、最適なサイト運営、設備の安定稼働、コストの最適化にも貢献します。また、現場のAPMに関する標準化、改善、新規ソリューションの導入などをCentralチームと連携して取り組みます。\u003cbr/\u003e\u003cbr/\u003e【取り扱う設備の一例（DSによって異なります）】\u003cbr/\u003e- マテハン設備（一般的な搬送ローラーコンベア）\u003cbr/\u003e- オートソーター設備（商品を搬送しながら自動で仕分けし搬出するコンベア）\u003cbr/\u003e- オートラベラー設備（搬送されている商品を自動でスキャンしラベルを貼り付けする設備）\u003cbr/\u003e\u003cbr/\u003e【More Information】：採用に関する詳細は、下記サイトをご参照ください。\u003cbr/\u003e関連情報\u003cbr/\u003e・所属部門:\u003ca href=\"https://www.amazon.co.jp/b?node=5637342051\"\u003eオペレーション技術開発\u003c/a\u003e\u003cbr/\u003e・職種:\u003ca href=\"https://www.amazon.co.jp/b?node=5609899051\"\u003eメンテナンス\u003c/a\u003e\u003cbr/\u003e・勤務地:\u003ca href=\"https://www.amazon.co.jp/b?node=8521082051\"\u003e関東エリアDS\u003c/a\u003e\u003cbr/\u003e\u003ca href=\"https://www.amazon.co.jp/career/jprme\"\u003eメンテナンスエンジニア特設サイト\u003c/a\u003e\u003cbr/\u003e\u003cbr/\u003e・メンテナンス職の社員インタビュー\u003cbr/\u003e\u003ca href=\"https://www.amazon.co.jp/b?node=5653623051\"\u003eフルフィルメントセンター(FC)部門/堺FC勤務の社員T.S.さん\u003c/a\u003e\u003cbr/\u003e\u003ca href=\"https://www.amazon.co.jp/b?node=10581432051\"\u003eフルフィルメントセンター(FC)部門/堺FC勤務の社員E.M.さん\u003c/a\u003e\u003cbr/\u003e\u003cbr/\u003eAmazon は多様かつインクルーシブな職場づくりを目指しています。Amazonは男女雇用機会均等法を順守しています。人種、 出身国、性別、性的指向、障がい、年齢、その他の属性によって差別することなく、平等に採用選考の機会を提供しています。障がいをお持ちの方は、以下をご覧ください。https://www.amazon.jobs/disability/jp\u003cbr/\u003e\u003cbr/\u003e\u003ca href=\" https://www.amazon.co.jp/career/DEI\"\u003eオペレーション部門のDEIの取り組み（Japanese Only）\u003c/a\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e設備資産管理プランナーの主な業務は下記の通りですが、これらに限定されません。\u003cbr/\u003e- サイトのSME（Subject Matter Expert）となり、FieldメンバーにAPM使用方法を指導、現場レベルのAPMの正しい活用と標準化を行う。\u003cbr/\u003e- サイトへのAPM導入を推進し、APM Launchプロジェクトをリードする。\u003cbr/\u003e- Centralチームにより開催される定例ミーティングに参加し、担当サイトへの必要な情報を現場へ共有、必要なアクションを適切に実行する。また、必要に応じてCentralチームに問題を提起する。\u003cbr/\u003e- 計画保全作業をシステムで予測しFieldメンバーに計画作業を割り当て、作業完了後のレポートを確認・分析し、必要に応じて作業者へフィードバックを行う。\u003cbr/\u003e- ビジネスデータ（パフォーマンス、履歴、工数）をメトリクス、KPI、ダッシュボード、レポートを活用して分析し、その結果に基づいた改善を提案する\u003cbr/\u003e- サイトレベルの機器、スペアパーツ、発注点といったパーツマスタを管理する\u003cbr/\u003e- JP RME DSネットワーク全体でのAPMのシステムや機能を実装する\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e% of Time：Description of essential functions\u003cbr/\u003e1： 50％：既存/新規DSへのAPM新規導入立ち上げ業務\u003cbr/\u003e2： 30%：APM稼動が開始したDSのPMやスペアパーツの予実管理\u003cbr/\u003e3： 10%：ネットワークレベルでのメトリクスやKPIを管理したDSサポート（各指標、フォローアップなど）\u003cbr/\u003e4： 10%：JP RME全体の標準化、自動化、簡素化など改善戦略プロジェクトの立案・推進\u003cbr/\u003e\u003cbr/\u003e※土日、祝日休みを基本とします。\u003cbr/\u003e※9:00-18:00勤務 (Flextime)","department_cost_center":null,"description_short":"このポジションの勤務地は、東京都大田区のデリバリーステーションになります。アマゾンジャパンでは、全国で20拠点以上のフルフィルメントセンター（FC）、50拠点以上のデリバリーステーション（DS）が稼働し、数千の機械、数万の従業員が、正しい商品を正しい人、正しい場所、正しい時間に届けるために、調和を保ちながら働いています。私たちReliability \u0026 Maintenance Engineering","display_distance":null,"id":"0aeddd9c-7f6f-4bd0-addc-56646c636f42","id_icims":"3172591","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3172591/jp-rme-maintenance","job_schedule_type":"full-time","location":"JP, 13, Tokyo","locations":["{\"normalizedStateName\":\"Tokyo\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Tokyo\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, 13, Tokyo\",\"coordinates\":\"35.68946,139.69172\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Tokyo, JPN\",\"location\":\"JP, 13, Tokyo\",\"region\":\"13\",\"buildingCodeList\":[\"DTK7\"]}"],"normalized_location":"Tokyo, JPN","optional_search_labels":[],"posted_date":"February  3, 2026","preferred_qualifications":"- 英語でメールや会議が出来るレベルのビジネス英語力\u003cbr/\u003e- EAM、コンピュータによる保守管理システム（CMMS）の知識や経験\u003cbr/\u003e- 設備の保全・メンテナンスの経験やそれらに関するプロジェクトリード経験\u003cbr/\u003e- データやプロセスの自動化を促進する一方、無駄やダブルワークを減らすための標準化や変更管理の推進と実装する能力\u003cbr/\u003e- システムに関する新機能リリースや標準化による変更案件に対し、適切な手順に基づいた実行経験\u003cbr/\u003e- 設備保全に必要な予備品管理の知識や購買プロセスの最適化を導くリーダーシップスキル\u003cbr/\u003e- インクルーシブなカルチャーへの貢献や多様性に富んだグループで働くことに対して前向きであること\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"13","title":"設備資産管理 プランナー, JP RME-Maintenance","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3172591/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team\u003cbr/\u003e- Proven track record of delivering complex software systems in production environments\u003cbr/\u003e- Strong understanding of computer science fundamentals including data structures, algorithms, and distributed systems.\u003cbr/\u003e- Experience building and operating software systems that meet business goals and operational requirements","business_category":"subsidiaries","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Industrial Robotics is building the future of manufacturing and industrial operations. Our team combines cutting-edge robotics technology with world-class software engineering to deliver AI-native solutions that operate on an unprecedented scale. We're pioneering high-performance, low-latency systems (\u003c100ms) that coordinate complex robotic operations while continuously learning and improving from production data. You'll work with passionate builders who are customer-obsessed and committed to technical excellence in applying buffer-centric and flow optimization principles to create manufacturing environments where humans and robots work safely and efficiently together. In this environment, your contributions directly impact Amazon's ability to serve customers worldwide by optimizing entire systems rather than individual components.\u003cbr/\u003e\u003cbr/\u003eAmazon Industrial Robotics is seeking an exceptional Senior Software Development Engineer to build and scale software systems that enable advanced manufacturing capabilities and industrial operations. You will architect, design and deliver critical components of our software stack, from real-time operational systems to enterprise-scale platforms, working at the forefront of AI-driven robotics and automation technology that orchestrates sophisticated operations at unprecedented scale.\u003cbr/\u003e\u003cbr/\u003eAs a Senior SDE, you will leverage deep technical expertise to solve complex problems in areas where solutions may not be well-defined. You will work independently with high judgment, taking ownership of significant technical domains while collaborating with cross-functional teams including Principal Engineers, Software Development Managers, Technical Program Managers, and technology partners. You understand how to leverage AI both in development practices (enabling 3x productivity gains through AWS Kiro and other AI-native development tools) and in product capabilities (such as closed-loop learning systems that automatically improve from production data). This is a ground-floor opportunity to shape the technical foundation of a strategic robotics initiative that combines cutting-edge AI, distributed systems, and advanced manufacturing processes to create adaptable automation solutions.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Architect, design, develop, and extend high-performance, test-driven code that is scalable, maintainable, and meets business requirements for industrial robotics systems\u003cbr/\u003e- Design and implement solutions that are highly scalable, cost-effective, and operate reliably at Amazon scale\u003cbr/\u003e- Lead technical design reviews and drive architectural decisions for complex distributed systems supporting manufacturing operations\u003cbr/\u003e- Build AI-native software solutions, leveraging AI in both development practices and in product capabilities (intelligent decision-making, optimization, predictive systems)\u003cbr/\u003e- Own end-to-end delivery of software components from design through deployment, including production support and operational excellence\u003cbr/\u003e- Establish and maintain technical standards for code quality, testing, deployment, and monitoring\u003cbr/\u003e- Mentor and provide technical guidance to other engineers, raising the bar for engineering excellence across the team\u003cbr/\u003e- Partner with cross-functional stakeholders to translate business requirements into technical solutions\u003cbr/\u003e- Work in an Agile/Scrum environment to deliver high-quality software with aggressive timelines\u003cbr/\u003e- Mitigate complexity risks by deconstructing significantly complex problems into straightforward solutions\u003cbr/\u003e- Actively participate in technical reviews across teams and provide critical feedback\u003cbr/\u003e- Drive continuous improvement in development processes, tools, and practices to increase team velocity and quality","department_cost_center":null,"description_short":"Amazon Industrial Robotics is building the future of manufacturing and industrial operations. Our team combines cutting-edge robotics technology with world-class software engineering to deliver AI-native","display_distance":null,"id":"b7ad4278-333a-4760-ad80-3bdf6d19fb77","id_icims":"3173458","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3173458/senior-software-development-engineer-amazon-industrial-robotics","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA90\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February  4, 2026","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in Computer Science, Engineering, a related field, or equivalent experience\u003cbr/\u003e- Experience building and operating AI-native software development practices and leveraging AI tools for productivity gains (e.g., Amazon Kiro, Amazon Q Developer, Amazon CodeWhisperer, Cline, Wasabi)\u003cbr/\u003e- Experience integrating AI/ML capabilities into production software systems\u003cbr/\u003e- Experience with cloud platforms (AWS preferred) and building scalable distributed systems\u003cbr/\u003e- Knowledge of flow optimization, theory of constraints, or manufacturing/industrial systems\u003cbr/\u003e- Experience with complex partner integrations and enterprise software systems\u003cbr/\u003e- Experience with robotics systems, autonomous agents, or industrial automation\u003cbr/\u003e- Experience influencing technical priorities and business strategy through data-driven contributions\u003cbr/\u003e- Ability to make trade-offs between opportunity, resources, and sustainability\u003cbr/\u003e- Demonstrated ability to work in highly ambiguous, fast-paced environments with changing priorities\u003cbr/\u003e- Strong problem-solving skills with ability to think creatively and propose innovative solutions\u003cbr/\u003e- Excellent written and verbal communication skills, with ability to present technical concepts to diverse audiences\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 168,100.00 - 227,400.00 USD annually","primary_search_label":"subsidiaries.team-amazon-robotics","source_system":"JobCreator","state":"WA","title":"Senior Software Development Engineer, Amazon Industrial Robotics","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3173458/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-robotics","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}