{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Ensino Superior Completo em Engenharia, Administração, Operações ou áreas relacionadas.\u003cbr/\u003e- MS Office, com nível avançado em Excel (vlookup, fórmulas avançadas, tabelas dinâmicas, macros).\u003cbr/\u003e- Disponibilidade para trabalhar em turnos flexíveis incluindo fins de semana e feriados.\u003cbr/\u003e- Disponibilidade para viagens em 25% do tempo.\u003cbr/\u003e- Inglês básico.","business_category":"transportation-and-logistics","city":"Salvador","company_name":"Amazon Logistica do Brasil","country_code":"BRA","description":"Nossas equipes de logística estão mudando a maneira como interagimos com clientes em todo o mundo todos os dias e resolvendo alguns dos maiores desafios logísticos enfrentados não apenas pela Amazon, mas também por toda a indústria.\u003cbr/\u003eSejam itens grandes ou pequenos, encontramos soluções para garantir que estamos cumprindo nossa promessa para os clientes. \u003cbr/\u003e\u003cbr/\u003eA equipe da Amazon Logistics Brasil (AMZL) está procurando uma pessoa Analista de Operações Logísticas para se juntar ao time de EDSP (External Delivery Service Providers), ou seja, as estações de entrega da AMZL operadas por parceiros. Essa pessoa irá atuar como Torre de Controle para essas operações operadas por parceiros. As operações serão feitas 7 dias por semana, incluindo feriados; portanto, os Analistas de Operações Logísticas são todos em escala 4x3, separados entre equipe front e back, podendo haver mudanças de turno.\u003cbr/\u003e\u003cbr/\u003eEssa pessoa atuará na gestão de estações de entrega dos parceiros logísticos externos para garantir o desempenho e conformidade dos processos desses parceiros. Trabalhará em um ambiente altamente colaborativo que é mais próximo de uma start-up do que uma grande empresa. A atitude adotada é que nenhuma ideia é uma má ideia e as melhores ideias são aquelas que devem ser testadas e experimentadas. \u003cbr/\u003eEssa pessoa precisará prosperar e entregar resultados em um ambiente ambíguo, rápido e dinâmico. Parte de suas funções poderão ser realizadas virtualmente, como também auditoria /visitas aos parceiros logísticos in loco.\u003cbr/\u003eNossa cultura inclusiva capacita os Amazonians a oferecer os melhores resultados para nossos clientes. Não celebramos apenas a diversidade de nossa força de trabalho, celebramos as diversas formas como trabalhamos. Se você quiser solicitar uma acomodação para a entrevista ou o processo de integração, avise seu recrutador e ele o conectará à nossa equipe de acomodação.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Monitorar diariamente o funcionamento eficiente dos parceiros logísticos, sugerir e implantar melhorias;\u003cbr/\u003e- Criar e acompanhar métricas operacionais com os parceiros logísticos;\u003cbr/\u003e- Analisar dados de várias fontes e identificar tendências relevantes para que, a partir deles, decisões rápidas e importantes ao negócio sejam tomadas;\u003cbr/\u003e- Encontrar soluções práticas e simples para problemas complexos;\u003cbr/\u003e- Servir de elo entre os stakeholders internos e externos tendo em vista os objetivos, limites, conformidade e privacidade das informações;\u003cbr/\u003e- Mergulhar profundamente nas causas raízes dos problemas operacionais.\u003cbr/\u003e","department_cost_center":null,"description_short":"Nossas equipes de logística estão mudando a maneira como interagimos com clientes em todo o mundo todos os dias e resolvendo alguns dos maiores desafios logísticos enfrentados não apenas pela Amazon, mas","display_distance":null,"id":"ee74127a-d404-42c3-a151-2a595786474e","id_icims":"3169982","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3169982/analista-operacoes-logisticas-amzl","job_schedule_type":"full-time","location":"BR, BA, Salvador","locations":["{\"normalizedStateName\":\"Bahia\",\"normalizedCountryCode\":\"BRA\",\"city\":\"Salvador\",\"countryIso3a\":\"BRA\",\"countryIso2a\":\"BR\",\"locationNonStemming\":\"Brazil, BA, Salvador\",\"coordinates\":\"-12.98645,-38.52259\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Brazil\",\"normalizedLocation\":\"Salvador, Bahia, BRA\",\"location\":\"BR, BA, Salvador\",\"region\":\"BA\",\"buildingCodeList\":[\"DSA8\"],\"normalizedCityName\":\"Salvador\"}"],"normalized_location":"Salvador, Bahia, BRA","optional_search_labels":[],"posted_date":"January 29, 2026","preferred_qualifications":"- Inglês avançado.\u003cbr/\u003e- Experiência em Logística, e/ou Transportes.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-amzl","source_system":"JobCreator","state":"BA","title":"Analista Operações Logísticas, AMZL","university_job":null,"updated_time":"1 minute","url_next_step":"https://account.amazon.com/jobs/3169982/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amzl","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 1+ years of software development engineer or related occupational experience\u003cbr/\u003e- 1+ years of designing and developing large-scale, multi-tiered, multi-threaded, embedded or distributed software applications, tools, systems, and services using: C#, C++, Java, or Perl experience\u003cbr/\u003e- 1+ years of Object Oriented Design experience\u003cbr/\u003e- Bachelor's degree or foreign equivalent in Computer Science, Engineering, Mathematics, or a related field\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon Leo will serve people and organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eJoin our dynamic team developing satellite technology that will revolutionize provisioning software  for satellite vehicles. In this critical role, you will design and implement robust software solutions that directly impact the proper functioning of satellite systems. Your expertise in problem solving and coding will be essential as you tackle complex challenges in a high-stakes environment where precision and reliability are paramount.\u003cbr/\u003e\u003cbr/\u003eThis position offers the unique opportunity to work with sophisticated satellite technology while developing features that ensure seamless operation of these advanced systems. You'll collaborate with a technically strong team to solve challenging problems, implement innovative solutions, and maintain critical software infrastructure that powers our satellite fleet. This role provides significant growth potential for someone with the technical aptitude and drive to advance into a Sr. Engineer position.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eDesign and develop software solutions for satellite vehicle systems, implementing best practices in code organization, clarity, and error handling while balancing short and long-term technical needs.\u003cbr/\u003e\u003cbr/\u003eContribute to technical architecture decisions and software development for satellite over-the-air update capabilities, ensuring high reliability, performance, and security in a mission-critical environment.\u003cbr/\u003e\u003cbr/\u003eCollaborate with cross-functional teams to troubleshoot complex support issues, triage bugs, and implement solutions that maintain operational excellence of satellite systems.\u003cbr/\u003e\u003cbr/\u003eIdentify and resolve root causes of persistent problems in satellite software, making existing systems simpler while maintaining robust development practices.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour day begins with a team standup where you'll discuss ongoing projects and address any blockers. You'll spend time in design and implementation discussions for new satellite features, working collaboratively with your team to solve complex technical challenges. Throughout the day, you'll write and review code, triage critical bugs, and provide expert support for over-the-air update issues that require immediate attention. You'll balance proactive feature development with responsive troubleshooting, ensuring the satellite software vehicle maintains optimal performance.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur small, tight-knit team carries significant responsibility due to the criticality of the software we own. We take pride in our technical expertise, with each member being a subject matter expert in their core competency. When pressure mounts, we support each other to ensure mission success.\u003cbr/\u003e\u003cbr/\u003eOur team's work directly impacts the proper functioning of satellite vehicles, making our software development efforts crucial to mission success. We value technical excellence, collaborative problem-solving, and mutual support, creating an environment where talented engineers can thrive while working on technology that matters.","department_cost_center":null,"description_short":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to","display_distance":null,"id":"e1afaac4-245f-4dda-b2b1-ab1d9831d017","id_icims":"3157611","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3157611/software-development-engineer-provisioning-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA114\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":[],"posted_date":"January 13, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Redmond - 143,700.00 - 194,400.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Software Development Engineer, Provisioning - Amazon Leo","university_job":null,"updated_time":"2 minutes","url_next_step":"https://account.amazon.com/jobs/3157611/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon Leo will serve people and organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- You will work with multiple cross functional teams to gather requirements, design, develop, deploy, and operate it across solution pipelines.\u003cbr/\u003e- You will collaborate and lead initiatives across multiple teams to build networking functions on AWS cloud infrastructure and set best practices for software development processes.\u003cbr/\u003e- You will lead teams, develop code, build CI/CD pipelines, test automation, and dashboards for monitoring health of systems and data pipelines.\u003cbr/\u003e- You will develop and mentor junior and new team members.\u003cbr/\u003e- You will engineer and build solutions which are required for provisioning, address management, packet inspection and dynamic traffic management for Internet service providers.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eA SDE in Leo Network Services is responsible for designing, developing, testing, deploying, and operating services that enable broadband networks systems worldwide. We write code, debug, and create the world’s most innovative products. We work in collaboration with other teams for designing and delivering scalable, flexible, low latency, and high throughput network functions. We develop flexible and cost-effective solutions in support of connecting and peering with public and private networks. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eLeo Network’s goal to connect users around the world, is a commitment to not just establish networks but to connect customers to services. These services enable customer terminals and applications the ability to interface with the larger world. Our services come into focus for each Leo subscriber at activation from address assignment and name resolution to secure and programmable network functions. The Network Services team walks backward from end-user’s perspective as we design and develop network functions that serve their unique asks.","department_cost_center":null,"description_short":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to","display_distance":null,"id":"9205dc99-c4e0-489d-aa02-990534961b11","id_icims":"3155387","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3155387/sr-software-development-engineer-leo-network-services","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA114\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":[],"posted_date":"January  8, 2026","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- Knowledge of professional software engineering \u0026 best practices for full software development life cycle, including coding standards, software architectures, code reviews, source control management, continuous deployments, testing, and operational excellence\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Redmond - 168,100.00 - 227,400.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Sr. Software Development Engineer, Leo Network Services","university_job":null,"updated_time":"2 minutes","url_next_step":"https://account.amazon.com/jobs/3155387/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 4+ years of working in mechanical engineering or equivalent experience\u003cbr/\u003e- Experience with prototyping and implementation\u003cbr/\u003e- Experience in developing functional specifications, design verification plans and functional test procedures","business_category":"aws","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"As part of the Applied AI Solutions organization, we have a vision to provide business applications that are used by millions of companies worldwide to manage day-to-day operations, leveraging Amazon’s unique experience and expertise. We accomplish this by accelerating our customers’ businesses through delivery of intuitive and differentiated technology solutions that solve their enduring challenges. Where customers prefer to buy over build, we become their trusted partner with solutions that are no-brainers to buy and easy to use and maintain.\u003cbr/\u003e\u003cbr/\u003eInnovation is part of our DNA! Our goal is to be Earth’s most customer-centric company and we are just getting started. We are looking for people who want to join an ambitious team that continues to push the state of the art in computer vision, machine learning, distributed systems and hardware design. \u003cbr/\u003e\u003cbr/\u003eAs an experienced Hardware Design Engineer within our team, you will engage with a skilled and accomplished cross-disciplinary staff to conceive and design innovative technologies. You will collaborate with internal and external stakeholders to drive key aspects of technology solution definition, execution and validation. \u003cbr/\u003e\u003cbr/\u003e Full cycle product development experience from inception through maturity is important. Working simultaneously on projects in different phases is common; you are able to demonstrate strong design and validation skills in addition to the understanding of mechanics of ongoing operational excellence and product support. You are responsive, flexible, and able to succeed within an open collaborative peer environment.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Contribute to system and component requirements.\u003cbr/\u003e- Collaborate with Sr. and Principal Electrical Engineers on system architecture and approaches.\u003cbr/\u003e- Create schematics and pcb layouts in Altium.\u003cbr/\u003e- Review schematics and pcb layouts of peers and contractors.\u003cbr/\u003e- Create documentation for production.\u003cbr/\u003e- Collaborate with contract manufacturers to optimize designs for manufacturability, testability, and reliability.\u003cbr/\u003e - Bringup and debug hardware.\u003cbr/\u003e- Write and execute Design Validation Test plans.\u003cbr/\u003e- Contribute to Manufacturing Test, Compliance, and Reliability development.\u003cbr/\u003e- Sustain what you have built above to ensure consistently delighted customers.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eABOUT AWS:\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe team is a group of electrical, mechanical, embedded firmware, manufacturing, and manufacturing engineers who devise hardware that enables Just Walk Out and RFID shopping experiences","department_cost_center":null,"description_short":"As part of the Applied AI Solutions organization, we have a vision to provide business applications that are used by millions of companies worldwide to manage day-to-day operations, leveraging Amazon’s","display_distance":null,"id":"6b3eb7e6-ab29-40d7-b690-901bc1b748d4","id_icims":"3130840","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/3130840/electrical-engineer-aws-applied-ai-services","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA55\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"November 21, 2025","preferred_qualifications":"- Knowledge of SolidWorks simulation or Ansys Finite Element analysis tools\u003cbr/\u003e- Experience in the design of complex mechanical products and equipment at volume\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $105,600/year in our lowest geographic market up to $185,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-hardware-development-primary","source_system":"JobCreator","state":"WA","title":"Electrical Engineer, AWS Applied AI Services","university_job":null,"updated_time":"2 minutes","url_next_step":"https://account.amazon.com/jobs/3130840/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-hardware-development-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 1+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- 3+ years of Object Oriented Design experience","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon Leo will serve people and organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eYou will design, craft, and deploy reliable embedded software for large quantity of consumer electronic products. Leo is breaking new ground with every device we design, and you will be an integral part of bringing this family of products to customers.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement: Due to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e· Develop embedded software for terrestrial devices within the Leo system.\u003cbr/\u003e· Participate in all phases of SDLC including requirements gathering, design, code, test, and code/test coverage.\u003cbr/\u003e· Developing embedded software in assembly, C, C++, Rust or other languages\u003cbr/\u003e· Have experience with real-time embedded software philosophies and practices\u003cbr/\u003e· Have expertise working and developing in a Linux environment\u003cbr/\u003e· Review schematics, logic analyzer, and embedded software trouble-shooting techniques.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs part of our BSP software engineering team, you will design and implement embedded software used in the Leo products. You will work in a collaborative environment with teams inside and outside of Amazon. You will craft your software from requirements, designs, code, test, to product deployment. You need to be flexible and responsive to changing priority issues.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Leo Customer Terminal Software Team supports the devices that connect our customers to the Leo network. We provide software for both applications and the underlying Linux system. We work hand in hand with hardware, product and operations teams to deliver a great experience for our customers.","department_cost_center":null,"description_short":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to","display_distance":null,"id":"5f84dd87-cafb-44e1-aa95-bf65cbd70eea","id_icims":"3154772","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3154772/software-dev-engineer-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA114\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":[],"posted_date":"January  7, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Redmond - 143,700.00 - 194,400.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Software Dev Engineer, Amazon Leo","university_job":null,"updated_time":"3 minutes","url_next_step":"https://account.amazon.com/jobs/3154772/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 8+ years of major internet routing protocols experience\u003cbr/\u003e- 5+ years of working in a Linux/Unix environment experience\u003cbr/\u003e- 3+ years of automation scripting using Python, Bash, Shell and/or Perl experience\u003cbr/\u003e- Experience in IP networking technologies such as - BGP, OSPF, IS-IS, MPLS, TCP, SLB, network hardware platforms, and packet forwarding architectures.\u003cbr/\u003e- Network design, engineering, implementation, and/or operations experience.\u003cbr/\u003e- Experience leading solutioning, planning, engineering, growth, operations, and/or enhancement of industry leading IP network solutions.\u003cbr/\u003e- Bachelor's degree in Networking, Computer Science, Computer Engineering, or related technical discipline.","business_category":"aws","city":"Herndon","company_name":"Amazon Development Center U.S., Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services Networking is searching for hands-on Senior Network Development Engineer to join our network team that owns critical Amazon Web Services IP networks for our public sector regions. The team drives design, engineering, implementation, operations, reliability, and sustainability of these next-generation networks and works on innovative ways to automate and scale our network as we expand. Position location can be Herndon, VA, Arlington, VA, or Seattle, WA.\u003cbr/\u003e\u003cbr/\u003eOur ideal candidate is hands-on, autonomous, detail oriented, possesses strong written and verbal communication skills, strong project management and time management skills, and has a successful track record of engineering, delivering, and optimizing durable solutions. The desire and ability to work in a fast paced, collaborative environment; with geographically diverse teams is essential. This is a fantastic opportunity to work with some of the best engineers in the industry and help shape the direction of one of the largest and fastest growing cloud networks in the world.\u003cbr/\u003e  \u003cbr/\u003eResponsibilities:\u003cbr/\u003e\u003cbr/\u003e - As a Senior Network Development Engineer working in AWS Networking, you will have end to end ownership (design, engineering, implementation, operations escalation) of our current and newly developing IP networks\u003cbr/\u003e -  Lead the design and evolution of highly available hyper-scale networks, driving them from concept to launch, and beyond  \u003cbr/\u003e -  Define and influence strategy within and outside the team \u003cbr/\u003e -  Lead project teams to deliver impactful benefits to our customers \u003cbr/\u003e -  Work closely with our network engineers and software developers to automate network deployment and operations \u003cbr/\u003e -  Drive operational excellence projects to improve network performance and reliability \u003cbr/\u003e -  Troubleshoot complex problems and develop innovative solutions \u003cbr/\u003e - Hiring, mentoring and coaching engineers \u003cbr/\u003e -  Review and implement changes on the network\u003cbr/\u003ePhysical and Other Requirements:\u003cbr/\u003e -  Must be willing to support an off-hours operations escalation pager rotation. \u003cbr/\u003e -  Experience dealing with customers during problem resolution and operating efficiently under pressure.\u003cbr/\u003e -   The ability to sit in front of computer during scheduled work hours  with appropriate breaks while maintaining a high level of alertness and  attention to detail.\u003cbr/\u003e -  Travel to data center/network sites and Amazon/customer offices as needed.\u003cbr/\u003e\u003cbr/\u003eThis position requires that the candidate selected be a U.S. citizen and obtain and maintain an active TS/SCI with a polygraph.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. ","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"199dfb7d-d5be-49bd-9201-72a73a79bd7c","id_icims":"3055031","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Network Development","job_function_id":null,"job_path":"/en/jobs/3055031/sr-network-development-engineer-adc-network-design-engineering-and-solutions","job_schedule_type":"full-time","location":"US, VA, Herndon","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD21\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Herndon, Virginia, USA","optional_search_labels":["aws.team-adc-infra-optional","aws.team-neteng","military","aws.team-clearedvets","aws.team-ais"],"posted_date":"August  8, 2025","preferred_qualifications":"- Ability to lead and deliver complex network projects and drive operational excellence.\u003cbr/\u003e- Proficiency in developing network automation software.\u003cbr/\u003e- Ability to drive and manage customer impacting network events.\u003cbr/\u003e- Ability to work in a fast paced and collaborative environment.\u003cbr/\u003e- Ability to deal with ambiguity, prioritize, and time manage effectively.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $143,200/year in our lowest geographic market up to $247,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-us-security-clearance-jobs-primary","source_system":"JobCreator","state":"VA","title":"Sr. Network Development Engineer, ADC Network Design, Engineering, and Solutions","university_job":null,"updated_time":"3 minutes","url_next_step":"https://account.amazon.com/jobs/3055031/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-us-security-clearance-jobs-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development testing experience\u003cbr/\u003e- 3+ years of test automation frameworks and tools building experience\u003cbr/\u003e- Experience programming with at least one modern language such as Java, C++, or C# including object-oriented design\u003cbr/\u003e- Experience in penetration testing and exploitability-focused vulnerability assessment\u003cbr/\u003e- Experience in platform-level security mitigations and hardening for Linux and Windows","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"We are looking for SDET II engineers with experience in supporting mission-critical applications, who are excited about building solutions that enhance automation, stability, and release processes across multiple systems. You will work closely with engineering teams to identify and address common issues, drive solutions, and improve overall release quality and reliability. This role requires hands-on engagement, troubleshooting, and automation development. You will work within the Leo Software Release Management team, managing release processes and automation to maintain a seamless and efficient pipeline. The team operates an on-call support rotation, and you will be responsible for maintaining release quality and pipeline health. Your work will directly impact Leo's ability to deliver high-quality, reliable releases efficiently.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThis role sits at the intersection of test automation, CI/CD, release engineering, and operational reliability. \u003cbr/\u003e\u003cbr/\u003e1. CI/CD Pipeline Ownership \u0026 Stability\u003cbr/\u003e- Own the daily build, test, and release pipelines end to end\u003cbr/\u003e- Monitor pipeline health, stability, and performance\u003cbr/\u003e- Diagnose and resolve pipeline failures (build, test, infra, dependency issues)\u003cbr/\u003e- Reduce flaky tests and nondeterministic failures\u003cbr/\u003e- Improve pipeline speed, reliability, and signal-to-noise ratio\u003cbr/\u003e\u003cbr/\u003e2. Release Engineering \u0026 Software Delivery\u003cbr/\u003e- Manage software build and release activities across environments\u003cbr/\u003e- Track releases, validate readiness, and enforce quality gates\u003cbr/\u003e- Support complex, multi-stage release processes\u003cbr/\u003e- Ensure releases meet quality, compliance, and reliability standards\u003cbr/\u003e- Partner with Dev, QA, and Ops during releases and hotfixes\u003cbr/\u003e\u003cbr/\u003e3. Test Automation at Scale\u003cbr/\u003e- Design, implement, and maintain automated test frameworks (API, integration, system, end-to-end)\u003cbr/\u003e- Integrate automated tests seamlessly into CI/CD pipelines\u003cbr/\u003e- Ensure test coverage aligns with risk, not just code coverage\u003cbr/\u003e- Build tooling to improve test execution efficiency and observability\u003cbr/\u003e\u003cbr/\u003e4. Operational Support \u0026 Incident Response\u003cbr/\u003e- Respond to pipeline, release, and production-impacting issues\u003cbr/\u003e- Participate in triage, on-call rotations, and incident resolution\u003cbr/\u003e- Debug high-complexity failures across code, infrastructure, and environments\u003cbr/\u003e- Drive root cause analysis (RCA) and preventative fixes\u003cbr/\u003e\u003cbr/\u003e5. Reliability \u0026 Continuous Improvement\u003cbr/\u003e- Create automated solutions to improve reliability, scalability, and efficiency\u003cbr/\u003e- Identify systemic issues and eliminate manual processes\u003cbr/\u003e- Introduce metrics, dashboards, and alerts for build/test/release health\u003cbr/\u003e- Champion best practices in testing, automation, and release management\u003cbr/\u003e\u003cbr/\u003e6. Technical Leadership \u0026 Collaboration (Senior-Level Expectation)\u003cbr/\u003e- Influence architecture and design for testability and reliability\u003cbr/\u003e- Mentor junior engineers on automation and CI/CD practices\u003cbr/\u003e- Partner closely with DevOps, Platform, and Infrastructure teams\u003cbr/\u003e- Drive standards and long-term quality strategy\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAn SDET II works closely with development, QA, and DevOps teams to ensure the reliability and quality of daily builds, automated tests, and release pipelines. They spend much of their time monitoring CI/CD pipelines, troubleshooting build and test failures, supporting software releases, and improving test automation and operational tooling. This role is hands-on and execution-focused, with opportunities to grow toward technical ownership and leadership.\u003cbr/\u003e\u003cbr/\u003eOn a typical day, you will:\u003cbr/\u003e- Monitor daily builds, automated test runs, and CI/CD pipeline health\u003cbr/\u003e- Investigate and resolve build, test, and pipeline failures\u003cbr/\u003e- Support software build and release activities across environments\u003cbr/\u003e- Participate in issue triage and help resolve operational or release-blocking issues\u003cbr/\u003e- Analyze failures, identify root causes, and implement fixes to prevent recurrence\u003cbr/\u003e- Develop, maintain, and improve automated test solutions integrated into pipelines\u003cbr/\u003e- Work with developers and DevOps engineers to improve testability, reliability, and release efficiency\u003cbr/\u003e- Contribute to documentation, dashboards, and metrics for build and release tracking\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe ANCHOR team (Automated Navigation and Control of Releases) is focused on streamlining and standardizing the release process. This team manages releases for all Payload LRUs, including Ground LRUs, ensuring consistent release quality, pipeline health, and process efficiency. The team’s charter includes creating release automation, documenting changes, tracking versioned releases, and supporting the transition to a common versionset structure as a long-term strategy. ANCHOR operates autonomously, focused on improving time-to-release, automation reliability, and release transparency.","department_cost_center":null,"description_short":"We are looking for SDET II engineers with experience in supporting mission-critical applications, who are excited about building solutions that enhance automation, stability, and release processes across","display_distance":null,"id":"b81de674-6a63-44d1-abc6-607b080e1792","id_icims":"3151418","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3151418/software-dev-engineer-in-test-ii-leo-anchor","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA114\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":[],"posted_date":"January  3, 2026","preferred_qualifications":"- Knowledge of software development lifecycle, including design, development, test, build, deployment processes and timelines\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $129,300/year in our lowest geographic market up to $223,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Software Dev Engineer in Test II, Leo Anchor","university_job":null,"updated_time":"3 minutes","url_next_step":"https://account.amazon.com/jobs/3151418/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 4+ years of non-internship professional software development testing experience\u003cbr/\u003e- 3+ years of software QA testing work with writing the test plans, use cases, and issue reports experience\u003cbr/\u003e- Experience managing programs across cross-functional teams, building processes and coordinating release schedules\u003cbr/\u003e- Experience programming with at least one modern language such as Java, C++, or C# including object-oriented design","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"We are looking for Sr. SDET engineers with experience in supporting mission-critical applications, who are excited about building solutions that enhance automation, stability, and release processes across multiple systems. You will work closely with engineering teams to identify and address common issues, drive solutions, and improve overall release quality and reliability. This role requires hands-on engagement, troubleshooting, and automation development. You will work within the ANCHOR team, managing release processes and automation to maintain a seamless and efficient pipeline. The team operates an on-call support rotation, and you will be responsible for maintaining release quality and pipeline health. Your work will directly impact Leo's ability to deliver high-quality, reliable releases efficiently.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThis role sits at the intersection of test automation, CI/CD, release engineering, and operational reliability. \u003cbr/\u003e\u003cbr/\u003e1. CI/CD Pipeline Ownership \u0026 Stability\u003cbr/\u003e- Own the daily build, test, and release pipelines end to end\u003cbr/\u003e- Monitor pipeline health, stability, and performance\u003cbr/\u003e- Diagnose and resolve pipeline failures (build, test, infra, dependency issues)\u003cbr/\u003e- Reduce flaky tests and nondeterministic failures\u003cbr/\u003e- Improve pipeline speed, reliability, and signal-to-noise ratio\u003cbr/\u003e\u003cbr/\u003e2. Release Engineering \u0026 Software Delivery\u003cbr/\u003e- Manage software build and release activities across environments\u003cbr/\u003e- Track releases, validate readiness, and enforce quality gates\u003cbr/\u003e- Support complex, multi-stage release processes\u003cbr/\u003e- Ensure releases meet quality, compliance, and reliability standards\u003cbr/\u003e- Partner with Dev, QA, and Ops during releases and hotfixes\u003cbr/\u003e\u003cbr/\u003e3. Test Automation at Scale\u003cbr/\u003e- Design, implement, and maintain automated test frameworks (API, integration, system, end-to-end)\u003cbr/\u003e- Integrate automated tests seamlessly into CI/CD pipelines\u003cbr/\u003e- Ensure test coverage aligns with risk, not just code coverage\u003cbr/\u003e- Build tooling to improve test execution efficiency and observability\u003cbr/\u003e\u003cbr/\u003e4. Operational Support \u0026 Incident Response\u003cbr/\u003e- Respond to pipeline, release, and production-impacting issues\u003cbr/\u003e- Participate in triage, on-call rotations, and incident resolution\u003cbr/\u003e- Debug high-complexity failures across code, infrastructure, and environments\u003cbr/\u003e- Drive root cause analysis (RCA) and preventative fixes\u003cbr/\u003e\u003cbr/\u003e5. Reliability \u0026 Continuous Improvement\u003cbr/\u003e- Create automated solutions to improve reliability, scalability, and efficiency\u003cbr/\u003e- Identify systemic issues and eliminate manual processes\u003cbr/\u003e- Introduce metrics, dashboards, and alerts for build/test/release health\u003cbr/\u003e- Champion best practices in testing, automation, and release management\u003cbr/\u003e\u003cbr/\u003e6. Technical Leadership \u0026 Collaboration (Senior-Level Expectation)\u003cbr/\u003e- Influence architecture and design for testability and reliability\u003cbr/\u003e- Mentor junior engineers on automation and CI/CD practices\u003cbr/\u003e- Partner closely with DevOps, Platform, and Infrastructure teams\u003cbr/\u003e- Drive standards and long-term quality strategy\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eA Sr. SDET works closely with development, QA, and DevOps teams to ensure the reliability and quality of daily builds, automated tests, and release pipelines. They spend much of their time monitoring CI/CD pipelines, troubleshooting build and test failures, supporting software releases, and improving test automation and operational tooling. This role is hands-on and execution-focused, with opportunities to grow toward technical ownership and leadership.\u003cbr/\u003e\u003cbr/\u003eOn a typical day, you will:\u003cbr/\u003e- Monitor daily builds, automated test runs, and CI/CD pipeline health\u003cbr/\u003e- Investigate and resolve build, test, and pipeline failures\u003cbr/\u003e- Support software build and release activities across environments\u003cbr/\u003e- Participate in issue triage and help resolve operational or release-blocking issues\u003cbr/\u003e- Analyze failures, identify root causes, and implement fixes to prevent recurrence\u003cbr/\u003e- Develop, maintain, and improve automated test solutions integrated into pipelines\u003cbr/\u003e- Work with developers and DevOps engineers to improve testability, reliability, and release efficiency\u003cbr/\u003e- Contribute to documentation, dashboards, and metrics for build and release tracking\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe ANCHOR team (Automated Navigation and Control of Releases) is focused on streamlining and standardizing the release process. This team manages releases for all Payload LRUs, including Ground LRUs, ensuring consistent release quality, pipeline health, and process efficiency. The team’s charter includes creating release automation, documenting changes, tracking versioned releases, and supporting the transition to a common versionset structure as a long-term strategy. ANCHOR operates autonomously, focused on improving time-to-release, automation reliability, and release transparency.","department_cost_center":null,"description_short":"We are looking for Sr. SDET engineers with experience in supporting mission-critical applications, who are excited about building solutions that enhance automation, stability, and release processes across","display_distance":null,"id":"12a0315e-0c56-4ac1-adf4-17b5f940fef0","id_icims":"3151415","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3151415/sr-software-dev-engineer-in-test-leo-anchor","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA114\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":[],"posted_date":"January  3, 2026","preferred_qualifications":"- 3+ years of software development and delivery experience\u003cbr/\u003e- Experience in penetration testing and exploitability-focused vulnerability assessment\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $151,300/year in our lowest geographic market up to $261,500/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Sr. Software Dev Engineer in Test, Leo Anchor","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3151415/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development testing experience\u003cbr/\u003e- 3+ years of test automation frameworks and tools building experience\u003cbr/\u003e- Experience programming with at least one modern language such as Java, C++, or C# including object-oriented design\u003cbr/\u003e- Experience in penetration testing and exploitability-focused vulnerability assessment\u003cbr/\u003e- Experience in platform-level security mitigations and hardening for Linux and Windows","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"We are looking for SDET II engineers with experience in supporting mission-critical applications, who are excited about building solutions that enhance automation, stability, and release processes across multiple systems. You will work closely with engineering teams to identify and address common issues, drive solutions, and improve overall release quality and reliability. This role requires hands-on engagement, troubleshooting, and automation development. You will work within the ANCHOR team, managing release processes and automation to maintain a seamless and efficient pipeline. The team operates an on-call support rotation, and you will be responsible for maintaining release quality and pipeline health. Your work will directly impact Leo's ability to deliver high-quality, reliable releases efficiently.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThis role sits at the intersection of test automation, CI/CD, release engineering, and operational reliability. \u003cbr/\u003e\u003cbr/\u003e1. CI/CD Pipeline Ownership \u0026 Stability\u003cbr/\u003e- Own the daily build, test, and release pipelines end to end\u003cbr/\u003e- Monitor pipeline health, stability, and performance\u003cbr/\u003e- Diagnose and resolve pipeline failures (build, test, infra, dependency issues)\u003cbr/\u003e- Reduce flaky tests and nondeterministic failures\u003cbr/\u003e- Improve pipeline speed, reliability, and signal-to-noise ratio\u003cbr/\u003e\u003cbr/\u003e2. Release Engineering \u0026 Software Delivery\u003cbr/\u003e- Manage software build and release activities across environments\u003cbr/\u003e- Track releases, validate readiness, and enforce quality gates\u003cbr/\u003e- Support complex, multi-stage release processes\u003cbr/\u003e- Ensure releases meet quality, compliance, and reliability standards\u003cbr/\u003e- Partner with Dev, QA, and Ops during releases and hotfixes\u003cbr/\u003e\u003cbr/\u003e3. Test Automation at Scale\u003cbr/\u003e- Design, implement, and maintain automated test frameworks (API, integration, system, end-to-end)\u003cbr/\u003e- Integrate automated tests seamlessly into CI/CD pipelines\u003cbr/\u003e- Ensure test coverage aligns with risk, not just code coverage\u003cbr/\u003e- Build tooling to improve test execution efficiency and observability\u003cbr/\u003e\u003cbr/\u003e4. Operational Support \u0026 Incident Response\u003cbr/\u003e- Respond to pipeline, release, and production-impacting issues\u003cbr/\u003e- Participate in triage, on-call rotations, and incident resolution\u003cbr/\u003e- Debug high-complexity failures across code, infrastructure, and environments\u003cbr/\u003e- Drive root cause analysis (RCA) and preventative fixes\u003cbr/\u003e\u003cbr/\u003e5. Reliability \u0026 Continuous Improvement\u003cbr/\u003e- Create automated solutions to improve reliability, scalability, and efficiency\u003cbr/\u003e- Identify systemic issues and eliminate manual processes\u003cbr/\u003e- Introduce metrics, dashboards, and alerts for build/test/release health\u003cbr/\u003e- Champion best practices in testing, automation, and release management\u003cbr/\u003e\u003cbr/\u003e6. Technical Leadership \u0026 Collaboration (Senior-Level Expectation)\u003cbr/\u003e- Influence architecture and design for testability and reliability\u003cbr/\u003e- Mentor junior engineers on automation and CI/CD practices\u003cbr/\u003e- Partner closely with DevOps, Platform, and Infrastructure teams\u003cbr/\u003e- Drive standards and long-term quality strategy\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAn SDET II works closely with development, QA, and DevOps teams to ensure the reliability and quality of daily builds, automated tests, and release pipelines. They spend much of their time monitoring CI/CD pipelines, troubleshooting build and test failures, supporting software releases, and improving test automation and operational tooling. This role is hands-on and execution-focused, with opportunities to grow toward technical ownership and leadership.\u003cbr/\u003e\u003cbr/\u003eOn a typical day, you will:\u003cbr/\u003e- Monitor daily builds, automated test runs, and CI/CD pipeline health\u003cbr/\u003e- Investigate and resolve build, test, and pipeline failures\u003cbr/\u003e- Support software build and release activities across environments\u003cbr/\u003e- Participate in issue triage and help resolve operational or release-blocking issues\u003cbr/\u003e- Analyze failures, identify root causes, and implement fixes to prevent recurrence\u003cbr/\u003e- Develop, maintain, and improve automated test solutions integrated into pipelines\u003cbr/\u003e- Work with developers and DevOps engineers to improve testability, reliability, and release efficiency\u003cbr/\u003e- Contribute to documentation, dashboards, and metrics for build and release tracking\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe ANCHOR team (Automated Navigation and Control of Releases) is focused on streamlining and standardizing the release process. This team manages releases for all Payload LRUs, including Ground LRUs, ensuring consistent release quality, pipeline health, and process efficiency. The team’s charter includes creating release automation, documenting changes, tracking versioned releases, and supporting the transition to a common versionset structure as a long-term strategy. ANCHOR operates autonomously, focused on improving time-to-release, automation reliability, and release transparency.","department_cost_center":null,"description_short":"We are looking for SDET II engineers with experience in supporting mission-critical applications, who are excited about building solutions that enhance automation, stability, and release processes across","display_distance":null,"id":"bc8aff08-0278-4ac2-83d3-c3b60a2cd870","id_icims":"3151420","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3151420/software-dev-engineer-in-test-ii-leo-anchor","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA114\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":[],"posted_date":"January  3, 2026","preferred_qualifications":"- Knowledge of software development lifecycle, including design, development, test, build, deployment processes and timelines\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Redmond - 143,700.00 - 194,400.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Software Dev Engineer in Test II, Leo Anchor","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3151420/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of technical product management with internet business experience\u003cbr/\u003e- 5+ years of working as a Technical Product Manager experience\u003cbr/\u003e- 3+ years of technical (software development, network development, IT, other related) experience\u003cbr/\u003e- Experience in taking a product from conception \u0026 definition phase through engineering design and taking it to market\u003cbr/\u003e- Experience delivering large-scale SaaS, PaaS or LaaS products where you are responsible for the full product lifecycle, from concept through GTM (go to market)","business_category":"aws","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"GameLift Servers is an AWS service that helps the world’s largest game developers deploy and scale game servers for millions of players around the world. Game developers complete against all other forms of entertainment for attention from players, and have increasingly migrated toward building “always on, live” multiplayer games since they retain and monetize players better versus single-player experiences. A foundational component of most multiplayer games are backend game severs which bring multiple players together (either on PC, console or mobile) into the same simulated world. \u003cbr/\u003e\u003cbr/\u003eWe are looking for a Sr PMT-ES who is passionate about solving challenges in game server hosting. In this role, you will help solve the hardest challenges customers face when engaging players on a global scale: server deployment to dozens of edge locations around the world, scaling performance to 100K+ game servers and millions of concurrent players in just minutes, leveraging their existing on-prem capacity to form hybrid compute topologies, low player latency so that gameplay is imperceptible from local play, cost reduction levers such as Linux, Spot or Graviton, and sufficient observability to understand if end-players are getting the desired experience at the right cost.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"GameLift Servers is an AWS service that helps the world’s largest game developers deploy and scale game servers for millions of players around the world. Game developers complete against all other forms","display_distance":null,"id":"74f5f80f-5c60-449c-bb7c-c4a5e9339abf","id_icims":"3053594","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Product Management - Technical","job_function_id":null,"job_path":"/en/jobs/3053594/senior-product-manager-technical-aws-game-tech","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA68\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"August  7, 2025","preferred_qualifications":"- Experience working in the gaming space\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 152,200.00 - 205,900.00 USD annually","primary_search_label":"aws.team-product-management-primary","source_system":"JobCreator","state":"WA","title":"Senior Product Manager (Technical), AWS Game Tech","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3053594/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-product-management-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}