{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Bachelor's degree in finance, accounting, business, economics, or a related analytical field (e.g., engineering, math, computer science)\u003cbr/\u003e- 3+ years of tax, finance or a related analytical field experience","business_category":"finance","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"As the finance partner for the network infrastructure team, you will help them make optimal investment decisions that will help build a highly reliable, scalable, low-cost infrastructure platform in the cloud that powers hundreds of thousands of enterprise, government and start-up businesses and organizations in over 190 countries around the world.\u003cbr/\u003e\u003cbr/\u003eAWS is seeking a Senior Financial Analyst to lead controllership and automation within the Networking Finance team. This role is based in Seattle and works across the Infrastructure Finance organization with an opportunity to learn about how AWS is making investments in our GenAI Infrastructure , to connect regions globally. The successful candidate will be able to communicate effectively, partner with business and finance stakeholders, manage multiple and time sensitive deliverables, and deliver process improvements.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Partner with business and finance leads to develop strategy, and planning for investments in networking infrastructure for AWS.\u003cbr/\u003e- Lead process improvements and automation across Networking Finance. Partner with finance and business teams to identify and deliver process improvements/automation to improve controllership.\u003cbr/\u003e- Collaborate with finance and business teams across AWS to increase accuracy, reliability, and efficiency of Capex and Opex reporting.\u003cbr/\u003e- Partner with the business teams to build and report metrics that enable the leadership to track business health.","department_cost_center":null,"description_short":"As the finance partner for the network infrastructure team, you will help them make optimal investment decisions that will help build a highly reliable, scalable, low-cost infrastructure platform in the","display_distance":null,"id":"26033324-df87-486f-b36f-f5afa48fb92d","id_icims":"3100888","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/Planning","job_function_id":null,"job_path":"/en/jobs/3100888/sr-financial-analyst-networking-infra-finance","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA29\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"October  3, 2025","preferred_qualifications":"- MBA, or CPA\u003cbr/\u003e- Knowledge of Tableau\u003cbr/\u003e- Experience with advanced use of SQL for data mining and business intelligence\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 82,700.00 - 117,100.00 USD annually","primary_search_label":"finance.team-aws","source_system":"JobCreator","state":"WA","title":"Sr. Financial Analyst, Networking Infra Finance","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3100888/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-aws","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- PhD, or Master's degree and 4+ years of quantitative field research experience\u003cbr/\u003e- Knowledge of at least one modern programming language such as C, C++, Java, or Perl\u003cbr/\u003e- Experience doing research on air traffic management algorithms","business_category":"retail","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Here at Amazon, we embrace our differences. We are committed to furthering our culture of diversity and inclusion of our teams within the organization.\u003cbr/\u003e\u003cbr/\u003eHow do you get items to customers quickly, cost-effectively, and—most importantly—safely, in less than an hour? And how do you do it in a way that can scale? Our teams of hundreds of scientists, engineers, aerospace professionals, and futurists have been working hard to do just that! We are delivering to customers, and are excited for what’s to come. Check out more information about Prime Air on the About Amazon blog (https://www.aboutamazon.com/news/transportation/amazon-prime-air-delivery-drone-reveal-photos).\u003cbr/\u003e\u003cbr/\u003eIf you are seeking an iterative environment where you can drive innovation, apply state-of-the-art technologies to solve real world delivery challenges, and provide benefits to customers, Prime Air is the place for you.\u003cbr/\u003e\u003cbr/\u003eCome work on the Amazon Prime Air Team!\u003cbr/\u003e\u003cbr/\u003eWe're looking for a Research Scientist with a background in developing simulations for traffic management algorithms, including expert knowledge in strategic deconfliction, tactical deconfliction, or detect-and-avoid systems.  Managing a large number of concurrent autonomous drone flights that share airspace with other autonomous or manned aircraft is a challenging problem. Be part of the team building simulation tools and algorithms to solve this at scale.\u003cbr/\u003e\u003cbr/\u003eThis role will contribute to a portfolio of simulation tools managing concurrent airspace traffic for aviation systems. This will include developing new methodologies in the areas of conflict detection and resolution, as well as developing related software systems that will be used in operation to enable package delivery at scale. The ideal candidate is comfortable with risk-taking and ambiguity and able to build consensus on critical, controversial technical decisions. If you enjoy the process of solving real-world problems that haven’t been solved at scale anywhere before, Prime Air is right for you. Along the way, we guarantee you’ll get opportunities to be a disruptor, prolific innovator, and a reputed problem solver and directly impact Amazon’s customers worldwide.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe primary focus of this role will be on modeling traffic management frameworks that use a layered conflict detection and resolution strategy to ensure safe and efficient flight operations. This will include developing fundamental simulation infrastructure code, including discrete event simulation tooling. In addition, it will involve developing expert knowledge of the layers of mitigation and conducting in-depth scientific research on alternative solutions for conflict resolution. The candidate will contribute to significant and impactful systems that will provide value for Amazon customers and will drive these projects from the concept stage through development. This role will include substantial software development in prototyping and production environments.","department_cost_center":null,"description_short":"Here at Amazon, we embrace our differences. We are committed to furthering our culture of diversity and inclusion of our teams within the organization.How do you get items to customers quickly, cost-effectively,","display_distance":null,"id":"5eac3806-d1ef-4f73-85b8-778ad4409227","id_icims":"3170072","is_intern":null,"is_manager":null,"job_category":"Research Science","job_family":"Research Science","job_function_id":null,"job_path":"/en/jobs/3170072/airspace-management-simulation-research-scientist-prime-air-flight-sciences-high-fidelity-methods","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA109\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"January 29, 2026","preferred_qualifications":"- Experience developing software in a production environment\u003cbr/\u003e- Experience publishing and presenting scientific research in professional journals or conferences\u003cbr/\u003e- Experience with building discrete event simulation tools from first principles, air traffic flow management, routing algorithms\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 136,000.00 - 184,000.00 USD annually","primary_search_label":"retail.team-global-prime-air","source_system":"JobCreator","state":"WA","title":"Airspace Management Simulation Research Scientist, Prime Air Flight Sciences High Fidelity Methods","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3170072/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-prime-air","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of technical product or program management experience\u003cbr/\u003e- 7+ years of working directly with engineering teams experience\u003cbr/\u003e- 5+ years of technical program management working directly with software engineering teams experience\u003cbr/\u003e- Experience managing programs across cross functional teams, building processes and coordinating release schedules\u003cbr/\u003e- Bachelor's degree in engineering, computer science or equivalent\u003cbr/\u003e- 15+ years of experience in either mass production consumer electronics or aviation Experience in Design for Manufacture, Design for Test, Design for SMT, Design for Quality.","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon Leo will serve people and organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eA Senior Manufacturing Technical Manager in the Leo Customer Terminal Engineering organization will understand customer desires, technology, and business opportunities to design and deliver Customer Terminals to a diverse set of Aviation customers. You understand key problems and analyze multiple solutions working cross functionally to produce the most power efficient, cost effective, technically advanced, lowest cost manufacturing assembly and test, and scalable Customer Terminal available in the market. A Senior Manufacturing Technical Manager provides the global vision, rationale, and recommendations to leadership teams for challenging technical issues related to Customer Terminal manufacturing while working on continually improving manufacturing assembly and test each year.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAmazon's vision is to be the world's most customer-centric company, and this role is key to that vision. As a Senior Manufacturing Technical Manager, you will be leading projects to ever-evolving customer needs for the continual development and innovation of Customer Terminals. \u003cbr/\u003eAs an ideal candidate:\u003cbr/\u003e\u003cbr/\u003e• You are able to identify and solve technical manufacturing assembly and testing challenges independently. \u003cbr/\u003e• You are responsible for continual improvement of internal design team standards to optimize for manufacturing assembly and testing.\u003cbr/\u003e• Working with a team of engineers, business development leaders, industrial design, customer terminal operations, and product integrity, you are responsible for technical updates manufacturing and assembly line to drive CT performance standardization.\u003cbr/\u003e• You lead projects with widespread impact on CT design, innovation and implementation.\u003cbr/\u003e• You demonstrate ability to review business cases and analysis models with the business development team ensuring viability of program.\u003cbr/\u003e• You decompose complex problems and distill underlying risks and benefits, and identify straightforward and actionable solutions to reduce risk.\u003cbr/\u003e• You work independently and have frequent reviews with business, engineering, software, operations and others. \u003cbr/\u003e• You understand which escalations to resolve independently, and actively facilitate the escalation of high-impact issues to senior engineering and business leadership.\u003cbr/\u003e• You understand the key aspects of legacy and modern phase array antenna design for satellite systems and how to incorporate new innovations.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Leo is focused on providing broadband access to under served customers across the world. We are passionate about accomplishing this mission as quickly as possible without sacrificing quality or performance. We are constantly solving new problems and embrace people who thrive in a startup like environment and have an entrepreneurial mindset.\u003cbr/\u003e\u003cbr/\u003eEvery day brings new challenges to Leo. In the morning, you may be working on the technology roadmap for the next five years and in the afternoon diving deep on a technical issue delaying a build. The ability to set priorities using high value judgement is a must in the role as you will have independence on focus on what you deem is critical to the organization.\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to","display_distance":null,"id":"fb8089d5-cc6f-43ed-8c1d-4f6fdbebe8c2","id_icims":"3113894","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/3113894/sr-manufacturing-tech-mgr-amazon-leo-customer-terminals","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA111\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":[],"posted_date":"October 22, 2025","preferred_qualifications":"- 5+ years of project management disciplines including scope, schedule, budget, quality, along with risk and critical path management experience\u003cbr/\u003e- Experience managing projects across cross functional teams, building sustainable processes and coordinating release schedules\u003cbr/\u003e- Experience defining KPI's/SLA's used to drive multi-million dollar businesses and reporting to senior leadership\u003cbr/\u003e- Proficient in the use for statics (Cpk, Ppk, Design of Experiments, confidence level, correlation studies). Use of MiniTab or JMP.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $128,600/year in our lowest geographic market up to $213,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Sr. Manufacturing Tech. Mgr, Amazon Leo Customer Terminals","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3113894/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in developing functional specifications, design verification plans and functional test procedures","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon LEO is an initiative to increase global broadband access through a constellation of 3,236 satellites in low Earth orbit (LEO). Its mission is to bring fast, affordable broadband to unserved and underserved communities around the world. Amazon LEO will help close the digital divide by delivering fast, affordable broadband to a wide range of customers, including consumers, businesses, government agencies, and other organizations operating in places without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eAs a RF Engineer at Leo, you will work closely with the Hardware Engineering team and cross-functional partners to design, implement, debug, and characterize RF systems for high-performance WiFi access points. This role focuses on development, validation, and optimization of RF subsystems that enable our products to deliver exceptional wireless performance across multiple protocols including WiFi and Bluetooth. The wireless interfaces you'll work on are critical to product success, making RF system performance and reliability essential to customer experience.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- RF front-end design and implementation for WiFi access points\u003cbr/\u003e- Design and optimize multi-band RF circuits across 2.4/5/6 GHz bands\u003cbr/\u003e- Develop RF coexistence solutions for multi-radio platforms (WiFi/BT/Thread)\u003cbr/\u003e- Perform RF simulation using tools like ADS, HFSS for matching networks and signal chain optimization\u003cbr/\u003e- Work closely with antenna teams to ensure successful RF system integration\u003cbr/\u003e- Create and execute RF validation test plans, including OTA, RvR, and regulatory compliance testing\u003cbr/\u003e- Lead RF debugging efforts during development and production phases\u003cbr/\u003e- Support RF component selection and vendor qualification\u003cbr/\u003e- Drive system-level design reviews and technical documentation\u003cbr/\u003e- Develop automated RF calibration and test solutions for manufacturing\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003e\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.","department_cost_center":null,"description_short":"Amazon LEO is an initiative to increase global broadband access through a constellation of 3,236 satellites in low Earth orbit (LEO). Its mission is to bring fast, affordable broadband to unserved and","display_distance":null,"id":"d5b2c0b9-71a2-4c62-836f-ad830c1c73fd","id_icims":"3148478","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/3148478/senior-rf-engineer-wifi-amazon-leo-customer-terminals","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA111\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":[],"posted_date":"December 23, 2025","preferred_qualifications":"- Master's degree in electrical engineering, computer engineering, or equivalent\u003cbr/\u003e- Experience working with interdisciplinary teams to execute product design from concept to production\u003cbr/\u003e- Experience with the project management of technical projects\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Redmond - 137,300.00 - 185,700.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Senior RF Engineer (WiFi), Amazon Leo - Customer Terminals","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3148478/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of tax, finance or a related analytical field experience\u003cbr/\u003e- Bachelor's degree in finance, accounting, business, economics, or a related analytical field (e.g., engineering, math, computer science), or Bachelor's degree and 5+ years of quantitative role (engineering, process re-engineering, quality assurance) experience\u003cbr/\u003e- Due to the nature of work performed, this position requires that the selected candidate be a U.S. citizen","business_category":"finance","city":"Arlington","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join our team as a Finance Manager to support the fast-growing AWS Public Sector business. As part of the Regions Finance team, you'll drive strategic financial planning and analysis for AWS Infrastructure Regions. This role offers the unique opportunity to own a complete P\u0026L, providing you with comprehensive visibility across revenue, operating costs, capital expenditures, and free cash flow. You'll leverage your financial expertise to influence leadership business decisions and support long-term growth initiatives. This role works to understand the financial impact of high-level business trends (such as customer adoption, GenAI capacity planning, etc.) and synthesize insights to provide the business strategic financial analysis.\u003cbr/\u003e\u003cbr/\u003eYour strong problem-solving skills and leadership communication will be essential as you partner with senior leadership to develop financial frameworks that enable data-driven decision making. You'll analyze complex data sets, identify strategic opportunities, and provide valuable insights that shape the direction of the business. This role is ideal for a finance professional looking to develop into a general finance manager with significant business impact.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Own financial reporting for AWS Public Sector infrastructure, developing analyses and narratives that support operational and growth business decisions with senior leadership\u003cbr/\u003e- Build and maintain comprehensive financial models to support revenue forecasting and cost analysis to drive strategic long-term value\u003cbr/\u003e- Communicate frequently and effectively with business leaders, using timely and accurate financials to help make business decisions\u003cbr/\u003e- Independently align financial and operational analyses with business partners, challenging assumptions when necessary and providing recommendations that influence data-driven decision making.\u003cbr/\u003e- Identify opportunities and implement large-scale financial solutions to proactively resolve finance issues, improve scalability, and simplify finance tools and processes across teams.\u003cbr/\u003e- Dive deep to ensure reporting accuracy and compliance with internal and external policies while promoting strong controllership principles.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eIn this dynamic role, you'll find yourself tackling strategic financial problems that directly impact business performance. Rather than following a routine, you'll prioritize what's most important each day—whether that's developing financial models for new initiatives, collaborating with leadership on investment decisions, or analyzing P\u0026L components to identify optimization opportunities. You'll leverage data to influence cross-functional partners and present financial insights that drive meaningful business outcomes.","department_cost_center":null,"description_short":"Join our team as a Finance Manager to support the fast-growing AWS Public Sector business. As part of the Regions Finance team, you'll drive strategic financial planning and analysis for AWS Infrastructure","display_distance":null,"id":"ce713e70-d4dc-4c74-ba0a-6d989412414b","id_icims":"3126449","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/Planning","job_function_id":null,"job_path":"/en/jobs/3126449/finance-manager-aws-regions-finance-public-sector","job_schedule_type":"full-time","location":"US, VA, Arlington","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS17\"],\"normalizedCityName\":\"Arlington\"}"],"normalized_location":"Arlington, Virginia, USA","optional_search_labels":[],"posted_date":"November 13, 2025","preferred_qualifications":"- 6+ years of identifying incomplete or inaccurate data, identifying the root cause and creating/implementing an escalation plan experience\u003cbr/\u003e- 6+ years of solving complex business challenges by delivering accurate and timely financial models, analysis, and recommendations that have a proven impact on business (e.g., financial savings, operational improvements, or customer benefits) experience\u003cbr/\u003e- Experience delivering forecasting, budgeting, and variance analysis, and data interpretation of results\u003cbr/\u003e- Experience communicating results to senior leadership\u003cbr/\u003e- Knowledge of statistical modeling\u003cbr/\u003e- MBA, or CPA\u003cbr/\u003e- 6+ years of applying key financial performance indicators (KPIs) to analyses experience\u003cbr/\u003e- 6+ years of building financial and operational reports/data sets that inform business decision-making experience\u003cbr/\u003e- 6+ years of creating process improvements with automation and analysis experience\u003cbr/\u003e- 6+ years of participating in continuous improvement projects in your team to scale and improve controllership with measurable results experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Arlington - 95,400.00 - 163,200.00 USD annually","primary_search_label":"finance.team-aws","source_system":"JobCreator","state":"VA","title":"Finance Manager, AWS Regions Finance - Public Sector","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3126449/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-aws","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 8+ years of specific technology domain areas (e.g. software development, cloud computing, systems engineering, infrastructure, security, networking, data \u0026 analytics) experience\u003cbr/\u003e- 3+ years of design, implementation, or consulting in applications and infrastructures experience\u003cbr/\u003e- 10+ years of IT development or implementation/consulting in the software or Internet industries experience\u003cbr/\u003e- Current, active US  Government Security Clearance of Secret or above","business_category":"aws","city":"Arlington","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Application deadline: Feb 7, 2026\u003cbr/\u003e\u003cbr/\u003eDo you like helping the U.S. Army implement innovative cloud computing solutions and solve technical problems? Would you like to do this using the latest cloud computing technologies? Do you have a knack for helping these groups understand application architectures and integration approaches, and the consultative skills to launch a project on a trajectory to success?\u003cbr/\u003e\u003cbr/\u003eMust be willing to travel within the US and Overseas 35%. \u003cbr/\u003e\u003cbr/\u003eCome join our team as a Solutions Architect and help us accelerate our growing U.S. Department of Defense business as part of the World Wide Public Sector practice. This is an excellent opportunity to join Amazon’s truly innovative technical teams, while also developing your skills and furthering your career within one of the most innovative and progressive technology companies anywhere.\u003cbr/\u003e\u003cbr/\u003eIn this role, you will have the opportunity to help shape and deliver on a strategy to build broad use of Amazon's utility computing web services (e.g., Amazon DynamoDB, Amazon S3, Amazon EC2, and Amazon CloudFront) directly with customers and our ecosystem of system integrators and solution providers. Your broad responsibilities will include: owning the technical engagement and ultimate success around specific implementation projects; defining implementation architectures, responding to RFPs, developing a deep expertise in the AWS technologies as well as broad know-how around how applications and services are constructed using the AWS platform; and being a subject matter expert on security as it relates to customer applications and services.\u003cbr/\u003e\u003cbr/\u003eYou will provide thoughtful technical design and offer sensitivity to our customer needs in the Defense markets for cloud computing working with a truly innovative sales and business development team. You will lead efforts to capture and share best-practice knowledge amongst the AWS solution architect community. You will have the opportunity to learn from, collaborate with, and educate some of the brightest technical minds in the industry today across the breadth of enterprise architecture.\u003cbr/\u003e\u003cbr/\u003eYou should apply to this role if you are passionate about:\u003cbr/\u003e\u003cbr/\u003e- Creating, building, educating, training and designing cloud computing architectures for our Defense Department customers.\u003cbr/\u003e- Our company credo: “Work hard. Have fun. Make history.” It’s critical to love what you do and take pride in your value proposition to our customers.\u003cbr/\u003e- Deep-dive technical discussions around design and the curiosity to keep your technical skills current while maintaining a pulse on industry trends\u003cbr/\u003e\u003cbr/\u003eThis position requires that the candidate selected be a US Citizen and currently possess and maintain an active Top Secret security clearance.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis team works with Army customers at various locations throughout the US and overseas.  We listen to customer requirements, analyze and determine potential solutions, then assist Army customers to achieve their cloud goals.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS \u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon  conferences, inspire us to never stop embracing our uniqueness. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Do you like helping the U.S. Army implement innovative cloud computing solutions and solve technical problems? Would you like to do this using the latest cloud computing technologies? Do you have a knack","display_distance":null,"id":"06eef912-3388-4ae5-ada4-9de275f42b1f","id_icims":"3094365","is_intern":null,"is_manager":null,"job_category":"Solutions Architect","job_family":"Solution Architect","job_function_id":null,"job_path":"/en/jobs/3094365/solution-architect-wwps-army-us-army","job_schedule_type":"full-time","location":"US, VA, Arlington","locations":["{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Nashville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Nashville\",\"coordinates\":\"36.16792,-86.77798\",\"normalizedCountyName\":\"Davidson\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Nashville, Tennessee, USA\",\"location\":\"US, TN, Nashville\",\"region\":\"TN\",\"buildingCodeList\":[\"BNA12\"],\"normalizedCityName\":\"Nashville\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS17\"],\"normalizedCityName\":\"Arlington\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD28\"],\"normalizedCityName\":\"Herndon\"}","{\"normalizedStateName\":\"North Carolina\",\"normalizedCountryCode\":\"USA\",\"city\":\"Raleigh\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NC, Raleigh\",\"coordinates\":\"35.78543,-78.6427\",\"normalizedCountyName\":\"Wake\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Raleigh, North Carolina, USA\",\"location\":\"US, NC, Raleigh\",\"region\":\"NC\",\"buildingCodeList\":[\"RDU11\"],\"normalizedCityName\":\"Raleigh\"}"],"normalized_location":"Arlington, Virginia, USA","optional_search_labels":["military-tech","aws.team-solutions-architects","military"],"posted_date":"September 26, 2025","preferred_qualifications":"- 5+ years of infrastructure architecture, database architecture and networking experience\u003cbr/\u003e- Experience working with end user or developer communities\u003cbr/\u003e- Experience communicating across technical and non-technical audiences, including executive level stakeholders or clients\u003cbr/\u003e- Experience architecting infrastructure solutions using both Linux/Unix and Windows with specific recommendations on server, load balancing, HA/DR, \u0026 storage architectures\u003cbr/\u003e- Executive Speaking and Presentation Skills White board, small and large group presentations\u003cbr/\u003e- Technical – Web Services development/deployment experience, cloud computing\u003cbr/\u003e- Operational – Web site/services operations, management, and security\u003cbr/\u003e- Economic and business – RFP/Acquisition support; Technical architecture; understanding market trends; cost benefit analysis\u003cbr/\u003e- Advisory/Consulting experience with Defense Department customers\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Denver - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, NC, Raleigh - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, TN, Nashville - 145,900.00 - 197,400.00 USD annually\u003cbr/\u003eUSA, VA, Arlington - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, VA, Herndon - 153,600.00 - 207,800.00 USD annually","primary_search_label":"aws.team-us-security-clearance-jobs-primary","source_system":"JobCreator","state":"VA","title":"Solution Architect-WWPS-Army, US Army","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3094365/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-us-security-clearance-jobs-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of tax, finance or a related analytical field experience\u003cbr/\u003e- Bachelor's degree in finance, accounting, business, economics, or a related analytical field (e.g., engineering, math, computer science), or Bachelor's degree and 5+ years of quantitative role (engineering, process re-engineering, quality assurance) experience","business_category":"finance","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"AWS Finance seeks a Finance Manager to join the Networking Finance team. This is an exciting opportunity to work with Network Engineering and Supply Chain teams supporting key investment decisions, developing controllership around various FP\u0026A processes and provide valuable finance support for new initiatives.\u003cbr/\u003e\u003cbr/\u003eYou will work with diverse, collaborative, and driven people who believe financial partnership is critical to customer success. The growth of AWS and scope of Amazon’s business create opportunities to grow your career and broaden experience in any direction you choose. As a pioneer in cloud services, AWS lets you apply data, creativity, and analytical ability to completely new challenges and opportunities. This is a chance to work hard, have fun, and make history.\u003cbr/\u003eEveryone on the team needs to be entrepreneurial, wear many hats, and work in a highly collaborative environment that’s more start-up than a big company. A successful candidate will be a self-starter who dives deep into data and support thoughtful decision-making, is able to build scalable processes, is detail oriented and has the ability to work well with cross-functional teams. The candidate will be working closely with business finance teams and senior leadership across AWS Infrastructure and will be leading end to end processes around key planning and reporting cycles.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003e    Facilitating financial review meetings with senior business and finance leadership to support decision making.\u003cbr/\u003e    Maintain, and improve, existing finance processes to ensure data integrity, efficient and insightful analysis.\u003cbr/\u003e    Play a critical role in cost management, controllership, business case development, decision-making, and metrics development\u003cbr/\u003e    Uses solid financial knowledge and business acumen to build financial models, interpret data, draw conclusions, and make recommendations that deliver results, drive improvements, and influence leaders\u003cbr/\u003e    Driver controllership around new initiatives such as Generative AI investments, automation projects and technology transition initiatives reporting","department_cost_center":null,"description_short":"AWS Finance seeks a Finance Manager to join the Networking Finance team. This is an exciting opportunity to work with Network Engineering and Supply Chain teams supporting key investment decisions, developing","display_distance":null,"id":"5ce18757-8c6a-46b2-87b6-c9ea446f5d96","id_icims":"3168887","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/Planning","job_function_id":null,"job_path":"/en/jobs/3168887/finance-manager-aws-networking-aws-networking","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"ZST8\",\"SHK5\",\"IBF4\",\"SEA43\",\"SEA88\",\"SEA57\",\"SEA109\",\"ONM125\",\"SEA91\",\"ATBP18\",\"SEA910\",\"UWA2\",\"SEA33R\",\"SEA26\",\"LBV2\",\"METR7\",\"BFI33\",\"XSE9\",\"UWA4\",\"SEA28\",\"LBV4\",\"WFM761\",\"JSE5\",\"LUM9\",\"SEA55\",\"SEA41\",\"SEA1\",\"SEA69\",\"ONM127\",\"SEA60\",\"SEA74\",\"ISE1\",\"DSW9\",\"PSE\",\"ATBP23\",\"QDS1\",\"SEA38\",\"SEA76\",\"LJG6\",\"SHK3\",\"ZSL2\",\"WFM216\",\"SEA98\",\"SEA45\",\"DCA53\",\"LFC1\",\"SEA116\",\"MAB6\",\"CPA2\",\"ASL1\",\"SEA86\",\"ZST1\",\"SEA70\",\"SEA19\",\"LUM5\",\"ZST4\",\"WFM103\",\"LUM2\",\"SOD5\",\"SEA134\",\"SOD4\",\"FSE1\",\"LWA2\",\"SEA48\",\"PSL1\",\"ONM234\",\"ZST2\",\"ISG2\",\"SEA801\",\"DWX3\",\"ISE3\",\"SEA33\",\"SEA4\",\"ONM135\",\"ZST3\",\"SEA52\",\"SEA63\",\"BFI99\",\"JSE4\",\"SEA300\",\"LUM1\",\"CPA3\",\"SEA62\",\"CPA4\",\"SEA68\",\"SEA3\",\"WFM524\",\"TFC2\",\"T001\",\"ONM126\",\"SEA53\",\"DSE9\",\"ATBP24\",\"SEA81\",\"SEA72\",\"SEA59\",\"COL1\",\"SEA78\",\"BLU1\",\"METR2\",\"WFM59\",\"SEA24\",\"HUS1\",\"SHK4\",\"CWA42\",\"ATBP20\",\"DWA8\",\"LWES\",\"LBV3\",\"SEA142\",\"R004\",\"PUP\",\"UWA3\",\"SEA73\",\"CPA1\",\"SHK6\",\"IBF5\",\"SEA190\",\"SEA42\",\"SEA25\",\"SSE1\",\"SEA39\",\"DSW8\",\"SEA9\",\"MAE1\",\"ZST9\",\"KRA1\",\"IBF3\",\"ATBP22\",\"CWA2\",\"ONM124\",\"SEA44\",\"ATBP17\",\"SEA90\",\"WFM630\",\"HDG13\",\"SEA71\",\"ISE9\",\"SEA58\",\"ISE7\",\"SEA32\",\"SHK2\",\"SEA77\",\"MAB7\",\"XBF2\",\"ONM122\",\"LRSQ\",\"ZSL1\",\"SEA2\",\"SEA01\",\"SEA54\",\"WFM755\",\"SEA23\",\"SEA29\",\"ATBP5\",\"T002\",\"PKD1\",\"FSE3\",\"SEA61\",\"SEA83\",\"ATBP10\",\"ONM232\",\"DTS2\",\"DWX8\",\"ONM128\",\"SEA89\",\"SEA803\",\"ZST7\",\"JSE1\",\"WFM604\",\"LUM4\",\"HCS8\",\"SEA51\",\"MAC8\",\"SEA20\",\"SEA65\",\"ATBP12\",\"SEA18\",\"SEA95\",\"SEA804\",\"SEA22\",\"LUM3\",\"SEA36\",\"SEA147\",\"METR4\",\"ISE6\",\"SEA47\",\"ZSE1\",\"CRP1\",\"ZST5\",\"DWX7\",\"SEA40\",\"IBF1\",\"SOD1\",\"PSE3\",\"WJL5\",\"SEA46\",\"SEA37\",\"SEA401\",\"SEA84\",\"BWA1\",\"XXX0\",\"SEA102\",\"R097\",\"SEA75\",\"METR5\",\"WFM275\",\"SEA27\",\"DSW4\",\"SHK7\",\"ZKL3\",\"SEA21\",\"SEA02\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"January 28, 2026","preferred_qualifications":"- 6+ years of identifying incomplete or inaccurate data, identifying the root cause and creating/implementing an escalation plan experience\u003cbr/\u003e- 6+ years of solving complex business challenges by delivering accurate and timely financial models, analysis, and recommendations that have a proven impact on business (e.g., financial savings, operational improvements, or customer benefits) experience\u003cbr/\u003e- MBA, or CPA\u003cbr/\u003e- Knowledge of SQL/ETL\u003cbr/\u003e- Experience delivering forecasting, budgeting, and variance analysis, and data interpretation of results\u003cbr/\u003e- 6+ years of applying key financial performance indicators (KPIs) to analyses experience\u003cbr/\u003e- 6+ years of building financial and operational reports/data sets that inform business decision-making experience\u003cbr/\u003e- 6+ years of participating in continuous improvement projects in your team to scale and improve controllership with measurable results experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, SEATTLE - 95,400.00 - 163,200.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 95,400.00 - 163,200.00 USD annually","primary_search_label":"finance.team-aws","source_system":"JobCreator","state":"WA","title":"Finance Manager, AWS Networking, AWS Networking","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3168887/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-aws","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of technical product or program management experience\u003cbr/\u003e- 2+ years of software development experience\u003cbr/\u003e- 3+ years of project management disciplines including scope, schedule, budget, quality, along with risk and critical path management experience\u003cbr/\u003e- Experience managing programs across cross functional teams, building processes and coordinating release schedules\u003cbr/\u003e- Bachelor's degree in Information Technology, Computer Science, Business Administration, or related field","business_category":"aws","city":"Arlington","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"The Platform Support \u0026 Operations TPM drives operational excellence across enterprise market initiatives by providing responsive platform support, streamlining access management, and maintaining effective project prioritization systems. This role serves as the primary support interface for internal customers while systematically improving platform operations and user experience.\u003cbr/\u003e\u003cbr/\u003eWorking within the US NSD Technical Program Management team, this position embodies our mission to anticipate and deliver technology solutions that enable customer success through proactive planning, collaborative building, reliable delivery, and continuous improvement. The successful candidate will transform business needs into effective solutions while partnering closely with engineering teams and maintaining deep engagement with users.\u003cbr/\u003e\u003cbr/\u003eThis position requires that the candidate selected be a US Citizen and obtain and maintain an active TS/SCI security clearance with polygraph.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003ePlatform Support Leadership\u003cbr/\u003e\u003cbr/\u003e- Monitor and respond to the platform support channel, providing first-line technical support to internal customers\u003cbr/\u003e- Conduct initial troubleshooting of system issues and create tickets for development team escalation when necessary\u003cbr/\u003e- Identify, document, and analyze recurring issue patterns to develop systematic solutions\u003cbr/\u003e- Track and analyze support metrics to drive continuous improvement initiatives\u003cbr/\u003e- Create and maintain comprehensive wiki documentation and knowledge base resources\u003cbr/\u003e\u003cbr/\u003eAccess Management \u0026 Security Compliance\u003cbr/\u003e- Own and execute user access audits for CRM and analytics platforms\u003cbr/\u003e- Interface with CRM Admin team within the development organization to streamline access management processes\u003cbr/\u003e- Maintain security compliance standards while reducing access complexity\u003cbr/\u003e- Propose and implement access workflow improvements to accelerate provisioning timelines\u003cbr/\u003e- Track and resolve access-related patterns and bottlenecks\u003cbr/\u003e\u003cbr/\u003eProject Prioritization \u0026 Communication\u003cbr/\u003e\u003cbr/\u003e- Own, maintain, and communicate the enterprise market-wide project priority and tracking mechanism\u003cbr/\u003e- Ensure clear visibility and scheduling of strategic initiatives across the organization\u003cbr/\u003e- Collaborate with cross-functional teams including Sales, Sales Operations, Contract Management Office, Regional Marketing, and Billing\u003cbr/\u003e- Develop self-service guidance resources and training materials for end users\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS \u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon  conferences, inspire us to never stop embracing our uniqueness. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"The Platform Support \u0026 Operations TPM drives operational excellence across enterprise market initiatives by providing responsive platform support, streamlining access management, and maintaining effective","display_distance":null,"id":"3818ecf5-7e45-4aec-b8ed-4a501df05c24","id_icims":"3124643","is_intern":null,"is_manager":null,"job_category":"Business \u0026 Merchant Development","job_family":"Technical Program Management","job_function_id":null,"job_path":"/en/jobs/3124643/customer-platforms-operations-natsec-defense-nsd-builders","job_schedule_type":"full-time","location":"US, VA, Arlington","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS17\"],\"normalizedCityName\":\"Arlington\"}"],"normalized_location":"Arlington, Virginia, USA","optional_search_labels":["amazon-cleared-jobs"],"posted_date":"November 11, 2025","preferred_qualifications":"- 5+ years of experience in technical support, platform administration, or similar customer-facing technical role\u003cbr/\u003e- IT security and access management experience, including user provisioning, audit processes, and compliance frameworks\u003cbr/\u003e- Strong technical writing and documentation skills with experience creating knowledge bases, training materials, or process documentation in wiki-style platforms\u003cbr/\u003e- Experience with data analytics and reporting tools (Tableau, Power BI, SQL queries) and ability to analyze support metrics and KPIs to identify trends and improvement opportunities\u003cbr/\u003e- Basic scripting or coding skills (Python, JavaScript, or automation tools) for creating workflow improvements and streamlining repetitive platform administration tasks\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Arlington - 127,100.00 - 172,000.00 USD annually","primary_search_label":"aws.team-us-security-clearance-jobs-primary","source_system":"JobCreator","state":"VA","title":"Customer Platforms \u0026 Operations, NatSec \u0026 Defense (NSD) Builders","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3124643/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-us-security-clearance-jobs-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Work flexible shifts including night shifts/weekends\u003cbr/\u003e- 1+ years of electrical/mechanical/industrial water experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products","business_category":"aws","city":"Frederick","company_name":"Amazon Data Services, Inc. - A19","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tDaily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability \u003cbr/\u003e•\tMonitor Building Management Systems (BMS) and Electrical Power Management System (EPMS) \u003cbr/\u003e•\tAssist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA) \u003cbr/\u003e•\tPerform rack installs and rack decommissioning within internal SLA \u003cbr/\u003e•\tPerform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment \u003cbr/\u003e•\tTechnical writing to support change management program \u003cbr/\u003e•\tMonitor daily work requests and manage to resolution, and execute projects from conception to completion \u003cbr/\u003e•\tOn-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation \u003cbr/\u003e•\tWork schedule changes depending on specific site needs. Shifts can be up to 12 hours and may rotate on a predefined schedule. Some locations have on-call rotations. \u003cbr/\u003e•\tRole may support more than one location/site. \u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e•\tWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations: \u003cbr/\u003e•\tRegularly lift and/or move up to 39 pounds independently \u003cbr/\u003e•\tParticipate in group lifts for 40+ pounds \u003cbr/\u003e•\tMaintain balance and perform construction tasks while on a ladder \u003cbr/\u003e•\tRegularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position \u003cbr/\u003e•\tWork in an environment requiring provided ear protection \u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e•\tAbility to travel to or commute between data center locations as needed  \u003cbr/\u003e•\tWillingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e•\tTravel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. \u003cbr/\u003e","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"61aa0b8b-b4ea-4491-afb3-28b7ccf2b24c","id_icims":"3160801","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3160801/engineering-operation-technician","job_schedule_type":"full-time","location":"US, MD, Frederick","locations":["{\"normalizedStateName\":\"Maryland\",\"normalizedCountryCode\":\"USA\",\"city\":\"Frederick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MD, Frederick\",\"coordinates\":\"39.41574,-77.41203\",\"normalizedCountyName\":\"Frederick\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Frederick, Maryland, USA\",\"location\":\"US, MD, Frederick\",\"region\":\"MD\",\"buildingCodeList\":[\"IAD533\"],\"normalizedCityName\":\"Frederick\"}"],"normalized_location":"Frederick, Maryland, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"January 16, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Industrial-scale chiller plant operation\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MD, Frederick - 31.00 - 55.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"MD","title":"Engineering Operation Technician ","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3160801/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 4+ years of working in mechanical engineering or equivalent experience\u003cbr/\u003e- Experience with prototyping and implementation\u003cbr/\u003e- Bachelor's degree in mechanical engineering, electrical engineering, or an equivalent engineering science\u003cbr/\u003e- 7+ years of new hardware products development experience\u003cbr/\u003e- Experience in hardware design and validation of components, subsystems and systems\u003cbr/\u003e- Experience that includes strong analytical skills, attention to detail, and effective communication abilities, or experience in technical support\u003cbr/\u003e- Experience completing complex tasks quickly with little to no guidance and react with appropriate urgency to situations that require a quick turnaround, or experience managing multiple calendars\u003cbr/\u003e- - Experience working with OEM vendors and external partners.","business_category":"fulfillment-technology-and-robotics","city":"Springdale","company_name":"Amazon.com Services LLC - A57","country_code":"USA","description":"Amazon’s Material Handling Engineering team is seeking a Hardware Development Engineer (HDE) to help define, design, and deliver the next generation of material handling equipment across our global distribution network. You will play a critical role in developing mechanical, electrical, and control solutions—working both independently and in collaboration with third-party OEM partners.\u003cbr/\u003e\u003cbr/\u003eThis role requires a balance of deep technical expertise, strong problem-solving skills, and the ability to translate business and operational needs into robust, scalable engineering solutions. You will work at the intersection of R\u0026D, product development, and operations, challenging the status quo of traditional conveyance, sortation, and robotics solutions.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Design, develop, and validate hardware solutions for Amazon’s next-generation material handling systems.\u003cbr/\u003e- Translate ambiguous business problems into clear technical requirements and engineering solutions.\u003cbr/\u003e- Collaborate with cross-functional partners (operations, procurement, global engineering, and launch teams) to ensure successful product delivery.\u003cbr/\u003e- Lead the design-for-manufacturing, assembly, installation, and maintenance processes to ensure long-term scalability.\u003cbr/\u003e- Evaluate and integrate OEM hardware solutions; identify gaps and lead in-house design where required.\u003cbr/\u003e- Build prototypes, conduct testing, and analyze results to validate performance, safety, and reliability.\u003cbr/\u003e- Author technical specifications, design documents, and test plans.\u003cbr/\u003e- Champion data-driven decision making, ensuring technical trade-offs are well-documented and communicated.\u003cbr/\u003e- Manage risk through proactive identification and mitigation strategies.\u003cbr/\u003e- Stay current with emerging technologies in automation, robotics, and industrial equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon installs a significant quantity of new buildings every year. The historical model has been to allow each integrator to use their own equipment, controls, subsystems, and methodologies. While that has allowed Amazon to be successful to this point, the variability between buildings has proven difficult to support and scale.  One MHS’ charge is to build partnerships to focus on consistency and scalability across our network of the future. We will be partnering with key suppliers to help them scale up their manufacturing capabilities to keep up with our needs, as well as refining their designs to drive innovation and operational uptime and better meet the specific needs of Amazon’s operational environment. ","department_cost_center":null,"description_short":"Amazon’s Material Handling Engineering team is seeking a Hardware Development Engineer (HDE) to help define, design, and deliver the next generation of material handling equipment across our global distribution","display_distance":null,"id":"e70ee733-942f-4812-bc51-448943fb1317","id_icims":"3153884","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/3153884/product-development-engineer-onemhs","job_schedule_type":"full-time","location":"US, OH, Springdale","locations":["{\"normalizedStateName\":\"Kentucky\",\"normalizedCountryCode\":\"USA\",\"city\":\"Hebron\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, KY, Hebron\",\"coordinates\":\"39.06603,-84.70084\",\"normalizedCountyName\":\"Boone\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Hebron, Kentucky, USA\",\"location\":\"US, KY, Hebron\",\"region\":\"KY\",\"buildingCodeList\":[\"LUKA\",\"LSI3\",\"CVG9\",\"LUKZ\",\"CVG5\",\"CVG121\",\"WVG1\",\"CVG3\",\"HCN1\",\"CRW11\",\"RNRM\",\"KWFS\",\"CVG1\",\"KEVA\",\"AUV1\",\"CVG2\",\"VURA\",\"CVG7\",\"VXX2\"],\"normalizedCityName\":\"Hebron\"}","{\"normalizedStateName\":\"Ohio\",\"normalizedCountryCode\":\"USA\",\"city\":\"Springdale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OH, Springdale\",\"coordinates\":\"39.29259,-84.48168\",\"normalizedCountyName\":\"Hamilton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Springdale, Ohio, USA\",\"location\":\"US, OH, Springdale\",\"region\":\"OH\",\"buildingCodeList\":[\"CVG91\",\"SOH2\",\"PCI2\"],\"normalizedCityName\":\"Springdale\"}"],"normalized_location":"Springdale, Ohio, USA","optional_search_labels":[],"posted_date":"January  6, 2026","preferred_qualifications":"- Knowledge of SolidWorks simulation or Ansys Finite Element analysis tools\u003cbr/\u003e- Experience in the design of complex mechanical products and equipment at volume\u003cbr/\u003e- MS degree in engineering, statistics, computer science, operations research, business analytics, information systems or equivalent\u003cbr/\u003e- Experience designing or implementing integrated automation solutions such as material handling systems, high-speed packaging lines, or manufacturing lines\u003cbr/\u003e- Knowledge of consumer product compliance processes and regulations\u003cbr/\u003e- - Familiarity with robotics, conveyance, or sortation systems.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, KY, Hebron - 117,300.00 - 160,000.00 USD annually\u003cbr/\u003eUSA, OH, Springdale - 117,300.00 - 160,000.00 USD annually","primary_search_label":"fulfillment-technology-and-robotics.one-material-handling-system","source_system":"JobCreator","state":"OH","title":"Product Development Engineer, OneMHS","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3153884/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"one-material-handling-system","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}