{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Bachelor's degree in a relevant field or equivalent work experience\u003cbr/\u003e- Experience communicating to senior management and customers verbally and in writing\u003cbr/\u003e- 3+ years of leading large-scale, technical or engineering programs with a proven record of thought leadership, business case development, realizing customer benefits, and successful program completion experience\u003cbr/\u003e- Experience in a direct or matrixed role leading technical and non-technical transformation project teams with a proven ability to work across broad functional teams\u003cbr/\u003e- Experience working with data and leveraging analytics to make decisions\u003cbr/\u003e- 3+ years of managing a technical team of solution architects, sales engineers or similar technical roles experience\u003cbr/\u003e- Experience navigating customer organizational structures, developing technology programs, defining milestones, success criteria, resource allocation and on-time delivery.","business_category":"retail","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"We are seeking an Onboarding Manager to lead the Technical Customer Solutions team (CSM-T), to join the MCCF team. As a Manager of CSM-Ts, you will have the exciting opportunity to help drive the growth, connect with customers, and shape the future of Buy With Prime (BwP) , MultiChannel Fulfillment (MCF) and other Amazon Supply Chain Services. This role will own building, managing, and scaling the team. The ideal candidate will possess a delivery background, with a passion for the customer, and experience leading technical and operational delivery teams. You will be adept at delivering desired outcomes through others, while staying abreast of the detail. You should also be a self-starter who is prepared to own, define, develop, and execute a strategy for onboarding programs within the defined region.\u003cbr/\u003e\u003cbr/\u003eIf you are entrepreneurial and want to build and own transformative technology-driven products, join us in making history!\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e  - Utilize leadership skills, technical depth and business experience to lead the onboarding team and demonstrate progress and value to C-suite and other key stakeholders\u003cbr/\u003e\u003cbr/\u003e   - Think strategically and execute on organization and team goals/initiatives and deliver results.\u003cbr/\u003e\u003cbr/\u003e   - Manage team to exceed goals, manage onboarding pipelines, and report progress across different business stakeholders.\u003cbr/\u003e\u003cbr/\u003e   - Develop customer solutions managers to think big, and deliver value to the customers and Amazon through innovation, continuous improvement and deliver value beyond onboarding programs. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- As a leader, you and your team will earn trust across the customer’s organization, identify strategic opportunities, establish roadmaps and actionable program plans, capture success criteria, and implement strong governance of your team's projects.\u003cbr/\u003e- You own and drive execution excellence for the end-to-end customer journey (e.g., technical, operational, organizational, and educational) that span tech teams, executives, and business units.\u003cbr/\u003e- You are a critical partner to our customers, shepherding them through their stages of MCF and BwP integration and adoption.\u003cbr/\u003e- You translate strategic initiatives in the account plan into executable actions, working backwards from our customers key milestones.\u003cbr/\u003e- You manage cadence by leading the reporting and tracking functions along the way.\u003cbr/\u003e- You own the execution of education plans, roadmap to business outcome alignments, Executive Briefing Sessions, and launch plans.\u003cbr/\u003e- You have a strong technical background, be detail driven, have excellent problem-solving abilities, and be exemplary communicators both at the executive and project team level. You will be a leader, have the ability to gain stakeholder buy-in, negotiate and lead various teams.\u003cbr/\u003e- You hire, on-board, train, and develop new Customer Solutions Managers from internal and external sources\u003cbr/\u003e- You have excellent customer engagement skills through all levels of an organization and develop long term relationships based on excellence\u003cbr/\u003e- You develop and utilize strong writing skills to partner with stakeholders and develop customer and business plans, and develop the team's writing skills","department_cost_center":null,"description_short":"We are seeking an Onboarding Manager to lead the Technical Customer Solutions team (CSM-T), to join the MCCF team. As a Manager of CSM-Ts, you will have the exciting opportunity to help drive the growth,","display_distance":null,"id":"935519be-bd02-4e96-9ba9-51b5499b408b","id_icims":"3130216","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"Tech, Customer Solutions Mgr","job_function_id":null,"job_path":"/en/jobs/3130216/merchant-onboarding-manager-buy-with-prime-bwp-multichannel-fulfillment-mcf","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA71\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"November 21, 2025","preferred_qualifications":"- MBA\u003cbr/\u003e- Experience mentoring, coaching, and influencing colleagues, collaborators, and stakeholders\u003cbr/\u003e- Experience prioritizing and handling multiple assignments at any given time while maintaining commitment to deadlines, or experience in a fast-paced, high-tech company\u003cbr/\u003e- Experience working with diverse or differing data sets including creating and compiling data into a final distribution for management consumption\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $152,100/year in our lowest geographic market up to $262,800/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"retail.team-buy-with-prime","source_system":"JobCreator","state":"WA","title":"Merchant Onboarding Manager, Buy with Prime (BwP) \u0026 MultiChannel Fulfillment (MCF)","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3130216/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-buy-with-prime","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Fairless Hills","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability \u003cbr/\u003e• Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS) \u003cbr/\u003e• Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA) \u003cbr/\u003e• Perform rack installs and rack decommissioning within internal SLA \u003cbr/\u003e• Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment \u003cbr/\u003e• Technical writing to support change management program \u003cbr/\u003e• Monitor daily work requests and manage to resolution, and execute projects from conception to completion \u003cbr/\u003e• On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation \u003cbr/\u003e• Work schedule changes depending on specific site needs. Shifts can be up to 12 hours and may rotate on a predefined schedule. Some locations have on-call rotations. \u003cbr/\u003e• Role may support more than one location/site. \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e• Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodations: \u003cbr/\u003e• Regularly lift and/or move up to 39 pounds independently \u003cbr/\u003e• Participate in group lifts for 40+ pounds \u003cbr/\u003e• Maintain balance and perform construction tasks while on a ladder \u003cbr/\u003e• Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position \u003cbr/\u003e• Work in an environment requiring provided ear protection \u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e• Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e• Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e• Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"8c2c92be-31bd-4fc2-86b6-4802c3718fb9","id_icims":"3165352","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3165352/data-center-engineering-operations-technician","job_schedule_type":"full-time","location":"US, PA, Fairless Hills","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Fairless Hills\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Fairless Hills\",\"coordinates\":\"40.17334,-74.85369\",\"normalizedCountyName\":\"Bucks\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Fairless Hills, Pennsylvania, USA\",\"location\":\"US, PA, Fairless Hills\",\"region\":\"PA\",\"buildingCodeList\":[\"PNE102\"],\"normalizedCityName\":\"Fairless Hills\"}"],"normalized_location":"Fairless Hills, Pennsylvania, USA","optional_search_labels":["military","hourly","aws.team-ais"],"posted_date":"January 27, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Technical (Military/Trade School) training\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, PA, Fairless Hills - 32.00 - 57.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"PA","title":"Data Center Engineering Operations Technician","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3165352/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Technical (Military/Trade School) training or 2+ years’ of equivalent experience in a relevant industry (for example: electrical or mechanical)\u003cbr/\u003e- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products (including Excel, Word and PowerPoint)","business_category":"aws","city":"Berwick","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support  the operations of some of the world’s most powerful data centers. Our Data Center Engineering Operations team maintain and operate our  critical infrastructure systems so that they are prepared to stand up  against any situation.  \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAWS has the world’s largest cloud computing portfolio. As an  Amazonian you will work in some of the most sophisticated, safe, and  secure data centers in the world. Our Engineering Operations Technicians  I (EOT’s) help keep them that way by working with the brightest minds  from around the globe to help test and implement the newest technology  and work practices to meet the demands of a changing market. \u003cbr/\u003e\u003cbr/\u003eWe have a passion for learning and evolving, it’s how we have helped  define ourselves as leaders in the industry.  Let’s work hard, have  fun, and make history! \u003cbr/\u003e   \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003e - Tasked with driving innovation while reducing operational costs in the facilities. \u003cbr/\u003e - Drive projects with moderate complexity.\u003cbr/\u003e - Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA).\u003cbr/\u003e - Perform rack installs, rack decommissioning, operational readings and facility management.\u003cbr/\u003e - Provide key performance indicators to senior engineers. \u003cbr/\u003e - Responsible for the on-site management of contractors,  sub-contractors and vendors, ensuring that all work performed is in  accordance with established practices, procedures \u0026 local  legislation. \u003cbr/\u003e - Performance and oversight of maintenance and operations on all  electrical, mechanical, and fire/life safety equipment within the data  center.\u003cbr/\u003e - Ensure all safety procedures are adhered to while performing work.\u003cbr/\u003e - Perform basic support concepts such as ticketing systems, root  cause analysis, change management creation, writing procedures and  building management systems.\u003cbr/\u003e - Work schedule changes depending on specific site needs. Shifts  can be up to 12-hours and may rotate on a predefined schedule. Some  locations have on-call rotations.\u003cbr/\u003e - Maintain data center critical infrastructure equipment ensuring  99.999% up-time of the world's largest cloud computing portfolio.\u003cbr/\u003e - Role may support more than one location/site. \u003cbr/\u003e - Walk job sites in uneven terrain. Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e - Regularly lift and/or move up to 39 pounds unassisted and participate in group lifts for 40+ pounds\u003cbr/\u003e - Regularly walk, use hands and fingers, handle or feel, reach  with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist,  bend, work above shoulders, grasp, carry, push and pull\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e \u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e","department_cost_center":null,"description_short":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support  the operations of some of the world’s most powerful data centers.","display_distance":null,"id":"8e42596b-deba-4239-8533-6893c9221c0f","id_icims":"3095415","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3095415/engineering-operations-technician-data-center-engg-ops","job_schedule_type":"full-time","location":"US, PA, Berwick","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Berwick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Berwick\",\"coordinates\":\"41.05089,-76.24352\",\"normalizedCountyName\":\"Columbia\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Berwick, Pennsylvania, USA\",\"location\":\"US, PA, Berwick\",\"region\":\"PA\",\"buildingCodeList\":[\"PHL101\"],\"normalizedCityName\":\"Berwick\"}"],"normalized_location":"Berwick, Pennsylvania, USA","optional_search_labels":["military","aws.team-ais","hourly"],"posted_date":"October  7, 2025","preferred_qualifications":"- 2+ years of Data Center Engineering experience\u003cbr/\u003e- Associates or Bachelor’s Degree\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, PA, Berwick - 32.00 - 57.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"PA","title":"Engineering Operations Technician ,  Data Center Engg Ops","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3095415/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Fairless Hills","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability \u003cbr/\u003e• Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS) \u003cbr/\u003e• Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA) \u003cbr/\u003e• Perform rack installs and rack decommissioning within internal SLA \u003cbr/\u003e• Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment \u003cbr/\u003e• Technical writing to support change management program \u003cbr/\u003e• Monitor daily work requests and manage to resolution, and execute projects from conception to completion \u003cbr/\u003e• On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation \u003cbr/\u003e• Work schedule changes depending on specific site needs. Shifts can be up to 12 hours and may rotate on a predefined schedule. Some locations have on-call rotations. \u003cbr/\u003e• Role may support more than one location/site. \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e• Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodations: \u003cbr/\u003e• Regularly lift and/or move up to 39 pounds independently \u003cbr/\u003e• Participate in group lifts for 40+ pounds \u003cbr/\u003e• Maintain balance and perform construction tasks while on a ladder \u003cbr/\u003e• Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position \u003cbr/\u003e• Work in an environment requiring provided ear protection \u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e• Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e• Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e• Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"37f23952-4bc6-4fad-a7c7-1d59fd65e214","id_icims":"3165361","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3165361/data-center-engineering-operations-technician","job_schedule_type":"full-time","location":"US, PA, Fairless Hills","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Fairless Hills\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Fairless Hills\",\"coordinates\":\"40.17334,-74.85369\",\"normalizedCountyName\":\"Bucks\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Fairless Hills, Pennsylvania, USA\",\"location\":\"US, PA, Fairless Hills\",\"region\":\"PA\",\"buildingCodeList\":[\"PNE103\"],\"normalizedCityName\":\"Fairless Hills\"}"],"normalized_location":"Fairless Hills, Pennsylvania, USA","optional_search_labels":["military","aws.team-ais","hourly"],"posted_date":"January 27, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Technical (Military/Trade School) training\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, PA, Fairless Hills - 32.00 - 57.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"PA","title":"Data Center Engineering Operations Technician","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3165361/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Fairless Hills","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability \u003cbr/\u003e• Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS) \u003cbr/\u003e• Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA) \u003cbr/\u003e• Perform rack installs and rack decommissioning within internal SLA \u003cbr/\u003e• Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment \u003cbr/\u003e• Technical writing to support change management program \u003cbr/\u003e• Monitor daily work requests and manage to resolution, and execute projects from conception to completion \u003cbr/\u003e• On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation \u003cbr/\u003e• Work schedule changes depending on specific site needs. Shifts can be up to 12 hours and may rotate on a predefined schedule. Some locations have on-call rotations. \u003cbr/\u003e• Role may support more than one location/site. \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e• Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodations: \u003cbr/\u003e• Regularly lift and/or move up to 39 pounds independently \u003cbr/\u003e• Participate in group lifts for 40+ pounds \u003cbr/\u003e• Maintain balance and perform construction tasks while on a ladder \u003cbr/\u003e• Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position \u003cbr/\u003e• Work in an environment requiring provided ear protection \u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e• Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e• Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e• Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"4376efd4-b80c-4ce5-9478-b53b5e479ad9","id_icims":"3165362","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3165362/data-center-engineering-operations-technician","job_schedule_type":"full-time","location":"US, PA, Fairless Hills","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Fairless Hills\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Fairless Hills\",\"coordinates\":\"40.17334,-74.85369\",\"normalizedCountyName\":\"Bucks\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Fairless Hills, Pennsylvania, USA\",\"location\":\"US, PA, Fairless Hills\",\"region\":\"PA\",\"buildingCodeList\":[\"PNE103\"],\"normalizedCityName\":\"Fairless Hills\"}"],"normalized_location":"Fairless Hills, Pennsylvania, USA","optional_search_labels":["military","hourly","aws.team-ais"],"posted_date":"January 27, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Technical (Military/Trade School) training\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, PA, Fairless Hills - 32.00 - 57.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"PA","title":"Data Center Engineering Operations Technician","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3165362/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Technical (Military/Trade School) training or 2+ years’ of equivalent experience in a relevant industry (for example: electrical or mechanical)\u003cbr/\u003e- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products (including Excel, Word and PowerPoint)","business_category":"aws","city":"Berwick","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support  the operations of some of the world’s most powerful data centers. Our Data Center Engineering Operations team maintain and operate our  critical infrastructure systems so that they are prepared to stand up  against any situation.  \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAWS has the world’s largest cloud computing portfolio. As an  Amazonian you will work in some of the most sophisticated, safe, and  secure data centers in the world. Our Engineering Operations Technicians  I (EOT’s) help keep them that way by working with the brightest minds  from around the globe to help test and implement the newest technology  and work practices to meet the demands of a changing market. \u003cbr/\u003e\u003cbr/\u003eWe have a passion for learning and evolving, it’s how we have helped  define ourselves as leaders in the industry.  Let’s work hard, have  fun, and make history! \u003cbr/\u003e   \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003e - Tasked with driving innovation while reducing operational costs in the facilities. \u003cbr/\u003e - Drive projects with moderate complexity.\u003cbr/\u003e - Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA).\u003cbr/\u003e - Perform rack installs, rack decommissioning, operational readings and facility management.\u003cbr/\u003e - Provide key performance indicators to senior engineers. \u003cbr/\u003e - Responsible for the on-site management of contractors,  sub-contractors and vendors, ensuring that all work performed is in  accordance with established practices, procedures \u0026 local  legislation. \u003cbr/\u003e - Performance and oversight of maintenance and operations on all  electrical, mechanical, and fire/life safety equipment within the data  center.\u003cbr/\u003e - Ensure all safety procedures are adhered to while performing work.\u003cbr/\u003e - Perform basic support concepts such as ticketing systems, root  cause analysis, change management creation, writing procedures and  building management systems.\u003cbr/\u003e - Work schedule changes depending on specific site needs. Shifts  can be up to 12-hours and may rotate on a predefined schedule. Some  locations have on-call rotations.\u003cbr/\u003e - Maintain data center critical infrastructure equipment ensuring  99.999% up-time of the world's largest cloud computing portfolio.\u003cbr/\u003e - Role may support more than one location/site. \u003cbr/\u003e - Walk job sites in uneven terrain. Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e - Regularly lift and/or move up to 39 pounds unassisted and participate in group lifts for 40+ pounds\u003cbr/\u003e - Regularly walk, use hands and fingers, handle or feel, reach  with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist,  bend, work above shoulders, grasp, carry, push and pull\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e \u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e","department_cost_center":null,"description_short":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support  the operations of some of the world’s most powerful data centers.","display_distance":null,"id":"ea0e5408-5668-4da3-9464-52b496db3fa6","id_icims":"3095421","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3095421/engineering-operations-technician-data-center-engg-ops","job_schedule_type":"full-time","location":"US, PA, Berwick","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Berwick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Berwick\",\"coordinates\":\"41.05089,-76.24352\",\"normalizedCountyName\":\"Columbia\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Berwick, Pennsylvania, USA\",\"location\":\"US, PA, Berwick\",\"region\":\"PA\",\"buildingCodeList\":[\"PHL101\"],\"normalizedCityName\":\"Berwick\"}"],"normalized_location":"Berwick, Pennsylvania, USA","optional_search_labels":["military","hourly","aws.team-ais"],"posted_date":"October  7, 2025","preferred_qualifications":"- 2+ years of Data Center Engineering experience\u003cbr/\u003e- Associates or Bachelor’s Degree\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, PA, Berwick - 32.00 - 57.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"PA","title":"Engineering Operations Technician ,  Data Center Engg Ops","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3095421/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"aws","city":"Seattle","company_name":"Amazon Development Center U.S., Inc.","country_code":"USA","description":"The Aurora DSQL team at AWS is building revolutionary transactional database technology, delivering innovative customer experiences in the areas of automated operations, global scale, query processing, and storage. If contributing to the design and development of a new, first-of-its-kind, database excites you, then a role on this new initiative may be your dream job. Join us during this formative period of the product and be a leader in shaping the future of databases at Amazon and beyond!\u003cbr/\u003e \u003cbr/\u003eThe Query Processing (QP) team is responsible for planning and executing SQL statements in the most efficient way possible. The QP team owns everything in the life cycle of a SQL statement like Parsing, Analysis (syntax and semantic), Rewriting, Planning (Optimizer) and Execution, and working with custom built Storage while providing customers access to observability metrics to help them understand their database performance better.\u003cbr/\u003e \u003cbr/\u003eAn ideal candidate has experience building databases and/or large stateful cloud services, is able to work with senior technical leaders, and is able to invent simple and elegant solutions. They are able to design, implement and deliver software systems and mentor junior team members. They thrive on creative and collaborative problem solving, and also enjoy the challenge of operating services at AWS scale.\u003cbr/\u003e\u003cbr/\u003eAWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for their cloud services\u003cbr/\u003e\u003cbr/\u003e10031\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eOur engineers collaborate across diverse teams, projects, and environments to have a firsthand impact on our global customer base. You’ll bring a passion for innovation, data, search, analytics, and distributed systems. You’ll also:\u003cbr/\u003eSolve challenging technical problems, often ones not solved before, at every layer of the stack.\u003cbr/\u003eDesign, implement, test, deploy and maintain innovative software solutions to transform service performance, durability, cost, and security.\u003cbr/\u003eBuild high-quality, highly available, always-on products.\u003cbr/\u003eResearch implementations that deliver the best possible experiences for customers.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs you design and code solutions to help our team drive efficiencies in software architecture, you’ll create metrics, implement automation and other improvements, and resolve the root cause of software defects. You’ll also:\u003cbr/\u003eBuild high-impact solutions to deliver to our large customer base.\u003cbr/\u003eParticipate in design discussions, code review, and communicate with internal and external stakeholders.\u003cbr/\u003eWork cross-functionally to help drive business decisions with your technical input.\u003cbr/\u003eWork in a startup-like development environment, where you’re always working on the most important stuff.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge-sharing and mentorship. Our senior members enjoy one-on-one mentoring and thorough, but kind, code reviews. We care about your career growth and strive to assign projects that help our team members develop your engineering expertise so you feel empowered to take on more complex tasks in the future.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eAbout AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"The Aurora DSQL team at AWS is building revolutionary transactional database technology, delivering innovative customer experiences in the areas of automated operations, global scale, query processing,","display_distance":null,"id":"c506128f-c6a5-4cc8-a4a1-678bf6d8fff9","id_icims":"3169650","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3169650/software-development-engineer-aurora-dsql","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA43\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["aws.team-utility-computing","aws.team-database"],"posted_date":"January 29, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 143,700.00 - 194,400.00 USD annually","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"WA","title":"Software Development Engineer, Aurora DSQL","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3169650/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of relevant work experience\u003cbr/\u003e- 2+ years of Microsoft Office products and applications experience\u003cbr/\u003e- Technical (Military/Trade School) training or 2+ years of electrical or mechanical, HVAC, fire system experience in a mission-critical infrastructure or equivalent experience in a relevant industry (for example: electrical or mechanical)","business_category":"aws","city":"Fairless Hills","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAWS has the world’s largest cloud computing portfolio. As an Amazonian you will work in some of the most sophisticated, safe, and secure data centers in the world. Our Engineering Operations Technicians (EOT’s) help keep them that way by working with the brightest minds from around the globe to help test and implement the newest technology and work practices to meet the demands of a changing market.\u003cbr/\u003e\u003cbr/\u003eWe have a passion for learning and evolving, it’s how we have helped define ourselves as leaders in the industry. Let’s work hard, have fun, and make history!\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003e\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. ","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"98ba15d1-2020-44f1-bd7e-e083086edf46","id_icims":"3165385","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3165385/data-center-engineering-operations-technician-data-center-ops","job_schedule_type":"full-time","location":"US, PA, Fairless Hills","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Fairless Hills\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Fairless Hills\",\"coordinates\":\"40.17334,-74.85369\",\"normalizedCountyName\":\"Bucks\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Fairless Hills, Pennsylvania, USA\",\"location\":\"US, PA, Fairless Hills\",\"region\":\"PA\",\"buildingCodeList\":[\"PNE103\"],\"normalizedCityName\":\"Fairless Hills\"}"],"normalized_location":"Fairless Hills, Pennsylvania, USA","optional_search_labels":["aws.team-ais","military","hourly"],"posted_date":"January 27, 2026","preferred_qualifications":"- 4+ years of data center engineering experience\u003cbr/\u003e- Bachelor's degree in Electrical Engineering, Mechanical Engineering, or a related field\u003cbr/\u003e- Knowledge of network design and layout as well as low voltage (copper/ fiber) cabling\u003cbr/\u003e- Experience in data center engineering\u003cbr/\u003e- Can perform physical tasks all day without becoming overly tired\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, PA, Fairless Hills - 37.00 - 65.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"PA","title":"Data Center Engineering Operations Technician, Data Center Ops","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3165385/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 1+ years of designing and developing large-scale, multi-tiered, multi-threaded, embedded or distributed software applications, tools, systems, and services using: C#, C++, Java, or Perl experience\u003cbr/\u003e- Bachelor's degree in Computer Science, Engineering, Mathematics, or a related field\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"aws","city":"Seattle","company_name":"Amazon Development Center U.S., Inc.","country_code":"USA","description":"The EC2 Nitro platform powers the world’s largest, fastest-growing, and most feature-rich cloud computing environment. Designed by AWS from the ground up, Nitro leverages a fully customized stack of hardware, firmware, and software to deliver unparalleled virtualization at a global scale. Within the EC2 Nitro organization, the MLS team is tasked with developing the next generation of EC2 Supercomputers, optimized for high-performance training and inference workloads.\u003cbr/\u003e\u003cbr/\u003eWe are looking for an experienced software engineer to drive development for new EC2 machine learning platforms. In this role, the engineer will work with a broad and deep group of technical teams that develop hardware, firmware, systems and application software etc.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate is expected to have solid understanding of computer science fundamentals, and expertise in C/C++ or Rust development in a Linux environment. Experience with Linux package management, version control systems, automated build processes, and software unit testing are required. In-depth knowledge of ML frameworks and cluster management is highly preferred.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"The EC2 Nitro platform powers the world’s largest, fastest-growing, and most feature-rich cloud computing environment. Designed by AWS from the ground up, Nitro leverages a fully customized stack of hardware,","display_distance":null,"id":"1f74eebe-ef4b-4bd6-b09f-e3f7ffadf8ee","id_icims":"3181314","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3181314/software-dev-engineer-ec2-nitro","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA42\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["aws.team-sde-sdm","aws.team-utility-computing"],"posted_date":"February 13, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- Knowledge of computer architecture, operating systems, and parallel computing\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 143,700.00 - 194,400.00 USD annually","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"WA","title":"Software Dev Engineer, EC2 Nitro","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3181314/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of engineering team management experience\u003cbr/\u003e- 7+ years of working directly within engineering teams experience\u003cbr/\u003e- 3+ years of designing or architecting (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 8+ years of leading the definition and development of multi tier web services experience\u003cbr/\u003e- Knowledge of engineering practices and patterns for the full software/hardware/networks development life cycle, including coding standards, code reviews, source control management, build processes, testing, certification, and livesite operations\u003cbr/\u003e- Experience partnering with product or program management teams","business_category":"aws","city":"Seattle","company_name":"Amazon Development Center U.S., Inc.","country_code":"USA","description":"EC2 Nitro drives the planet’s largest, fastest growing and most feature-rich compute cloud. Nitro is AWS ground-up design for virtualization at global scale built on a fully custom stack of hardware, firmware and applications. Nitro has enabled EC2 to support Intel, AMD and Amazon’s custom silicon - the Graviton processor family - while raising the industry bar for security and performance across our product line.\u003cbr/\u003e\u003cbr/\u003eWe integrate hardware, firmware, application software and services to deliver new virtualized and bare-metal compute platforms for companies from startups through the Fortune 500. We are looking for an experienced leader to drive software development and scaling for new EC2 compute platforms. In this role, you will work with a broad and deep group of technical teams that develop hardware, firmware, systems and application software.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate is expected to have solid understanding of computer science fundamentals, and expertise in C,C++ or Rust development in a Linux environment. Experience with Linux package management, version control systems, automated build processes, and software unit testing are required. In-depth knowledge of ML frameworks and cluster management is highly preferred.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"EC2 Nitro drives the planet’s largest, fastest growing and most feature-rich compute cloud. Nitro is AWS ground-up design for virtualization at global scale built on a fully custom stack of hardware, firmware","display_distance":null,"id":"975eb099-ba7a-442b-a2f3-753fef5ee55b","id_icims":"3182140","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3182140/software-development-manager-ec2-nitro","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA42\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["aws.team-sde-sdm","aws.team-utility-computing"],"posted_date":"February 16, 2026","preferred_qualifications":"- Experience in communicating with users, other technical teams, and senior leadership to collect requirements, describe software product features, technical designs, and product strategy\u003cbr/\u003e- Experience in recruiting, hiring, mentoring/coaching and managing teams of Software Engineers to improve their skills, and make them more effective, product software engineers\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 184,900.00 - 250,200.00 USD annually","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"WA","title":"Software Development Manager, EC2 Nitro","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3182140/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}