{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Mineral","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"9fb96e67-1e91-46fc-a787-936bdf490668","id_icims":"3153273","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3153273/engineering-operations-technician","job_schedule_type":"full-time","location":"US, VA, Mineral","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Mineral\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Mineral\",\"coordinates\":\"38.01073,-77.90796\",\"normalizedCountyName\":\"Louisa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Mineral, Virginia, USA\",\"location\":\"US, VA, Mineral\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD551\"],\"normalizedCityName\":\"Mineral\"}"],"normalized_location":"Mineral, Virginia, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"January  6, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Technical (Military/Trade School) training\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Mineral - 32.00 - 57.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"VA","title":"Engineering Operations Technician","university_job":null,"updated_time":"3 minutes","url_next_step":"https://account.amazon.com/jobs/3153273/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- Experience in computer networking\u003cbr/\u003e- Experience working with Linux operating systems\u003cbr/\u003e- Can lift and rack equipment up to 40 pounds\u003cbr/\u003e- Experience with computer hardware troubleshooting and repair","business_category":"aws","city":"Didcot","company_name":"Amazon Data Services UK Limited","country_code":"GBR","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eA unique opportunity to join AWS as a Data Centre Technician. You will  become the primary resolver for your support team, and gain troubleshooting skills on one or more operating systems. You will be able to troubleshoot and solve all but the most complex infrastructure issues. Issues are escalated to the appropriate resolver groups when necessary. You create and maintain documentation on technologies you support and are able to convey Standard Operation Procedures (SOPs) to junior staff. You understand all aspects of the equipment you support. You know how to innovate and make decisions on his/her own, but also know how to take direction when it is given, paying attention to all details involved.\u003cbr/\u003e\u003cbr/\u003eYou are able to execute small projects on your own and work with your manager in planning and executing larger local projects. You act as an escalation point for junior technicians. You understand all aspects of the equipment you support.\u003cbr/\u003e\u003cbr/\u003e24/7 shift coverage is required and may include 12 hour shifts, rotating shifts, 3, 4, or 5 day work weeks, and may change based on the needs of the business. Travel may be required up to 10% of the time.\u003cbr/\u003e\u003cbr/\u003eResponsibilities:\u003cbr/\u003e - Troubleshooting of facility and rack-level events within internal Service-Level Agreements (SLAs)\u003cbr/\u003e - Perform root cause analysis of equipment failures\u003cbr/\u003e - Ensure all safety procedures are adhered to while performing work\u003cbr/\u003e - Respond to off hour emergency calls per on call rotation for any one of the region’s sites\u003cbr/\u003e - Fully comply with all physical security procedures and policies.\u003cbr/\u003e- Must be commutable to the Thames Valley Region. \u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eYou will need to be a UK national and able to obtain and maintain a UK Government Security Clearance. Further details found here: https://www.gov.uk/government/publications/united-kingdom-security-vetting-clearance-levels","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"5a9a6c70-3fed-4110-8ee5-99a862a68925","id_icims":"3167559","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3167559/data-centre-technician-data-center-operations","job_schedule_type":"full-time","location":"GB, Didcot","locations":["{\"normalizedStateName\":\"England\",\"normalizedCountryCode\":\"GBR\",\"city\":\"Didcot\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, Didcot\",\"coordinates\":\"51.60237,-1.23211\",\"normalizedCountyName\":\"Oxfordshire\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"Didcot, England, GBR\",\"location\":\"GB, Didcot\",\"region\":\"\",\"buildingCodeList\":[\"LHR097\"],\"normalizedCityName\":\"Didcot\"}"],"normalized_location":"Didcot, England, GBR","optional_search_labels":["aws.team-uk-launches-optional","amazon-cleared-jobs"],"posted_date":"January 27, 2026","preferred_qualifications":"- Can work in cramped spaces or in elevated locations while adhering to health \u0026 safety guidelines\u003cbr/\u003e- Experience dealing effectively with customers during problem resolution and operating efficiently under pressure\u003cbr/\u003e- Experience managing work and priorities through a ticketing system\u003cbr/\u003e- Experience with cabling infrastructure best practices and methodologies\u003cbr/\u003e- Experience working in a data center environment (racking and stacking gear, cable management, hot/cold aisle containment)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-no-matching-primary-label-listed","source_system":"JobCreator","state":null,"title":"Data Centre Technician , Data Center Operations","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3167559/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-no-matching-primary-label-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Abgeschlossene technische Berufsausbildung, anerkannt durch die Industrie- und Handelskammer (IHK) oder Handwerkskammer (HWK) oder Nachweis eines erfolgreich abgeschlossen Hochschulstudium im Ingenieurwissenschaftlichen Bereich (Maschinenbau / Elektrotechnik oder artverwandt) einer deutschen Hochschule oder anerkannte ausländische Hochschulabschlüsse (BA, B. Sc., MA, M. Sc., Dipl.-Ing.)\u003cbr/\u003e- Mindestens zweijährige Berufserfahrung in dem entsprechenden Handwerk\u003cbr/\u003e- Erfahrung in der Instandhaltung von industriellen Produktionsanlagen\u003cbr/\u003e- Fortgeschrittene Deutschkenntnisse in Wort und Schrift","business_category":"fulfillment-ops","city":"Wolfhagen","company_name":"Amazon SZ Wolfhagen GmbH","country_code":"DEU","description":"Das Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) ist für unseren Betrieb von fundamentaler Bedeutung – es sorgt dafür, dass unsere technischen Systeme und Anlagen laufend funktionieren. Als Instandhaltungstechniker:in bist Du für die Wartung und Instandhaltung unserer förder- und haustechnischen Anlagen sowie Produktionsanlagen zuständig. Du hilfst, die höchsten Sicherheitsstandards im Arbeitsschutz zu gewährleisten und Maschinenausfallzeiten zu verhindern. Unser technisches Team stellt eine hohe Verfügbarkeit der technischen Anlagen sicher und verbessert die Qualität unserer Geräte.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eDeine Hauptaufgaben\u003cbr/\u003e\u003cbr/\u003eAusführung präventiver Wartungsmaßnahmen an einer breiten Vielfalt von Geräten an unseren Standorten\u003cbr/\u003eDurchführung von Reparaturen und Fehlerdiagnosen\u003cbr/\u003eVerwendung neuester Tools zur Maximierung der Geräteeffektivität\u003cbr/\u003eEinhaltung aller Arbeitsschutzrichtlinien und -praktiken \u003cbr/\u003eUnterstützung der Entwicklung und des beruflichen Fortschritts von Auszubildenden am Standort\u003cbr/\u003eArbeit an Projekten zur kontinuierlichen Verbesserung und Einführung von Best Practices an verschiedenen EU-Standorten\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAls Instandhaltungstechniker:in bist Du vor Ort in einem unserer Logistikzentren tätig, um schnell auf technische Störungen reagieren zu können. Du führst eine Reihe geplanter präventiver Wartungsmaßnahmen an Geräten durch, um für ihren sicheren Betrieb zu sorgen. Außerdem reagierst Du als Instandhaltungstechniker:in unverzüglich auf Störungen und Ausfälle. Du untersuchst die Ursachen, findest so schnell wie möglich Lösungen und wendest sie an.  Zudem machst Du Vorschläge für langfristige Verbesserungen.\u003cbr/\u003eIn Zusammenarbeit mit leitenden Kolleg:innen nimmst Du tägliche Wartungsaufgaben wahr und kommunizierst mit Dienstleistern, falls Du externe Expertise benötigst. Du arbeitest in rotierenden Schichten, damit wir rund um die Uhr unsere Standorte unterstützen – und dafür sorgen, dass Amazon weiterhin in dem Tempo liefern kann, für das wir bekannt sind. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eUnser Amazon Transportation Services (ATS) Team ist essentiell, um Amazons schnelles Lieferversprechen einhalten zu können. Bei ATS wirst du Teil eines diversen Teams, welches eine zentrale Rolle für den Erfolg unserer Supply Chain spielt. In Zusammenarbeit mit Luft- und Seefrachtunternehmen, Straßenspeditionen und unseren Sortierzentren sorgst Du dafür, dass Amazon seine Kund:innen so effizient wie möglich beliefert.  \u003cbr/\u003eUnsere Mitarbeitenden und ihre Sicherheit sind dabei unsere höchste Priorität. Und wir nutzen das Können unserer Mitarbeitenden, um Pakete schnell, reibungslos und nachhaltig an ihr Ziel zu bringen. Unsere datenbasierte Entscheidungsfindung und unsere Flexibilität uns den Bedürfnissen der Kunden anzupassen macht Amazon noch effizienter und innovativer.","department_cost_center":null,"description_short":"Das Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) ist für unseren Betrieb von fundamentaler Bedeutung – es sorgt dafür, dass unsere technischen Systeme und","display_distance":null,"id":"940fd591-af79-4ebb-af31-b8ac49e542b0","id_icims":"3141942","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Real Estate/facilities","job_function_id":null,"job_path":"/en/jobs/3141942/instandhaltungstechniker-in","job_schedule_type":"full-time","location":"DE, HE, Wolfhagen","locations":["{\"normalizedStateName\":\"Hesse\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Wolfhagen\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, HE, Wolfhagen\",\"coordinates\":\"51.32798,9.17243\",\"normalizedCountyName\":\"Kassel (Landkreis)\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Wolfhagen, Hesse, DEU\",\"location\":\"DE, HE, Wolfhagen\",\"region\":\"HE\",\"buildingCodeList\":[\"KSF7\"],\"normalizedCityName\":\"Wolfhagen\"}"],"normalized_location":"Wolfhagen, Hesse, DEU","optional_search_labels":["ops.lander-emea-rme-technician","hourly","ops.rme-technician"],"posted_date":"December 12, 2025","preferred_qualifications":"- Erfahrung mit zustandsorientierter Überwachung\u003cbr/\u003e- Erfahrung in der Arbeit mit Druck- und Applikationsmaschinen\u003cbr/\u003e- Erfahrung in der Störungssuche und Wartung von Förder- oder Automationssystemen\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":"HE","title":"Instandhaltungstechniker :in","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3141942/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- Experience with computers, including MS Excel, Word and Office\u003cbr/\u003e- Work a flexible schedule including weekends, nights, and holidays\u003cbr/\u003e- Work flexible schedules including weekends, nights, and holidays","business_category":"fulfillment-ops","city":"Belfast","company_name":"Amazon UK Services Ltd. - A10","country_code":"GBR","description":"At Amazon, we have hundreds of facilities across Europe. They’re not just workplaces – they’re our hubs where teams meet and collaborate to make sure we’re always delivering the best we can for our customers. As a Reliability Maintenance Engineering (RME) Area Manager, you’ll bring together the elements that make our working environment as supportive and efficient as possible. Your focus will be to lead and mentor a team of expert technicians dedicated to equipment reliability.  \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eSupport colleagues in site compliance with safety policies and procedures \u003cbr/\u003eImplement EU network standards, plan preventative maintenance and ensure technical availability  \u003cbr/\u003eCollaborate with colleagues to collect and analyse data to improve processes \u003cbr/\u003eDeliver and support both site-based and network-level projects \u003cbr/\u003eLead, support and mentor your team to develop their career\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou’ll be based at one of our operational sites, which allows you to give practical guidance to your team and get a clear vision of what’s happening at your site. This involves collecting data and solving problems in a fast-paced environment. You’ll also have a chance to create an operational plan to make the site more productive and efficient. That will involve setting up new projects that improve everything from operational processes to equipment maintenance. After safety, the most important part of the role is leading your team and managing their performance and development, including organising additional training. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur Reliability Maintenance Engineering or RME team keep our equipment performing at its best. We're a technically minded team, made up of excellent team players and guided by experienced leaders. We work together to maintain, troubleshoot and repair equipment across our global network of fulfilment centres. Some of our people are leaders, who oversee the team as they work on exciting technology – some of which only exists at Amazon.\u003cbr/\u003e\u003cbr/\u003eFrom installing automated packaging systems to overseeing the general maintenance of a site to repairing key distribution equipment, our team handles most aspects of Amazon’s technical side. This includes keeping buildings legally compliant, so everyone is safe, and our sites are operating at maximum efficiency. There are lots of opportunities for progression, both within the RME team and more widely across Amazon.\u003cbr/\u003e\u003cbr/\u003eEverything we do focuses on reducing downtime in Amazon’s crucial operations sites, so customers get their orders on time. We often work during early or late hours to carry out maintenance with minimal disruption, including night shifts. If we spot a better way to do something, we have the skills and the opportunity to develop and introduce completely new processes or cutting-edge tech like Amazon Robotics and our Complex Item Sorter.","department_cost_center":null,"description_short":"At Amazon, we have hundreds of facilities across Europe. They’re not just workplaces – they’re our hubs where teams meet and collaborate to make sure we’re always delivering the best we can for our customers.","display_distance":null,"id":"cee297ea-ced2-4a97-b6e2-cc797974a98d","id_icims":"3155919","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Real Estate/facilities","job_function_id":null,"job_path":"/en/jobs/3155919/maintenance-manager-amzl","job_schedule_type":"full-time","location":"GB, Belfast","locations":["{\"normalizedStateName\":\"Northern Ireland\",\"normalizedCountryCode\":\"GBR\",\"city\":\"Belfast\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, Belfast\",\"coordinates\":\"54.59534,-5.93455\",\"normalizedCountyName\":\"County Antrim\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"Belfast, Northern Ireland, GBR\",\"location\":\"GB, Belfast\",\"region\":\"\",\"buildingCodeList\":[\"BFS\",\"DBT3\",\"SBF1\"],\"normalizedCityName\":\"Belfast\"}"],"normalized_location":"Belfast, Northern Ireland, GBR","optional_search_labels":["ops.lander-emea-rme-manager","ops.rme-field-management","fulfillment-and-operations.global-engineering-services-emea","fulfillment-and-operations.fulfillment-center-mgmt-emea"],"posted_date":"January  9, 2026","preferred_qualifications":"- Master's degree, or Six Sigma Black Belt certification\u003cbr/\u003e- Experience with preventive maintenance procedures, industrial electrical, industrial controls, and industrial electronics \u0026 robotics\u003cbr/\u003e- Experience working with Material Handling Equipment (MHE) integrators\u003cbr/\u003e- Experience maintaining material handling equipment and integrated systems\u003cbr/\u003e- Experience in project management\u003cbr/\u003e- Experience with statistical analysis\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-engineering-it","source_system":"JobCreator","state":null,"title":"Maintenance Manager, AMZL","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3155919/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-engineering-it","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Relevant experience with PLC-controlled automation and issue diagnosis in a continuous process or production environment\u003cbr/\u003e- Relevant experience supporting different conveyors and sortation systems\u003cbr/\u003e- Relevant experience dealing with material handling, flow and capacity visualisation, and monitoring\u003cbr/\u003e- Experience with at least one of the following tools:Microsoft Office, project management tools and EPLAN, Ladder Logic and structure programming from Siemens, Allen-Brady or Codesys PLCs Ignition SCADA or similar platform and Human Machine Interface (HMI), EthernetIP, Profinet, Profibus and AS-i or other fieldbus networks, VFDs, safety gateways and input and output devices\u003cbr/\u003e- Advanced proficiency in verbal and written\u003cbr/\u003e- English and local language","business_category":"fulfillment-ops","city":"Wakefield","company_name":"Amazon UK Services Ltd.","country_code":"GBR","description":"Operations is at the heart of everything Amazon does, and automation is one of the ways we optimise our processes. As an Automation Engineer, you’ll make sure that our automated systems are working at their best so that our customers get their orders on time. By exploring data on everything from control systems to sensors, you’ll maximise the availability of equipment at your sites. This role puts you at the forefront of Amazon’s emerging technology to solve complex productivity challenges.  \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Monitor, troubleshoot and repair issues with key systems \u003cbr/\u003e- Work with the EU Controls network to monitor\u003cbr/\u003e- Material Handling Equipment (MHE) metrics \u003cbr/\u003e- Provide data visualisations of troubleshooting to internal stakeholders \u003cbr/\u003e- Own or actively participate in continuous improvement projects run by the EU Controls network \u003cbr/\u003e- Work with different departments to ensure all systems are correctly documented and that accurate backup libraries are maintained \u003cbr/\u003e- Work with global colleagues to install and commission new equipment \u003cbr/\u003e- Support other sites in the EU Controls network as needed \u003cbr/\u003e- Interpret mechanical and electrical drawings, and develop improvement strategies for code conforming to IEC 61131-3 \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs an Automation Engineer, you’ll be the site expert when it comes to keeping key automated systems running smoothly. You’ll be working with our automation machinery, from conveyors to sortation systems, and ensuring they’re working efficiently. If something has gone wrong or can be done better, you’ll take the lead in coming up with and implementing a solution.  \u003cbr/\u003e\u003cbr/\u003eYou’ll also share your expertise with your close colleagues. You’ll be keeping your Engineering Technicians up to date with device troubleshooting and preventative maintenance control training, so that your team can keep our automation systems in order. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur Reliability Maintenance Engineering or RME team keep our equipment performing at its best. We're a technically minded team, made up of excellent team players and guided by experienced leaders. We work together to maintain, troubleshoot and repair equipment across our global network of fulfilment centres. Some of our people are leaders, who oversee the team as they work on exciting technology – some of which only exists at Amazon.\u003cbr/\u003e\u003cbr/\u003eFrom installing automated packaging systems to overseeing the general maintenance of a site to repairing key distribution equipment, our team handles most aspects of Amazon’s technical side. This includes keeping buildings legally compliant, so everyone is safe, and our sites are operating at maximum efficiency. There are lots of opportunities for progression, both within the RME team and more widely across Amazon.\u003cbr/\u003e\u003cbr/\u003eEverything we do focuses on reducing downtime in Amazon’s crucial operations sites, so customers get their orders on time. We often work during early or late hours to carry out maintenance with minimal disruption, including night shifts. If we spot a better way to do something, we have the skills and the opportunity to develop and introduce completely new processes or cutting-edge tech like Amazon Robotics and our Complex Item Sorter.","department_cost_center":null,"description_short":"Operations is at the heart of everything Amazon does, and automation is one of the ways we optimise our processes. As an Automation Engineer, you’ll make sure that our automated systems are working at","display_distance":null,"id":"3f9a6650-01ab-4dbc-a36f-1d3bf516dc41","id_icims":"3138007","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3138007/automation-engineer","job_schedule_type":"full-time","location":"GB, WAR, Wakefield","locations":["{\"normalizedStateName\":\"England\",\"normalizedCountryCode\":\"GBR\",\"city\":\"Wakefield\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, WAR, Wakefield\",\"coordinates\":\"53.67994,-1.51033\",\"normalizedCountyName\":\"West Yorkshire\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"Wakefield, England, GBR\",\"location\":\"GB, WAR, Wakefield\",\"region\":\"WAR\",\"buildingCodeList\":[\"DSA6\"],\"normalizedCityName\":\"Wakefield\"}"],"normalized_location":"Wakefield, England, GBR","optional_search_labels":["ops.rme-automation-engineer"],"posted_date":"December  5, 2025","preferred_qualifications":"- A degree in computer science, electrical engineering, industrial electronics or another technical subject\u003cbr/\u003e- Experience working within ISO 13849 and ISO 62061 frameworks\u003cbr/\u003e- Experience working in a multi-site environment\u003cbr/\u003e- Project management experience with multiple frameworks such as Agile and Waterfall\u003cbr/\u003e- Experience of Six Sigma, data analysis or process improvement techniques\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":"WAR","title":"Automation Engineer","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3138007/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience using data and metrics to drive improvements\u003cbr/\u003e- Experience communicating results to senior leadership\u003cbr/\u003e- Experience driving direction and alignment with cross-functional teams\u003cbr/\u003e- Experience with communication, presentation, and negotiation\u003cbr/\u003e- Deep knowledge and Extensive experience in theatrical marketing within Germany,\u003cbr/\u003e- Proven track record in marketing leadership roles within a global media company.\u003cbr/\u003e- Deep understanding of the German and digital landscape, consumer behavior and cultural trends","business_category":"entertainment","city":"Berlin","company_name":"Amazon Digital Germany GmbH","country_code":"DEU","description":"Amazon MGM Studios is seeking a Head of Germany Theatrical Marketing. The candidate will architect and execute large-scale marketing campaigns for our ambitious slate of theatrical releases in collaboration with US and global theatrical teams as well as key local territory colleagues and stakeholders. This role is responsible for developing and executing local marketing strategies that drive awareness, engagement and box office performance, in alignment with global campaign objectives.  This role requires managing concurrent releases, and pivoting quickly in response to audience reception. You'll oversee budgets that leverage both traditional theatrical and digital channels to maximize impact. This role functions as the key point of contact for all aspects of theatrical marketing for Amazon MGM Studios within Germany. This position will report into the Head of International Theatrical Marketing. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tDevelop and lead theatrical marketing campaigns in Germany that delight audiences and drive box office success for Amazon MGM Studios' films, specifically tailored to the territory while aligning to international and global film strategies.\u003cbr/\u003e•\tImplement tactics to drive experimentation through qualitative and quantitative campaign optimization, with a focus on real time campaign refinement\u003cbr/\u003e•\tGrow and maintain strategic relationships with key industry players in the Germany market.\u003cbr/\u003e•\tBuild marketing budget allocation and optimize spending across channels.\u003cbr/\u003e•\tWork closely with Publicity personnel to maximise this critical part of the overall marketing mix\u003cbr/\u003e•\tWork closely with local and international Distribution leadership, especially around Exhibitor Marketing efforts and overall P\u0026L scenarios\u003cbr/\u003e•\t Lead and direct relevant internal and external agency support in territory to deliver these best in class marketing campaigns\u003cbr/\u003e•\tManage and mentor local marketing team and coordinate with regional and international teams.\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon MGM Studios is seeking a Head of Germany Theatrical Marketing. The candidate will architect and execute large-scale marketing campaigns for our ambitious slate of theatrical releases in collaboration","display_distance":null,"id":"69cab34c-07dc-43f2-9794-ce259f1d9f32","id_icims":"3120645","is_intern":null,"is_manager":null,"job_category":"Marketing \u0026 PR","job_family":"Entertainment and Studio","job_function_id":null,"job_path":"/en/jobs/3120645/head-of-germany-theatrical-marketing-amazon-mgm-studios-marketing","job_schedule_type":"full-time","location":"DE, BE, Berlin","locations":["{\"normalizedStateName\":\"Berlin\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Berlin\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, BE, Berlin\",\"coordinates\":\"52.51604,13.37691\",\"normalizedCountyName\":\"Berlin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Berlin, Berlin, DEU\",\"location\":\"DE, BE, Berlin\",\"region\":\"BE\",\"buildingCodeList\":[\"BER16\"],\"normalizedCityName\":\"Berlin\"}","{\"normalizedStateName\":\"Bavaria\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Munich\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, BY, Munich\",\"coordinates\":\"48.13641,11.57754\",\"normalizedCountyName\":\"Munich\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Munich, Bavaria, DEU\",\"location\":\"DE, BY, Munich\",\"region\":\"BY\",\"buildingCodeList\":[\"MUC11\"],\"normalizedCityName\":\"Munich\"}"],"normalized_location":"Berlin, Berlin, DEU","optional_search_labels":[],"posted_date":"February 23, 2026","preferred_qualifications":"- Track record of launching successful theatrical releases in the Germany market\u003cbr/\u003e- Experience operating in fast-paced, ambiguous environments, with overlapping launch dates and priorities.\u003cbr/\u003e- Experience working with filmmakers, exhibitors and key influencers\u003cbr/\u003e- Strong understanding of both traditional theatrical marketing and digital platforms\u003cbr/\u003e- Bachelor's degree or industry-equivalent experience in Marketing, Business Administration, or related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"entertainment.team-amazonstudios","source_system":"JobCreator","state":"BE","title":"Head of Germany Theatrical Marketing, Amazon \u0026 MGM Studios Marketing","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3120645/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazonstudios","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Master's degree or above in Computational Linguistics\u003cbr/\u003e- Experience owning and executing language data collection projects, including guidelines, labelset and annotation workflow development\u003cbr/\u003e- Master's or higher degree in a relevant field (Computational Linguistics or equivalent field with computational analysis)\u003cbr/\u003e- 2+ years experience in computational linguistics or language data processing or AI data creation\u003cbr/\u003e- Experience with language data annotation systems and other forms of data markup\u003cbr/\u003e- Proficient with scripting languages, such as Python\u003cbr/\u003e- Experience working with speech, text, and multimodal data in multiple languages\u003cbr/\u003e- Excellent communication, strong organizational skills and very detailed oriented\u003cbr/\u003e- Comfortable working in a fast paced, highly collaborative, dynamic work environment","business_category":"alexa-and-amazon-devices","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The Amazon Artificial General Intelligence (AGI) Data Services organization is responsible for developing diverse datasets to train and evaluate the Amazon AI models. We are looking for Language Engineers to join our science and engineering team to support the development of complex, multimodal datasets, using a range of approaches including synthetic data generation, model-supported data generation, and human-in-the-loop data collections. \u003cbr/\u003e\u003cbr/\u003eYou will play a critical role in driving innovation and advancing the state-of-the-art in evaluating and training AI models. You will work closely with cross-functional teams, including product managers, engineers, and data scientists to ensure that our AI systems are best in class.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Design complex data collections with human participants in response to science needs: author instructions, define and implement quality targets and mechanisms, provide day-to-day coordination of data collection efforts (including planning, scheduling, and reporting), and be responsible for the final deliverables \u003cbr/\u003e- Design and conduct complex data creation tasks using synthetic and model-based data generation methods, following state-of-the-art approaches\u003cbr/\u003e- Analyze and extract insights from large amounts of data \u003cbr/\u003e- Build tools or tool prototypes for data analysis or data creation, using Python or another scripting language\u003cbr/\u003e- Use modeling tools to bootstrap or test new AI functionalities \u003cbr/\u003e- Collaborate with scientists, software engineers, and other data creators to evaluate performance of AI models \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon strives to be the world’s most customer-centric company, where customers can research and purchase anything they might want online or offline. We set big goals and are looking for people who can help us reach and exceed them. The AGI organization provides AI capabilities for a variety of Amazon products and searches. We provide secure, flexible, cost effective, and high-quality data development services to our customers, that enables them to build advanced ML models.","department_cost_center":null,"description_short":"The Amazon Artificial General Intelligence (AGI) Data Services organization is responsible for developing diverse datasets to train and evaluate the Amazon AI models. We are looking for Language Engineers","display_distance":null,"id":"02fd27a5-fced-4486-9ee4-438bef28105d","id_icims":"3173993","is_intern":null,"is_manager":null,"job_category":"Data Science","job_family":"Language Engineer","job_function_id":null,"job_path":"/en/jobs/3173993/language-engineer-artificial-general-intelligence-data-services","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Boston\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Boston\",\"coordinates\":\"42.35866,-71.05674\",\"normalizedCountyName\":\"Suffolk\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Boston, Massachusetts, USA\",\"location\":\"US, MA, Boston\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS17\"],\"normalizedCityName\":\"Boston\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sunnyvale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Sunnyvale\",\"coordinates\":\"37.37188,-122.03751\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sunnyvale, California, USA\",\"location\":\"US, CA, Sunnyvale\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC13\"],\"normalizedCityName\":\"Sunnyvale\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA106\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":["alexa-and-amazon-devices.team-machine-learning-and-science-job-family","amazon.artificial-intelligence"],"posted_date":"February  4, 2026","preferred_qualifications":"- PhD in Computational Linguistics (or equivalent field with computational emphasis)\u003cbr/\u003e- Expertise in bootstrapping AI data collections for quickly evolving requirements\u003cbr/\u003e- Extensive experience working with speech, text, and multimodal data in multiple languages\u003cbr/\u003e- Experience in data creation for complex agentic workflows\u003cbr/\u003e- Practical experience with Machine Learning and technical concepts such as API\u003cbr/\u003e- Practical knowledge of version control and agile development; familiarity with database queries and data analysis processes (SQL, R, Matlab, etc.)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Sunnyvale - 86,500.00 - 151,400.00 USD annually\u003cbr/\u003eUSA, MA, Boston - 75,200.00 - 131,600.00 USD annually\u003cbr/\u003eUSA, WA, BELLEVUE - 82,700.00 - 131,600.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-alexa-echo-devices","source_system":"JobCreator","state":"WA","title":"Language Engineer, Artificial General Intelligence - Data Services","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3173993/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-alexa-echo-devices","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"\u003cbr/\u003ePosition Requirements:\u003cbr/\u003e\u003cbr/\u003eMaster's degree or foreign equivalent degree in Computer Science, Engineering, Information Systems, Mathematics, or a related field and two years of experience in the job offered or a related occupation. Employer will accept a Bachelor's degree or foreign equivalent degree in Computer Science, Engineering, Information Systems, Mathematics, or a related field and five years of progressive post-baccalaureate experience in the job offered or a related occupation as equivalent to the Master’s degree and two years of experience. Must have two years of experience in the following skill(s): 1) building automated tools in a modern programming language; 2) focusing on cloud, system, or network security; and 3) experience with network-based attack patterns and related threat models.#0000","business_category":"no-business-category","city":"Seattle","company_name":"Amazon Development Center U.S., Inc.","country_code":"USA","description":"MULTIPLE POSITIONS AVAILABLE\u003cbr/\u003e\u003cbr/\u003eEmployer: AMAZON DEVELOPMENT CENTER U.S., INC.\u003cbr/\u003eOffered Position: Security Engineer III\u003cbr/\u003eJob Location: Seattle, Washington\u003cbr/\u003eJob Number: AMZ9441880\u003cbr/\u003e\u003cbr/\u003ePosition Responsibilities:\u003cbr/\u003e\u003cbr/\u003eCollaborate with scientists and software engineers to research and develop innovative machine learning (ML) and artificial intelligence (AI) solutions for challenging cybersecurity problems. Analyze the output of ML/AI models for accuracy, customer impact, and interpretability. Integrate successful experiments into large scale, highly complex production services. Build complex systems that turn machine/deep learning and AI research into great products for our customers. Rapidly design and conduct large scale experiments in a high-ambiguity environment, making use of both quantitative and business judgment. Interact with other security engineers and related domain experts to dive deep into the types of challenges that we need innovative solutions for.\u003cbr/\u003e\u003cbr/\u003ePosition Requirements:\u003cbr/\u003e\u003cbr/\u003eMaster's degree or foreign equivalent degree in Computer Science, Engineering, Information Systems, Mathematics, or a related field and two years of experience in the job offered or a related occupation. Employer will accept a Bachelor's degree or foreign equivalent degree in Computer Science, Engineering, Information Systems, Mathematics, or a related field and five years of progressive post-baccalaureate experience in the job offered or a related occupation as equivalent to the Master’s degree and two years of experience. Must have two years of experience in the following skill(s): 1) building automated tools in a modern programming language; 2) focusing on cloud, system, or network security; and 3) experience with network-based attack patterns and related threat models.\u003cbr/\u003e\u003cbr/\u003eAmazon.com is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation.\u003cbr/\u003e\u003cbr/\u003e40 hours / week, 8:00am-5:00pm, Salary Range $178,400/year to $226,700/year.\u003cbr/\u003e\u003cbr/\u003eAmazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, visit:\u003cbr/\u003ehttps://www.aboutamazon.com/workplace/employee-benefits.#0000","department_cost_center":null,"description_short":"MULTIPLE POSITIONS AVAILABLEEmployer: AMAZON DEVELOPMENT CENTER U.S., INC.Offered Position: Security Engineer IIIJob Location: Seattle, WashingtonJob Number: AMZ9441880Position Responsibilities:Collaborate","display_distance":null,"id":"0aedee6e-52ec-422f-a5f6-ba0eb39ec270","id_icims":"3173055","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Systems Security Engineering","job_function_id":null,"job_path":"/en/jobs/3173055/security-engineer-iii-amz9441880","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA40\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February  3, 2026","preferred_qualifications":"Please see job description and the position requirements above.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"WA","title":"Security Engineer III - AMZ9441880","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3173055/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"Position Requirements:\u003cbr/\u003e\u003cbr/\u003eMaster's degree or foreign equivalent degree in Computer Science, Engineering, Mathematics, or a related field and one year of experience in the job offered or as a Support Engineer, Systems Engineer, or related occupation. Employer will accept a Bachelor's degree or foreign equivalent degree in Computer Science, Engineering, Mathematics, or a related field and five years of progressive post-baccalaureate experience in the job offered or related occupation as equivalent to the Master's degree and one year of experience. Must have one year of experience in the following skill(s): (1) designing, developing, implementing, troubleshooting, and managing large-scale, distributed applications; (2) performing system administration in a Linux or Windows environment; and (3) conducting computer networking, scripting, and automation. Domestic and international travel up to 25% to perform role responsibilities may be required.#0000","business_category":"no-business-category","city":"Arlington","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"MULTIPLE POSITIONS AVAILABLE\u003cbr/\u003e\u003cbr/\u003eEmployer: AMAZON WEB SERVICES, INC.\u003cbr/\u003eOffered Position: Enterprise Act Engineer III\u003cbr/\u003eJob Location: Arlington, Virginia\u003cbr/\u003eJob Number: AMZ10038308\u003cbr/\u003e\u003cbr/\u003ePosition Responsibilities:\u003cbr/\u003e\u003cbr/\u003eDesign, develop and support global and enterprise companies running cloud-based mission-critical applications, systems, services and features. Work directly with engineering teams and leading technologists. Utilize transformational technologies to ensure flawless customer experience. Manage Enterprise accounts, oversee support cases, and assist customers regarding strategy, project planning, launch, and ongoing operations. Complete analysis and present periodic reviews of operational performance to customer. Provide detailed reviews of service disruptions, metrics, and detailed prelaunch planning. Recommend new offerings for company architecture and provide proactive advice through all phases of the implementation life cycle. Advocate for customer requirements. Participate in customer requested meetings. Utilize all key customer resolution tools across all service groups to facilitate rapid resolution of concerns.\u003cbr/\u003e\u003cbr/\u003ePosition Requirements:\u003cbr/\u003e\u003cbr/\u003eMaster's degree or foreign equivalent degree in Computer Science, Engineering, Mathematics, or a related field and one year of experience in the job offered or as a Support Engineer, Systems Engineer, or related occupation. Employer will accept a Bachelor's degree or foreign equivalent degree in Computer Science, Engineering, Mathematics, or a related field and five years of progressive post-baccalaureate experience in the job offered or related occupation as equivalent to the Master's degree and one year of experience. Must have one year of experience in the following skill(s): (1) designing, developing, implementing, troubleshooting, and managing large-scale, distributed applications; (2) performing system administration in a Linux or Windows environment; and (3) conducting computer networking, scripting, and automation. Domestic and international travel up to 25% to perform role responsibilities may be required.\u003cbr/\u003e\u003cbr/\u003eAmazon.com is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation.\u003cbr/\u003e\u003cbr/\u003e40 hours / week, 8:00am-5:00pm, Salary Range $175,427/year to $207,800/year.\u003cbr/\u003e\u003cbr/\u003eAmazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, visit:\u003cbr/\u003ehttps://www.aboutamazon.com/workplace/employee-benefits.#0000","department_cost_center":null,"description_short":"MULTIPLE POSITIONS AVAILABLEEmployer: AMAZON WEB SERVICES, INC.Offered Position: Enterprise Act Engineer IIIJob Location: Arlington, VirginiaJob Number: AMZ10038308Position Responsibilities:Design, develop","display_distance":null,"id":"f6b5835d-3261-4735-9ba3-7de0fa249c81","id_icims":"3173018","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Solution Architect","job_function_id":null,"job_path":"/en/jobs/3173018/enterprise-act-engineer-iii-amz10038308","job_schedule_type":"full-time","location":"US, VA, Arlington","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS17\"],\"normalizedCityName\":\"Arlington\"}"],"normalized_location":"Arlington, Virginia, USA","optional_search_labels":[],"posted_date":"February  3, 2026","preferred_qualifications":"Please see job description and the position requirements above.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"VA","title":"Enterprise Act Engineer III - AMZ10038308","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3173018/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"Position Requirements:\u003cbr/\u003e\u003cbr/\u003eBachelor’s degree or foreign equivalent degree in Computer Science, Engineering, or a related field and five years of experience in the job offered, cloud infrastructure, software development, or a related occupation. Must have one year of experience in the following skill(s): proficiency in at least one programming language such as Python or Node.js; and designing, deploying, and operating infrastructure or applications with the cloud. Domestic and/or international travel up to 25% to perform role responsibilities may be required.#0000","business_category":"no-business-category","city":"Seattle","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"MULTIPLE POSITIONS AVAILABLE\u003cbr/\u003e\u003cbr/\u003eEmployer: AMAZON WEB SERVICES, INC.\u003cbr/\u003eOffered Position: Tech Training Specialist II\u003cbr/\u003eJob Location: Seattle, Washington\u003cbr/\u003eJob Number: AMZ10038286\u003cbr/\u003e\u003cbr/\u003ePosition Responsibilities:\u003cbr/\u003e\u003cbr/\u003eDive deep into AWS technologies, such as Big Data, Web Applications, Security, Networking, High Performance Computing, Storage, Databases, Enterprise Applications, Migration Strategies or other solutions areas to understand the services and develop effective training for our customers. Work with Product Management, Core Curriculum, and Technical Curriculum Architects to develop and maintain a cohesive set of real-world, scenario-based labs to reinforce the learning objectives for AWS courseware by offering hands-on learning for students. Coordinate with the Curriculum Engineering to ensure that hands on labs are built for scalability and long-term support. Utilize automated lab and courseware publishing process to manage and deploy content. Work with the Technical Curriculum Architects, Lab Engineers and other teams to provide support and maintenance for deployed hands-on labs. Determine services and features to be included in course lab exercises, based on intended audience profile, learning objectives, AWS best practices and strategic initiatives. Collaborate with Subject Matter Experts across AWS (including Curriculum Developers, Technical Trainers, Support Engineers, Professional Services, and Solutions Architects) to build technically accurate training that meets the learning objectives. Collaborate with AWS service teams to identify changes in offerings that would affect training materials and participate in collaborations between Curriculum Development and the service teams. Identify and automate manual processes during course / lab development and maintenance.\u003cbr/\u003e\u003cbr/\u003ePosition Requirements:\u003cbr/\u003e\u003cbr/\u003eBachelor’s degree or foreign equivalent degree in Computer Science, Engineering, or a related field and five years of experience in the job offered, cloud infrastructure, software development, or a related occupation. Must have one year of experience in the following skill(s): proficiency in at least one programming language such as Python or Node.js; and designing, deploying, and operating infrastructure or applications with the cloud. Domestic and/or international travel up to 25% to perform role responsibilities may be required.\u003cbr/\u003e\u003cbr/\u003eAmazon.com is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation.\u003cbr/\u003e\u003cbr/\u003e40 hours / week, 8:00am-5:00pm, Salary Range $120,328/year to $160,000/year.\u003cbr/\u003e\u003cbr/\u003eAmazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, visit:\u003cbr/\u003ehttps://www.aboutamazon.com/workplace/employee-benefits.#0000","department_cost_center":null,"description_short":"MULTIPLE POSITIONS AVAILABLEEmployer: AMAZON WEB SERVICES, INC.Offered Position: Tech Training Specialist IIJob Location: Seattle, WashingtonJob Number: AMZ10038286Position Responsibilities:Dive deep into","display_distance":null,"id":"005188c8-8932-4051-9d53-d06faa09b7e1","id_icims":"3172961","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Technical Training","job_function_id":null,"job_path":"/en/jobs/3172961/tech-training-specialist-ii-amz10038286","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA40\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February  3, 2026","preferred_qualifications":"Please see job description and the position requirements above.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"WA","title":"Tech Training Specialist II - AMZ10038286","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3172961/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}