{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"Technical (Military/Trade School) training or degree in a relevant field (for example: electrical, mechanical).\u003cbr/\u003e3+ years of electrical or mechanical experience.\u003cbr/\u003e3+ years of data center or mission critical facilities (example: hospital, military facility, public safety facility, etc.) experience.","business_category":"aws","city":"Sterling","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support the operations of some of the world’s most powerful data centers. Our Data Center Engineering Operations team maintain and operate our critical infrastructure systems so that they are prepared to stand up against any situation.\u003cbr/\u003e\u003cbr/\u003eAWS has the world’s largest cloud computing portfolio. As an Amazonian you will work in some of the most sophisticated, safe, and secure data centers in the world. Our Chief Engineers (CE) help keep them that way by working with the brightest minds from around the globe to help test and implement the newest technology and work practices to meet the demands of a changing market.\u003cbr/\u003e\u003cbr/\u003eWe have a passion for learning and evolving, it’s how we have helped define ourselves as leaders in the industry. Let’s work hard, have fun, and make history!\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Act as the primary escalation point for all facilities-related issues. Oversee operation and management of routine and emergency services on a variety of critical systems such as: switchgear, generators, UPS systems, power distribution equipment, chillers, cooling towers, computer room air handlers, building monitoring systems, etc.\u003cbr/\u003e- Perform root cause analysis of equipment failures, and troubleshooting of facility within internal Service Level Agreements (SLA).\u003cbr/\u003e- Provide training and guidance to Engineering Operations Technicians and responsible for working with Facility Manager (FM) to set team culture.\u003cbr/\u003e- Create and deploy new standard practices for Engineering Operations Technicians, Chief Engineers, and vendor support teams\u003cbr/\u003e- May assist in the build out of new facilities and assist in projects to increase current facility efficiency\u003cbr/\u003e- Working outside of normal business hours for routine maintenance as required, including responding to out-of-hours emergency calls.\u003cbr/\u003e- Communicate complex technical information to a non-technical audience.\u003cbr/\u003e- Work with IT managers and other business leaders to coordinate projects, manage capacity, and optimize plant safety, performance, reliability and efficiency\u003cbr/\u003e- Ensure all safety procedures are adhered to by vendor and Amazon staff\u003cbr/\u003e- Establish building performance benchmarks, conduct analyses, and prepare reports on all aspects of the critical facility operations and maintenance.\u003cbr/\u003e- Utilize Microsoft Excel, Word, Outlook and other basic administrative tools to perform day to day tasks\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e- Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They maintain, operate, and troubleshoot mission-critical data center facility equipment including electrical support equipment that supports servers that must maintain better than 99.999% uptime. Equipment will include but is not limited to stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eThe CE directs, trains and supports technicians in their role of providing hands-on electrical and mechanical equipment troubleshooting and operations. Implementation and execution of site/equipment-specific training exercises is also expected. They manage projects from conception to completion. These projects involve independent work as well as collaboration with external support groups including engineering, automation, processing, and finance in both local and global settings. The CE will be tasked with creating and delivering on key milestones, obtaining and tracking quotes for all necessary costs, and documenting project results for future implementation at other facilities.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.","department_cost_center":null,"description_short":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support the operations of some of the world’s most powerful data centers.","display_distance":null,"id":"ae1565c5-7ba8-4eef-8386-42dc0438436c","id_icims":"3084428","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3084428/data-center-night-chief-engineer-dcc-communities","job_schedule_type":"full-time","location":"US, VA, Sterling","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sterling\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Sterling\",\"coordinates\":\"39.03336,-77.40713\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sterling, Virginia, USA\",\"location\":\"US, VA, Sterling\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD10\"],\"normalizedCityName\":\"Sterling\"}"],"normalized_location":"Sterling, Virginia, USA","optional_search_labels":["aws.team-dc","military","aws.team-ais"],"posted_date":"September 16, 2025","preferred_qualifications":"4+ years of Data Center Engineering Experience.\u003cbr/\u003eAssociates or Bachelor’s Degree.\u003cbr/\u003eExperience leading a team.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Sterling - 96,000.00 - 166,300.00 USD annually","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"VA","title":"Data Center Night Chief Engineer, DCC Communities ","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3084428/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of people management and team development experience\u003cbr/\u003e- 5+ years of engineering work managing large-scale services experience\u003cbr/\u003e- Experience in people management and team development\u003cbr/\u003e- Experience in engineering work, managing large-scale services\u003cbr/\u003e- Experience maintaining SLAs through the implementation of proactive issue detection and reporting\u003cbr/\u003e- Experience operating a mission-critical team or product\u003cbr/\u003e- High school or equivalent","business_category":"aws","city":"Sterling","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support the operations of some of the world’s most powerful data centers. Our Data Center Engineering Operations team maintain and operate our critical infrastructure systems so that they are prepared to stand up against any situation.\u003cbr/\u003e\u003cbr/\u003eAWS has the world’s largest cloud computing portfolio. As an Amazonian you will work in some of the most sophisticated, safe, and secure data centers in the world. Our Facility Managers help keep them that way by working with the brightest minds from around the globe to help test and implement the newest technology and work practices to meet the demands of a changing market.\u003cbr/\u003e\u003cbr/\u003eWe have a passion for learning and evolving, it’s how we have helped define ourselves as leaders in the industry. Let’s work hard, have fun, and make history!\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Oversee all aspects of the data center’s critical physical infrastructure. Maintain high availability and performance while ensuring that all work performed within the site is done to high quality without impact to internal/external customers and maintain service level agreements.\u003cbr/\u003e- Manage on-site teams of 24x7 shift technicians, sub-contractors and vendors ensuring that all work performed is in accordance with established practices, procedures and safety protocols.\u003cbr/\u003e- Drive safety and security culture and compliance within the team\u003cbr/\u003e- Hire, coach, and promote team members. Responsible for team's career development and performance management\u003cbr/\u003e- Promotes healthy team culture and peak morale\u003cbr/\u003e- Effectively and efficiently manage the operations budget and expenditures.\u003cbr/\u003e- Engage in improvement projects, often requiring reaching out to a variety of support teams, and drive them from conception to completion.\u003cbr/\u003e- Act as an escalation point for all facilities-related issues. Oversee operation and management of routine and emergency services on a variety of critical systems such as: switchgear, generators, UPS systems, power distribution equipment, chillers, cooling towers, computer room air handlers, building monitoring systems, etc.\u003cbr/\u003e- Utilize root cause analysis and troubleshooting/problem solving skills\u003cbr/\u003e- Respond to out-of-hours emergency calls.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e- May assist in the build out of new facilities and assist in projects to increase current facility efficiency\u003cbr/\u003e- Utilize Microsoft Excel, Word, Outlook and other basic administrative tools to perform day to day tasks\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are seeking an energetic Data Center Facility Manager to serve as a technical resource and leader within Amazon data centers. The position will help ensure overall availability and reliability to meet or exceed defined service levels of data center operations. The Data Center Facility Manager will oversee operations and management of technicians responsible for routine and emergency services on a variety of critical systems such as: switch gear, generators, UPS systems, power distribution equipment, chillers, cooling towers, computer room air handlers, building monitoring systems, etc. They will assist in maintaining a high reliability and performance while keeping operating costs in facilities at a minimum. This equipment supports mission-critical servers and must maintain better than 99.999% uptime.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e","department_cost_center":null,"description_short":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support the operations of some of the world’s most powerful data centers.","display_distance":null,"id":"60c731cf-e312-4732-9ff2-43c525fa7a3e","id_icims":"3099672","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3099672/data-center-facility-operations-manager-data-center-operations","job_schedule_type":"full-time","location":"US, VA, Sterling","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sterling\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Sterling\",\"coordinates\":\"39.03336,-77.40713\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sterling, Virginia, USA\",\"location\":\"US, VA, Sterling\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD122\"],\"normalizedCityName\":\"Sterling\"}"],"normalized_location":"Sterling, Virginia, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"October  2, 2025","preferred_qualifications":"- 3+ years of work in a management position with 5 or more direct reports experience\u003cbr/\u003e- 5+ years of work in data centers with an emphasis on building and equipment operation experience\u003cbr/\u003e- Bachelor's degree in Electrical Engineering, Mechanical Engineering, or a related field\u003cbr/\u003e- Knowledge of the electrical and mechanical systems involved in critical data center operations including systems such as feeders, transformers, generators, switchgear, UPS systems, ATS units, PDU units, chillers, pumps, air handling units, and CRAC units\u003cbr/\u003e- Experience in a management position with 5 or more direct reports\u003cbr/\u003e- Experience working in data centers with an emphasis on building and equipment operation\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Sterling - 129,200.00 - 193,000.00 USD annually","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"VA","title":"Data Center Facility Operations Manager, Data Center Operations","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3099672/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- 4+ years of work in a management position with 5 or more direct reports experience\u003cbr/\u003e- 5+ years of data center or mission critical facilities (example: hospital, military facility, public safety facility, etc.), or 2+ years of electrical or mechanical experience","business_category":"aws","city":"Sterling","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support the operations of some of the world’s most powerful data centers. Our Data Center Engineering Operations team maintain and operate our critical infrastructure systems so that they are prepared to stand up against any situation.\u003cbr/\u003e\u003cbr/\u003eAWS has the world’s largest cloud computing portfolio. As an Amazonian you will work in some of the most sophisticated, safe, and secure data centers in the world. Our Facility Managers help keep them that way by working with the brightest minds from around the globe to help test and implement the newest technology and work practices to meet the demands of a changing market.\u003cbr/\u003e\u003cbr/\u003eWe have a passion for learning and evolving, it’s how we have helped define ourselves as leaders in the industry. Let’s work hard, have fun, and make history!\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Oversee all aspects of the data center’s critical physical infrastructure. Maintain high availability and performance while ensuring that all work performed within the site is done to high quality without impact to internal/external customers and maintain service level agreements.\u003cbr/\u003e- Manage on-site teams of 24x7 shift technicians, sub-contractors and vendors ensuring that all work performed is in accordance with established practices, procedures and safety protocols.\u003cbr/\u003e- Drive safety and security culture and compliance within the team\u003cbr/\u003e- Hire, coach, and promote team members. Responsible for team's career development and performance management\u003cbr/\u003e- Promotes healthy team culture and peak morale\u003cbr/\u003e- Effectively and efficiently manage the operations budget and expenditures.\u003cbr/\u003e- Engage in improvement projects, often requiring reaching out to a variety of support teams, and drive them from conception to completion.\u003cbr/\u003e- Act as an escalation point for all facilities-related issues. Oversee operation and management of routine and emergency services on a variety of critical systems such as: switchgear, generators, UPS systems, power distribution equipment, chillers, cooling towers, computer room air handlers, building monitoring systems, etc.\u003cbr/\u003e- Utilize root cause analysis and troubleshooting/problem solving skills\u003cbr/\u003e- Respond to out-of-hours emergency calls.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e- May assist in the build out of new facilities and assist in projects to increase current facility efficiency\u003cbr/\u003e- Utilize Microsoft Excel, Word, Outlook and other basic administrative tools to perform day to day tasks\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are seeking an energetic Data Center Facility Manager to serve as a technical resource and leader within Amazon data centers. The position will help ensure overall availability and reliability to meet or exceed defined service levels of data center operations. The Data Center Facility Manager will oversee operations and management of technicians responsible for routine and emergency services on a variety of critical systems such as: switch gear, generators, UPS systems, power distribution equipment, chillers, cooling towers, computer room air handlers, building monitoring systems, etc. They will assist in maintaining a high reliability and performance while keeping operating costs in facilities at a minimum. This equipment supports mission-critical servers and must maintain better than 99.999% uptime.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e","department_cost_center":null,"description_short":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support the operations of some of the world’s most powerful data centers.","display_distance":null,"id":"af250ed9-6ba2-4b8a-9ac9-86611ba21822","id_icims":"3148252","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3148252/data-center-facility-operations-manager","job_schedule_type":"full-time","location":"US, VA, Sterling","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sterling\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Sterling\",\"coordinates\":\"39.03336,-77.40713\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sterling, Virginia, USA\",\"location\":\"US, VA, Sterling\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD81\"],\"normalizedCityName\":\"Sterling\"}"],"normalized_location":"Sterling, Virginia, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"December 23, 2025","preferred_qualifications":"- Advanced electrical or mechanical certifications (Bachelor's degree or higher in a relevant engineering discipline)\u003cbr/\u003e- 5+ years of experience in a management position with 5 or more direct reports\u003cbr/\u003e- 7+ years of experience working in a data center or other mission critical environment with an emphasis on building and equipment operation\u003cbr/\u003e- An excellent understanding of the electrical and mechanical systems involved in critical data center operations including systems such as feeders, transformers, generators, switchgear, UPS systems, ATS units, PDU units, chillers, pumps, air handling units, and CRAHU units\u003cbr/\u003e- Strong verbal and written communication skills, technical writing or business justifications (white paper experience)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Sterling - 129,200.00 - 193,000.00 USD annually","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"VA","title":"Data Center Facility Operations Manager","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3148252/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"alexa-and-amazon-devices","city":"Austin","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is an initiative to launch a constellation of Low Earth Orbit satellites that will provide low-latency, high-speed broadband connectivity to unserved and underserved communities around the world. As a Embedded Software Engineer you will be a part of the team participating in the definition and implementation of the communication software architecture of Amazon Leo’s broadband wireless modem. You will participate in all phases of physical layer software development, from architecture design, through requirements, implementation, test, and operational support. This is a unique opportunity to innovate and define novel wireless technology with few legacy constraints. The team develops the communication system of Leo and validates overall performance within key metrics such as throughput, latency, system availability, packet loss etc.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Develop embedded software in assembly, C, and C++ in a real-time operating system environment for broadband satellite communication modem systems.\u003cbr/\u003e- Work closely with ASIC, communication systems and software teams to support system bring-ups, end-to-end integration, and testing. \u003cbr/\u003e- Ability to adapt design and test activities based on current HW/SW capabilities delivered by the development teams.\u003cbr/\u003e- Support end-to-end testing using lab equipment such as Vector Signal Generators and Analyzers, Packet Generators, Channel Emulators. Contribute to development-test bring up procedures with Linux, Python, bash scripting etc.\u003cbr/\u003e- Support operations and maintenance using telemetry to validate link performance over key indicators such as throughput, latency, etc.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs part of our software engineering team, you will design and implement software to deploy on Leo satellites in R\u0026D and commercial operation. You will also develop tests and debug capabilities to validate implementations on ground and on orbit. You will work in a collaborative environment with teams in hardware development, software development and network operations. You need to be flexible and responsive to fast changing priorities and issues.","department_cost_center":null,"description_short":"Amazon Leo is an initiative to launch a constellation of Low Earth Orbit satellites that will provide low-latency, high-speed broadband connectivity to unserved and underserved communities around the world.","display_distance":null,"id":"8d7056e6-3a3a-45f9-886f-1a40a33e417f","id_icims":"3163715","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3163715/embedded-sw-engineer-wireless-systems","job_schedule_type":"full-time","location":"US, TX, Austin","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS13\"],\"normalizedCityName\":\"Austin\"}"],"normalized_location":"Austin, Texas, USA","optional_search_labels":[],"posted_date":"January 21, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Austin - 143,700.00 - 194,400.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"TX","title":"Embedded SW Engineer, Wireless Systems ","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3163715/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 7+ years of engineering experience\u003cbr/\u003e- 3+ years of engineering team management experience\u003cbr/\u003e- 8+ years of leading the definition and development of multi tier web services experience\u003cbr/\u003e- Knowledge of engineering practices and patterns for the full software/hardware/networks development life cycle, including coding standards, code reviews, source control management, build processes, testing, certification, and livesite operations\u003cbr/\u003e- Experience partnering with product or program management teams\u003cbr/\u003e- Experience designing or architecting (design patterns, reliability and scaling) of new and existing systems","business_category":"entertainment","city":"Chennai","company_name":"ADCI MAA 15 SEZ","country_code":"IND","description":"Amazon.com is looking for a talented and enthusiastic Software Development Manager to join the Digital Acceleration team. The Digital Acceleration team owns services supporting the publishing, pricing and purchase of Digital content, including Kindle Books, Amazon AppStore, Amazon Music, Amazon Video, etc.\u003cbr/\u003e\u003cbr/\u003eThis candidate will be leading a team working on scalable web services using cloud technologies and offers opportunity to work on Gen-AI LLM technology. The work will be highly visible to Amazon customers and internal stakeholders.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Develop the long-term strategy for your products and translate that into an achievable road map.\u003cbr/\u003e· Drive product vision and adoption by influencing clients and partners\u003cbr/\u003e· Lead a nimble team of software engineers to architect, develop, test and deploy high quality software solutions with persistent customer focus\u003cbr/\u003e\u003cbr/\u003e· Manage departmental resources: hiring, mentoring, career management and maintaining a high performing team.\u003cbr/\u003e• Drive technical vision and architecture for Digital Pricing\u003cbr/\u003e• Make critical technical decisions balancing speed, quality, and operational excellence\u003cbr/\u003e• Partner with science teams to implement ML/AI strategies\u003cbr/\u003e• Lead design reviews and architecture discussions for complex distributed systems","department_cost_center":null,"description_short":"Amazon.com is looking for a talented and enthusiastic Software Development Manager to join the Digital Acceleration team. The Digital Acceleration team owns services supporting the publishing, pricing","display_distance":null,"id":"36f81893-b51d-4ad4-8013-bd41cdcbfdeb","id_icims":"3124583","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3124583/software-development-manager-iii-amazon-digital-acceleration-amazon-digital-acceleration-digital-pricing","job_schedule_type":"full-time","location":"IN, TN, Chennai","locations":["{\"normalizedStateName\":\"Tamil Nadu\",\"normalizedCountryCode\":\"IND\",\"city\":\"Chennai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TN, Chennai\",\"coordinates\":\"13.08404,80.28274\",\"normalizedCountyName\":\"Chennai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Chennai, Tamil Nadu, IND\",\"location\":\"IN, TN, Chennai\",\"region\":\"TN\",\"buildingCodeList\":[\"MAA15\"],\"normalizedCityName\":\"Chennai\"}"],"normalized_location":"Chennai, Tamil Nadu, IND","optional_search_labels":[],"posted_date":"November 11, 2025","preferred_qualifications":"- Experience in communicating with users, other technical teams, and senior leadership to collect requirements, describe software product features, technical designs, and product strategy\u003cbr/\u003e- Experience in recruiting, hiring, mentoring/coaching and managing teams of Software Engineers to improve their skills, and make them more effective, product software engineers\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"entertainment.digital-acceleration","source_system":"JobCreator","state":"TN","title":"Software Development Manager III, Amazon Digital Acceleration, Amazon Digital Acceleration - Digital Pricing","university_job":null,"updated_time":"23 minutes","url_next_step":"https://account.amazon.com/jobs/3124583/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"digital-acceleration","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent, or 5+ years of sales or marketing work (like e-commerce, retail technology, SaaS) or equivalent experience","business_category":"customer-trust-and-partner-support","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"We are seeking a talented Account Rep to increase recruitment and drive business development on our 3P sales team. In this role, you will be responsible for prospecting and recruiting Brand Owners and Resellers, with a focus on achieving sales performance metrics and sustainable growth. Specializing in a specific product category and seller tier, you'll leverage our New Seller Guide and various tools to ensure seller success. You'll work closely with cross-functional teams to maximize seller potential and drive revenue growth.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eIdentify, qualify, acquire and grow seller commitment to Selling on Amazon programs.\u003cbr/\u003eImplement and track metrics for recording the success and quality of the sellers in your territory. Use these metrics to guide your work and uncover hidden areas of opportunity.\u003cbr/\u003eManage complex contract negotiations and serve as a liaison to the legal team.\u003cbr/\u003eProspect and close business to achieve quarterly quota targets for both the quantity and quality of sellers recruited.\u003cbr/\u003eUnderstand and utilize the right tools to track all pertinent account information and sales progress as well as forecast and prioritize to achieve quarterly goals.\u003cbr/\u003eDevelop a thorough understanding of the e-commerce industry and including knowledge of product offerings.\u003cbr/\u003ePrioritize and complete additional projects (such as SMEship) while maintaining current book of business.\u003cbr/\u003ePrepare and deliver business reviews regarding progress and state of health for the respective territory.\u003cbr/\u003eMeet or exceed quarterly revenue targets and operational metrics.\u003cbr/\u003eCreate and articulate compelling value propositions around the Selling on Amazon product.\u003cbr/\u003eDevelop a clear understanding of the Selling on Amazon products along with the features and functionalities.\u003cbr/\u003eAssist internal partners to drive change, remove roadblocks and close business.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis person will recruit, and be the primary point of contact for companies throughout the discovery and registration process. \u003cbr/\u003e\u003cbr/\u003eThe Account Rep will be chartered with developing and managing a sales pipeline mix of both high value and transactional accounts while executing sales strategies to secure deals that will exceed account acquisition and output goals. \u003cbr/\u003e\u003cbr/\u003eSpecifically, this individual will be responsible for identifying and building relationships with key influencers and decision-makers within the senior management and executive teams of prospective accounts. Alongside internal stakeholders, they will create and present compelling Amazon solutions that meet and exceed customer requirements.  ","department_cost_center":null,"description_short":"We are seeking a talented Account Rep to increase recruitment and drive business development on our 3P sales team. In this role, you will be responsible for prospecting and recruiting Brand Owners and","display_distance":null,"id":"7308e698-f544-403b-aa19-5165b9861f46","id_icims":"3140192","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Sales/Account Management","job_function_id":null,"job_path":"/en/jobs/3140192/account-representative-ii-new-seller-recruitment-hardlines-direct-sales","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA27\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"December 10, 2025","preferred_qualifications":"- 5+ years of inside sales experience\u003cbr/\u003e- Experience in cold calling, prospecting and qualifying companies or equivalent\u003cbr/\u003e- Experience influencing at all levels within an organization, particularly at the executive level\u003cbr/\u003e- Experience exceeding sales targets using a consultative, solutions-focused approach or equivalent\u003cbr/\u003e- Experience across affiliate marketing, PPC, SEM and social media advertising\u003cbr/\u003e- Extensive Seller Central experience and reverse logistics industry experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 80,200.00 - 120,800.00 USD annually","primary_search_label":"customer-trust-and-partner-support.team-selling-partner-support","source_system":"JobCreator","state":"WA","title":"Account Representative II, New Seller Recruitment - Hardlines Direct Sales","university_job":null,"updated_time":"27 minutes","url_next_step":"https://account.amazon.com/jobs/3140192/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-selling-partner-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of delivering design solutions as a UX designer or interaction designer experience\u003cbr/\u003e- Have an available online portfolio","business_category":"alexa-and-amazon-devices","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The Devices \u0026 Services Experience Design (DxD) team leads user experience and industrial design innovation across Amazon's device portfolio, including Echo, Fire TV, Fire Tablets, Alexa.com, and related mobile apps. Our team works at the intersection of design, product and engineering, creating meaningful hardware and software experiences that enhance customer lives. We believe in storytelling and thinking holistically to craft the \"why\" behind everything we ship.\u003cbr/\u003e\u003cbr/\u003eThe Devices Design System team within DXD creates components and patterns that function across devices; from Echo Devices, Alexa Mobile App, Fire TV and Fire Tablet, supporting different modalities such as Voice, Touch, and Remote.\u003cbr/\u003e\u003cbr/\u003eWe are looking for a Full Stack UX Designer to drive the definition and design for Alexa's core multi-device and multimodal experiences, encompassing all new and existing Echo devices, Fire TV, and Tablet experiences. You will additionally help drive the definition and design of tools that will help our partners design and build experiences for devices.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Design beautiful, useful, and desirable user interfaces and experiences in a team environment\u003cbr/\u003e- Create user-centered designs by considering market analysis, customer feedback, and usability findings\u003cbr/\u003e- Use business requirements, user and market research to assist in developing scenarios, use cases, and high-level requirements\u003cbr/\u003e- Design the UI architecture, interface, and interaction flow of applications and experiences\u003cbr/\u003e- Develop conceptual diagrams, wireframes, visual mockups, click-throughs, and prototypes\u003cbr/\u003e- Develop and maintain detailed user-interface specifications and design patterns\u003cbr/\u003e- Develop and maintain documentation of customer behaviors, motivations, and daily habits.\u003cbr/\u003e- Work with project managers to plan projects for effective delivery while maintaining high standards for design\u003cbr/\u003e- Be a passionate and effective advocate for design with non-design audiences\u003cbr/\u003e- Write effectively to communicate design rationales and benefits to Amazon customers\u003cbr/\u003e- Use analytics and data to drive design decision making to best serve our customers\u003cbr/\u003e- Create and maintain processes for scaling, updating, managing, and evangelizing a design system\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou will create a variety of deliverables, including wireframes, prototypes, user-flows, high-fidelity mockups and specs to communicate design thinking to senior leadership, engineering and product partners at every phase of product development. You will champion a design system and invent and simplify a set of mechanisms and tools that empower designers and engineers building the future of multimodal experiences. You will collaborate on a daily basis with a world-class, multi-disciplinary team of design, product, and engineering professionals working on some of the most challenging problems at Amazon today.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eYou will join a team of full stack designers working across devices to deliver exceptional customer experiences. Customer obsession is at the core of all of our design decisions. We dive deep with product managers, designers, and engineers from various domains to learn how they are serving their customers. We work cross functionally to craft scalable, cohesive, and usable multimodal solutions for our customers. The team makes strategic decisions that allow partners to take action, move quickly, take ownership and deliver results. We earn the trust of others within DXD to foster an environment of inclusion and openness, allowing everyone to do their best every day.","department_cost_center":null,"description_short":"The Devices \u0026 Services Experience Design (DxD) team leads user experience and industrial design innovation across Amazon's device portfolio, including Echo, Fire TV, Fire Tablets, Alexa.com, and related","display_distance":null,"id":"a7b32843-dda0-4ed0-8e9d-33d00db66022","id_icims":"3182331","is_intern":null,"is_manager":null,"job_category":"Design","job_family":"Design","job_function_id":null,"job_path":"/en/jobs/3182331/ux-designer-devices-design-system","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA41\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["alexa-and-amazon-devices.team-design-job-family"],"posted_date":"February 17, 2026","preferred_qualifications":"- 2+ years of mass-market consumer web / mobile products experience\u003cbr/\u003e- Experience working in a collaborative team and working directly with developers for implementation of designs\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 117,800.00 - 160,000.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-ddg","source_system":"JobCreator","state":"WA","title":"UX Designer, Devices Design System","university_job":null,"updated_time":"41 minutes","url_next_step":"https://account.amazon.com/jobs/3182331/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-ddg","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of sales experience\u003cbr/\u003e- Bachelor's degree","business_category":"transportation-and-logistics","city":"Noida","company_name":"ASSPL - Delhi - C76","country_code":"IND","description":"At Amazon, we're working to be the most customer- eccentric company on earth. To get there, we need exceptionally talented, bright, and self driven people. Amazon is seeking Team leads for our transportation team. Amazon is one of the most recognizable brand names in the world and we distribute millions of products each year to our loyal customers\u003cbr/\u003e\u003cbr/\u003eWe're seeking a Channel Team lead for our Delivery center. In this role you will be responsible for I H S operations at our DCs \u0026 EDSP mangement. and support the DC manager in performance management and driving the operational plan 7 deliver defined above goal performance.\u003cbr/\u003e\u003cbr/\u003eTitle: Channel Team Lead\u003cbr/\u003e\u003cbr/\u003eEssential Functions\u003cbr/\u003e\u003cbr/\u003e-Job Description · Account Identification \u0026 Acquisition: Market mapping and Identification of potential retail stores for time bound Acquisition, induction and onboarding of new accounts (I.H.S stores) in the assigned territory.\u003cbr/\u003e· Account Management: Managing and driving the growth of the Channel partners/stores’ business with Amazon. Build and execute on a strategic account plan that delivers on key business opportunities for the stores and Amazon.\u003cbr/\u003e· Field Visits: Visiting targeted number of stores on a daily/weekly/monthly basis.\u003cbr/\u003e· Training: Deliver training \u0026 coaching of Amazon processes, products, operating model and SOPs.\u003cbr/\u003e· Work on the ground to enable network with new product launches and partner with the operations and other teams.\u003cbr/\u003e· Reporting: Maintaining \u0026 publishing routine reporting on the stores current performance \u0026 business with Amazon. Publish recommendations and action plans based on data. Reporting the overall Network Health in the assigned territory.\u003cbr/\u003e· Team Management: Building and managing a multi-layer team and manage performance through on-the job coaching and mentoring. Driving team of associates for managing their targets.\u003cbr/\u003e· Set proper expectations, provide clear status communications, and manage relationships with the acquired/assigned stores for a mutual growth.\u003cbr/\u003e· Work with Stores/channel partners to improve operational aspects of their business in providing a great delivery experience and consistently enhance efficiency.\u003cbr/\u003e· Enhance Engagement with accounts to improve business and increase retention.\u003cbr/\u003e· Drive stores against goals (Volume, FTR and other key metrics).\u003cbr/\u003e· Handling day to day operational escalations and be available to round the clock to manage the issues.\u003cbr/\u003e· Internal/External Stake holder management.\u003cbr/\u003e· Support station operations and/or customer deliveries.\u003cbr/\u003e\u003cbr/\u003eEssential Skills\u003cbr/\u003e\u003cbr/\u003eStrong leadership capabilities and people management skills\u003cbr/\u003eAbility to work under pressure situations\u003cbr/\u003eAbility to work in ambiguous situations\u003cbr/\u003eGood communication skills. Ability to communicate and explain to individuals \u0026 the team, what needs to be achieved for the Delivery Center /Amazon to achieve its objectives. Listening skills: Gains input and commitment from all involved in delivering their specific part.\u003cbr/\u003eStrong Bias for great customer service: Engage the Team in developing their understanding of Customer Experience and knowledge of what Customers actually needs/expects.\u003cbr/\u003eHigh Ownership: Follows through to ensure the delivery of changes/solutions/services that fulfill the Customer’s needs.\u003cbr/\u003e\u003cbr/\u003eAnalytical Skills: Effectively analyze and interpret information, identifying \u0026 validating the key facts, including reviewing alternatives to determine advantages and associated risks.\u003cbr/\u003e\u003cbr/\u003eBasic Qualifications\u003cbr/\u003e* Bachelor Degree / MBA.\u003cbr/\u003e* Preferably from Sales/Telecom background\u003cbr/\u003e* Advanced Excel and Communication skills\u003cbr/\u003e* Operations/People Handling skills\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAbility to work in ambiguous situations\u003cbr/\u003e\u003cbr/\u003eGood communication skills. Ability to communicate and explain to individuals \u0026 the team, what needs to be achieved for the Delivery Center /Amazon to achieve its objectives. Listening skills: Gains input and commitment from all involved in delivering their specific part.\u003cbr/\u003e\u003cbr/\u003eStrong Bias for great customer service: Engage the Team in developing their understanding of Customer Experience and knowledge of what Customers actually needs/expects.\u003cbr/\u003e\u003cbr/\u003eHigh Ownership: Follows through to ensure the delivery of changes/solutions/services that fulfill the Customer’s needs.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe Ops Manager, leads an operation for +20k packages. Manages On-The-Road execution encompassing to Delivery Service Partners, and Drivers on route and develops strategies to streamline these operations. Leads a team of  UTR \u0026 OTR TLs and +30 Associates, being the owner of solving complex problems and making key decisions and escalations on behalf of their team. Fosters a Culture of Safety. Responsible for protecting service levels monitoring and improving drivers and associates performance. Assembles the right team, assigns the tracking strategy, and controls the operation to ensure timely and successful Last Mile delivery. ","department_cost_center":null,"description_short":"At Amazon, we're working to be the most customer- eccentric company on earth. To get there, we need exceptionally talented, bright, and self driven people. Amazon is seeking Team leads for our transportation","display_distance":null,"id":"c639d0b7-806e-40c7-8aa7-273fdf7f8ec5","id_icims":"3182333","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Sales/Account Management","job_function_id":null,"job_path":"/en/jobs/3182333/ctl-quick-commerce-last-mile-gsf-prime-now","job_schedule_type":"full-time","location":"IN, UP, Noida","locations":["{\"normalizedStateName\":\"Uttar Pradesh\",\"normalizedCountryCode\":\"IND\",\"city\":\"Noida\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, UP, Noida\",\"coordinates\":\"28.53342,77.3819\",\"normalizedCountyName\":\"Gautam Buddha Nagar\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Noida, Uttar Pradesh, IND\",\"location\":\"IN, UP, Noida\",\"region\":\"UP\",\"buildingCodeList\":[\"UDL6\"],\"normalizedCityName\":\"Noida\"}"],"normalized_location":"Noida, Uttar Pradesh, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"February 17, 2026","preferred_qualifications":"- 2+ years of sales experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-amzl","source_system":"JobCreator","state":"UP","title":"CTL-Quick Commerce Last Mile,  GSF Prime Now","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3182333/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amzl","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- ・人材育成経験1年以上（業界・職種は問わず）\u003cbr/\u003e- ・業務または工程の改善経験（規模の大小は問わず）\u003cbr/\u003e- ・エクセル初級レベル（四則演算/SUM関数/Pivotができる）\u003cbr/\u003e- ・日本で有効な運転免許を所有（運転業務は発生しませんが、交通事情や安全への理解が必要な為）\u003cbr/\u003e- ・ビジネスレベルの日本語力","business_category":"transportation-and-logistics","city":"Nagoya","company_name":"Amazon Japan G.K.","country_code":"JPN","description":"※こちらは愛知県名古屋市の拠点と一宮市を掛け持ちしての勤務となります。また、必要に応じて国内の出張が発生するポジションです。\u003cbr/\u003e\u003cbr/\u003eお客様から注文された商品はフルフィルメントセンターという物流拠点から発送され、各地のデリバリーステーション（配送拠点）を経てお客様に届けられます。\u003cbr/\u003e\u003cbr/\u003eドライバーオンボーディングアシスタントは、お客様の個人宅や商業施設などへ荷物を運ぶ際の安全運転や高品質なカスタマーサービスをドライバーに伝達します。\u003cbr/\u003eこのポジションは、お客様の満足する配送品質を維持・向上するために重要な役割を担い、様々な商品を適切な場所に時間通りに配送することに貢献しています。\u003cbr/\u003e\u003cbr/\u003e【具体的な業務内容】\u003cbr/\u003e・ドライバーオンボーディングアシスタントは、配送拠点のマネージャーおよび人材開発部門と連携して、学習関連のアクティビティの調整、実施、測定、評価を行います。\u003cbr/\u003e・標準作業と安全プログラムをサポートします。\u003cbr/\u003e・配送拠点内のドライバー向けガイダンスのクオリティを管理します。\u003cbr/\u003e・新人ドライバー向けにオンライン・対面によるオンボーディングガイダンスを実施します。（オンライントレーニングのシステム準備、実行含む）\u003cbr/\u003e\u003cbr/\u003e*勤務はシフト制となります。（業務状況に応じ夜勤が発生する場合もあります）\u003cbr/\u003e*転勤の可能性もあります。\u003cbr/\u003e\u003cbr/\u003e======================\u003cbr/\u003e関連情報\u003cbr/\u003e・所属部門:\u003ca href=\"https://www.amazon.co.jp/b?node=5637343051\"\u003eラストマイル(AMZL)\u003c/a\u003e\u003cbr/\u003e・職種:\u003ca href=\"https://www.amazon.co.jp/b?node=5609898051\"\u003eオペレーション\u003c/a\u003e\u003cbr/\u003e・勤務地:\u003ca href=\"https://www.amazon.co.jp/b?node=8521084051\"\u003e東海エリアDS\u003c/a\u003e\u003cbr/\u003e======================\u003cbr/\u003e\u003cbr/\u003eAmazon は多様かつインクルーシブな職場づくりを目指しています。Amazonは男女雇用機会均等法を順守しています。人種、 出身国、性別、性的指向、障がい、年齢、その他の属性によって差別することなく、平等に採用選考の機会を提供しています。障がいをお持ちの方は、以下をご覧ください。https://www.amazon.jobs/disability/jp\u003cbr/\u003e\u003cbr/\u003e\u003ca href=\"https://www.amazon.co.jp/career/DEI\"\u003eオペレーション部門のDEIの取り組み（Japanese Only）\u003c/a\u003e","department_cost_center":null,"description_short":"※こちらは愛知県名古屋市の拠点と一宮市を掛け持ちしての勤務となります。また、必要に応じて国内の出張が発生するポジションです。お客様から注文された商品はフルフィルメントセンターという物流拠点から発送され、各地のデリバリーステーション（配送拠点）を経てお客様に届けられます。ドライバーオンボーディングアシスタントは、お客様の個人宅や商業施設などへ荷物を運ぶ際の安全運転や高品質なカスタマーサービスをドライバーに伝達します。このポジションは、お客様の満足する配送品質を維持・向上するために重要な役割を担い、様々な商品を適切な場所に時間通りに配送することに貢献しています。【具体的な業務内容】・ドライバーオン","display_distance":null,"id":"03bb383c-b26d-4b87-aeaf-ac7163d2ba48","id_icims":"3139411","is_intern":null,"is_manager":null,"job_category":"Leadership Development \u0026 Training","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3139411/driver-on-boarding-assistant","job_schedule_type":"full-time","location":"JP, 23, Nagoya","locations":["{\"normalizedStateName\":\"Aichi\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Nagoya\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, 23, Nagoya\",\"coordinates\":\"35.18142,136.90668\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Nagoya-shi, Aichi, JPN\",\"location\":\"JP, 23, Nagoya\",\"region\":\"23\",\"buildingCodeList\":[\"QAI2\",\"NGO251\",\"SCJ4\",\"VAI1\",\"TPN2\",\"JXD93\",\"SAI8\",\"JXD92\",\"VAI2\",\"ATR1\",\"VJGL\",\"SCJ2\",\"SFS7\",\"HSC1\",\"DCJ4\",\"SFS8\",\"VCJ4\",\"QAI1\",\"QCJ4\",\"NGO250\"],\"normalizedCityName\":\"Nagoya-shi\"}"],"normalized_location":"Nagoya-shi, Aichi, JPN","optional_search_labels":[],"posted_date":"December  9, 2025","preferred_qualifications":"- ・配送/輸送業務経験\u003cbr/\u003e- ・個人、グループ双方のトレーニング実施の経験\u003cbr/\u003e- ・端末機器を効果的に操作する能力\u003cbr/\u003e- ・フィードバックを与えたり受けたりする能力\u003cbr/\u003e- ・インクルーシブなカルチャーへの貢献や多様性に富んだグループで働くことに対して前向きであること\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-amzl","source_system":"JobCreator","state":"23","title":"Driver On-boarding Assistant","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3139411/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amzl","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years in a high traceability manufacturing environment, or relevant trade school certification\u003cbr/\u003e- 1+ years using hand tools and/or precision measuring instruments (i.e., Calipers, multi-meters, torque wrenches)\u003cbr/\u003e- Experience reading, interpreting and working from engineering documentation and/or drawings","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"LEO is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the capacity, flexibility, and performance to serve a wide range of customers, from individual households to schools, hospitals, businesses, government agencies, and other organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eWe are looking for talented technicians to help full-scale production of the Kuiper satellites. The success of Kuiper depends on the quality, reliability, cost, manufacturability, throughput, and security of the products that you deliver. If you seek a fast-paced, dynamic environment; if you thrive on solving difficult problems where resolutions have high impact; and if you love the challenge of building something from scratch, then this role will be an ideal next career step. To be successful you need to be highly motivated and detail oriented while showing the highest standards of execution.\u003cbr/\u003e\u003cbr/\u003e***Expected Working Hours***\u003cbr/\u003eDays: 6 am - 4:30 pm (Sun-Wed OR Wed-Sat)\u003cbr/\u003eNights: 5 pm - 3:30 am (Sun-Wed OR Wed-Sat)\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Follow work instructions and safety procedures\u003cbr/\u003e- Assemble and test with emphasis to detail, an assortment of LRUs, electrical-mechanical assemblies, avionics, or other complex aerospace builds\u003cbr/\u003e- Participate in process improvements, maintain floor stock inventory\u003cbr/\u003e- You will independently execute and prioritize work to meet company deliverables\u003cbr/\u003e- Execute test procedures for component and system level testing maintenance\u003cbr/\u003e- Champion safety requirements in all designated zones and work locations\u003cbr/\u003e- Ensure lab equipment is maintained and calibrated\u003cbr/\u003e- Supports some preventative maintenance activities on test equipment and data acquisition systems\u003cbr/\u003e- Receive shipments and coordinate deliveries with recipients (Using pallet jacks, kit carts, etc)\u003cbr/\u003e- Your work may include contributing to improving SOPs and safety procedures\u003cbr/\u003e\u003cbr/\u003eCandidates must be 18 years or older with the ability to understand and adhere to all job requirements and safety guidelines. \u003cbr/\u003e\u003cbr/\u003eThe starting pay for this role in Washington State is up to $37.00/hour and employees are eligible for incremental raises based on tenure. A full range of medical, financial, and/or other benefits are provided. This information is provided per the Washington State Pay Transparency Act. Base pay information is based on market location. Applicants should apply via Amazon's internal or external careers site.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.","department_cost_center":null,"description_short":"LEO is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the capacity,","display_distance":null,"id":"8735e2db-d2c0-4380-90a1-56e5a13f424b","id_icims":"3175956","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Manufacturing","job_function_id":null,"job_path":"/en/jobs/3175956/oisl-assembly-technician-multiple-shifts-leo","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"REDMOND\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, REDMOND\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, REDMOND\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA99\"],\"normalizedCityName\":\"Redmond\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA99\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":["devices-manufacturing"],"posted_date":"February 11, 2026","preferred_qualifications":"- Experience in Space Vehicle/Satellite Operations, Space Communications or related industry\u003cbr/\u003e- Aircraft \u0026 Powerplant (A\u0026P) certification/license • CFOT certification or equivalent experience\u003cbr/\u003e- Airman or Avionic certification or equivalent experience\u003cbr/\u003e- ASE certification or equivalent experience\u003cbr/\u003e- Experience in fast-paced production environment with flight hardware\u003cbr/\u003e- Experience working with FOD, ESD sensitive hardware and clean room requirements\u003cbr/\u003e- Experience working with Electro-Mechanical Assembly, Final Integration, Fiber Optics/Optical and/or Harness Integration\u003cbr/\u003e- Ability to rapidly change roles/responsibilities while working in a high-paced, challenging work environment\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below including the base pay rate plus the highest available shift differential which applies depending on the shift you select. As a total compensation company, you are eligible for additional earnings including overtime pay and performance bonuses. Final pay will be based on factors including shift selection and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, REDMOND - 37.00 - 40.00 USD hourly","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"OISL Assembly Technician - Multiple Shifts, Leo","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3175956/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}