{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Vasta esperienza nella manutenzione di impianti meccanici e/o elettrici.\u003cbr/\u003e- Piena padronanza della lingua italiana, scritta e parlata.","business_category":"fulfillment-ops","city":"Torrazza","company_name":"Amazon Italia Logistica S.R.L. - B96","country_code":"ITA","description":"Il team Reliability Maintenance Engineering (RME) è fondamentale ad Amazon per monitorare tutte le attività operative: è grazie a questo team che viene garantito il corretto funzionamento di macchinari critici. In qualità di RME Technician, ti occuperai della manutenzione di una vasta gamma di macchinari e postazioni di lavoro, assicurando sempre il rispetto delle normative di salute e sicurezza. Aiuterai a tutelare la sicurezza dei colleghi, prevenendo fermi macchina. Il nostro team di RME ottimizza la disponibilità e la qualità dei nostri macchinari e migliora l’ambiente operativo nel complesso.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Interventi di manutenzione preventiva e a guasto su un’ampia gamma di macchinari in sede.\u003cbr/\u003e- Eseguire riparazioni di emergenza e diagnosi dei guasti nei magazzini di distribuzione.\u003cbr/\u003e- Utilizzo di strumenti all’avanguardia per massimizzare l’efficacia dei macchinari.\u003cbr/\u003e- Conformità a tutte le normative e prassi in materia di salute e sicurezza. \u003cbr/\u003e- Favorire lo sviluppo e l’avanzamento di chi partecipa ai programmi di apprendistato nelle nostre sedi.\u003cbr/\u003e- Sovraintendere a progetti di miglioramento continuo e implementare procedure chiave in una gamma di sedi europee.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eI nostri RME Technician operano sul campo, in modo da intervenire prontamente nell’eventualità di problemi ai macchinari. A intervalli prestabiliti, eseguirai una serie di interventi di manutenzione preventiva sui macchinari delle nostre sedi, per assicurarne il corretto funzionamento. In qualità di RME Technician, interverrai prontamente in caso di guasti, investigandone le cause e implementando soluzioni in maniera tempestiva.  Inoltre, indicherai possibili miglioramenti a lungo termine da apportare per scongiurare problematiche in futuro.\u003cbr/\u003eAffiancando i colleghi senior, ti occuperai della manutenzione ordinaria, come la tinteggiatura o l’idraulica, con il supporto di professionisti esterni se necessario. Il tuo lavoro sarà organizzato su diversi turni, per assicurare assistenza 24 ore su 24, in modo da consentire ad Amazon di effettuare le consegne con la velocità che ci contraddistingue. ","department_cost_center":null,"description_short":"Il team Reliability Maintenance Engineering (RME) è fondamentale ad Amazon per monitorare tutte le attività operative: è grazie a questo team che viene garantito il corretto funzionamento di macchinari","display_distance":null,"id":"88c6b0c7-1ace-46d9-a395-b2711059ad9b","id_icims":"3159171","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Real Estate/facilities","job_function_id":null,"job_path":"/en/jobs/3159171/tecnico-manutentore-elettro-meccanico","job_schedule_type":"full-time","location":"IT, Torrazza","locations":["{\"normalizedStateName\":\"Liguria\",\"normalizedCountryCode\":\"ITA\",\"city\":\"Torrazza\",\"countryIso3a\":\"ITA\",\"countryIso2a\":\"IT\",\"locationNonStemming\":\"Italy, Torrazza\",\"coordinates\":\"43.88765,7.96604\",\"normalizedCountyName\":\"Imperia\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Italy\",\"normalizedLocation\":\"Imperia, Liguria, ITA\",\"location\":\"IT, Torrazza\",\"region\":\"\",\"buildingCodeList\":[\"TRN2\"],\"normalizedCityName\":\"Imperia\"}"],"normalized_location":"Imperia, Liguria, ITA","optional_search_labels":[],"posted_date":"January 14, 2026","preferred_qualifications":"- Le qualifiche preferenziali non sono requisiti obbligatori per candidarsi a una posizione in Amazon. Se possiedi tutte le qualifiche richieste di cui sopra, non esitare a inviarci la tua candidatura: saremo felici di esaminarla!\u003cbr/\u003e- Esperienza nel monitoraggio \"Condition Based Monitoring\" (monitoraggio in base alle condizioni)\u003cbr/\u003e- Esperienza con procedure di sicurezza (LOTO, lockout-tagout)\u003cbr/\u003e- Esperienza professionale con i macchinari di stampa e applicazione etichette.\u003cbr/\u003e- Esperienza nell’individuazione dei guasti e nella manutenzione di nastri trasportatori o sistemi di automazione.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":null,"title":"Tecnico Manutentore Elettro/Meccanico","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3159171/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent\u003cbr/\u003e- A minimum of 1 year in an Environmental Health \u0026 Safety (EHS) related field OR; A Bachelor’s degree in EHS-relevant background OR; 6 months experience performing in a safety-related role within Amazon\u003cbr/\u003e- Knowledge of OSHA regulations specifically 29 CFR 1910\u003cbr/\u003e- Experience using Microsoft Word and Excel in a professional capacity\u003cbr/\u003e- Experience maintaining confidentiality in matter involving security and/or personnel issues in the workplace","business_category":"fulfillment-and-operations","city":"Baltimore","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. As a Workplace Health \u0026 Safety Specialist (WHSS), you'll be at the forefront of transforming workplace safety culture at one of the world's most innovative companies. Your expertise and dedication will directly protect employees, ensuring they return home safely to their families every day. You'll facilitate new approaches to safety, combining technology with human-centered solutions to create an environment where safety and productivity thrive together. This isn't just about maintaining safety standards – it's about revolutionizing how we think about and implement workplace safety, making a lasting impact on our people and operations. As your building's designated safety champion, you'll have the unique opportunity to build relationships, influence positive change, and help write the next chapter in Amazon's commitment to becoming Earth's Safest Place to Work.\u003cbr/\u003e\u003cbr/\u003eCore Impact Areas:\u003cbr/\u003eSafety Program Excellence \u0026 Implementation - Drive comprehensive safety programs through data-driven strategies. Lead daily safety audits, incident investigations, and risk assessments while implementing innovative solutions to prevent injuries. Deliver engaging safety training that resonates with associates and promotes a proactive safety culture. Champion continuous improvement initiatives that enhance workplace safety while maintaining operational efficiency.\u003cbr/\u003e\u003cbr/\u003eAssociate Advocacy \u0026 Cultural Leadership -  Serve as a trusted safety advisor and advocate for associate wellbeing, building strong partnerships across all levels of the organization. Foster a culture where safety is everyone's priority through effective communication, coaching, and positive reinforcement. Develop strong relationships with frontline associates and leadership to drive behavioral changes and ensure safety best practices become natural habits. Transform safety data into compelling narratives that influence positive change and drive engagement in safety initiatives.\u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements include: \u003cbr/\u003e- Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Stand/walk for up to 12 hours during shifts\u003cbr/\u003e- Work in an environment where the noise level varies \u003cbr/\u003e- Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e- Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e- Maintain effective care delivery in emergencies and assist emergency response at the site\u003cbr/\u003e\u003cbr/\u003eMust be available to work flexible shifts including days, nights and/or weekends. \u003cbr/\u003e\u003cbr/\u003eFor those that do not have an adult First Aid, CPR, AED certification from the American Heart Association or American Red Cross, must obtain within 3 weeks of start date.","department_cost_center":null,"description_short":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. As a Workplace","display_distance":null,"id":"603efde3-861d-4010-9eb6-b98825d12822","id_icims":"3172855","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3172855/ehs-specialist","job_schedule_type":"full-time","location":"US, MD, Baltimore","locations":["{\"normalizedStateName\":\"Maryland\",\"normalizedCountryCode\":\"USA\",\"city\":\"Baltimore\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MD, Baltimore\",\"coordinates\":\"39.29058,-76.60926\",\"normalizedCountyName\":\"Baltimore (City)\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Baltimore, Maryland, USA\",\"location\":\"US, MD, Baltimore\",\"region\":\"MD\",\"buildingCodeList\":[\"BWI2\"],\"normalizedCityName\":\"Baltimore\"}"],"normalized_location":"Baltimore, Maryland, USA","optional_search_labels":[],"posted_date":"February  3, 2026","preferred_qualifications":"- Bachelor’s degree or higher, preferably in a safety related field\u003cbr/\u003e- Strong communication, teamwork, analysis, judgment, and customer focus skills\u003cbr/\u003e- Experience leading and managing a team, ability to analyze accident data, new processes, and machinery for potential safety concerns, and conduct job hazard and job safety analyses\u003cbr/\u003e- Experience in emergency response and currently holds First Aid and CPR certificates\u003cbr/\u003e- Experience in workers compensation case management\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MD, Baltimore - 27.00 - 33.00 USD hourly","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"MD","title":"EHS Specialist ","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3172855/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in engineering, energy management, business or related field\u003cbr/\u003e- 8+ years professional experience within the energy sector with extensive experience working with utilities\u003cbr/\u003e- Expertise in power grids with strong knowledge of grid codes and connection policies at national or EU level\u003cbr/\u003e- Advanced project management and stakeholder management skills\u003cbr/\u003e- Ability to think strategically and drive tactical execution of contracts / projects\u003cbr/\u003e- Ability to prioritise and manage multiple projects/responsibilities","business_category":"aws","city":"London","company_name":"AWS EMEA SARL (UK Branch)","country_code":"GBR","description":"Energy Projects Manager – EMEA Infrastructure Energy Team (Senior Level)\u003cbr/\u003e\u003cbr/\u003eThe Infrastructure Energy Team (for Europe, Middle East and Africa (EMEA) is looking for a results-oriented individual to join in the role of Energy Projects Manager. This role owns the origination \u003cbr/\u003eand securing of utility-scale power for AWS’s data centres in a number of AWS’s core regions; providing energy expertise to Site Acquisition; developing strategies that accelerate utility power and optimise total cost of ownership; owning AWS's relationship with utilities; developing and implementing compliance strategies for emerging utility regulations (e.g., use-it-or-lose-it, grid codes) across northern Europe; and partnering with Public Policy to position AWS as a trusted utility and policymaker partner while advancing connection reforms critical for business growth. \u003cbr/\u003e\u003cbr/\u003eThe position can be based in Dublin or London. Regular travel (10–20%) will be required throughout Europe. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services (AIS)\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Develop and implement strategies that enable the origination and securing of scalable power opportunities\u003cbr/\u003e- Complete power due diligence on in-market opportunities\u003cbr/\u003e- Develop strategies that accelerate utility power and optimize total cost of ownership\u003cbr/\u003e- Develop strategies to maintain compliance with changing utility regulations e.g. use-it-or-lose-it, grid codes\u003cbr/\u003e- Collaborate with other departments (e.g. Real Estate, Finance, Legal, Public Policy) to ensure alignment of energy strategies with overall business objectives\u003cbr/\u003e- Develop and maintain strategic relationships with utilities\u003cbr/\u003e- Monitor global energy markets, policies, and regulations to identify energy related risks and opportunities and develop strategies to capitalize on the opportunities and to mitigate the risks\u003cbr/\u003e- Collaborate with Public Policy to advocate for connection reforms that enable broader AWS strategies and objectives\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eABOUT AWS:\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, AWS Infrastructure Services (AIS)\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003ethere’s nothing we can’t achieve in the cloud. \u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Energy Projects Manager – EMEA Infrastructure Energy Team (Senior Level)The Infrastructure Energy Team (for Europe, Middle East and Africa (EMEA) is looking for a results-oriented individual to join in","display_distance":null,"id":"737ddf3c-c8c8-4dca-ae2f-a10ce95b5c1a","id_icims":"3173584","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Infra Business Dev - Tech","job_function_id":null,"job_path":"/en/jobs/3173584/energy-projects-manager-emea-infrastructure-energy-team","job_schedule_type":"full-time","location":"GB, London","locations":["{\"normalizedStateName\":\"England\",\"normalizedCountryCode\":\"GBR\",\"city\":\"London\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, London\",\"coordinates\":\"51.50643,-0.12719\",\"normalizedCountyName\":\"London\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"London, England, GBR\",\"location\":\"GB, London\",\"region\":\"\",\"buildingCodeList\":[\"LHR14\"],\"normalizedCityName\":\"London\"}"],"normalized_location":"London, England, GBR","optional_search_labels":["aws.team-ais"],"posted_date":"February  4, 2026","preferred_qualifications":"- Master’s Degree\u003cbr/\u003e- Experience originating and securing utility power\u003cbr/\u003e- Experience designing / delivering HV / MV electrical infrastructure\u003cbr/\u003e- Experience of IT infrastructure, data centres and cloud services\u003cbr/\u003e- Ability to converse in German, French, Swedish or Italian\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-business-development-primary","source_system":"JobCreator","state":null,"title":"Energy Projects Manager, EMEA Infrastructure Energy Team","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3173584/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-business-development-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in supply chain management, operations, engineering, analytics or related field\u003cbr/\u003e- 5+ years of operational experience\u003cbr/\u003e- Experience in Excel (including VBA, pivot tables, array functions, power pivots, etc.) and data visualization tools such as Tableau\u003cbr/\u003e- Experience presenting to SVP and C-Level\u003cbr/\u003e- Experience with one of the following areas: machine learning technologies, Reinforcement Learning, Deep Learning, Computer Vision, Natural Language Processing (NLP) or related applications\u003cbr/\u003e- English C1","business_category":"fulfillment-and-operations","city":"Mexico City","company_name":"Servicios Comerciales Amazon Mexico S. de R.L. de C.V.","country_code":"MEX","description":"Are you looking for an opportunity to create a substantial impact on business profitability? The ROW Recommerce role at Amazon's Fulfillment Centers (FCs) can provide that opportunity. This role focuses on maximizing value recovery from customer returned units in LATAM region through refurbishment and Amazon Resale in close collaboration with the Amazon Customer Excellence System (ACES), Amazon Market Services (AMS), Products, and business partners.\u003cbr/\u003eAt Amazon, we're working relentlessly to be the most customer-centric company on earth. Our team drives innovation while continuously improving operations. To get there, we need exceptionally talented, bright, and driven people. In this role, you will be responsible for implementing incremental value recovery capabilities in our fulfillment centers, enabling us to recover maximum value from returned units.\u003cbr/\u003eTo be successful, you will need excellent communication, negotiation, and influencing skills to drive consensus across multiple stakeholders. While operating in FC operations, you will interface with Engineering, Category, Finance, Procurement, Data Science, and Returns and Customer Experience (RCX) teams to identify and execute solutions that improve recovery.\u003cbr/\u003eThis opportunity requires excellent troubleshooting and problem-solving abilities, as well as the capacity to thrive in a fast-paced, ambiguous, and technical environment. Ownership of your work is extremely important, and candidates should have a proven record of driving operational improvements and new launches within FC/operations. The ideal candidate is motivated, optimistic, and agile, with strong time management skills.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tDeep diving and analyzing operational data to arrive root causes for loss of value at FC Customer Returns (CRET) processes - invent or replicate solutions to those root causes, track impact.\u003cbr/\u003e•\tImprove efficacy of operational capabilities at CRET incl. Standardization of metrics, processes, SOPs across LATAM and Rest of the World (RoW) markets related to value recovery\u003cbr/\u003e•\tDevelop deep subject matter expertise.\u003cbr/\u003e•\tDriving product and/or process solutions to improve value recovery and implement them in FCs\u003cbr/\u003e","department_cost_center":null,"description_short":"Are you looking for an opportunity to create a substantial impact on business profitability? The ROW Recommerce role at Amazon's Fulfillment Centers (FCs) can provide that opportunity. This role focuses","display_distance":null,"id":"0465a6e2-b31b-4548-8a63-227461bcb212","id_icims":"3133525","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3133525/recommerce-manager-latam-central-functions-rest-of-the-world-row","job_schedule_type":"full-time","location":"MX, DIF, Mexico City","locations":["{\"normalizedStateName\":\"Mexico City\",\"normalizedCountryCode\":\"MEX\",\"city\":\"Mexico City\",\"countryIso3a\":\"MEX\",\"countryIso2a\":\"MX\",\"locationNonStemming\":\"Mexico, DIF, Mexico City\",\"coordinates\":\"19.43195,-99.13315\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Mexico\",\"normalizedLocation\":\"Mexico City, Mexico City, MEX\",\"location\":\"MX, DIF, Mexico City\",\"region\":\"DIF\",\"buildingCodeList\":[\"MEX16\"],\"normalizedCityName\":\"Mexico City\"}"],"normalized_location":"Mexico City, Mexico City, MEX","optional_search_labels":["ops.lander-mexico"],"posted_date":"November 27, 2025","preferred_qualifications":"- Master's degree, or MBA in business, operations, human resources, adult education, organizational development, instructional design or related field\u003cbr/\u003e- Knowledge of process improvement, ideally including Lean, Kaizen and Six Sigma\u003cbr/\u003e- Experience driving projects to improve operations and support-related processes\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.no-team-listed","source_system":"JobCreator","state":"DIF","title":"Recommerce Manager, LATAM, Central Functions - Rest of the World (RoW)","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3133525/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- 5+ years of increasing responsibilities in EHS and/or environmental programs in manufacturing, production, or service operations\u003cbr/\u003e- 5+ years of increasing responsibilities in people and performance management","business_category":"fulfillment-and-operations","city":"Arlington Heights","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Application deadline: Feb 12, 2026\u003cbr/\u003e\u003cbr/\u003eJoin Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. Our Workplace Health \u0026 Safety (WHS) team is at the forefront of this mission, creating environments where safety and efficiency work in perfect harmony. We're seeking a dynamic and innovative WHS Manager to help drive this mission forward. As our next WHS Manager, you'll be more than a safety professional – you'll be a catalyst for change, leading a comprehensive safety program that touches thousands of lives. Working at the intersection of operations and safety, you'll shape the future of workplace health while delivering real-time solutions that protect our most valuable asset: our people.\u003cbr/\u003e\u003cbr/\u003eIn this role, you'll serve as the site's safety pioneer, orchestrating our Global WHS Program with precision and passion. You'll partner with Operations leadership to weave safety into the fabric of our daily operations, using data-driven insights to create innovative solutions that reduce risk and enhance productivity. Your ability to build trust, influence change, and drive results will be crucial as you lead comprehensive risk assessments and transform safety data into actionable strategies.\u003cbr/\u003eLeadership is at the heart of this role. You'll build and develop a high-performing team of WHS professionals, fostering a culture of continuous improvement and excellence. \u003cbr/\u003e\u003cbr/\u003eCore Impact Areas:\u003cbr/\u003eSafety Leadership \u0026 Innovation - Transform safety culture through leadership and innovative solutions. Drive continuous improvement initiatives that set new benchmarks in workplace safety. Leverage technology and data analytics to drive preventive safety measures that protect our associates while enhancing operational excellence. Develop leadership plans, communicate expectations, and drive initiatives to create a safe work environment. Measure performance against WHS policies, analyze metrics, and conduct site audits to address non-compliance issues. \u003cbr/\u003e\u003cbr/\u003eStrategic Partnership \u0026 Influence - Build partnerships with Operations leadership to integrate safety into every aspect of our business. Use compelling data analysis and risk insights to influence positive change and drive strategic decision-making. Establish yourself as a trusted advisor who balances safety excellence with operational demands. Oversee recordkeeping, workplace organization, and WHS training programs. \u003cbr/\u003e\u003cbr/\u003eThis position requires the flexibility to travel 50-70% of the time and work various shifts.\u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements include: \u003cbr/\u003e- Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Stand/walk for up to 12 hours during shifts\u003cbr/\u003e- Work in an environment where the noise level varies \u003cbr/\u003e- Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e- Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e\u003cbr/\u003eThe role focuses on supporting sites and WHS staff across North American regions to drive safety excellence and ensure compliance. Key responsibilities include overseeing incident management and investigations, conducting business reviews and leadership meetings, managing staff development and training, monitoring safety assessments and compliance, overseeing emergency preparedness, and maintaining stakeholder relationships. The position emphasizes continuous improvement through regular site inspections, performance monitoring, and implementation of safety initiatives. Major themes throughout the tasks include safety oversight and compliance, people management, performance monitoring, incident prevention, stakeholder communication, and quality assurance.\u003cbr/\u003e\u003cbr/\u003eThose that do not have an adult First Aid, CPR, AED certification from the American Heart Association or American Red Cross must obtain within 3 weeks of start date.","department_cost_center":null,"description_short":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. Our Workplace","display_distance":null,"id":"a57384f1-ab7a-4e63-92fb-d371c9a1f7f3","id_icims":"3146057","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3146057/regional-ehs-manager-iii","job_schedule_type":"full-time","location":"US, IL, Arlington Heights","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"DSW4\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Illinois\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington Heights\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, IL, Arlington Heights\",\"coordinates\":\"42.08729,-87.98044\",\"normalizedCountyName\":\"Cook\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington Heights, Illinois, USA\",\"location\":\"US, IL, Arlington Heights\",\"region\":\"IL\",\"buildingCodeList\":[\"DLN3\"],\"normalizedCityName\":\"Arlington Heights\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DDE3\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Phoenix\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Phoenix\",\"coordinates\":\"33.44825,-112.0758\",\"normalizedCountyName\":\"Maricopa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Phoenix, Arizona, USA\",\"location\":\"US, AZ, Phoenix\",\"region\":\"AZ\",\"buildingCodeList\":[\"DPX2\"],\"normalizedCityName\":\"Phoenix\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Dallas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Dallas\",\"coordinates\":\"32.77822,-96.79512\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Dallas, Texas, USA\",\"location\":\"US, TX, Dallas\",\"region\":\"TX\",\"buildingCodeList\":[\"DDA7\"],\"normalizedCityName\":\"Dallas\"}"],"normalized_location":"Arlington Heights, Illinois, USA","optional_search_labels":[],"posted_date":"December 19, 2025","preferred_qualifications":"- Experience in a distribution center or manufacturing EHS with mix of exempt and non-exempt employees at a site of at least 250 people\u003cbr/\u003e- Master’s degree\u003cbr/\u003e- Experience implementing lean principles and process improvement in an operational environment.\u003cbr/\u003e- Experience in a fast paced, dynamic organization.\u003cbr/\u003e- Certified Safety Professional\u003cbr/\u003e- Excellent written and verbal communication skills, including comfort interfacing with site leaders.\u003cbr/\u003e- Ability to develop and implement department goals and strategies.\u003cbr/\u003e- Strong analytical skills with demonstrated problem solving ability.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, AZ, Phoenix - 94,200.00 - 141,400.00 USD annually\u003cbr/\u003eUSA, CO, Denver - 94,200.00 - 141,400.00 USD annually\u003cbr/\u003eUSA, IL, Arlington Heights - 94,200.00 - 141,400.00 USD annually\u003cbr/\u003eUSA, TX, Dallas - 94,200.00 - 141,400.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 94,200.00 - 141,400.00 USD annually","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"IL","title":"Regional EHS Manager III","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3146057/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of vendor management experience\u003cbr/\u003e- 4+ years of relevant work in a data center or other critical environment experience\u003cbr/\u003e- 5+ years of data center engineering or operations experience\u003cbr/\u003e- 5+ years of Microsoft Office including Outlook, Word, and Excel experience\u003cbr/\u003e- Bachelor's degree in Electrical Engineering, Mechanical Engineering, or a related field\u003cbr/\u003e- Bachelor's degree in Mechanical or Electrical Engineering, or 1+ years of relevant discipline work experience\u003cbr/\u003e- Experience in vendor management\u003cbr/\u003e- Experience in a data center or other critical environment\u003cbr/\u003e- Experience in data center engineering or operations\u003cbr/\u003e- Experience with Microsoft Office including Outlook, Word, and Excel","business_category":"aws","city":"Herndon","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAs a Data Center Project Engineer, you will be a part of a creative, diverse team tasked with solving fascinating problems constructing Amazon Data Centers. Our data centers are industry examples of energy efficient, cost-effective designs. You will work alongside partner teams such as Operations, Networking, Controls, Security, and Commissioning to build Data Centers that directly support our Customers. \u003cbr/\u003e \u003cbr/\u003eA Data Center Project Engineer, will support the teams that build some of the most interesting electrical and mechanical systems in the world. You will be on the construction site, daily interacting with the construction managers and stakeholders, and be directly responsible for supporting the fast, high-quality delivery of our data center construction. You will be part of the onsite Construction Management team and will own the communication coordination with our vendors, information workflow, and coordination of document management including requests for information (RFI), change orders, report, and schedule updates.\u003cbr/\u003e \u003cbr/\u003eThe Data Center Project Engineer will be responsible for:\u003cbr/\u003e\u003cbr/\u003e- Establishing communication and coordination across a data center region’s general contractors, stakeholders, and internal teams. Example includes sending out region wide changes to construction trailer setup, COVID-19 testing procedures, or location to access documents.\u003cbr/\u003e \u003cbr/\u003e- Develop and maintain a tracking system for design changes, RFI’s (requests for information), and change orders and dashboard and track this information for regional leadership review. Include tracking status of priority and due dates.\u003cbr/\u003e\u003cbr/\u003e- Requesting and reviewing MOPs (Method of Procedure) for proper detail, necessity, and risk. \u003cbr/\u003e\u003cbr/\u003e- Onboarding new vendors for badging and orientation.\u003cbr/\u003e\u003cbr/\u003e- Updating project management software with milestone dates, correspondence, and documents.\u003cbr/\u003e\u003cbr/\u003e- Monitor delivery of owner furnished material to site.\u003cbr/\u003e\u003cbr/\u003e- Compiling and storing construction data from vendors.\u003cbr/\u003e\u003cbr/\u003e- Managing checklist including various checklists including substantial completion checks, safety, and quality.\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e-Manage the owners side RFI, submittal and change management processes related to data center builds.\u003cbr/\u003e-Help to ensure monthly Billing and Pay Applications are correct \u003cbr/\u003e-Help to manage and implement new processes as required.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Project Engineer \u003cbr/\u003e-You will help manage the AWS change order process for all inflight activities and work daily with the general contractors, Superintendents, and Project Engineers to help keep the project on schedule. \u003cbr/\u003e-You will be responsible for providing daily support to the onsite construction managers in dealing with the many moving parts of a construction project.  \u003cbr/\u003e\u003cbr/\u003eDCCD: Global Construction Management is the team responsible for the construction portion of our Data Center Builds working closely with key stakeholders from the very early stages of Design Kickoff, through bidding, equipment procurement, construction, startup, commissioning and ultimately handing off the build to the DC Operations team.\u003cbr/\u003e\u003cbr/\u003eKey goals are to reduce cost, shorten the duration of delivery and minimize defects. Specifically, we set out to bring the job in at or below budget, on schedule and with Zero Defects at Power Facilities Hand-Off\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"216b32d7-27c6-440b-a445-605a2c447a23","id_icims":"3175265","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3175265/project-engineer-dccd-amer-construction","job_schedule_type":"full-time","location":"US, VA, Herndon","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD31\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Herndon, Virginia, USA","optional_search_labels":["aws.team-ais"],"posted_date":"February  5, 2026","preferred_qualifications":"- 3+ years of construction or project management experience\u003cbr/\u003e- Electrical or mechanical Journeyman License\u003cbr/\u003e- operating engineering license such as DC II, DC III, or equivalent\u003cbr/\u003e- Experience in construction or project management\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Herndon - 96,000.00 - 166,300.00 USD annually","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"VA","title":"Project Engineer, DCCD: AMER Construction","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3175265/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of software development, or 2+ years of technical support experience\u003cbr/\u003e- Experience scripting in modern program languages\u003cbr/\u003e- Experience troubleshooting and debugging technical systems","business_category":"international-stores","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"The Amazon Consumer Payments supports multiple payment products and processes millions of transactions every day across numerous countries and payment methods. Over 100 million customers and merchants send tens of billions of dollars moving at light-speed through our systems annually, and use our products on and off Amazon.\u003cbr/\u003eWe build systems that provide various payments features and process payments at an unprecedented scale, with accuracy, speed, and mission-critical availability. We innovate to improve customer experience across the globe, with support for currency choice, pay using installments, pay with reward points, in-store payments, pay on delivery, credit and debit payments, seller disbursements, gift cards, and many new exciting and challenging ideas are in the works.\u003cbr/\u003eIf you are excited about the opportunity to learn and work on large scale distributed systems, enjoy trouble shooting and solving complex problems, consider the opportunities at the Bangalore center. Come challenge yourself in our team-oriented atmosphere, and watch yourself grow with one of the fastest growing areas of the Amazon e-commerce product and services platform. ","department_cost_center":null,"description_short":"The Amazon Consumer Payments supports multiple payment products and processes millions of transactions every day across numerous countries and payment methods. Over 100 million customers and merchants","display_distance":null,"id":"8d02c693-1a8f-4e56-82df-a324e6d9eb0f","id_icims":"3168756","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Support Engineering","job_function_id":null,"job_path":"/en/jobs/3168756/application-engineer-iii-gc-greenseers","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR26\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"January 28, 2026","preferred_qualifications":"- Knowledge of web services, distributed systems, and web application development\u003cbr/\u003e- Experience troubleshooting \u0026 maintaining hardware \u0026 software RAID\u003cbr/\u003e- Experience with REST web services, XML, JSON\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"international-stores.team-amazon-payments","source_system":"JobCreator","state":"KA","title":"Application Engineer III, GC Greenseers","university_job":null,"updated_time":"30 minutes","url_next_step":"https://account.amazon.com/jobs/3168756/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-payments","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of computational linguistics, language data processing, semantics, philosophy of language experience","business_category":"consumer_engagement","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The Alexa Shopping team is seeking a Language Engineer with experience in the field of Natural Language Processing, Machine Learning, or Large Language Models, as well as expertise in handling large data sets and strong analytical skills. You will play a critical role in innovative projects by driving design of Alexa Shopping features. The key responsibilities are to generate high-quality data and to run and evaluate experiments, which involves prompt engineering our Large Language Model for API delivery. You will work closely with engineers, scientists, Editors, and program managers to ensure we're providing the best voice shopping experience for millions of our customers.\u003cbr/\u003e\u003cbr/\u003eAs a Language Engineer, you will start by diving deep into a couple of critical projects across Alexa Shopping experiences. You will collaborate with fellow Language Engineers, Data Scientists, Program Managers, and stakeholders in science, engineering, and product teams to understand the role data plays in developing data sets and exemplars that meet customer needs. You will analyze and automate processes for collecting and annotating LLM inputs and outputs to assess data quality and measurement.\u003cbr/\u003e\u003cbr/\u003eYou will apply state-of-the-art Generative AI techniques to analyze how well our data represents human language and run experiments to gauge downstream interactions. You will work collaboratively with other Language Engineers and Scientists to design and implement principled strategies for data optimization.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Collaborate with scientists and software engineers to help design APIs and evaluate performance of LLM's\u003cbr/\u003e- Produce and manipulate different types of language data, analyze and provide efficient solutions\u003cbr/\u003e- Design and lead a data collection; define scope and target, provide a guideline and training, guide teams cross sites to meet the quality bar, and run evaluation of data for hand off\u003cbr/\u003e- Engineer prompts to guide generative AI to produce desired outputs in context\u003cbr/\u003e- Automate operations and perform data analysis using Python or other scripting language\u003cbr/\u003e- Advocate strict adherence to annotation guidelines\u003cbr/\u003e- Test and deploy changes to Alexa's language understanding codebase\u003cbr/\u003e- Identify and solve production issues that are impacting the Alexa customer experience\u003cbr/\u003e- Collaborate with other linguists, scientists, and designers in creating optimal solutions to elevate the customer experience\u003cbr/\u003e- Own the customer-facing machine learning and deterministic models for a specific domain of features\u003cbr/\u003e- Use modeling tools to bootstrap and test new functionalities\u003cbr/\u003e","department_cost_center":null,"description_short":"The Alexa Shopping team is seeking a Language Engineer with experience in the field of Natural Language Processing, Machine Learning, or Large Language Models, as well as expertise in handling large data","display_distance":null,"id":"45911536-a213-4b3f-a58f-68d6efd9e7cd","id_icims":"3162431","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Language Engineer","job_function_id":null,"job_path":"/en/jobs/3162431/language-engineer-ii-operations-team","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA20\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"January 20, 2026","preferred_qualifications":"- Experience in computational linguistics, language data processing, semantics, and philosophy of language\u003cbr/\u003e- Master's degree or above in Linguistics or a related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 82,700.00 - 131,600.00 USD annually","primary_search_label":"consumer_engagement.no-team-listed","source_system":"JobCreator","state":"WA","title":"Language Engineer II, Operations Team","university_job":null,"updated_time":"34 minutes","url_next_step":"https://account.amazon.com/jobs/3162431/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- 5+ years of program or project management experience\u003cbr/\u003e- Experience using data and metrics to determine and drive improvements\u003cbr/\u003e- Experience owning program strategy, end to end delivery, and communicating results to senior leadership\u003cbr/\u003e- Experience implementing repeatable processes and driving automation or standardization\u003cbr/\u003e- Experience in complex problem solving, and working in a tight schedule environment\u003cbr/\u003e- Experience working cross functionally with tech and non-tech teams","business_category":"transportation-and-logistics","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Air (AIR) is seeking a Senior Program Manager to lead complex, enterprise-level initiatives across the Global Strategic Programs and Initiatives (GSPI) team. This role is highly cross-functional and regularly engages senior and executive leaders to align priorities, manage dependencies, and drive execution across multiple organizations.\u003cbr/\u003e\u003cbr/\u003eThe Senior Program Manager will own high-visibility, ambiguous initiatives critical to Amazon Air’s ability to scale, innovate, and operate efficiently. This role is responsible for independently defining program structure, scoping and executing large cross-functional projects, managing tradeoffs and risks, and establishing PMO best practices, processes, and tools to govern AIR’s portfolio of strategic programs. The Sr. PM will create and maintain an effective operating rhythm by tracking timelines and metrics, coordinating across teams, and enabling executive decision-making through clear written narratives, executive business reviews, and senior leadership communications.\u003cbr/\u003e\u003cbr/\u003eThis role requires strong program management fundamentals and comfort operating in ambiguity. The Sr. PM will independently develop and execute solutions, move seamlessly between strategic and tactical work, and build structure where none exists. Success in this role requires clear written and verbal communication and the ability to earn trust with executive leaders and diverse stakeholder groups in a fast-paced, Day One environment.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Manage cross-functional teams, and plan/organize/execute complex projects/programs across multiple organizations (Operations, Tech, Finance, Third Party Vendors, etc.) to enable the launch of new products and processes.\u003cbr/\u003e- Partner with key functional stakeholders across the company to lead, support, and influence new business initiatives.\u003cbr/\u003e- Build strong partnerships with operational leaders to identify the impact of new business initiatives.\u003cbr/\u003e- Innovate to improve project scope/execution to improve customer outcomes and decrease the end-to-end supply chain cost.\u003cbr/\u003e- Escalate risks in the project plan to the relevant owners and teams.\u003cbr/\u003e- Navigate through ambiguity.\u003cbr/\u003e- Manage and coordinate multiple project assignments simultaneously in a fast-paced, deadline-driven environment, accepting ownership and accountability of the cross-functional processes, and delivering on commitments.\u003cbr/\u003e- Track end-to-end project status and incorporate new metrics to transition the project to the normal operations.\u003cbr/\u003e- Own the planning, organization, and execution of complex projects across multiple organizations and stakeholders, including development of Program Management Office (PMO) processes.\u003cbr/\u003e- Own multiple business narrative reports, simultaneously. \u003cbr/\u003e- Create and build new tools and processes with both tech and non tech resources. \u003cbr/\u003e- Potential to travel 15% per year.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour day will be a dynamic blend of strategic thinking and tactical execution. You'll navigate complex program landscapes, engaging with leaders across Operations, Technology, Finance, and external partnerships. Expect to craft compelling narratives, design innovative program frameworks, and orchestrate collaborative solutions that drive meaningful organizational change.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Global Strategic Programs and Initiatives (GSPI) team is comprised of leaders who work in a highly ambiguous and autonomous environment. GSPI strives to deliver results within three main pillars: program management, operational excellence/standardization, and exploratory projects. ","department_cost_center":null,"description_short":"Amazon Air (AIR) is seeking a Senior Program Manager to lead complex, enterprise-level initiatives across the Global Strategic Programs and Initiatives (GSPI) team. This role is highly cross-functional","display_distance":null,"id":"ed4c0197-2f45-4765-aaa1-2ffb9ff0b4db","id_icims":"3150799","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Program Management","job_function_id":null,"job_path":"/en/jobs/3150799/senior-program-manager-strategic-programs-air-supply-chain-and-analytics","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA82\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"December 31, 2025","preferred_qualifications":"- Master's degree\u003cbr/\u003e- 5+ years of driving process improvements experience\u003cbr/\u003e- Knowledge of Excel at an intermediate level (e.g., pivot tables \u0026 charts, multiple criteria lookups, nested logical/IF formulas, data cleansing, array formulas, etc.)\u003cbr/\u003e- PMP certificate\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Bellevue - 115,600.00 - 160,000.00 USD annually","primary_search_label":"transportation-and-logistics.team-airplanes","source_system":"JobCreator","state":"WA","title":"Senior Program Manager, Strategic Programs, AIR Supply Chain and Analytics","university_job":null,"updated_time":"37 minutes","url_next_step":"https://account.amazon.com/jobs/3150799/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-airplanes","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Systems Engineering, Computer Science, or related field or relevant work experience\u003cbr/\u003e- Experience in site reliability engineering (SRE), systems engineering, systems administration, DevOps, security administration, or network administration\u003cbr/\u003e- Experience working with Linux\u003cbr/\u003e- Experience in systems engineering\u003cbr/\u003e- Experience in any of the following: Python, Java, Perl, PHP, Ruby, Bash, Shell or equivalent","business_category":"entertainment","city":"London","company_name":"Amazon Digital UK Limited","country_code":"GBR","description":"Are you interested in shaping the future of movies and television? Do you want to define the next generation of how and what Amazon customers are watching? Prime Video is one of the leading digital video services on the Internet today, and we’re just getting started changing the way millions of people around the world enjoy content.\u003cbr/\u003e\u003cbr/\u003eNow available in more than 240 countries and territories, Prime Video offers customers the broadest selection of any on-demand video service, including our critically-acclaimed Amazon Originals Series such as the multi-award-winning The Marvelous Mrs. Maisel, Tom Clancy’s Jack Ryan, The Boys; UK-produced hit Amazon Original series like Good Omens, The Grand Tour, All or Nothing: Manchester City and forthcoming drama series The Power; exclusive TV shows like Star Trek: Picard, American Gods and Vikings; and movies like Late Night and Get Duked, plus live sport including ATP and WTA Tour and US Open Tennis and Premier League football.\u003cbr/\u003e\u003cbr/\u003eAmazon MGM Studios is the movies and television development and production arm of Amazon. It is our role to produce original content and license studio programs worldwide in exclusive service of Amazon’s Prime Video customers. We need your passion, innovative ideas, and creativity to help take us to new heights.\u003cbr/\u003e\u003cbr/\u003eAmazon MGM Studios Technology is looking for a Technology Operations Engineer to help drive the execution and improvement of key service delivery processes throughout the Studios organization.\u003cbr/\u003e\u003cbr/\u003eThe Technology Operations Engineer will have an excellent understanding of computers components (hardware and software) and a demonstrated willingness to learn and apply new technology.\u003cbr/\u003e\u003cbr/\u003eA successful candidate will demonstrate a technical aptitude, the ability to deal effectively with people in a wide variety of situations. A successful candidate will also be able to prioritize a multitude of concurrent issues, able to escalate and demonstrate a proven ability to operate in complex situations. You will provide first and second tier technical support, contribute to enterprise cross-functional projects and interact with software developers, executives, vendors and other support teams.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eYour responsibilities will contribute to supporting network, technology, software and devices across Amazon MGM Studios global productions. TechOps teams support the Studios production personnel (cast and crew) and Studios business teams (development, engineering, programming and marketing). We work in a team environment and regularly interact with production personnel and studio executives at all levels.\u003cbr/\u003e\u003cbr/\u003eRegular activities include systems administration, troubleshooting, issue prioritization, root cause analysis in problem solving and escalation in a variety of software and hardware environments.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eTechOps Engineers drive the execution and improvement of key service delivery processes throughout the content production lifecycle and the global Studios organization. You will support hardware devices, manage software applications, provide a positive customer service experience and partner daily with cross-functional partners. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur TechOps teams support the Studios production personnel (cast and crew) and Studios business teams (content development,  software engineering, content programming and marketing). We work in a team environment and regularly collaborate with studios production personnel and studio executives at all levels.","department_cost_center":null,"description_short":"Are you interested in shaping the future of movies and television? Do you want to define the next generation of how and what Amazon customers are watching? Prime Video is one of the leading digital video","display_distance":null,"id":"eb8c6135-c50d-4063-aa20-60464f8ad6a3","id_icims":"3159821","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"System Planning/Administration","job_function_id":null,"job_path":"/en/jobs/3159821/techops-support-engineer-amazon-mgm-studios-technology-operations-support","job_schedule_type":"full-time","location":"GB, London","locations":["{\"normalizedStateName\":\"England\",\"normalizedCountryCode\":\"GBR\",\"city\":\"London\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, London\",\"coordinates\":\"51.50643,-0.12719\",\"normalizedCountyName\":\"London\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"London, England, GBR\",\"location\":\"GB, London\",\"region\":\"\",\"buildingCodeList\":[\"LHR16\"],\"normalizedCityName\":\"London\"}"],"normalized_location":"London, England, GBR","optional_search_labels":["primevideo.team-studios-tech"],"posted_date":"January 15, 2026","preferred_qualifications":"- Knowledge of TCP/IP and networking protocols such as HTTP and DNS\u003cbr/\u003e- Experience designing and developing scripts to automate operational burdens and reviewing scripting changes to ensure they meet the standards for maintainability, scalability and security\u003cbr/\u003e- Experience working in 24/7 production environment\u003cbr/\u003e- Experience with service-oriented architecture and web services\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"entertainment.team-amazonstudios","source_system":"JobCreator","state":null,"title":"TechOps \u0026 Support Engineer, Amazon MGM Studios | Technology Operations \u0026 Support","university_job":null,"updated_time":"39 minutes","url_next_step":"https://account.amazon.com/jobs/3159821/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazonstudios","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}