{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 3+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Moreno Valley","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Job summary\u003cbr/\u003eOur WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Operations Manager. In this role, you will lead and develop a team of salaried and hourly talent. You will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. To achieve this, managers are expected to provide their team with the tools needed for success while driving improvements in productivity and efficiency through data-driven decisions and analytical problem-solving. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e   \u003cbr/\u003e  Our Operation’s workflow has three major components:  First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer.\u003cbr/\u003e \u003cbr/\u003e Key Responsibilities and Job Elements:\u003cbr/\u003e - Support, mentor, and motivate your salaried and hourly workforce\u003cbr/\u003e - Lead large-scope projects with site and regional impact\u003cbr/\u003e - Build and execute productivity plans through forecast reviews, determining productivity requirements, and partnering with other Leaders to load balance \u003cbr/\u003e - Manage safety, quality, productivity, and customer delivery promises \u003cbr/\u003e - Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e - Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e - Stand/walk for up to 12 hours during shifts \u003cbr/\u003e - Work in an environment where the noise level varies and can be loud\u003cbr/\u003e - Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e - Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e   Our fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Operations Managers based on location preference and the business’ current openings.  ","department_cost_center":null,"description_short":"Job summaryOur WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Operations","display_distance":null,"id":"3883974e-0717-4165-8bf2-ef50263ce5f2","id_icims":"3173243","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3173243/operations-manager","job_schedule_type":"full-time","location":"US, CA, Moreno Valley","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Moreno Valley\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Moreno Valley\",\"coordinates\":\"33.91684,-117.26113\",\"normalizedCountyName\":\"Riverside\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Moreno Valley, California, USA\",\"location\":\"US, CA, Moreno Valley\",\"region\":\"CA\",\"buildingCodeList\":[\"ONT6\"],\"normalizedCityName\":\"Moreno Valley\"}"],"normalized_location":"Moreno Valley, California, USA","optional_search_labels":[],"posted_date":"February  3, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 2+ salaried employees and 70+ indirect employees\u003cbr/\u003e- Experience scoping, leading, and implementing process improvements through: Lean process, Kaizen, and/or Six Sigma.\u003cbr/\u003e- Demonstrated problem solving skills and analytical skills\u003cbr/\u003e- Excellent customer service skills, communication skills and interpersonal skills\u003cbr/\u003e- Track record of meeting or exceeding department performance goals\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Experience in: military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production, or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Moreno Valley - 91,000.00 - 136,500.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"CA","title":"Operations Manager","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3173243/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in developing functional specifications, design verification plans and functional test procedures\u003cbr/\u003e- Experience in aviation regulatory compliance\u003cbr/\u003e- Bachelor's degree in Computer Science, Engineering, or a related field\u003cbr/\u003e- 7+ years’ experience leading software quality assurance activities from inception of project to delivery to support DO-178C certification, and DO-330, DO-331, DO-332\u003cbr/\u003e- 7+ years' experience auditing design activities and perform process assurance activities to ensure lifecycle processes comply with approved plans and standards (ARP-4754)\u003cbr/\u003e- 5+ years' experience monitoring test execution\u003cbr/\u003e- 5+ years' experience performing conformity reviews\u003cbr/\u003e- 5+ years' experience participating FAA audits and change control boards\u003cbr/\u003e- Strong command of product development lifecycle processes\u003cbr/\u003e- Demonstrated Experience with PLM, JAMA, and other common tools","business_category":"retail","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Here at Amazon, we embrace our differences. We are committed to furthering our culture of diversity and inclusion of our teams within the organization.\u003cbr/\u003e\u003cbr/\u003eHow do you get items to customers quickly, cost-effectively, and—most importantly—safely, in less than an hour? And how do you do it in a way that can scale? Our teams of hundreds of scientists, engineers, aerospace professionals, and futurists have been working hard to do just that! We are delivering to customers, and are excited for what’s to come. Check out more information about Prime Air on the About Amazon blog (https://www.aboutamazon.com/news/transportation/amazon-prime-air-delivery-drone-reveal-photos).\u003cbr/\u003e\u003cbr/\u003eIf you are seeking an iterative environment where you can drive innovation, apply state-of-the-art technologies to solve real world delivery challenges, and provide benefits to customers, Prime Air is the place for you.\u003cbr/\u003e\u003cbr/\u003eCome work on the Amazon Prime Air Team! \u003cbr/\u003e\u003cbr/\u003ePrime Air Quality is seeking an experienced Sr. Design Quality Assurance Engineer. The successful candidate will have a strong track record of leading Hardware/Software Quality and Design Assurance engineering initiatives for certifying highly complex products in the aerospace, aviation maintenance industries. The right candidate will also be a strong integrator who prioritizes well and communicates effectively.\u003cbr/\u003e\u003cbr/\u003eExport Control License: This position may require a deemed export control license for compliance with applicable laws and regulations. Placement is contingent on Amazon’s ability to apply for and obtain an export control license on your behalf.\u003cbr/\u003e","department_cost_center":null,"description_short":"Here at Amazon, we embrace our differences. We are committed to furthering our culture of diversity and inclusion of our teams within the organization.How do you get items to customers quickly, cost-effectively,","display_distance":null,"id":"ceed094e-ab0d-4386-af93-5dc4e5e395ec","id_icims":"3175042","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/3175042/sr-design-quality-assurance-engineer-prime-air","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA109\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February  5, 2026","preferred_qualifications":"- Master's degree in electrical engineering, computer engineering, or equivalent\u003cbr/\u003e- Experience working with interdisciplinary teams to execute product design from concept to production\u003cbr/\u003e- Experience with the project management of technical projects\u003cbr/\u003e- 10+ years' experience with DQA activities in DO-178 Compliance and Auditing\u003cbr/\u003e- 5+ years' experience with DO-254 and DO-278 Compliance and Auditing\u003cbr/\u003e- Demonstrated Experience with (FAA) 14 CFR 21.137 requirements\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 137,300.00 - 185,700.00 USD annually","primary_search_label":"retail.team-global-prime-air","source_system":"JobCreator","state":"WA","title":"Sr. Design Quality Assurance Engineer, Prime Air","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3175042/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-prime-air","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Abgeschlossene technische Berufsausbildung, anerkannt durch die Industrie- und Handelskammer (IHK) oder Handwerkskammer (HWK) oder Nachweis eines erfolgreich abgeschlossen Hochschulstudium im Ingenieurwissenschaftlichen Bereich (Maschinenbau / Elektrotechnik oder artverwandt) einer deutschen Hochschule oder anerkannte ausländische Hochschulabschlüsse (BA, B. Sc., MA, M. Sc., Dipl.-Ing.)\u003cbr/\u003e- Zusätzlich, eine abgeschlossene Qualifikation als Industriemeister, Handwerksmeister oder Staatlich Geprüfter/Anerkannter Techniker oder mehrjährige einschlägige Berufserfahrung\u003cbr/\u003e- Praktische Erfahrung im Führen von Teams\u003cbr/\u003e- Erfahrung in der Automatisierung und Instandhaltung von Förderanlagen\u003cbr/\u003e- Fortgeschrittene Deutschkenntnisse in Wort und Schrift sowie Grundsprachkenntnisse in Englisch","business_category":"fulfillment-ops","city":"Graben","company_name":"Amazon FC Graben GmbH","country_code":"DEU","description":"Unser Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) ist der Kern von Amazons Engagement für Innovation. Amazon entwickelt sich weiter und dieses Team sorgt dafür, dass dies auch die von uns verwendeten Technologien und Tools tun. Als Senior RME Technician hilfst Du uns, der Entwicklung einen Schritt voraus zu bleiben. Du setzt die neuesten Technologien ein und identifizierst neue, effiziente Arbeitsmethoden. In dieser Rolle achtest Du genau auf unsere Prozesse und trägst dazu bei, dass wir unsere höchsten Sicherheitsstandards befolgen und weiter erhöhen. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e    Best Practice und Unterstützen im Bedienen von Geräten und Anlagen mit den höchsten Sicherheitsstandards\u003cbr/\u003e    Verfolgen der Geräteleistung durch visuelle Prüfungen, zustandsorientierte Überwachung und vorbeugende Wartungsmaßnahmen und Einplanen zusätzlicher Wartung je nach Bedarf\u003cbr/\u003e    Verantwortung für das technische Team während seiner Schicht und dessen Unterstützung und Weiterentwicklung\u003cbr/\u003e    Lösung von Problemen an Anlagen, um Betriebsausfallzeiten zu reduzieren und die schnellstmögliche Abfertigung von Paketen zu ermöglichen\u003cbr/\u003e    Unterstützung bei der kontinuierlichen Verbesserung von Systemen und Standardisierung von Prozessen im ganzen EU-Netzwerk\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eDu betreust ein Instandhaltungsteam innerhalb einer Schicht und sorgst dafür, dass alle Mitarbeitenden die erforderlichen Werkzeuge zur Verfügung haben und diese einwandfrei funktionieren. Das beinhaltet die Überwachung von Prozessen, damit Vorschriften und Richtlinien befolgt werden, ebenso wie die Gewährleistung der Durchführung vorbeugender Wartungsmaßnahmen, um die Betriebszeit unserer Anlagen zu maximieren.\u003cbr/\u003eDurch Deine Beobachtungen während der Schichtarbeit machst Du Verbesserungsvorschläge, um unsere Systeme noch effizienter und produktiver zu gestalten, und setzt diese Verbesserungen EU-weit um. Außerdem nutzt Du Tools wie SCADA zur Überwachung von Prozessen, um deren Leistungsfähigkeit zu gewährleisten, und unterstützt administrative Aufgaben in enger Zusammenarbeit mit Deinen Führungskräften.\u003cbr/\u003eDu arbeitest vor Ort in einem unserer Logistikzentren. Du arbeitest in Schichtmodellen, die Nächte und Wochenenden umfassen können. Mit den Kenntnissen und Erfahrungen, die Du sammelst, wirst Du Dich zu weiteren Führungspositionen weiterentwickeln\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eUnser Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) sorgt dafür, dass unsere Geräte und Ausstattung jederzeit optimal funktionieren. Wir sind ein Team von Techniker:innen und Ingenieur:innen, das aus hervorragenden Teamplayern besteht und von erfahrenen Führungskräften geleitet wird. Wir arbeiten gemeinsam daran, die Geräte in unserem gesamten globalen Netzwerk von Fulfillment-Centern zu warten, zu reparieren und ihre Fehler zu beheben. Einige unserer Mitarbeiter:innen sind Führungskräfte, die das Team bei der Arbeit an spannender, innovativer Technologie beaufsichtigen – die es teilweise nur bei Amazon gibt.\u003cbr/\u003eVon der Installation automatisierter Verpackungssysteme bis hin zur Beaufsichtigung der allgemeinen Wartungsarbeiten eines Standorts sowie der Reparatur von für den Vertrieb wesentlichen Geräten wickelt unser Team einen Großteil der technischen Aufgaben bei Amazon ab. Unter anderem sorgt es auch dafür, dass Gebäude weiterhin den rechtlichen Auflagen entsprechen, damit alle sicher bleiben und unsere Standorte mit maximaler Effizienz betrieben werden. Es gibt zahlreiche Aufstiegschancen im RME-Team selbst ebenso wie im gesamten Amazon-Unternehmen.\u003cbr/\u003eAlle unsere Aktivitäten sind darauf ausgerichtet, die Ausfallzeiten an Amazons wichtigsten Betriebsstandorten zu reduzieren, damit Kund:innen ihre Bestellungen rechtzeitig erhalten. Oft arbeiten wir früh morgens, spät abends oder in der Nachtschicht, um Wartungsarbeiten mit den geringstmöglichen Störungen vorzunehmen. Falls wir eine bessere Möglichkeit finden, eine bestimmte Aufgabe zu erledigen, verfügen wir über die Fertigkeiten und Gelegenheiten, vollständig neue Prozesse oder bahnbrechende Technologie wie Amazon Robotics oder unseren Complex Item Sorter einzuführen.","department_cost_center":null,"description_short":"Unser Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) ist der Kern von Amazons Engagement für Innovation. Amazon entwickelt sich weiter und dieses Team sorgt","display_distance":null,"id":"485db975-dd2d-4259-baba-09732b4c4368","id_icims":"3175769","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/facilities","job_function_id":null,"job_path":"/en/jobs/3175769/teamleiter-instandhaltung-all-genders","job_schedule_type":"full-time","location":"DE, BY, Graben","locations":["{\"normalizedStateName\":\"Bavaria\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Graben\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, BY, Graben\",\"coordinates\":\"48.18916,10.82012\",\"normalizedCountyName\":\"Augsburg (Landkreis)\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Graben, Bavaria, DEU\",\"location\":\"DE, BY, Graben\",\"region\":\"BY\",\"buildingCodeList\":[\"MUC3\"],\"normalizedCityName\":\"Graben\"}"],"normalized_location":"Graben, Bavaria, DEU","optional_search_labels":["ops.lander-emea-rme-technician","ops.rme-technician","jdv.operations.rmetechnician","military-operations","military"],"posted_date":"February  6, 2026","preferred_qualifications":"- Erfahrung in der Betreuung von Fremdfirmen\u003cbr/\u003e- Verständnis von SPS-basierten Steuersystemen und gesetzlichen Compliance-Anforderungen\u003cbr/\u003e- Erfahrung im Gebrauch von computergesteuerten Wartungsmanagementsystemen, um proaktive Wartungsmaßnahmen zu planen und reaktive Maßnahmen aufzuzeichnen\u003cbr/\u003e- Studienabschluss, vorzugsweise in einem technischen Fachgebiet oder in Betriebswirtschaft\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-global-specialty-fulfillment","source_system":"JobCreator","state":"BY","title":"Teamleiter Instandhaltung (all genders)","university_job":null,"updated_time":"21 minutes","url_next_step":"https://account.amazon.com/jobs/3175769/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-specialty-fulfillment","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Advanced degree, or Bachelor's degree\u003cbr/\u003e- Experience managing people\u003cbr/\u003e- Experience working with multiple groups of stakeholders\u003cbr/\u003e- Experience using data to influence business decisions\u003cbr/\u003e- Knowledge of advanced English at CEFR level B2/C1","business_category":"fulfillment-and-operations","city":"Illescas","company_name":"Amazon Spain Fulfillment, S.L.U.","country_code":"ESP","description":"When you join Amazon as an Area/Shift Manager, you’ll gain experience leading a large and diverse team to make sure your area of the business keeps pace with demand. In this hands-on role, you’ll learn about the complexity of operations at a global business and what it takes to make everything run seamlessly. While you implement your team’s approach to drive productivity, you’ll also work closely with your colleagues to address challenges, which means no two days will be the same.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003ePromote a culture of safety and wellbeing\u003cbr/\u003e    Analyse and implement corrective actions to make sure quality and productivity are at consistently high levels, and business objectives are met across all shifts\u003cbr/\u003e    Support and lead a team and handle administrative work alongside building and supporting a strong team culture\u003cbr/\u003e    Analyse performance and suggest process improvements to optimise work and improve customer service\u003cbr/\u003e    Collaborate with other managers to standardise shift processes\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou’ll work shifts and be based at one of our operational sites. Your main focus will be to maintain safety standards within your team and across your site. You’ll also monitor and maintain process efficiency. Your days will always include prioritising routine team management and daily operational tasks, alongside other tasks like individual escalations, process improvement work and wide-scale operational contingency planning.\u003cbr/\u003eBeing a key part of the operations team involves working with colleagues in other teams and external partners to make sure we stay on track to meet our customer demands and targets. This will involve analysing data and performance metrics with leaders in your business area, as well as discussing the operational pros and cons of technical improvements with engineers.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eCustomer Fulfilment, or CF, is where it all started for Amazon. CF has scaled up from a humble team of booksellers to a sophisticated global team which handles more than 1.5 million orders every day. The team is the foundation of our business and its efforts have helped us diversify across new regions and services. With the help of emerging technology, we’re always looking for ways to offer a bigger, better product range – delivered quickly and affordably.\u003cbr/\u003e\u003cbr/\u003eThe CF team are the first people in the chain that helps customers get products at the speed we’re known for. We’re based in Fulfilment Centres, which are at the heart of Amazon’s fast-paced Operations network. Our centres are sometimes referred to as the ‘First Mile’ because it’s where most Amazon packages start their journey. We help to manage dynamic inventory and facilitate speedy deliveries round the clock.\u003cbr/\u003e\u003cbr/\u003eLots of different people work in our Fulfilment Centres, so there are plenty of opportunities for every skillset. Some of us work with physical products, while others analyse data to help everyone across the business make smart decisions.","department_cost_center":null,"description_short":"When you join Amazon as an Area/Shift Manager, you’ll gain experience leading a large and diverse team to make sure your area of the business keeps pace with demand. In this hands-on role, you’ll learn","display_distance":null,"id":"6cf30474-b495-47c1-b123-775f718e1951","id_icims":"3175773","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3175773/area-manager","job_schedule_type":"full-time","location":"ES, TO, Illescas","locations":["{\"normalizedStateName\":\"Castille-La Mancha\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Illescas\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, TO, Illescas\",\"coordinates\":\"40.12299,-3.84591\",\"normalizedCountyName\":\"Toledo\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Illescas, Castille-La Mancha, ESP\",\"location\":\"ES, TO, Illescas\",\"region\":\"TO\",\"buildingCodeList\":[\"MAD7\"],\"normalizedCityName\":\"Illescas\"}"],"normalized_location":"Illescas, Castille-La Mancha, ESP","optional_search_labels":[],"posted_date":"February  6, 2026","preferred_qualifications":"- Knowledge of Lean, Six Sigma and Kaizen techniques\u003cbr/\u003e- Experience in warehouse operations and logistics or equivalent\u003cbr/\u003e- Experience working with the MS Office suite (Word, Excel, Outlook) in a professional environment\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-last-mile-delivery","source_system":"JobCreator","state":"TO","title":"Area Manager","university_job":null,"updated_time":"21 minutes","url_next_step":"https://account.amazon.com/jobs/3175773/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-delivery","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience (non-internship) in professional software development\u003cbr/\u003e- Experience designing or architecting (design patterns, reliability and scaling) of new and existing systems\u003cbr/\u003e- Experience programming with at least one software programming language\u003cbr/\u003e- Knowledge of a front-end language (Javascript, CSS, HTML, etc.)\u003cbr/\u003e- Experience with common front-end technologies such as HTML, CSS, JS, TypeScript, and Node","business_category":"amazon-business","city":"Madrid","company_name":"Amazon Spain Services, S.L.U. - B76","country_code":"ESP","description":"Amazon Business (AB) represents an incredible opportunity to address a vast new market segment and customer base for Amazon. AB is one of Amazon’s fastest growing businesses in Amazon’s history, available in 10 countries, serving over 5 million customers worldwide and generating over $25B in annual revenue. We are focused on building solutions that solve the unique needs of business customers of all types and sizes from SMB to the biggest companies in the world. We are not stopping there and setting ambitious goals for our expansion launching in multiple marketplaces annually. It comes with the challenge of not only working across org but coming up strategy for our go-faster goal. We want people who are willing to roll up their sleeves and push hard to help us achieve those goals and have the perseverance to push through the inevitable obstacles.\u003cbr/\u003e\u003cbr/\u003eWe are looking for a talented Software Development Engineer to join our growing team, focusing on expanding our global reach through robust localization and internationalization (L10n \u0026 I18n) efforts. In this pivotal role, you'll be instrumental in designing, developing, and implementing scalable solutions that enable our products and services to seamlessly adapt to diverse languages, cultures, and regions worldwide, with a particular focus on upcoming market expansions. If you have a passion for building globally-ready software and solving complex technical challenges related to multi-lingual and multi-cultural user experiences, we encourage you to apply.\u003cbr/\u003e\u003cbr/\u003eSome info about this opportunity:\u003cbr/\u003e- The role has high potential growth that has opportunity to work with Sr. Engineering leadership (PE, Sr. SDE and Sr. Managers) across AB, consumer Prime and Marketing.\u003cbr/\u003e- The scope of the work spreads across multiple portfolio of products and services. It gives opportunity to get broader knowledge and experience of Amazon (buying experience, seller experience, Customer Acquisition, Account Management etc).\u003cbr/\u003e- You will apply Amazon innovation mechanisms and AWS technologies including native AWS, machine learning, and more at scale.\u003cbr/\u003e- You get be part of new team and shape the culture of the team.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Acting as subject matter expert on the Localization \u0026 Internationalization (L10n \u0026 I18n) topics with for instance driving Right-to-Left (RTL) layouts projects (implementing and styling RTL interfaces for Arabic and other RTL languages).\u003cbr/\u003e- Leveraging i18n libraries/frameworks and integrating with translation management systems (TMS) or workflows.\u003cbr/\u003e- Owning performance optimization tasks involving strong understanding of web performance best practices (e.g., code splitting, lazy loading, image optimization, caching strategies, CDN integration).\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Business (AB) represents an incredible opportunity to address a vast new market segment and customer base for Amazon. AB is one of Amazon’s fastest growing businesses in Amazon’s history, available","display_distance":null,"id":"3846b4ec-ee2b-4dbd-b6fc-40c17fc96ce4","id_icims":"3175768","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3175768/software-developper-engineer-ii","job_schedule_type":"full-time","location":"ES, M, Madrid","locations":["{\"normalizedStateName\":\"Community of Madrid\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Madrid\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, M, Madrid\",\"coordinates\":\"40.42024,-3.68755\",\"normalizedCountyName\":\"Madrid\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Madrid, Community of Madrid, ESP\",\"location\":\"ES, M, Madrid\",\"region\":\"M\",\"buildingCodeList\":[\"MAD12\"],\"normalizedCityName\":\"Madrid\"}"],"normalized_location":"Madrid, Community of Madrid, ESP","optional_search_labels":["international-stores.stores-tech-emea"],"posted_date":"February  6, 2026","preferred_qualifications":"- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- Experience with full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-business.no-team-listed","source_system":"JobCreator","state":"M","title":"Software Developper Engineer II","university_job":null,"updated_time":"23 minutes","url_next_step":"https://account.amazon.com/jobs/3175768/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Speak, write, and read fluently in English\u003cbr/\u003e- Experience using strong customer service, communication, and interpersonal skills\u003cbr/\u003e- Experience working independently and collaborating effectively in a remote team environment\u003cbr/\u003e- Proven experience in technical support, escalation management, or a similar role.\u003cbr/\u003e- Good problem-solving and analytical skills.\u003cbr/\u003e- Willingness to work 24/7 shift rotations.","business_category":"fulfillment-ops","city":"Barcelona","company_name":"Amazon Spain Fulfillment, S.L.U.","country_code":"ESP","description":"Amazon Operations sits at the heart of the Amazon customer experience. We look after everything from the moment a customer clicks buy, to the moment their item is delivered – from desktop to doorstep.\u003cbr/\u003e\u003cbr/\u003eAcross the globe we have more than thousand Fulfillment Centers, thousands of Delivery Stations, tens of thousands of machines, and  hundreds of thousands of employees, all working together in harmony to make sure the right item gets delivered to the right person, in the right place, at the right time.\u003cbr/\u003e\u003cbr/\u003eWorking in Amazon Operations is for people who like to be active and give their all. We work in a busy, dynamic environment and are part of a bigger team delivering on the expectations of millions of customers every single day. We are open, inclusive and welcome individuality and diversity. The culture in our Operation is built on the way teams’ bond and the work ethic that enables our business run like clockwork. Our teams take pride in a job well done, looking out for one another, ensuring the highest safety standards and playing their part in delivering the quality service Amazon is known for around the world.\u003cbr/\u003e\u003cbr/\u003eThe Escalation Specialist is responsible for first-line monitoring and response within Amazon Maintenance Operations Centre (AMOC). This role directly monitors alarm systems, dispatches local vendors, assists site maintenance and operations personnel with troubleshooting efforts, and ensures accurate documentation and communication. The successful candidates will be action-orientated, flexible problem-solvers with excellent research skills who can demonstrate exceptional customer service and take full ownership of each case.\u003cbr/\u003eAMOC provides 24/7 monitoring, facilities escalation management, vendor dispatch and tracking, documentation and resolution management for multiple Amazon business units with and without dedicated onsite maintenance personnel.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tRespond to and triage incoming work requests within standard service level agreements (SLAs)\u003cbr/\u003e•\tManage remote works from start to end, including work order/purchase order raising and receipting\u003cbr/\u003e•\tCommunicate effectively and efficiently with stakeholders (Reliability Maintenance Engineering, Ops, H\u0026S etc.)\u003cbr/\u003e•\tProvide updates on vendor status, take the lead on coordinating works during an escalation\u003cbr/\u003e•\tIdentify and escalate critical issues through appropriate channels to maintain equipment reliability and minimize operational impact\u003cbr/\u003e•\tMonitor, respond to, and manage refrigeration alarm systems, ensuring timely response to critical alerts\u003cbr/\u003e•\tManage and prioritize work queues based on urgency and SLA requirements","department_cost_center":null,"description_short":"Amazon Operations sits at the heart of the Amazon customer experience. We look after everything from the moment a customer clicks buy, to the moment their item is delivered – from desktop to doorstep.Across","display_distance":null,"id":"a8f2bdb6-d8d9-441e-8766-c1788e2a325c","id_icims":"3175766","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Internal Procurement","job_function_id":null,"job_path":"/en/jobs/3175766/escalation-specialist-amazon-maintenance-operation-centre","job_schedule_type":"full-time","location":"ES, Barcelona","locations":["{\"normalizedStateName\":\"Catalonia\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Barcelona\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, Barcelona\",\"coordinates\":\"41.38804,2.17001\",\"normalizedCountyName\":\"Barcelona\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Barcelona, Catalonia, ESP\",\"location\":\"ES, Barcelona\",\"region\":\"\",\"buildingCodeList\":[\"BCN1\"],\"normalizedCityName\":\"Barcelona\"}"],"normalized_location":"Barcelona, Catalonia, ESP","optional_search_labels":["ops.lander-emea-rme-reliability","operations-team.reliability-maintenance-engineering-eu","operations.team-reliability-maintenance-engineering-na"],"posted_date":"February  6, 2026","preferred_qualifications":"- Bachelor's degree in electrical engineering, computer engineering, or equivalent\u003cbr/\u003e- Knowledge of electric vehicle charging systems and infrastructure.\u003cbr/\u003e- Proficient in other languages\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":null,"title":"Escalation Specialist, Amazon Maintenance Operation Centre","university_job":null,"updated_time":"32 minutes","url_next_step":"https://account.amazon.com/jobs/3175766/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- 2+ year of experience in any of the following or similar technical or vocational roles: Computer Hardware Repair, Infrastructure Cabling, Network Deployment, Data Center Operations, Technical Project Management","business_category":"aws","city":"Chantilly","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon is looking for an Infrastructure Delivery Installation Technician to join our growing team within infrastructure operations. You will work with minimum supervision in a dynamic environment to drive the stability and sustainability of our next-generation networks and assist in the development of innovative ways to automate and scale our network.\u003cbr/\u003e\u003cbr/\u003eTo be successful in this role you should possess technical aptitude, written and oral communications skills and the ability to deal effectively with people in a wide variety of situations. In addition, you must possess strong analytical skills with demonstrated problem solving ability. You will be able to leverage your experience exercising high levels of initiative, judgment, and diplomacy.\u003cbr/\u003e\u003cbr/\u003eAdditionally, all candidates should be willing to work both independently and with a team. Work prioritization, organizational skills, effective communication, and the ability to react quickly are critical to being successful.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eAll physical requirements are expected with reasonable accommodations:\u003cbr/\u003e•\tRegularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds\u003cbr/\u003e•\tAbility to work in an environment that operates 24/7 with an ability to participate in primary responder rotation and provide after-hours support as needed\u003cbr/\u003e•\tWorking in cramped and/or elevated and/or noisy environments\u003cbr/\u003e•\tBending, lifting, stretching, reaching, standing and walking for up to 8+ hours a day\u003cbr/\u003e•\tAscending and descending ladders, stairs, and gangways safely and without limitation\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tMoving and implementing large enterprise equipment\u003cbr/\u003e•\tInstalling Fiber and Copper cabling and patching cabling between equipment\u003cbr/\u003e•\tEnsuring proper safety and security standards are maintained during cabling and rack installation, \u003cbr/\u003e•\tFollowing well established hardware installation procedures and break-fix activities\u003cbr/\u003e•\tSafely using material handling tools and equipment\u003cbr/\u003eTraveling within and outside of regional work area is required.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"a5a7dc6b-90c9-4c7a-90c9-8292b8d1fcbc","id_icims":"3168068","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3168068/network-install-technician-infrastructure-delivery","job_schedule_type":"full-time","location":"US, VA, Chantilly","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sterling\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Sterling\",\"coordinates\":\"39.03336,-77.40713\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sterling, Virginia, USA\",\"location\":\"US, VA, Sterling\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD603\",\"IAD57\",\"IAD282\",\"IAD12\",\"IAD118\",\"IAD417\",\"IAD91\",\"IAD181\",\"IAD62\",\"IAD140\",\"IAD661\",\"IAD147\",\"IAD33\",\"IAD405\",\"IAD232\",\"IAD588\",\"IAD190\",\"IAD256\",\"IAD160\",\"IAD409\",\"IAD83\",\"IAD143\",\"IAD16\",\"IAD123\",\"OSU69\",\"IAD15\",\"IAD98\",\"IAD139\",\"IAD413\",\"IAD69\",\"IAD82\",\"IAD662\",\"IAD90\",\"IAD182\",\"IAD148\",\"IAD146\",\"IAD285\",\"IAD141\",\"IAD402\",\"IAD144\",\"IAD257\",\"IAD17\",\"IAD586\",\"IAD244\",\"IAD407\",\"IAD32\",\"IAD192\",\"BWI1\",\"IAD259\",\"IAD571\",\"IAD214\",\"IAD410\",\"IAD164\",\"IAD608\",\"IAD920\",\"IAD26\",\"IAD403\",\"IAD72\",\"IAD10\",\"IAD116\",\"IAD121\",\"IAD415\",\"IAD149\",\"IAD229\",\"IAD128\",\"IAD613\",\"IAD213\",\"IAD93\",\"IAD226\",\"IAD79\",\"IAD81\",\"IAD191\",\"IAD389\",\"IAD255\",\"IAD412\",\"IAD129\",\"IAD231\",\"IAD92\",\"IAD230\",\"IAD180\",\"IAD419\",\"IAD574\",\"IAD142\",\"IAD88\",\"IAD388\",\"IAD681\",\"IAD246\",\"IAD418\",\"IAD56\",\"IAD117\",\"IAD119\",\"IAD89\",\"IAD404\",\"IAD68\",\"IAD163\",\"IAD414\",\"IAD228\",\"IAD122\",\"IAD175\",\"IAD58\",\"WAS30\",\"IAD408\",\"IAD99\",\"IAD609\",\"DDC4\",\"IAD587\",\"IAD411\",\"IAD258\",\"IAD51\",\"IAD76\",\"IAD145\",\"IAD406\",\"IAD416\",\"IAD243\",\"IAD120\"],\"normalizedCityName\":\"Sterling\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Ashburn\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Ashburn\",\"coordinates\":\"39.05232,-77.4827\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Ashburn, Virginia, USA\",\"location\":\"US, VA, Ashburn\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD438\",\"LAB1\",\"IAD496\",\"IAD426\",\"IAD200\",\"IAD215\",\"IAD115\",\"IAD434\",\"IAD435\",\"IAD66\",\"WFM534\",\"IAD290\",\"IAD50\",\"IAD611\",\"IAD847\",\"IAD169\",\"IAD685\",\"IAD499\",\"IAD423\",\"IAD13\",\"IAD421\",\"IAD162\",\"IAD606\",\"IAD433\",\"IAD202\",\"IAD177\",\"IAD71\",\"IAD431\",\"IAD114\",\"IAD05\",\"IAD78\",\"IAD428\",\"IAD470\",\"IAD420\",\"IAD23\",\"IAD436\",\"IAD179\",\"IAD60\",\"IAD498\",\"IAD80\",\"IAD138\",\"IAD254\",\"IAD2\",\"IAD437\",\"IAD174\",\"IAD497\",\"IAD427\",\"IAD6\",\"WAS36\",\"IAD439\",\"IAD430\",\"IAD67\",\"IAD432\",\"IAD54\",\"IAD429\",\"IAD161\",\"IAD422\"],\"normalizedCityName\":\"Ashburn\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Chantilly\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Chantilly\",\"coordinates\":\"38.88675,-77.43892\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Chantilly, Virginia, USA\",\"location\":\"US, VA, Chantilly\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD544\",\"IAD37\",\"IAD600\",\"IAD527\",\"IAD9\",\"IAD156\",\"IAD604\",\"IAD738\",\"IAD152\",\"IAD63\",\"IAD157\",\"IAD150\",\"IAD86\",\"IAD203\",\"IAD61\",\"IAD1\",\"IAD135\",\"IAD602\",\"IAD529\",\"IAD155\",\"IAD530\",\"IAD18\",\"IAD525\",\"IAD134\",\"IAD610\",\"IAD605\",\"IAD151\",\"IAD526\",\"IAD158\",\"IAD22\",\"IAD159\",\"IAD528\",\"IAD543\",\"IAD601\",\"IAD65\",\"IAD204\",\"DRC7\"],\"normalizedCityName\":\"Chantilly\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Dulles\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Dulles\",\"coordinates\":\"39.02784,-77.39718\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sterling, Virginia, USA\",\"location\":\"US, VA, Dulles\",\"region\":\"VA\",\"buildingCodeList\":[\"HGJ5\",\"IAD683\",\"IAD183\",\"HCS6\",\"HCS5\",\"AFT3\",\"IAD251\",\"PAR6\",\"HGJ4\",\"IAD614\",\"HSN2\",\"AFT2\"],\"normalizedCityName\":\"Sterling\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD653\",\"IAD28\",\"IAD168\",\"DCA52\",\"IAD547\",\"IAD940\",\"IAD657\",\"IAD21\",\"IAD993\",\"IAD656\",\"IAD769\",\"IAD8\",\"IAD548\",\"IAD736\",\"IAD21R\",\"IAD500\",\"IAD658\",\"IAD990\",\"IAD960\",\"IAD869\",\"IAD545\",\"IAD980\",\"IAD549\",\"IAD166\",\"IAD848\",\"IAD739\",\"IAD651\",\"IAD660\",\"IAD992\",\"IAD655\",\"IAD31\",\"IAD905\",\"IAD654\",\"IAD650\",\"IAD165\",\"IAD991\",\"IAD546\",\"IAD659\",\"IAD652\",\"IAD737\",\"IAD167\"],\"normalizedCityName\":\"Herndon\"}","{\"normalizedStateName\":\"Maryland\",\"normalizedCountryCode\":\"USA\",\"city\":\"Frederick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MD, Frederick\",\"coordinates\":\"39.41574,-77.41203\",\"normalizedCountyName\":\"Frederick\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Frederick, Maryland, USA\",\"location\":\"US, MD, Frederick\",\"region\":\"MD\",\"buildingCodeList\":[\"BWI139\",\"IAD541\",\"BWI111\",\"BWI127\",\"DIW5\",\"BWI144\",\"IAD536\",\"BWI118\",\"IAD533\",\"BWI135\",\"BWI136\",\"BWI126\",\"IAD532\",\"IAD916\",\"BWI110\",\"IAD542\",\"BWI141\",\"BWI143\",\"BWI184\",\"IAD539\",\"BWI138\",\"BWI128\",\"BWI153\",\"BWI100\",\"BWI131\",\"BWI133\",\"BWI148\",\"DFR1\",\"FDK1\",\"IAD534\",\"BWI181\",\"BWI151\",\"IAD245\",\"BWI123\",\"BWI125\",\"IAD538\",\"BWI142\",\"HGR4\",\"BWI113\",\"WFM865\",\"BWI154\",\"DDI1\",\"BWI137\",\"BWI150\",\"BWI117\",\"IAD531\",\"BWI121\",\"BWI116\",\"BWI146\",\"BWI145\",\"BWI130\",\"BWI101\",\"LFDK\",\"BWI124\",\"BWI122\",\"IAD537\",\"BWI112\",\"BWI134\",\"IAD540\",\"BWI147\",\"BWI180\",\"BWI149\",\"BWI132\",\"BWI119\",\"IAD352\",\"BWI152\",\"BWI129\",\"IAD535\"],\"normalizedCityName\":\"Frederick\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Manassas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Manassas\",\"coordinates\":\"38.75125,-77.47086\",\"normalizedCountyName\":\"Manassas (City)\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Manassas, Virginia, USA\",\"location\":\"US, VA, Manassas\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD96\",\"IAD112\",\"IAD100\",\"IAD84\",\"IAD314\",\"IAD46\",\"IAD107\",\"IAD516\",\"IAD75\",\"IAD34\",\"IAD444\",\"IAD43\",\"IAD103\",\"IAD14\",\"IAD598\",\"IAD234\",\"IAD87\",\"IAD322\",\"IAD515\",\"IAD440\",\"IAD38\",\"IAD210\",\"IAD524\",\"IAD216\",\"IAD108\",\"IAD225\",\"DCA73\",\"IAD194\",\"IAD443\",\"IAD35\",\"IAD95\",\"IAD111\",\"IAD445\",\"IAD7\",\"IAD85\",\"IAD224\",\"IAD132\",\"IAD523\",\"IAD47\",\"IAD101\",\"IAD441\",\"IAD104\",\"IAD521\",\"IAD518\",\"IAD73\",\"IAD448\",\"IAD237\",\"IAD106\",\"IAD307\",\"IAD247\",\"IAD20\",\"IAD594\",\"IAD222\",\"IAD45\",\"DCA72\",\"IAD19\",\"IAD442\",\"IAD914\",\"IAD109\",\"IAD110\",\"IAD223\",\"IAD193\",\"MAK7\",\"IAD24\",\"IAD211\",\"DCA080\",\"IAD235\",\"IAD220\",\"HWY120\",\"IAD39\",\"IAD446\",\"IAD102\",\"IAD370\",\"IAD77\",\"IAD131\",\"DCA075\",\"IAD48\",\"IAD612\",\"IAD590\",\"IAD113\",\"IAD49\",\"IAD97\",\"IAD52\",\"IAD944\",\"IAD130\",\"IAD607\",\"DVA5\",\"IAD59\",\"IAD236\",\"IAD447\",\"IAD449\",\"IAD221\",\"IAD218\",\"IAD105\",\"IAD44\",\"IAD520\",\"IAD519\",\"IAD74\",\"IAD11\",\"IAD133\",\"IAD248\",\"IAD517\",\"IAD522\",\"IAD238\",\"IAD846\"],\"normalizedCityName\":\"Manassas\"}"],"normalized_location":"Chantilly, Virginia, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"January 27, 2026","preferred_qualifications":"- Industry standard certifications (CompTIA, CCENT, Network+)\u003cbr/\u003e- Knowledge of network cabling, optic types, and test equipment\u003cbr/\u003e- Experience with cabling infrastructure best practices and methodologies\u003cbr/\u003e- Experience with medium to large, complex project scopes and ambiguous details within work environment\u003cbr/\u003e- Knowledge of major Command Line Protocols (Cisco IOS, JunOS, GNU/Linux) and common Networking Protocols (BGP, OSPF)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MD, Frederick - 29.00 - 52.00 USD hourly\u003cbr/\u003eUSA, VA, Ashburn - 29.00 - 52.00 USD hourly\u003cbr/\u003eUSA, VA, Chantilly - 29.00 - 52.00 USD hourly\u003cbr/\u003eUSA, VA, Dulles - 29.00 - 52.00 USD hourly\u003cbr/\u003eUSA, VA, Herndon - 29.00 - 52.00 USD hourly\u003cbr/\u003eUSA, VA, MANASSAS - 29.00 - 52.00 USD hourly\u003cbr/\u003eUSA, VA, Manassas - 29.00 - 52.00 USD hourly\u003cbr/\u003eUSA, VA, Sterling - 29.00 - 52.00 USD hourly","primary_search_label":"aws.team-it-services","source_system":"JobCreator","state":"VA","title":"Network Install Technician, Infrastructure Delivery","university_job":null,"updated_time":"35 minutes","url_next_step":"https://account.amazon.com/jobs/3168068/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-it-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of computer networking experience\u003cbr/\u003e- 1+ years of Linux operating systems experience\u003cbr/\u003e- Bachelor's degree in Information Technology, Computer Science, or a related field\u003cbr/\u003e- Experience in computer networking\u003cbr/\u003e- Experience working with Linux operating systems\u003cbr/\u003e- Can lift and rack equipment up to 40 pounds\u003cbr/\u003e- Experience with computer hardware troubleshooting and repair","business_category":"aws","city":"Dulles","company_name":"Amazon Data Services, Inc. - A19","country_code":"USA","description":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring seamless data center operations that power millions of businesses and services worldwide.\u003cbr/\u003eData Center Technician position involves in-depth hardware and network diagnostics followed by physical repair as well as participating in an on-call rotation.\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role.\u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e-Performing server rack installations, hardware break-fix on various components, troubleshooting network issues, responding to operational incidents that impact service availability, and carrying out routine network, server hardware, and operating system repairs to contribute to the overall availability of AWS services\u003cbr/\u003e-Serving as a primary contact point for both internal and external stakeholders, including engineers, software developers, vendors, and contractors\u003cbr/\u003e-Performing on-call duties and participating in scheduled maintenance and change management activities\u003cbr/\u003e-Contributing to documentation and process improvement initiatives based on your analysis of operational issues\u003cbr/\u003e-Helping to interview, train and onboard new team members\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e-Lifting and moving material up to 40 pounds each\u003cbr/\u003e-Working in cramped and/or elevated locations\u003cbr/\u003e-Bending, lifting, stretching, and reaching\u003cbr/\u003e-Standing and walking for up to 8+ hours a day\u003cbr/\u003e-Ascending and descending ladders, stairs, and gangways safely and without limitation\u003cbr/\u003e\u003cbr/\u003eWork in an industrial environment\u003cbr/\u003e-Work shifts longer than 8 hours to support 24/7 operations (covering both night and day shifts).\u003cbr/\u003e-This role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational.\u003cbr/\u003e\u003cbr/\u003eEssential Requirements:\u003cbr/\u003e-Ability to travel to or commute between data center locations as needed\u003cbr/\u003e-Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational\u003cbr/\u003e-Travel frequency will vary based on business needs and operational status of assigned facility\u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eOur Data Center Technician professionals, who have industry-leading technical abilities and demonstrate a breadth of knowledge while they:\u003cbr/\u003e\u003cbr/\u003e-Take ownership of technical issues brought by their customer base, engaging other teams when needed to drive resolution\u003cbr/\u003e-Show a strong aptitude for troubleshooting and problem solving\u003cbr/\u003e-Solve problems at their root and step back to understand the broader context\u003cbr/\u003e-Maintain service level agreements through the implementation of proactive issue detection and reporting\u003cbr/\u003e-Are biased to act in the absence of direction or support\u003cbr/\u003e-Improve effectiveness through process innovation\u003cbr/\u003e\u003cbr/\u003eYou will be required to work shift work that will include days/nights/weekends/holidays.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.","department_cost_center":null,"description_short":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring","display_distance":null,"id":"6f58aca7-ac1d-4342-a188-c033f000f371","id_icims":"3167700","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3167700/dco-tech","job_schedule_type":"full-time","location":"US, VA, Dulles","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sterling\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Sterling\",\"coordinates\":\"39.03336,-77.40713\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sterling, Virginia, USA\",\"location\":\"US, VA, Sterling\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD603\",\"IAD57\",\"IAD282\",\"IAD12\",\"IAD118\",\"IAD417\",\"IAD91\",\"IAD181\",\"IAD62\",\"IAD140\",\"IAD661\",\"IAD147\",\"IAD33\",\"IAD405\",\"IAD232\",\"IAD588\",\"IAD190\",\"IAD256\",\"IAD160\",\"IAD409\",\"IAD83\",\"IAD143\",\"IAD16\",\"IAD123\",\"OSU69\",\"IAD15\",\"IAD98\",\"IAD139\",\"IAD413\",\"IAD69\",\"IAD82\",\"IAD662\",\"IAD90\",\"IAD182\",\"IAD148\",\"IAD146\",\"IAD285\",\"IAD141\",\"IAD402\",\"IAD144\",\"IAD257\",\"IAD17\",\"IAD586\",\"IAD244\",\"IAD407\",\"IAD32\",\"IAD192\",\"BWI1\",\"IAD259\",\"IAD571\",\"IAD214\",\"IAD410\",\"IAD164\",\"IAD608\",\"IAD920\",\"IAD26\",\"IAD403\",\"IAD72\",\"IAD10\",\"IAD116\",\"IAD121\",\"IAD415\",\"IAD149\",\"IAD229\",\"IAD128\",\"IAD613\",\"IAD213\",\"IAD93\",\"IAD226\",\"IAD79\",\"IAD81\",\"IAD191\",\"IAD389\",\"IAD255\",\"IAD412\",\"IAD129\",\"IAD231\",\"IAD92\",\"IAD230\",\"IAD180\",\"IAD419\",\"IAD574\",\"IAD142\",\"IAD88\",\"IAD388\",\"IAD681\",\"IAD246\",\"IAD418\",\"IAD56\",\"IAD117\",\"IAD119\",\"IAD89\",\"IAD404\",\"IAD68\",\"IAD163\",\"IAD414\",\"IAD228\",\"IAD122\",\"IAD175\",\"IAD58\",\"WAS30\",\"IAD408\",\"IAD99\",\"IAD609\",\"DDC4\",\"IAD587\",\"IAD411\",\"IAD258\",\"IAD51\",\"IAD76\",\"IAD145\",\"IAD406\",\"IAD416\",\"IAD243\",\"IAD120\"],\"normalizedCityName\":\"Sterling\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Ashburn\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Ashburn\",\"coordinates\":\"39.05232,-77.4827\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Ashburn, Virginia, USA\",\"location\":\"US, VA, Ashburn\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD438\",\"LAB1\",\"IAD496\",\"IAD426\",\"IAD200\",\"IAD215\",\"IAD115\",\"IAD434\",\"IAD435\",\"IAD66\",\"WFM534\",\"IAD290\",\"IAD50\",\"IAD611\",\"IAD847\",\"IAD169\",\"IAD685\",\"IAD499\",\"IAD423\",\"IAD13\",\"IAD421\",\"IAD162\",\"IAD606\",\"IAD433\",\"IAD202\",\"IAD177\",\"IAD71\",\"IAD431\",\"IAD114\",\"IAD05\",\"IAD78\",\"IAD428\",\"IAD470\",\"IAD420\",\"IAD23\",\"IAD436\",\"IAD179\",\"IAD60\",\"IAD498\",\"IAD80\",\"IAD138\",\"IAD254\",\"IAD2\",\"IAD437\",\"IAD174\",\"IAD497\",\"IAD427\",\"IAD6\",\"WAS36\",\"IAD439\",\"IAD430\",\"IAD67\",\"IAD432\",\"IAD54\",\"IAD429\",\"IAD161\",\"IAD422\"],\"normalizedCityName\":\"Ashburn\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Chantilly\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Chantilly\",\"coordinates\":\"38.88675,-77.43892\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Chantilly, Virginia, USA\",\"location\":\"US, VA, Chantilly\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD544\",\"IAD37\",\"IAD600\",\"IAD527\",\"IAD9\",\"IAD156\",\"IAD604\",\"IAD738\",\"IAD152\",\"IAD63\",\"IAD157\",\"IAD150\",\"IAD86\",\"IAD203\",\"IAD61\",\"IAD1\",\"IAD135\",\"IAD602\",\"IAD529\",\"IAD155\",\"IAD530\",\"IAD18\",\"IAD525\",\"IAD134\",\"IAD610\",\"IAD605\",\"IAD151\",\"IAD526\",\"IAD158\",\"IAD22\",\"IAD159\",\"IAD528\",\"IAD543\",\"IAD601\",\"IAD65\",\"IAD204\",\"DRC7\"],\"normalizedCityName\":\"Chantilly\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Dulles\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Dulles\",\"coordinates\":\"39.02784,-77.39718\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sterling, Virginia, USA\",\"location\":\"US, VA, Dulles\",\"region\":\"VA\",\"buildingCodeList\":[\"HGJ5\",\"IAD683\",\"IAD183\",\"HCS6\",\"HCS5\",\"AFT3\",\"IAD251\",\"PAR6\",\"HGJ4\",\"IAD614\",\"HSN2\",\"AFT2\"],\"normalizedCityName\":\"Sterling\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD653\",\"IAD28\",\"IAD168\",\"DCA52\",\"IAD547\",\"IAD940\",\"IAD657\",\"IAD21\",\"IAD993\",\"IAD656\",\"IAD769\",\"IAD8\",\"IAD548\",\"IAD736\",\"IAD21R\",\"IAD500\",\"IAD658\",\"IAD990\",\"IAD960\",\"IAD869\",\"IAD545\",\"IAD980\",\"IAD549\",\"IAD166\",\"IAD848\",\"IAD739\",\"IAD651\",\"IAD660\",\"IAD992\",\"IAD655\",\"IAD31\",\"IAD905\",\"IAD654\",\"IAD650\",\"IAD165\",\"IAD991\",\"IAD546\",\"IAD659\",\"IAD652\",\"IAD737\",\"IAD167\"],\"normalizedCityName\":\"Herndon\"}","{\"normalizedStateName\":\"Maryland\",\"normalizedCountryCode\":\"USA\",\"city\":\"Frederick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MD, Frederick\",\"coordinates\":\"39.41574,-77.41203\",\"normalizedCountyName\":\"Frederick\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Frederick, Maryland, USA\",\"location\":\"US, MD, Frederick\",\"region\":\"MD\",\"buildingCodeList\":[\"BWI139\",\"IAD541\",\"BWI111\",\"BWI127\",\"DIW5\",\"BWI144\",\"IAD536\",\"BWI118\",\"IAD533\",\"BWI135\",\"BWI136\",\"BWI126\",\"IAD532\",\"IAD916\",\"BWI110\",\"IAD542\",\"BWI141\",\"BWI143\",\"BWI184\",\"IAD539\",\"BWI138\",\"BWI128\",\"BWI153\",\"BWI100\",\"BWI131\",\"BWI133\",\"BWI148\",\"DFR1\",\"FDK1\",\"IAD534\",\"BWI181\",\"BWI151\",\"IAD245\",\"BWI123\",\"BWI125\",\"IAD538\",\"BWI142\",\"HGR4\",\"BWI113\",\"WFM865\",\"BWI154\",\"DDI1\",\"BWI137\",\"BWI150\",\"BWI117\",\"IAD531\",\"BWI121\",\"BWI116\",\"BWI146\",\"BWI145\",\"BWI130\",\"BWI101\",\"LFDK\",\"BWI124\",\"BWI122\",\"IAD537\",\"BWI112\",\"BWI134\",\"IAD540\",\"BWI147\",\"BWI180\",\"BWI149\",\"BWI132\",\"BWI119\",\"IAD352\",\"BWI152\",\"BWI129\",\"IAD535\"],\"normalizedCityName\":\"Frederick\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Manassas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Manassas\",\"coordinates\":\"38.75125,-77.47086\",\"normalizedCountyName\":\"Manassas (City)\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Manassas, Virginia, USA\",\"location\":\"US, VA, Manassas\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD96\",\"IAD112\",\"IAD100\",\"IAD84\",\"IAD314\",\"IAD46\",\"IAD107\",\"IAD516\",\"IAD75\",\"IAD34\",\"IAD444\",\"IAD43\",\"IAD103\",\"IAD14\",\"IAD598\",\"IAD234\",\"IAD87\",\"IAD322\",\"IAD515\",\"IAD440\",\"IAD38\",\"IAD210\",\"IAD524\",\"IAD216\",\"IAD108\",\"IAD225\",\"DCA73\",\"IAD194\",\"IAD443\",\"IAD35\",\"IAD95\",\"IAD111\",\"IAD445\",\"IAD7\",\"IAD85\",\"IAD224\",\"IAD132\",\"IAD523\",\"IAD47\",\"IAD101\",\"IAD441\",\"IAD104\",\"IAD521\",\"IAD518\",\"IAD73\",\"IAD448\",\"IAD237\",\"IAD106\",\"IAD307\",\"IAD247\",\"IAD20\",\"IAD594\",\"IAD222\",\"IAD45\",\"DCA72\",\"IAD19\",\"IAD442\",\"IAD914\",\"IAD109\",\"IAD110\",\"IAD223\",\"IAD193\",\"MAK7\",\"IAD24\",\"IAD211\",\"DCA080\",\"IAD235\",\"IAD220\",\"HWY120\",\"IAD39\",\"IAD446\",\"IAD102\",\"IAD370\",\"IAD77\",\"IAD131\",\"DCA075\",\"IAD48\",\"IAD612\",\"IAD590\",\"IAD113\",\"IAD49\",\"IAD97\",\"IAD52\",\"IAD944\",\"IAD130\",\"IAD607\",\"DVA5\",\"IAD59\",\"IAD236\",\"IAD447\",\"IAD449\",\"IAD221\",\"IAD218\",\"IAD105\",\"IAD44\",\"IAD520\",\"IAD519\",\"IAD74\",\"IAD11\",\"IAD133\",\"IAD248\",\"IAD517\",\"IAD522\",\"IAD238\",\"IAD846\"],\"normalizedCityName\":\"Manassas\"}"],"normalized_location":"Sterling, Virginia, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"January 27, 2026","preferred_qualifications":"- Can work in cramped spaces or in elevated locations while adhering to health \u0026 safety guidelines\u003cbr/\u003e- Experience dealing effectively with customers during problem resolution and operating efficiently under pressure\u003cbr/\u003e- Experience managing work and priorities through a ticketing system\u003cbr/\u003e- Experience with cabling infrastructure best practices and methodologies\u003cbr/\u003e- Experience working in a data center environment (racking and stacking gear, cable management, hot/cold aisle containment)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MD, Frederick - 29.00 - 52.00 USD hourly\u003cbr/\u003eUSA, VA, Ashburn - 29.00 - 52.00 USD hourly\u003cbr/\u003eUSA, VA, Chantilly - 29.00 - 52.00 USD hourly\u003cbr/\u003eUSA, VA, Dulles - 29.00 - 52.00 USD hourly\u003cbr/\u003eUSA, VA, Herndon - 29.00 - 52.00 USD hourly\u003cbr/\u003eUSA, VA, MANASSAS - 29.00 - 52.00 USD hourly\u003cbr/\u003eUSA, VA, Manassas - 29.00 - 52.00 USD hourly\u003cbr/\u003eUSA, VA, Sterling - 29.00 - 52.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"VA","title":"DCO Tech","university_job":null,"updated_time":"35 minutes","url_next_step":"https://account.amazon.com/jobs/3167700/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Work shifts longer than eight hours in duration\u003cbr/\u003e- 2+ years of practical experience in electrical systems, mechanical systems, HVAC, and/or fire suppression systems\u003cbr/\u003e- Can bend or twist the body into unusual positions while working, use hands to manipulate small wires and objects, walk on job sites in uneven terrain, and work at heights and from ladders","business_category":"aws","city":"Chantilly","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support the operations of some of the world’s most powerful data centers. Our Data Center Engineering Operations team maintain and operate our critical infrastructure systems so that they are prepared to stand up against any situation.\u003cbr/\u003e\u003cbr/\u003eAWS has the world’s largest cloud computing portfolio. As an Amazonian you will work in some of the most sophisticated, safe, and secure data centers in the world. Our Engineering Operations Technicians (EOT’s) help keep them that way by working with the brightest minds from around the globe to help test and implement the newest technology and work practices to meet the demands of a changing market.\u003cbr/\u003e\u003cbr/\u003eWe have a passion for learning and evolving, it’s how we have helped define ourselves as leaders in the industry. Let’s work hard, have fun, and make history!\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003eWork Schedule:\u003cbr/\u003eOur Data Centers operate 24/7 and require on-site presence. This position offers two shift schedule options:\u003cbr/\u003e\u003cbr/\u003eOption 1: Weekend Rotation\u003cbr/\u003e- Days Worked: Sunday - Tuesday, plus every other Saturday\u003cbr/\u003e- Weekly Pattern: Alternates between 3-day and 4-day work weeks\u003cbr/\u003e- Shift Hours: 5:30am - 6:00pm (day shift) OR 5:30pm - 6:00am (night shift)\u003cbr/\u003e\u003cbr/\u003eOption 2: Weekday Rotation\u003cbr/\u003e- Days Worked: Wednesday - Friday, plus every other Saturday\u003cbr/\u003e- Weekly Pattern: Alternates between 3-day and 4-day work weeks\u003cbr/\u003e- Shift Hours: 5:30am - 6:00pm (day shift) OR 5:30pm - 6:00am (night shift)\u003cbr/\u003e\u003cbr/\u003eBoth schedules follow a rotating pattern where you'll work 3 days one week and 4 days the following week.\u003cbr/\u003e\u003cbr/\u003eOvertime \u0026 Pay\u003cbr/\u003e- Overtime: Time and a half after 40 hours per week\u003cbr/\u003e- Night Shift Differential: 13% additional pay (6:00pm - 6:00am shifts)\u003cbr/\u003e- Maximum Hours: 60 hours per week in total (up to 20 hours of overtime)\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e- Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.","department_cost_center":null,"description_short":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support the operations of some of the world’s most powerful data centers.","display_distance":null,"id":"a4f296bc-0fa1-41b0-81cf-88ef74fd6470","id_icims":"3146880","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3146880/data-center-engineering-operations-technician-northern-virginia","job_schedule_type":"full-time","location":"US, VA, Chantilly","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sterling\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Sterling\",\"coordinates\":\"39.03336,-77.40713\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sterling, Virginia, USA\",\"location\":\"US, VA, Sterling\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD603\",\"IAD26\",\"IAD57\",\"IAD403\",\"IAD12\",\"IAD118\",\"IAD72\",\"IAD417\",\"IAD91\",\"IAD10\",\"IAD116\",\"IAD121\",\"IAD181\",\"IAD415\",\"IAD149\",\"IAD62\",\"IAD140\",\"IAD176\",\"IAD229\",\"IAD661\",\"IAD128\",\"IAD147\",\"IAD33\",\"IAD405\",\"IAD613\",\"IAD213\",\"IAD232\",\"IAD588\",\"IAD93\",\"IAD226\",\"IAD190\",\"IAD79\",\"IAD81\",\"IAD256\",\"IAD160\",\"IAD191\",\"IAD409\",\"IAD83\",\"IAD389\",\"IAD255\",\"IAD412\",\"IAD143\",\"IAD16\",\"IAD129\",\"IAD123\",\"OSU69\",\"IAD231\",\"IAD15\",\"IAD92\",\"IAD98\",\"IAD230\",\"IAD139\",\"IAD180\",\"IAD419\",\"IAD413\",\"IAD574\",\"IAD142\",\"IAD88\",\"IAD388\",\"IAD69\",\"IAD82\",\"IAD681\",\"IAD662\",\"IAD246\",\"IAD90\",\"IAD418\",\"IAD182\",\"IAD148\",\"IAD56\",\"IAD117\",\"IAD119\",\"IAD89\",\"IAD404\",\"IAD146\",\"IAD285\",\"IAD68\",\"IAD163\",\"IAD414\",\"IAD228\",\"IAD122\",\"IAD141\",\"IAD175\",\"IAD402\",\"IAD144\",\"IAD58\",\"WAS30\",\"IAD408\",\"IAD99\",\"IAD257\",\"IAD609\",\"DDC4\",\"IAD587\",\"IAD17\",\"IAD411\",\"IAD586\",\"IAD244\",\"IAD258\",\"IAD407\",\"IAD32\",\"IAD192\",\"IAD51\",\"BWI1\",\"IAD76\",\"IAD145\",\"IAD259\",\"IAD571\",\"IAD214\",\"IAD406\",\"IAD416\",\"IAD410\",\"IAD164\",\"IAD608\",\"IAD243\",\"IAD120\",\"IAD920\"],\"normalizedCityName\":\"Sterling\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Ashburn\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Ashburn\",\"coordinates\":\"39.05232,-77.4827\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Ashburn, Virginia, USA\",\"location\":\"US, VA, Ashburn\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD438\",\"IAD424\",\"IAD470\",\"LAB1\",\"IAD496\",\"IAD426\",\"IAD420\",\"IAD200\",\"IAD23\",\"IAD436\",\"IAD215\",\"IAD115\",\"IAD434\",\"IAD179\",\"IAD60\",\"IAD435\",\"IAD66\",\"WFM534\",\"IAD498\",\"IAD290\",\"IAD50\",\"IAD611\",\"IAD425\",\"IAD847\",\"IAD80\",\"IAD169\",\"IAD685\",\"IAD138\",\"IAD499\",\"IAD254\",\"IAD2\",\"IAD423\",\"IAD437\",\"IAD174\",\"IAD497\",\"IAD427\",\"IAD6\",\"IAD13\",\"IAD421\",\"WAS36\",\"IAD162\",\"IAD606\",\"IAD439\",\"IAD433\",\"IAD430\",\"IAD67\",\"IAD202\",\"IAD177\",\"IAD432\",\"IAD71\",\"IAD54\",\"IAD431\",\"IAD429\",\"IAD114\",\"IAD161\",\"IAD05\",\"IAD422\",\"IAD78\",\"IAD428\"],\"normalizedCityName\":\"Ashburn\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Chantilly\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Chantilly\",\"coordinates\":\"38.88675,-77.43892\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Chantilly, Virginia, USA\",\"location\":\"US, VA, Chantilly\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD530\",\"IAD544\",\"IAD37\",\"IAD600\",\"IAD18\",\"IAD527\",\"IAD9\",\"IAD525\",\"IAD134\",\"IAD156\",\"IAD610\",\"IAD605\",\"IAD604\",\"IAD738\",\"IAD151\",\"IAD526\",\"IAD158\",\"IAD152\",\"IAD63\",\"IAD22\",\"IAD159\",\"IAD528\",\"IAD543\",\"IAD601\",\"IAD157\",\"IAD150\",\"IAD86\",\"IAD65\",\"IAD203\",\"IAD61\",\"IAD1\",\"IAD135\",\"IAD204\",\"IAD602\",\"DRC7\",\"IAD529\",\"IAD155\"],\"normalizedCityName\":\"Chantilly\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Dulles\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Dulles\",\"coordinates\":\"39.02784,-77.39718\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sterling, Virginia, USA\",\"location\":\"US, VA, Dulles\",\"region\":\"VA\",\"buildingCodeList\":[\"HCS5\",\"AFT3\",\"IAD251\",\"PAR6\",\"HGJ5\",\"HGJ4\",\"IAD614\",\"IAD683\",\"HSN2\",\"IAD183\",\"AFT2\",\"HCS6\"],\"normalizedCityName\":\"Sterling\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD653\",\"IAD28\",\"IAD168\",\"DCA52\",\"IAD549\",\"IAD166\",\"IAD547\",\"IAD651\",\"IAD657\",\"IAD660\",\"IAD992\",\"IAD21\",\"IAD993\",\"IAD656\",\"IAD655\",\"IAD8\",\"IAD31\",\"IAD548\",\"IAD21R\",\"IAD654\",\"IAD650\",\"IAD165\",\"IAD991\",\"IAD500\",\"IAD658\",\"IAD546\",\"IAD990\",\"IAD659\",\"IAD652\",\"IAD545\",\"IAD167\"],\"normalizedCityName\":\"Herndon\"}","{\"normalizedStateName\":\"Maryland\",\"normalizedCountryCode\":\"USA\",\"city\":\"Frederick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MD, Frederick\",\"coordinates\":\"39.41574,-77.41203\",\"normalizedCountyName\":\"Frederick\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Frederick, Maryland, USA\",\"location\":\"US, MD, Frederick\",\"region\":\"MD\",\"buildingCodeList\":[\"IAD542\"],\"normalizedCityName\":\"Frederick\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Manassas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Manassas\",\"coordinates\":\"38.75125,-77.47086\",\"normalizedCountyName\":\"Manassas (City)\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Manassas, Virginia, USA\",\"location\":\"US, VA, Manassas\",\"region\":\"VA\",\"buildingCodeList\":[\"DCA72\",\"IAD96\",\"IAD19\",\"IAD112\",\"IAD100\",\"IAD84\",\"IAD442\",\"IAD914\",\"IAD109\",\"IAD314\",\"IAD46\",\"IAD110\",\"IAD107\",\"IAD223\",\"IAD193\",\"MAK7\",\"IAD516\",\"IAD24\",\"IAD211\",\"DCA080\",\"IAD75\",\"IAD34\",\"IAD444\",\"IAD235\",\"IAD43\",\"IAD220\",\"HWY120\",\"IAD103\",\"IAD14\",\"IAD39\",\"IAD598\",\"IAD234\",\"IAD87\",\"IAD322\",\"IAD446\",\"IAD515\",\"IAD440\",\"IAD38\",\"IAD102\",\"IAD210\",\"IAD524\",\"IAD216\",\"IAD108\",\"IAD370\",\"IAD77\",\"IAD225\",\"IAD131\",\"DCA73\",\"IAD194\",\"IAD48\",\"IAD443\",\"IAD35\",\"IAD612\",\"IAD590\",\"IAD113\",\"IAD49\",\"IAD97\",\"IAD52\",\"IAD944\",\"IAD95\",\"IAD111\",\"IAD445\",\"IAD7\",\"IAD130\",\"IAD85\",\"IAD224\",\"IAD132\",\"IAD607\",\"IAD523\",\"IAD47\",\"IAD101\",\"DVA5\",\"IAD59\",\"IAD236\",\"IAD447\",\"IAD441\",\"IAD449\",\"IAD104\",\"IAD221\",\"IAD521\",\"IAD518\",\"IAD218\",\"IAD105\",\"IAD44\",\"IAD520\",\"IAD519\",\"IAD74\",\"IAD11\",\"IAD73\",\"IAD133\",\"IAD448\",\"IAD237\",\"IAD248\",\"IAD517\",\"IAD106\",\"IAD522\",\"IAD307\",\"IAD238\",\"IAD846\",\"IAD247\",\"IAD20\",\"IAD594\",\"IAD222\",\"IAD45\"],\"normalizedCityName\":\"Manassas\"}"],"normalized_location":"Chantilly, Virginia, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"December 19, 2025","preferred_qualifications":"- Knowledge of network design and layout as well as low voltage (copper/ fiber) cabling\u003cbr/\u003e- Experience in data center engineering\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $68,300/year in our lowest geographic market up to $152,700/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"VA","title":"Data Center Engineering Operations Technician - Northern Virginia","university_job":null,"updated_time":"35 minutes","url_next_step":"https://account.amazon.com/jobs/3146880/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Knowledge of at least one modern programming language such as C, C++, Java, or Perl\u003cbr/\u003e- Experience programming with at least one modern language such as C++, C#, Java, Python, Golang, PowerShell, Ruby\u003cbr/\u003e- Experience tools for automation (building, testing, releasing or monitoring)\u003cbr/\u003e- 1+ years of DevOps or SysOps in a large-scale software development environment experience","business_category":"retail","city":"Bengaluru","company_name":"ADCI - Tamil Nadu","country_code":"IND","description":"AEE (Amazon Exports \u0026 Expansion) Tech builds and tests technology that brings Amazon footprint to new countries by offering Best- At- Amazon with undeniable delivery experience, selection and convenience localized for our customers. We enable Amazon to new international marketplaces and give an opportunity for consumers in new geographies to find, discover, and buy anything online and for local and international sellers to choose Amazon as an indispensable channel for their products. We support emerging marketplace business to grow bigger as well. Country expansion and global store launches along with Exports is essential to the global success of Amazon as a whole. This would be a great opportunity to be part of this exciting journey!\r\u003cbr/\u003e\r\u003cbr/\u003eWe're looking for a Systems Development Engineer to own deployments, automation, scaling, and solving operations with software across our platforms. This will include identifying and resolving issues, automating and improving repetitive processes, and working closely with the development team to identify operational needs. You will become intimately familiar with the architecture of our systems, and be responsible for diving deep into code, while developing solutions for our customers and services. You’ll drive prioritization of operational issues, and drive automation design \u0026 scaling requirements in support of the wider organization. You will get the opportunity to work closely with a great team of software developers who will help you grow (and also learn things from you).","department_cost_center":null,"description_short":"AEE (Amazon Exports \u0026 Expansion) Tech builds and tests technology that brings Amazon footprint to new countries by offering Best- At- Amazon with undeniable delivery experience, selection and convenience","display_distance":null,"id":"182b8bf0-3fbe-44d1-abf9-b0b0ee6cf15a","id_icims":"3156848","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"System Development Engineering","job_function_id":null,"job_path":"/en/jobs/3156848/system-development-engineer-cross-border-shopping","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR22\"],\"normalizedCityName\":\"Bengaluru\"}","{\"normalizedStateName\":\"Tamil Nadu\",\"normalizedCountryCode\":\"IND\",\"city\":\"Chennai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TN, Chennai\",\"coordinates\":\"13.08404,80.28274\",\"normalizedCountyName\":\"Chennai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Chennai, Tamil Nadu, IND\",\"location\":\"IN, TN, Chennai\",\"region\":\"TN\",\"buildingCodeList\":[\"MAA15\"],\"normalizedCityName\":\"Chennai\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"January 12, 2026","preferred_qualifications":"- Knowledge of and proficiency in the use of Python scripting language\u003cbr/\u003e- Experience on highly concurrent, high throughput systems and knowledge of complex distributed systems\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"retail.no-team-listed","source_system":"JobCreator","state":"KA","title":"System Development Engineer, Cross Border Shopping","university_job":null,"updated_time":"42 minutes","url_next_step":"https://account.amazon.com/jobs/3156848/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}