{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 6+ years of program or project management experience\u003cbr/\u003e- Experience using data and metrics to determine and drive improvements\u003cbr/\u003e- Experience owning program strategy, end to end delivery, and communicating results to senior leadership","business_category":"retail","city":"Cairo","company_name":"Souq.com for E-Commerce LLC","country_code":"EGY","description":"Amazon.com strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online.\u003cbr/\u003eAmazon strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online. By giving customers more of what they want – low prices, vast selection, and convenience – Amazon continues to grow and evolve as a world-class e-commerce platform. \u003cbr/\u003e\u003cbr/\u003eMENA Consumables team  is looking for a high caliber Senior Program Manager to deliver results through key growth initiatives and programs by: (i) driving alignment and coordination between multiple international business and technology teams in order to achieve the desired outcome in the fastest possible time-frame; (ii) ensuring partner teams are organized to hit their goals and (iii) escalating or proposing innovative ways to accelerate projects when these are slowed down by internal or external factors.\u003cbr/\u003e\u003cbr/\u003eThe team is seeking an experienced program leader to build scalable processes and frameworks to drive the customer facing programs. You will define high quality program roadmap based on business strategy and voice of customer. Manage a cross-functional process to translate the desired customer experience into a program roadmap. Create mechanisms with internal and external stakeholders. You will also build and execute go-to-market plans for new programs and features working closely with marketing, sales and other product teams to help drive adoption. You will apply both business and technical acumen in a fast-paced, ambiguous, and innovative environment. Our ideal teammate possesses a natural curiosity, sharp analytical skills and is excited to pioneer on behalf of customers.","department_cost_center":null,"description_short":"Amazon.com strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online.Amazon strives to be Earth's most customer-centric company where","display_distance":null,"id":"ea5c892f-4e4b-40dd-bd5a-4f0d6fab8aad","id_icims":"3153050","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Program Management","job_function_id":null,"job_path":"/en/jobs/3153050/sr-program-manager-cl-programs","job_schedule_type":"full-time","location":"EG, Cairo","locations":["{\"normalizedCountryCode\":\"EGY\",\"city\":\"Cairo\",\"countryIso3a\":\"EGY\",\"countryIso2a\":\"EG\",\"locationNonStemming\":\"Egypt, Cairo\",\"coordinates\":\"30.04427,31.23525\",\"normalizedCountyName\":\"Cairo\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Egypt\",\"normalizedLocation\":\"Cairo, EGY\",\"location\":\"EG, Cairo\",\"region\":\"\",\"buildingCodeList\":[\"CAI14\"],\"normalizedCityName\":\"Cairo\"}"],"normalized_location":"Cairo, EGY","optional_search_labels":["global-corporate.team-aet"],"posted_date":"January  6, 2026","preferred_qualifications":"- 3+ years of driving process improvements experience\u003cbr/\u003e- Master's degree, or MBA in business, operations, human resources, adult education, organizational development, instructional design or related field\u003cbr/\u003e- Experience working in a matrixed organization\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"retail.team-consumables","source_system":"JobCreator","state":null,"title":"Sr Program Manager, CL Programs","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3153050/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-consumables","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Technology related sales or business development experience\u003cbr/\u003e- Ability to build and deliver against a plan for your territory which meets or exceeds revenue targets\u003cbr/\u003e- Passion for helping startups grow\u003cbr/\u003e- Entrepreneurial “builder” mentality\u003cbr/\u003e- Excellent French \u0026 English verbal and written communication skills\u003cbr/\u003e- Comfortable delivering results amid ambiguity and change","business_category":"aws","city":"Courbevoie","company_name":"AWS EMEA SARL (France Branch)","country_code":"FRA","description":"As an Account Manager you will help drive the growth of startups, serving their unique needs, engaging with Founders, CxOs, Board of Directors and VC influencers, and teaming with business development, marketing, solution architecture and partner teams to lead execution of coordinated go-to-market strategies.\u003cbr/\u003e\u003cbr/\u003eIn this role, you will also establish Amazon Web Services as the key cloud technology provider across the companies you manage, promoting the entire AWS products and services portfolio to Startup Customers. You will be at the heart of latest trends like GenAI and you will help your customers to leverage state-of-the-art technologies on AWS to innovate and become the next disrupters. \u003cbr/\u003e\u003cbr/\u003eDo you look around corners for ways to engage and service customers? Are you passionate about startups? Come build the future with us.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e - Successfully work in a large scale environment, and strategically impact a diverse customer portfolio.\u003cbr/\u003e - Accelerate the adoption of AWS services in a defined territory with an ultimate goal of meeting or exceeding quarterly revenue targets and defined goals.\u003cbr/\u003e - Develop and execute a territory plan to drives account growth.\u003cbr/\u003e - Maintain a robust customer pipeline while continuously maintaining high closing rates.\u003cbr/\u003e - Develop long-term strategic relationships with key stakeholders at all levels of the customer organization.\u003cbr/\u003e - Collaborate with AWS resources (Solution Architects, Business Development, Marketing, Partners, Support, and Service teams) to support customer interests, and further drive solution adoption.\u003cbr/\u003e - Expect moderate travel\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\t\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\t\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\t\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\t\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e","department_cost_center":null,"description_short":"As an Account Manager you will help drive the growth of startups, serving their unique needs, engaging with Founders, CxOs, Board of Directors and VC influencers, and teaming with business development,","display_distance":null,"id":"e122c255-15f8-436f-aa5e-9b8bf1212a60","id_icims":"3179592","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Tech Sales","job_function_id":null,"job_path":"/en/jobs/3179592/account-manager-startup-greenfield-startup-team-france","job_schedule_type":"full-time","location":"FR, Courbevoie","locations":["{\"normalizedStateName\":\"Ile-de-France\",\"normalizedCountryCode\":\"FRA\",\"city\":\"Courbevoie\",\"countryIso3a\":\"FRA\",\"countryIso2a\":\"FR\",\"locationNonStemming\":\"France, Courbevoie\",\"coordinates\":\"48.89617,2.25648\",\"normalizedCountyName\":\"Hauts-de-Seine\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"France\",\"normalizedLocation\":\"Courbevoie, Ile-de-France, FRA\",\"location\":\"FR, Courbevoie\",\"region\":\"\",\"buildingCodeList\":[\"CDG11\"],\"normalizedCityName\":\"Courbevoie\"}"],"normalized_location":"Courbevoie, Ile-de-France, FRA","optional_search_labels":["aws.team-startupbd","aws.team-sus-startups-optional"],"posted_date":"February 12, 2026","preferred_qualifications":"- A technical background in engineering, computer science, or MIS a plus\u003cbr/\u003e- Knowledge of French start-up ecosystem\u003cbr/\u003e- Extensive customer network throughout France is a plus.\u003cbr/\u003e\u003cbr/\u003eAmazon est un employeur engagé pour l'égalité des chances. Nous sommes convaincus qu'une main d'oeuvre diversifée est essentielle à notre réussite. Nous prenons nos décisions de recrutement en fonction de votre expérience et de vos compétences. Nous apprécions votre envie de découvrir, d'inventer, de simplifier et de construire. La protection de votre vie privée et la sécurité de vos données constituent depuis longtemps une priorité absolue pour Amazon. Veuillez consulter notre Politique de Confidentialité pour en savoir plus sur la façon dont nous collectons, utilisons et traitons les données personnelles de nos candidats.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-sales-primary","source_system":"JobCreator","state":null,"title":"Account Manager Startup, Greenfield Startup Team, France","university_job":null,"updated_time":"19 minutes","url_next_step":"https://account.amazon.com/jobs/3179592/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sales-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Professional software/system development experience (non-internship).\u003cbr/\u003e- Experience with designing and creating architecture for scalable systems using modern software design patterns.\u003cbr/\u003e- Proficiency in at least one Object-Oriented programming (OOP) language; C++, C#, Java, Python,  Ruby, etc,. Ideally CODESYS on top of it, providing that otherwise there is interest in learning CODESYS.\u003cbr/\u003e- Strong problem-solving and troubleshooting abilities of Robotics/Controls systems, we are a hands on team.\u003cbr/\u003e- Excellent communication skills across diverse cultural contexts, we operate across 3 continents and more than 7 countries.\u003cbr/\u003e- Willingness to travel up to 30% accordingly with business needs.\u003cbr/\u003e- Good writing skills, we need to document our software designs.","business_category":"amazon-business","city":"Madrid","company_name":"Amazon EU SARL (Spain Branch)","country_code":"ESP","description":"We are calling Senior Engineers; Robotics Software Engineers, Controls System Development Engineers or Firmware Engineers to join our In-House Controls team within World-Wide Central Engineering. This global role requires a dynamic individual eager to travel and lead the deployment of cutting-edge robotics automation solutions across our international network. The ideal candidate will have a continuous improvement mindset, demonstrate Bias for Action, and be prepared to lead robotics software development. \u003cbr/\u003e\u003cbr/\u003eThis role is open across multiple locations in Europe within both Corporate and Field organizations, including London, Berlin, Luxembourg , Milan, Paris and Madrid. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur In-House Controls (IHC) team within World-Wide Central Engineering develops, deploys, and scales automated solutions globally. We deliver pioneering solutions that integrate seamlessly into existing and new facilities worldwide. IHC will develop and deploy the software for all future WW AMZL automation, from software design through to commissioning and deployment and operational on-call support. In this critical role, you'll straddle the cutting-edge worlds of robotics, software, and Amazon Logistics. \u003cbr/\u003e\u003cbr/\u003eThe key benefits of our approach include:\u003cbr/\u003e• Standardized, integrator-agnostic control systems for all AMZL automation, reducing the requirement to develop and maintain bespoke solutions for each piece of automation. We are breaking industry paradigms that every PLC based controls solution machine has a unique software.\u003cbr/\u003e• Control of development, deployment, fault finding and future upgrades, removing dependency on external third party.\u003cbr/\u003e• Generation of data and metrics to drive future improvements, removing dependency on vendors and ensuring comprehensive data collection. Leveraging Amazon AWS features and tools to improve our solutions. ","department_cost_center":null,"description_short":"We are calling Senior Engineers; Robotics Software Engineers, Controls System Development Engineers or Firmware Engineers to join our In-House Controls team within World-Wide Central Engineering. This","display_distance":null,"id":"a754bce0-9239-4167-b43d-af13a76f88d5","id_icims":"3177712","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"System Development Engineering","job_function_id":null,"job_path":"/en/jobs/3177712/sr-systems-development-engineer-in-house-controls-world-wide-central-engineering","job_schedule_type":"full-time","location":"ES, M, Madrid","locations":["{\"normalizedStateName\":\"Community of Madrid\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Madrid\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, M, Madrid\",\"coordinates\":\"40.42024,-3.68755\",\"normalizedCountyName\":\"Madrid\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Madrid, Community of Madrid, ESP\",\"location\":\"ES, M, Madrid\",\"region\":\"M\",\"buildingCodeList\":[\"MAD12\"],\"normalizedCityName\":\"Madrid\"}"],"normalized_location":"Madrid, Community of Madrid, ESP","optional_search_labels":[],"posted_date":"February 10, 2026","preferred_qualifications":"- Bachelor's degree in Computer Science or equivalent.\u003cbr/\u003e- Experience with CODESYS development environment\u003cbr/\u003e- Demonstrated track record of success in a science or engineering field, evidenced by outstanding projects, innovations, or advanced problem-solving.\u003cbr/\u003e- Experience with full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations\u003cbr/\u003e- Experience with building IOT solutions\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-business.team-consumer-3p-job-posting","source_system":"JobCreator","state":"M","title":"Sr. Systems Development Engineer,  In-House Controls, World-Wide Central Engineering","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3177712/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-consumer-3p-job-posting","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 社会人経験（業界は問わず） ・業務または工程の改善経験（規模の大小は問わず） ・エクセル初級レベル（四則演算/SUM関数ができる） ・ビジネスレベルの日本語力","business_category":"transportation-and-logistics","city":"Saitama","company_name":"Amazon Japan G.K.","country_code":"JPN","description":"*こちらは埼玉県三郷市にある物流拠点での勤務となります。\u003cbr/\u003e\u003cbr/\u003e私たちは数億という膨大な商品を取り扱っており、多くのサプライヤーから入荷したアイテムはフルフィルメントセンターという物流拠点に集約され、各地のデリバリーステーション（配送拠点）を経てお客様先に届けられます。\u003cbr/\u003e\u003cbr/\u003e現在Amazonの配送拠点であるデリバリーステーションはお客様に更に便利をお届けする物流網の強化のため全国に拡大中です。\u003cbr/\u003e\u003cbr/\u003e配送拠点では様々な業界出身（小売・飲食、営業、製造業など）のメンバーが多く活躍しており、メンバー一丸となってミッション達成の為取り組んでいます。\u003cbr/\u003e\u003cbr/\u003eAmazonの重要拠点で物流を進化させる新規ビジネスに携わる。\u003cbr/\u003eそんな挑みがいのあるミッションに、あなたの経験を活かしてみませんか。\u003cbr/\u003e\u003cbr/\u003e【業務内容】\u003cbr/\u003e作成された日々の計画に沿って、作業工程が計画通りに円滑に進むようサポートを行います。\u003cbr/\u003e･社内ツールを使った生産管理（進捗管理）業務\u003cbr/\u003e･チームメンバーと一緒に現場の課題に対し改善プランの策定、実行\u003cbr/\u003e･安全・品質・作業効率の向上に向けたプロジェクトの立案および推進\u003cbr/\u003e･標準作業手順書（SOP）の作成や業務標準化の推進\u003cbr/\u003e\u003cbr/\u003e*マネージャーやチームのサポートのもと上記業務を行っていただきます\u003cbr/\u003e*デリバリーステーション内での配送を通して、物流の仕組みやマネージメントを学べます。\u003cbr/\u003e*マネージャーへのキャリアアップや社内公募による他部署への異動のチャンスもあります。\u003cbr/\u003e*勤務はシフト制となります（夜勤有）\u003cbr/\u003e\u003cbr/\u003e本ポジションの所属部門等に関する詳細は、下記リンク先をご参照ください。\u003cbr/\u003e本ポジションの所属部門等に関する詳細は、下記リンク先をご参照ください。\u003cbr/\u003e======================\u003cbr/\u003e関連情報\u003cbr/\u003e・所属部門:\u003ca href=\"https://www.amazon.co.jp/b?node=5637343051\"\u003eラストマイル(AMZL)\u003c/a\u003e\u003cbr/\u003e・職種:\u003ca href=\"https://www.amazon.co.jp/b?node=5609898051\"\u003eオペレーション\u003c/a\u003e\u003cbr/\u003e・勤務地:\u003ca href=\"https://www.amazon.co.jp/b?node=8521082051\"\u003e関東エリアDS\u003c/a\u003e\u003cbr/\u003e・シフトアシスタント職についてもっと知りたい場合は\u003ca href=\"https://www.amazon.co.jp/career/pasa\"\u003eこちら\u003c/a\u003e\u003cbr/\u003e======================\u003cbr/\u003e\u003cbr/\u003e※Amazon は多様かつインクルーシブな職場づくりを目指しています。Amazonは男女雇用機会均等法を順守しています。人種、 出身国、性別、性的指向、障がい、年齢、その他の属性によって差別することなく、平等に採用選考の機会を提供しています。障がいをお持ちの方は、以下をご覧ください。https://www.amazon.jobs/disability/jp\u003cbr/\u003e\u003cbr/\u003e\u003ca href=\"https://www.amazon.co.jp/career/DEI\"\u003eオペレーション部門のDEIの取り組み（Japanese Only）\u003c/a\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"*こちらは埼玉県三郷市にある物流拠点での勤務となります。私たちは数億という膨大な商品を取り扱っており、多くのサプライヤーから入荷したアイテムはフルフィルメントセンターという物流拠点に集約され、各地のデリバリーステーション（配送拠点）を経てお客様先に届けられます。現在Amazonの配送拠点であるデリバリーステーションはお客様に更に便利をお届けする物流網の強化のため全国に拡大中です。配送拠点では様々な業界出身（小売・飲食、営業、製造業など）のメンバーが多く活躍しており、メンバー一丸となってミッション達成の為取り組んでいます。Amazonの重要拠点で物流を進化させる新規ビジネスに携わる。そんな挑みが","display_distance":null,"id":"7da8e66b-4e66-4d4b-beaf-80403435432f","id_icims":"3111188","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3111188/amzl","job_schedule_type":"full-time","location":"JP, 11, Saitama","locations":["{\"normalizedStateName\":\"Saitama\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Saitama\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, 11, Saitama\",\"coordinates\":\"35.85721,139.64902\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Saitama, JPN\",\"location\":\"JP, 11, Saitama\",\"region\":\"11\",\"buildingCodeList\":[\"DEJ5\"]}"],"normalized_location":"Saitama, JPN","optional_search_labels":[],"posted_date":"October 17, 2025","preferred_qualifications":"- ピープルマネジメント経験（アルバイトでも可） ・様々な世代とのコミュニケーション経験 ・エクセル中級レベル以上（VLOOKUP、ピボット、マクロ等） ・チームワークを重視し、チームプレーのための気配りができる方 ・向上心があり、今よりも成長したいという熱意がある方 ・臨機応変に行動し、理論的に物事の判断ができる方 ・インクルーシブなカルチャーへの貢献や多様性に富んだグループで働くことに対して前向きであること 【給与情報】 月額基本給 306,000 円以上（年俸を12分割支給） 時間外労働手当、深夜勤務手当、法定休日勤務手当分は労働時間に応じて支給される。 ※能力、資格、経歴、経験等を考慮し、面接後に最終決定 　 Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-fulfillment-transportation","source_system":"JobCreator","state":"11","title":"シフトアシスタント, AMZL","university_job":null,"updated_time":"21 minutes","url_next_step":"https://account.amazon.com/jobs/3111188/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-transportation","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of investigating the feasibility of applying scientific principles and concepts to business problems and products experience\u003cbr/\u003e- PhD, or Master's degree and 5+ years of quantitative field research experience\u003cbr/\u003e- Experience with big data technologies such as AWS, Hadoop, Spark, Pig, Hive etc.\u003cbr/\u003e- Experience communicating qualitative research methods and findings to non-qualitative researchers","business_category":"transportation-and-logistics","city":"Bangalore","company_name":"ADCI - Karnataka","country_code":"IND","description":"Have you ever ordered a product on Amazon and when that box with the smile arrived you wondered how it got to you so fast? Have you wondered where it came from and how much it cost Amazon to deliver it to you? If so, the WW Amazon Logistics, Business Analytics team is for you. We manage the delivery of tens of millions of products every week to Amazon’s customers, achieving on-time delivery in a cost-effective manner.\u003cbr/\u003e \u003cbr/\u003eWe are looking for an enthusiastic, customer obsessed, Sr. Applied Scientist with good analytical skills to help manage projects and operations, implement scheduling solutions, improve metrics, and develop scalable processes and tools. The primary role of an Operations Research Scientist within Amazon is to address business challenges through building a compelling case, and using data to influence change across the organization. This individual will be given responsibility on their first day to own those business challenges and the autonomy to think strategically and make data driven decisions. Decisions and tools made in this role will have significant impact to the customer experience, as it will have a major impact on how the final phase of delivery is done at Amazon.\u003cbr/\u003e \u003cbr/\u003eIdeal candidates will be a high potential, strategic and analytic graduate with a PhD in (Operations Research, Statistics, Engineering, and Supply Chain) ready for challenging opportunities in the core of our world class operations space. Great candidates have a history of operations research, and the ability to use data and research to make changes.\u003cbr/\u003e \u003cbr/\u003eThis role requires robust program management skills and research science skills in order to act on research outcomes. This individual will need to be able to work with a team, but also be comfortable making decisions independently, in what is often times an ambiguous environment.\u003cbr/\u003e\u003cbr/\u003eResponsibilities may include:\u003cbr/\u003e - Develop input and assumptions based preexisting models to estimate the costs and savings opportunities associated with varying levels of network growth and operations\u003cbr/\u003e - Creating metrics to measure business performance, identify root causes and trends, and prescribe action plans\u003cbr/\u003e - Managing multiple projects simultaneously\u003cbr/\u003e - Working with technology teams and product managers to develop new tools and systems to support the growth of the business\u003cbr/\u003e - Communicating with and supporting various internal stakeholders and external audiences","department_cost_center":null,"description_short":"Have you ever ordered a product on Amazon and when that box with the smile arrived you wondered how it got to you so fast? Have you wondered where it came from and how much it cost Amazon to deliver it","display_distance":null,"id":"dea94fff-b0fd-4a0a-8af9-fa4ca2ac9d49","id_icims":"3126640","is_intern":null,"is_manager":null,"job_category":"Research Science","job_family":"Research Science","job_function_id":null,"job_path":"/en/jobs/3126640/sr-research-scientist-last-mile-science","job_schedule_type":"full-time","location":"IN, KA, Bangalore","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bangalore\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bangalore\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bangalore\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR262\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":["amazon.artificial-intelligence"],"posted_date":"November 14, 2025","preferred_qualifications":"- Experience converting research studies into tangible real-world changes\u003cbr/\u003e- Experience with discrete and continuous optimization methodologies and algorithms\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-last-mile-delivery-tech","source_system":"JobCreator","state":"KA","title":"Sr. Research Scientist, Last Mile Science","university_job":null,"updated_time":"35 minutes","url_next_step":"https://account.amazon.com/jobs/3126640/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-delivery-tech","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Abgeschlossene technische Berufsausbildung, anerkannt durch die Industrie- und Handelskammer (IHK) oder Handwerkskammer (HWK) oder Nachweis eines erfolgreich abgeschlossen Hochschulstudium im Ingenieurwissenschaftlichen Bereich (Maschinenbau / Elektrotechnik oder artverwandt) einer deutschen Hochschule oder anerkannte ausländische Hochschulabschlüsse (BA, B. Sc., MA, M. Sc., Dipl.-Ing.)\u003cbr/\u003e- Mindestens zweijährige Berufserfahrung in dem entsprechenden Handwerk\u003cbr/\u003e- Erfahrung in der Instandhaltung von industriellen Produktionsanlagen\u003cbr/\u003e- Fortgeschrittene Deutschkenntnisse in Wort und Schrift","business_category":"fulfillment-ops","city":"Frankenthal","company_name":"Amazon Logistik Frankenthal GmbH","country_code":"DEU","description":"Das Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) ist für unseren Betrieb von fundamentaler Bedeutung – es sorgt dafür, dass unsere technischen Systeme und Anlagen laufend funktionieren. Als Instandhaltungstechniker:in bist Du für die Wartung und Instandhaltung unserer förder- und haustechnischen Anlagen sowie Produktionsanlagen zuständig. Du hilfst, die höchsten Sicherheitsstandards im Arbeitsschutz zu gewährleisten und Maschinenausfallzeiten zu verhindern. Unser technisches Team stellt eine hohe Verfügbarkeit der technischen Anlagen sicher und verbessert die Qualität unserer Geräte.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Ausführung präventiver Wartungsmaßnahmen an einer breiten Vielfalt von Geräten an unseren Standorten\u003cbr/\u003e- Durchführung von Reparaturen und Fehlerdiagnosen\u003cbr/\u003e- Verwendung neuester Tools zur Maximierung der Geräteeffektivität\u003cbr/\u003e- Einhaltung aller Arbeitsschutzrichtlinien und -praktiken \u003cbr/\u003e- Unterstützung der Entwicklung und des beruflichen Fortschritts von Auszubildenden am Standort\u003cbr/\u003e- Arbeit an Projekten zur kontinuierlichen Verbesserung und Einführung von Best Practices an verschiedenen EU-Standorten\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAls Instandhaltungstechniker:in bist Du vor Ort in einem unserer Logistikzentren tätig, um schnell auf technische Störungen reagieren zu können. Du führst eine Reihe geplanter präventiver Wartungsmaßnahmen an Geräten durch, um für ihren sicheren Betrieb zu sorgen. Außerdem reagierst Du als Instandhaltungstechniker:in unverzüglich auf Störungen und Ausfälle. Du untersuchst die Ursachen, findest so schnell wie möglich Lösungen und wendest sie an.  Zudem machst Du Vorschläge für langfristige Verbesserungen.\u003cbr/\u003eIn Zusammenarbeit mit leitenden Kolleg:innen nimmst Du tägliche Wartungsaufgaben wahr und kommunizierst mit Dienstleistern, falls Du externe Expertise benötigst. Du arbeitest in rotierenden Schichten, damit wir rund um die Uhr unsere Standorte unterstützen – und dafür sorgen, dass Amazon weiterhin in dem Tempo liefern kann, für das wir bekannt sind. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eUnser Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) sorgt dafür, dass unsere Geräte und Ausstattung jederzeit optimal funktionieren. Wir sind ein Team von Techniker:innen und Ingenieur:innen, das aus hervorragenden Teamplayern besteht und von erfahrenen Führungskräften geleitet wird. Wir arbeiten gemeinsam daran, die Geräte in unserem gesamten globalen Netzwerk von Fulfillment-Centern zu warten, zu reparieren und ihre Fehler zu beheben. Einige unserer Mitarbeiter:innen sind Führungskräfte, die das Team bei der Arbeit an spannender, innovativer Technologie beaufsichtigen – die es teilweise nur bei Amazon gibt. Von der Installation automatisierter Verpackungssysteme bis hin zur Beaufsichtigung der allgemeinen Wartungsarbeiten eines Standorts sowie der Reparatur von für den Vertrieb wesentlichen Geräten wickelt unser Team einen Großteil der technischen Aufgaben bei Amazon ab. Unter anderem sorgt es auch dafür, dass Gebäude weiterhin den rechtlichen Auflagen entsprechen, damit alle sicher bleiben und unsere Standorte mit maximaler Effizienz betrieben werden. Es gibt zahlreiche Aufstiegschancen im RME-Team selbst ebenso wie im gesamten Amazon-Unternehmen. Alle unsere Aktivitäten sind darauf ausgerichtet, die Ausfallzeiten an Amazons wichtigsten Betriebsstandorten zu reduzieren, damit Kund:innen ihre Bestellungen rechtzeitig erhalten. Oft arbeiten wir früh morgens, spät abends oder in der Nachtschicht, um Wartungsarbeiten mit den geringstmöglichen Störungen vorzunehmen. Falls wir eine bessere Möglichkeit finden, eine bestimmte Aufgabe zu erledigen, verfügen wir über die Fertigkeiten und Gelegenheiten, vollständig neue Prozesse oder bahnbrechende Technologie wie Amazon Robotics oder unseren Complex Item Sorter einzuführen.","department_cost_center":null,"description_short":"Das Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) ist für unseren Betrieb von fundamentaler Bedeutung – es sorgt dafür, dass unsere technischen Systeme und","display_distance":null,"id":"1e0fb740-f3b8-4dd6-9eb7-9fab1ce34450","id_icims":"3178630","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/facilities","job_function_id":null,"job_path":"/en/jobs/3178630/elektriker-in-mechatroniker-in-instandhaltungstechniker-in-frankenthal","job_schedule_type":"full-time","location":"DE, RP, Frankenthal","locations":["{\"normalizedStateName\":\"Hesse\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Viernheim\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, RP, Viernheim\",\"coordinates\":\"49.53834,8.57711\",\"normalizedCountyName\":\"Bergstraße\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Viernheim, Hesse, DEU\",\"location\":\"DE, RP, Viernheim\",\"region\":\"RP\",\"buildingCodeList\":[\"DRP1\"],\"normalizedCityName\":\"Viernheim\"}","{\"normalizedStateName\":\"Rhineland-Palatinate\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Worms\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, Worms\",\"coordinates\":\"49.63049,8.36197\",\"normalizedCountyName\":\"Worms\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Worms, Rhineland-Palatinate, DEU\",\"location\":\"DE, Worms\",\"region\":\"\",\"buildingCodeList\":[\"VEQE\",\"DRP7\"],\"normalizedCityName\":\"Worms\"}","{\"normalizedStateName\":\"Rhineland-Palatinate\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Frankenthal\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, RP, Frankenthal\",\"coordinates\":\"49.53483,8.35066\",\"normalizedCountyName\":\"Frankenthal (Pfalz)\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Frankenthal (Pfalz), Rhineland-Palatinate, DEU\",\"location\":\"DE, RP, Frankenthal\",\"region\":\"RP\",\"buildingCodeList\":[\"FRA7\"],\"normalizedCityName\":\"Frankenthal (Pfalz)\"}","{\"normalizedStateName\":\"Baden-Wurttemberg\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Mannheim\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, Mannheim\",\"coordinates\":\"49.48443,8.46274\",\"normalizedCountyName\":\"Mannheim\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Mannheim, Baden-Wurttemberg, DEU\",\"location\":\"DE, Mannheim\",\"region\":\"\",\"buildingCodeList\":[\"NBW1\"],\"normalizedCityName\":\"Mannheim\"}"],"normalized_location":"Frankenthal (Pfalz), Rhineland-Palatinate, DEU","optional_search_labels":["ops.rme-technician","hourly","ops.lander-emea-rme-technician"],"posted_date":"February 11, 2026","preferred_qualifications":"- Erfahrung mit zustandsorientierter Überwachung\u003cbr/\u003e- Erfahrung in der Arbeit mit Druck- und Applikationsmaschinen\u003cbr/\u003e- Erfahrung in der Störungssuche und Wartung von Förder- oder Automationssystemen\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":"RP","title":"Elektriker:in/Mechatroniker:in/Instandhaltungstechniker:in  - Frankenthal","university_job":null,"updated_time":"41 minutes","url_next_step":"https://account.amazon.com/jobs/3178630/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Abgeschlossene Berufsausbildung oder Erfahrung in einem relevanten Bereich\u003cbr/\u003e- Relevante Erfahrung in der Nutzung von Datenanalysen, um Kennzahlen zu generieren und zu belegen \u003cbr/\u003e- Fortgeschrittene Deutschkenntnisse\u003cbr/\u003e- Gute Englischkenntnisse","business_category":"fulfillment-ops","city":"Witten","company_name":"Amazon SZ NRW GmbH","country_code":"DEU","description":"Arbeitsschutz und Wohlbefinden unserer Mitarbeiter:innen haben bei Amazon höchste Priorität. Unsere Safety Koordinatoren spielen dabei eine wichtige Rolle. Diese Stelle bietet Dir einen Einstieg in den Arbeitsschutz und eine Chance zur beruflichen Weiterentwicklung in einem globalen Unternehmen. Du überwachst Deinen Standort in enger Zusammenarbeit mit unseren Expert:innen und erlebst jeden Tag, welchen positiven Beitrag Du zum Wohlbefinden Deiner Mitmenschen leistest. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Durchführung von Risikobewertungen und -Audits\u003cbr/\u003e- Überwachung des Standorts, damit die Prozesse den Sicherheitsverfahren von Amazon entsprechen\u003cbr/\u003e- Erstellung und Aktualisierung von Berichten zu Sicherheitskennzahlen, damit Kolleg:innen sie prüfen können. \u003cbr/\u003e- Zusammenarbeit mit und Anleitungen für Kolleg:innen aus dem Betrieb und dem gesamten Unternehmen zu Sicherheitsfragen und -prozessen\u003cbr/\u003e- Unterstützung der Einführung neuer Sicherheitsmaßnahmen\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eDu arbeitest vor Ort an einem unserer Logistikstandorte. Du verfolgst das Geschehen genau, und Mitarbeiter:innen kommen während ihrer Schicht mit Fragen auf Dich zu. In dieser Funktion musst Du potenzielle Probleme erkennen, bevor sie auftreten. Du überprüfst den Standort kontinuierlich und machst Dich damit vertraut, wie Mitarbeiter:innen die Ausrüstung benutzen. Du verstehst die Funktionsweisen aller Aufgaben und Maschinen und sorgst für die optimale Sicherheit der Prozesse.\u003cbr/\u003eDu gehörst zu den Personen, die Änderungen bei der Sicherheit in die Tat umsetzen, und arbeitest dabei mit vielen Menschen unmittelbar zusammen. Neben Deinen täglichen und wöchentlichen Routineaufgaben unterstützt Du bei Bedarf unser Betriebsteam bei Sicherheitsfragen.\u003cbr/\u003eArbeitsschutz ist für Amazon sehr wichtig. Du hilfst uns, wesentliche Daten zu sammeln, um unsere Prozesse zu verstehen und Problemen vorzubeugen. Du teilst diese Daten auch mit anderen Mitarbeiter:innen im Unternehmen und arbeitest mit anderen Teams zusammen, damit die Sicherheit an erster Stelle steht. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDer Arbeitsschutz ist wesentlich, um das mentale und körperliche Wohlbefinden unserer Mitarbeitenden am Arbeitsplatz zu gewährleisten. Unser WHS Team sorgt gemeinsam mit Manager:innen, Partnerfirmen und Lokalregierungen an allen unseren Standorten dafür, dass wir alle Richtlinien und rechtlichen Vorschriften für Amazon einhalten und dass unsere Arbeitsplätze sicher sind.\u003cbr/\u003eDas Team umfasst eine Reihe verschiedener Funktionen, von Arbeitsschutzingenieur:innen bis hin zu Programmmanager:innen. Egal in welcher Rolle, Du wirst zur Entwicklung, Umsetzung und Wahrung unserer hohen Arbeitsschutzstandards beitragen. Dabei arbeitest Du potenziell gemeinsam mit Kolleg:innen aus dem ganzen Unternehmen an verschiedenartigen Projekten, von Geräte- und Prozessinspektionen bis hin zur Bewertung von Prozess-, Gebäude- und Gerätedesigns.","department_cost_center":null,"description_short":"Arbeitsschutz und Wohlbefinden unserer Mitarbeiter:innen haben bei Amazon höchste Priorität. Unsere Safety Koordinatoren spielen dabei eine wichtige Rolle. Diese Stelle bietet Dir einen Einstieg in den","display_distance":null,"id":"6c9bb3df-fdd5-4cb3-9817-297f0c851148","id_icims":"3071680","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3071680/whs-coordinator","job_schedule_type":"full-time","location":"DE, NW, Witten","locations":["{\"normalizedStateName\":\"North-Rhine-Westphalia\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Witten\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, NW, Witten\",\"coordinates\":\"51.44033,7.33617\",\"normalizedCountyName\":\"Ennepe-Ruhr-Kreis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Witten, North-Rhine-Westphalia, DEU\",\"location\":\"DE, NW, Witten\",\"region\":\"NW\",\"buildingCodeList\":[\"DTM9\"],\"normalizedCityName\":\"Witten\"}"],"normalized_location":"Witten, North-Rhine-Westphalia, DEU","optional_search_labels":["jdv.operations.whscoordinator"],"posted_date":"September  3, 2025","preferred_qualifications":"- Erfahrung in der effektiven Kommunikation mit verschiedenen Stakeholdern entweder schriftlich oder mithilfe von Präsentationen\u003cbr/\u003e- Erfahrung, eigenständig zu arbeiten ebenso wie als Teammitglied\u003cbr/\u003e- Vorhandene Ausbildung zur Fachkraft für Arbeitssicherheit\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-whs-emea","source_system":"JobCreator","state":"NW","title":"WHS Coordinator","university_job":null,"updated_time":"43 minutes","url_next_step":"https://account.amazon.com/jobs/3071680/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-whs-emea","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Abgeschlossene technische Berufsausbildung, anerkannt durch die Industrie- und Handelskammer (IHK) oder Handwerkskammer (HWK) oder Nachweis eines erfolgreich abgeschlossen Hochschulstudium im Ingenieurwissenschaftlichen Bereich (Maschinenbau / Elektrotechnik oder artverwandt) einer deutschen Hochschule oder anerkannte ausländische Hochschulabschlüsse (BA, B. Sc., MA, M. Sc., Dipl.-Ing.)\u003cbr/\u003e- Zusätzlich, eine abgeschlossene Qualifikation als Industriemeister, Handwerksmeister oder Staatlich Geprüfter/Anerkannter Techniker oder mehrjährige einschlägige Berufserfahrung\u003cbr/\u003e- Praktische Erfahrung im Führen von Teams\u003cbr/\u003e- Erfahrung in der Automatisierung und Instandhaltung von Förderanlagen\u003cbr/\u003e- Fortgeschrittene Deutschkenntnisse in Wort und Schrift sowie Grundsprachkenntnisse in Englisch","business_category":"fulfillment-ops","city":"Gernsheim","company_name":"Amazon VZ Suedhessen GmbH - H67","country_code":"DEU","description":"Unser Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) ist der Kern von Amazons Engagement für Innovation. Amazon entwickelt sich weiter und dieses Team sorgt dafür, dass dies auch die von uns verwendeten Technologien und Tools tun. Als Senior RME Technician hilfst Du uns, der Entwicklung einen Schritt voraus zu bleiben. Du setzt die neuesten Technologien ein und identifizierst neue, effiziente Arbeitsmethoden. In dieser Rolle achtest Du genau auf unsere Prozesse und trägst dazu bei, dass wir unsere höchsten Sicherheitsstandards befolgen und weiter erhöhen. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e - Best Practice und Unterstützen im Bedienen von Geräten und Anlagen mit den höchsten Sicherheitsstandards\u003cbr/\u003e    - Verfolgen der Geräteleistung durch visuelle Prüfungen, zustandsorientierte Überwachung und vorbeugende Wartungsmaßnahmen und Einplanen zusätzlicher Wartung je nach Bedarf\u003cbr/\u003e    - Verantwortung für das technische Team während seiner Schicht und dessen Unterstützung und Weiterentwicklung\u003cbr/\u003e    - Lösung von Problemen an Anlagen, um Betriebsausfallzeiten zu reduzieren und die schnellstmögliche Abfertigung von Paketen zu ermöglichen\u003cbr/\u003e    - Unterstützung bei der kontinuierlichen Verbesserung von Systemen und Standardisierung von Prozessen im ganzen EU-Netzwerk\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eDu betreust ein Instandhaltungsteam innerhalb einer Schicht und sorgst dafür, dass alle Mitarbeitenden die erforderlichen Werkzeuge zur Verfügung haben und diese einwandfrei funktionieren. Das beinhaltet die Überwachung von Prozessen, damit Vorschriften und Richtlinien befolgt werden, ebenso wie die Gewährleistung der Durchführung vorbeugender Wartungsmaßnahmen, um die Betriebszeit unserer Anlagen zu maximieren.\u003cbr/\u003eDurch Deine Beobachtungen während der Schichtarbeit machst Du Verbesserungsvorschläge, um unsere Systeme noch effizienter und produktiver zu gestalten, und setzt diese Verbesserungen EU-weit um. Außerdem nutzt Du Tools wie SCADA zur Überwachung von Prozessen, um deren Leistungsfähigkeit zu gewährleisten, und unterstützt administrative Aufgaben in enger Zusammenarbeit mit Deinen Führungskräften.\u003cbr/\u003eDu arbeitest vor Ort in einem unserer Logistikzentren. Du arbeitest in Schichtmodellen, die Nächte und Wochenenden umfassen können. Mit den Kenntnissen und Erfahrungen, die Du sammelst, wirst Du Dich zu weiteren Führungspositionen weiterentwickeln. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eUnser Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) sorgt dafür, dass unsere Geräte und Ausstattung jederzeit optimal funktionieren. Wir sind ein Team von Techniker:innen und Ingenieur:innen, das aus hervorragenden Teamplayern besteht und von erfahrenen Führungskräften geleitet wird. Wir arbeiten gemeinsam daran, die Geräte in unserem gesamten globalen Netzwerk von Fulfillment-Centern zu warten, zu reparieren und ihre Fehler zu beheben. Einige unserer Mitarbeiter:innen sind Führungskräfte, die das Team bei der Arbeit an spannender, innovativer Technologie beaufsichtigen – die es teilweise nur bei Amazon gibt.\u003cbr/\u003eVon der Installation automatisierter Verpackungssysteme bis hin zur Beaufsichtigung der allgemeinen Wartungsarbeiten eines Standorts sowie der Reparatur von für den Vertrieb wesentlichen Geräten wickelt unser Team einen Großteil der technischen Aufgaben bei Amazon ab. Unter anderem sorgt es auch dafür, dass Gebäude weiterhin den rechtlichen Auflagen entsprechen, damit alle sicher bleiben und unsere Standorte mit maximaler Effizienz betrieben werden. Es gibt zahlreiche Aufstiegschancen im RME-Team selbst ebenso wie im gesamten Amazon-Unternehmen.\u003cbr/\u003eAlle unsere Aktivitäten sind darauf ausgerichtet, die Ausfallzeiten an Amazons wichtigsten Betriebsstandorten zu reduzieren, damit Kund:innen ihre Bestellungen rechtzeitig erhalten. Oft arbeiten wir früh morgens, spät abends oder in der Nachtschicht, um Wartungsarbeiten mit den geringstmöglichen Störungen vorzunehmen. Falls wir eine bessere Möglichkeit finden, eine bestimmte Aufgabe zu erledigen, verfügen wir über die Fertigkeiten und Gelegenheiten, vollständig neue Prozesse oder bahnbrechende Technologie wie Amazon Robotics oder unseren Complex Item Sorter einzuführen.","department_cost_center":null,"description_short":"Unser Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) ist der Kern von Amazons Engagement für Innovation. Amazon entwickelt sich weiter und dieses Team sorgt","display_distance":null,"id":"225b1b5b-bdc3-41b8-8d56-21c800c86aba","id_icims":"3179563","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3179563/senior-instandhaltungstechniker-in","job_schedule_type":"full-time","location":"DE, HE, Gernsheim","locations":["{\"normalizedStateName\":\"Hesse\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Gernsheim\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, HE, Gernsheim\",\"coordinates\":\"49.75423,8.48142\",\"normalizedCountyName\":\"Groß-Gerau\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Gernsheim, Hesse, DEU\",\"location\":\"DE, HE, Gernsheim\",\"region\":\"HE\",\"buildingCodeList\":[\"DHE9\",\"DCQ6\",\"FRAX\"],\"normalizedCityName\":\"Gernsheim\"}"],"normalized_location":"Gernsheim, Hesse, DEU","optional_search_labels":[],"posted_date":"February 12, 2026","preferred_qualifications":"- Erfahrung in der Betreuung von Fremdfirmen\u003cbr/\u003e- Verständnis von SPS-basierten Steuersystemen und gesetzlichen Compliance-Anforderungen\u003cbr/\u003e- Erfahrung im Gebrauch von computergesteuerten Wartungsmanagementsystemen, um proaktive Wartungsmaßnahmen zu planen und reaktive Maßnahmen aufzuzeichnen\u003cbr/\u003e- Studienabschluss, vorzugsweise in einem technischen Fachgebiet oder in Betriebswirtschaft\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":"HE","title":"Senior Instandhaltungstechniker:in","university_job":null,"updated_time":"43 minutes","url_next_step":"https://account.amazon.com/jobs/3179563/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in natural language data labeling, data annotation, linguistic annotation or other forms of data markup\u003cbr/\u003e- Speak, write, and read fluently in English\u003cbr/\u003e- Speak, write, and read fluently in Portuguese\u003cbr/\u003e- C1+ or equivalent proficiency in Brazilian Portuguese\u003cbr/\u003e- C1+ or equivalent proficiency in English","business_category":"amazon-artificial-general-intelligence","city":"London","company_name":"Evi Technologies Limited","country_code":"GBR","description":"AI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment of large language models (LLMs) across all of our businesses. Come build the future of human-technology interaction with us.\u003cbr/\u003e\u003cbr/\u003eWe are looking for those candidates who just don’t think out of the box, but make the box they are in ‘Bigger’. The future is now, do you want to be a part of it? Then read on! \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Maintain and follow strict confidentiality as customer privacy is our biggest tenet\u003cbr/\u003e- Work with a range of different types of data including but not limited to text, speech, image, and video\u003cbr/\u003e- Deliver high-quality labelled data, using guidelines provided to meet our KPIs and using in-house tools and software\u003cbr/\u003e- Assume the role of a subject matter expert for Machine Learning (ML) data workflows and demonstrate proficiency in researching, creating factually and grammatically correct responses, ranking responses, creating grammatically correct text, speech, image, video annotation.\u003cbr/\u003e- Ability to make logical decisions while performing tasks even when provided information is ambiguous. \u003cbr/\u003e- Eye for detail and ability to pivot from one category of requirement to another instantaneously.\u003cbr/\u003e- Demonstrate support for daily operational deliverables like AHT, quality, TAT for multiple task types assigned to you and the team\u003cbr/\u003e- Demonstrate expertise in handling end to end data execution process related to labelling the tasks and be less dependent on work instructions\u003cbr/\u003e- Contribute to root cause analysis, identify error patterns and identify solutions to improve quality of labelling tasks\u003cbr/\u003e- Responsible for identifying day-to-day process and operational issues in SOP, tools and suggest changes to unblock operations\u003cbr/\u003e- Demonstrate ownership in floor support to clarify internal queries during execution on need basis\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are looking for a ML Data Associate (MLDA) to undertake the task of foundational labeling functions, such as dialogue evaluation on speech, text, audio, video data, to assess and improve Alexa’s performance in everyday situations.\u003cbr/\u003e\u003cbr/\u003eYour ability to concentrate, multi-task and your high attention to detail helps you deliver high-quality work as well as maintaining strict confidentiality and follow all applicable Amazon policies for securing confidential information. You will be a part of a diverse team with the shared vision to make huge strides in the world of technology and the way we use Artificial Intelligence. An inner drive, individuality, and a creative mind are extremely beneficial.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe team works strictly in the office Monday through Friday with an eight-hour shift. We are constantly looking for ways to improve our capabilities and deliver the best product possible. Diverse team, regular meetings, trainings, and Amazon events throughout the year await you.","department_cost_center":null,"description_short":"AI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment","display_distance":null,"id":"7dde66f3-d3fe-48c9-91a1-40603075f4f4","id_icims":"3136405","is_intern":null,"is_manager":null,"job_category":"Editorial, Writing, \u0026 Content Management","job_family":"Machine Learning Data Operatio","job_function_id":null,"job_path":"/en/jobs/3136405/ai-data-associate-portuguese-artificial-general-intelligence","job_schedule_type":"full-time","location":"GB, London","locations":["{\"normalizedStateName\":\"England\",\"normalizedCountryCode\":\"GBR\",\"city\":\"London\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, London\",\"coordinates\":\"51.50643,-0.12719\",\"normalizedCountyName\":\"London\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"London, England, GBR\",\"location\":\"GB, London\",\"region\":\"\",\"buildingCodeList\":[\"LHR10\"],\"normalizedCityName\":\"London\"}"],"normalized_location":"London, England, GBR","optional_search_labels":["alexa-and-amazon-devices.team-machine-learning-and-science-job-family","amazon.artificial-intelligence"],"posted_date":"December  3, 2025","preferred_qualifications":"- Bachelor's degree in a relevant field or equivalent work experience\u003cbr/\u003e- Proven experience with demonstrated task execution ability\u003cbr/\u003e- Proven capacity to leverage open-source resources effectively for comprehensive research purposes\u003cbr/\u003e- Ability to adapt well to fast-paced environments with changing circumstances, direction, and strategy\u003cbr/\u003e- Proven project coordination or management experience (for support functions teams)\u003cbr/\u003e- Experience managing stakeholder relationships across departments\u003cbr/\u003e- Advanced proficiency in Microsoft Office Suite and common business applications.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":null,"title":"AI Data Associate - Portuguese, Artificial General Intelligence","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3136405/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Berufsausbildung oder Erfahrung in einem relevanten Bereich\u003cbr/\u003e- Relevante Erfahrung in der Nutzung von Datenanalysen, um Kennzahlen zu generieren und zu belegen\u003cbr/\u003e- Fortgeschrittene Deutschkenntnisse\u003cbr/\u003e- Gute Englischkenntnisse","business_category":"fulfillment-ops","city":"Kassel","company_name":"Amazon Deutschland N13 Transport GmbH","country_code":"DEU","description":"Arbeitsschutz und Wohlbefinden unserer Mitarbeiter:innen haben bei Amazon höchste Priorität. Unsere Safety Technicians spielen dabei eine wichtige Rolle. Diese Stelle bietet Dir einen Einstieg in den Arbeitsschutz und eine Chance zur beruflichen Weiterentwicklung in einem globalen Unternehmen. Du überwachst Deinen Standort in enger Zusammenarbeit mit unseren Expert:innen und erlebst jeden Tag, welchen positiven Beitrag Du zum Wohlbefinden Deiner Mitmenschen leistest. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Durchführung von Risikobewertungen und -Audits\u003cbr/\u003e- Überwachung des Standorts, damit die Prozesse den Sicherheitsverfahren von Amazon entsprechen\u003cbr/\u003e- Erstellung und Aktualisierung von Berichten zu Sicherheitskennzahlen, damit Kolleg:innen sie prüfen können. \u003cbr/\u003e- Zusammenarbeit mit und Anleitungen für Kolleg:innen aus dem Betrieb und dem gesamten Unternehmen zu Sicherheitsfragen und -prozessen\u003cbr/\u003e- Unterstützung der Einführung neuer Sicherheitsmaßnahmen\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eDu arbeitest vor Ort an einem unserer Logistikstandorte. Du verfolgst das Geschehen genau, und Mitarbeiter:innen kommen während ihrer Schicht mit Fragen auf Dich zu. In dieser Funktion musst Du potenzielle Probleme erkennen, bevor sie auftreten. Du überprüfst den Standort kontinuierlich und machst Dich damit vertraut, wie Mitarbeiter:innen die Ausrüstung benutzen. Du verstehst die Funktionsweisen aller Aufgaben und Maschinen und sorgst für die optimale Sicherheit der Prozesse.\u003cbr/\u003eDu gehörst zu den Personen, die Änderungen bei der Sicherheit in die Tat umsetzen, und arbeitest dabei mit vielen Menschen unmittelbar zusammen. Neben Deinen täglichen und wöchentlichen Routineaufgaben unterstützt Du bei Bedarf unser Betriebsteam bei Sicherheitsfragen.\u003cbr/\u003eArbeitsschutz ist für Amazon sehr wichtig. Du hilfst uns, wesentliche Daten zu sammeln, um unsere Prozesse zu verstehen und Problemen vorzubeugen. Du teilst diese Daten auch mit anderen Mitarbeiter:innen im Unternehmen und arbeitest mit anderen Teams zusammen, damit die Sicherheit an erster Stelle steht. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDer Arbeitsschutz ist wesentlich, um das mentale und körperliche Wohlbefinden unserer Mitarbeitenden am Arbeitsplatz zu gewährleisten. Unser WHS Team sorgt gemeinsam mit Manager:innen, Partnerfirmen und Lokalregierungen an allen unseren Standorten dafür, dass wir alle Richtlinien und rechtlichen Vorschriften für Amazon einhalten und dass unsere Arbeitsplätze sicher sind.\u003cbr/\u003eDas Team umfasst eine Reihe verschiedener Funktionen, von Arbeitsschutzingenieur:innen bis hin zu Programmmanager:innen. Egal in welcher Rolle, Du wirst zur Entwicklung, Umsetzung und Wahrung unserer hohen Arbeitsschutzstandards beitragen. Dabei arbeitest Du potenziell gemeinsam mit Kolleg:innen aus dem ganzen Unternehmen an verschiedenartigen Projekten, von Geräte- und Prozessinspektionen bis hin zur Bewertung von Prozess-, Gebäude- und Gerätedesigns.","department_cost_center":null,"description_short":"Arbeitsschutz und Wohlbefinden unserer Mitarbeiter:innen haben bei Amazon höchste Priorität. Unsere Safety Technicians spielen dabei eine wichtige Rolle. Diese Stelle bietet Dir einen Einstieg in den Arbeitsschutz","display_distance":null,"id":"4dfdee62-fff3-4cc9-9a96-a5bf2ab67544","id_icims":"3179577","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3179577/whs-coordinator","job_schedule_type":"full-time","location":"DE, HE, Kassel","locations":["{\"normalizedStateName\":\"Hesse\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Kassel\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, HE, Kassel\",\"coordinates\":\"51.31853,9.51183\",\"normalizedCountyName\":\"Kassel\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Kassel, Hesse, DEU\",\"location\":\"DE, HE, Kassel\",\"region\":\"HE\",\"buildingCodeList\":[\"DHE7\"],\"normalizedCityName\":\"Kassel\"}"],"normalized_location":"Kassel, Hesse, DEU","optional_search_labels":[],"posted_date":"February 12, 2026","preferred_qualifications":"- Erfahrung in der effektiven Kommunikation mit verschiedenen Stakeholdern entweder schriftlich oder mithilfe von Präsentationen\u003cbr/\u003e- Erfahrung, eigenständig zu arbeiten ebenso wie als Teammitglied\u003cbr/\u003e- Vorhandene Ausbildung zur Fachkraft für Arbeitssicherheit\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-whs-emea","source_system":"JobCreator","state":"HE","title":"WHS Coordinator","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3179577/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-whs-emea","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}