{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- 10+ years of expertise in deploying and maintaining 5G cores\u003cbr/\u003e- 5+ years of expertise in cloud-native deployments\u003cbr/\u003e- Real world experience of deploying AI-based services across telecom footprint\u003cbr/\u003e- Deep understanding of roaming and internetworking across global MNOs","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"KGS LLC","country_code":"USA","description":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon Leo will serve people and organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eAs a Principal Product Manager - Core Network , you will lead the system requirements, architecture definition of a 3GPP/5G core network running on cloud infrastructure. You have demonstrated expertise in deploying 5G network cores at large scale US or International telecom service providers with deep understanding of the latest 3GPP standards and architectures.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e10037\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Demonstrated expertise in deploying large scale 5G cores\u003cbr/\u003e• Deep understanding of 5G protocols and systems implementation from inception to delivery \u003cbr/\u003e•  Experience in networking, interconnectivity, and integration with global MNOs\u003cbr/\u003e• Develop and maintain product requirements documents \u003cbr/\u003e• Collaborate with cross-functional teams to ensure the core network is designed for mission-critical operations\u003cbr/\u003e\u003cbr/\u003eThis is an on-site role that requires employees to work from the company's office 5 days per week. The role will include up to 25% of business travel.\u003cbr/\u003e\u003cbr/\u003eExport Control - \u003cbr/\u003eThis position requires that the candidate selected be a U.S. Citizen in order to comply with U.S. government-imposed requirements related to the nature of the work and/or where it will be performed.\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to","display_distance":null,"id":"e224230d-0101-4d20-8f91-264c0f35993b","id_icims":"3050332","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Product Management - Technical","job_function_id":null,"job_path":"/en/jobs/3050332/principal-prod-mgmt-technical-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA131\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":["alexa-and-amazon-devices.team-product-project-program-management-job-family","military-transportation","military-spouse","military-operations","military-tech","military","military-leadership"],"posted_date":"August  1, 2025","preferred_qualifications":"- Knowledge of SQL\u003cbr/\u003e- Experience in representing and advocating for a variety of critical customers and stakeholders during executive-level prioritization and planning\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Redmond - 179,900.00 - 243,400.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Principal, Prod Mgmt - Technical , Amazon Leo","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3050332/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in developing functional specifications, design verification plans and functional test procedures\u003cbr/\u003e- Master's degree in Electrical/Communications Engineering, or 8+ years of analog or RF layout design experience\u003cbr/\u003e- Knowledge of antenna fundamental and radiation theory EM simulation experience\u003cbr/\u003e- Strong understanding of RF and Microwave Components design, Frontend design, Radio Architecture\u003cbr/\u003e- Strong understanding of Mixed Signal components, Digital Modulations and OFDM, Signal Theory\u003cbr/\u003e- 4+ yr of industrial experience driving the test strategy for 5G NR FR1 and FR2, WiFi 6 and 7 products\u003cbr/\u003e- 5+ yr experience in test automation","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon LEO is an initiative to increase global broadband access through a constellation of 3,236 satellites in low Earth orbit (LEO). Its mission is to bring fast, affordable broadband to unserved and underserved communities around the world. Amazon LEO will help close the digital divide by delivering fast, affordable broadband to a wide range of customers, including consumers, businesses, government agencies, and other organizations operating in places without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eAs an Wireless Test Architect you will engage with an experienced cross-disciplinary team to develop new, advanced test systems for our Digital Phased Array systems, integrating them with our existing test infrastructure. We have near field spherical scanners, robotic manipulators and advanced RF optics that account for some of the fastest antenna characterization systems in the world, but we need to keep improving test coverage, test accuracy and repeatability, and test new features. Although Amazon LEO's communication system typically relied on sat-com concepts and test methods (DVT, ATP and QTP test campaigns and cycles), we look to the 3GPP industry standards and testing practices to adopt those learnings and build upon them.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* design a DVT and QTP campaign that is adequately trimmed for the devices, campaign goals and resources available\u003cbr/\u003e* Given a campaign goal, design an OTA test that can be performed with available test infrastructure\u003cbr/\u003e* drive strategy of test, custom instrumentation and infrastructure buildup for new wireless tests for DVT, QTP and ATP for all Payload and CT products\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.","department_cost_center":null,"description_short":"Amazon LEO is an initiative to increase global broadband access through a constellation of 3,236 satellites in low Earth orbit (LEO). Its mission is to bring fast, affordable broadband to unserved and","display_distance":null,"id":"a9e2e883-9867-46e8-badc-e68c56f6574f","id_icims":"3138438","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/3138438/sr-wireless-test-architect-leo-antenna-test-infrastructure","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA111\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":[],"posted_date":"December  6, 2025","preferred_qualifications":"- Experience working with interdisciplinary teams to execute product design from concept to production\u003cbr/\u003e- Experience with the project management of technical projects\u003cbr/\u003e- Experience with network troubleshooting tools (telnet, test-netconnection, tracert, tracetcp, iperf, ntttcp, dig, and packet capture tools), or experience in Linux and Networking protocols and experience in Network protocols like DNS/DHCP/TCP\u003cbr/\u003e- Track record of designing and implementing automated testing solutions for wireless platforms, and test frameworks.\u003cbr/\u003e- Strong hands-on experience with radio frequency measurement devices, such as VSA, VSG, and wireless connectivity testing systems. Knowledge of platforms like CMW500 or similar testing solutions is desirable.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Redmond - 137,300.00 - 185,700.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Sr. Wireless Test Architect, LEO Antenna Test Infrastructure","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3138438/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience programming in Java, C++, Python or related language\u003cbr/\u003e- Experience with SQL and an RDBMS (e.g., Oracle) or Data Warehouse","business_category":"aws","city":"Pasadena","company_name":"Amazon Development Center U.S., Inc.","country_code":"USA","description":"The Amazon Web Services (AWS) Center for Quantum Computing in Pasadena, CA, is looking to hire a Quantum Research Scientist in the Fabrication group. You will join a multi-disciplinary team of theoretical and experimental physicists, materials scientists, and hardware and software engineers working at the forefront of quantum computing. You should have a deep and broad knowledge of device fabrication techniques. \u003cbr/\u003e \u003cbr/\u003eCandidates with a track record of original scientific contributions will be preferred. We are looking for candidates with strong engineering principles, resourcefulness and a bias for action, superior problem solving, and excellent communication skills. Working effectively within a team environment is essential. As a research scientist you will be expected to work on new ideas and stay abreast of the field of experimental quantum computation. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eIn this role, you will drive improvements in qubit performance by characterizing the impact of environmental and material noise on qubit dynamics. This will require designing experiments to assess the role of specific noise sources, ensuring the collection of statistically significant data through automation, analyzing the results, and preparing clear summaries for the team. Finally, you will work with hardware engineers, material scientists, and circuit designers to implement changes which mitigate the impact of the most significant noise sources.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS. Within AWS UC, Amazon Dedicated Cloud (ADC) roles engage with AWS customers who require specialized security solutions for their cloud services.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement: \u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be either a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum, or be able to obtain a US export license. If you are unsure if you meet these requirements, please apply and Amazon will review your application for eligibility. \u003cbr/\u003e","department_cost_center":null,"description_short":"The Amazon Web Services (AWS) Center for Quantum Computing in Pasadena, CA, is looking to hire a Quantum Research Scientist in the Fabrication group. You will join a multi-disciplinary team of theoretical","display_distance":null,"id":"107ed17b-b78d-422f-81ec-74325bb22e59","id_icims":"3181264","is_intern":null,"is_manager":null,"job_category":"Research Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3181264/applied-scientist-quantum-computing","job_schedule_type":"full-time","location":"US, CA, Pasadena","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Pasadena\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Pasadena\",\"coordinates\":\"34.14745,-118.14427\",\"normalizedCountyName\":\"Los Angeles\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Pasadena, California, USA\",\"location\":\"US, CA, Pasadena\",\"region\":\"CA\",\"buildingCodeList\":[\"LAX43\"],\"normalizedCityName\":\"Pasadena\"}"],"normalized_location":"Pasadena, California, USA","optional_search_labels":["aws.team-utility-computing","aws.team-generative-ai","amazon.artificial-intelligence"],"posted_date":"February 13, 2026","preferred_qualifications":"- Experience implementing algorithms using both toolkits and self-developed code\u003cbr/\u003e- Have publications at top-tier peer-reviewed conferences or journals\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Pasadena - 136,000.00 - 184,000.00 USD annually","primary_search_label":"aws.team-data-science-primary","source_system":"JobCreator","state":"CA","title":"Applied Scientist, Quantum Computing","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3181264/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-data-science-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High School or equivalent diploma\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.\u003cbr/\u003e- 1+ years of computer/server hardware troubleshooting or related IT experience\"","business_category":"aws","city":"Canton","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring seamless data center operations that power millions of businesses and services worldwide. \u003cbr/\u003e \u003cbr/\u003eData Center Technicians should be willing to work both independently and with a team. Work prioritization, organizational skills, effective communication, and the ability to react quickly are critical to success. In addition to hardware and network repair, candidates will install equipment, create documentation, innovate solutions, and fix problems within the data center space. This team works in an environment that operates 24/7. Traveling within and outside of the regional work area is required. \u003cbr/\u003e \u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e-Performing server rack installations, hardware break-fix on various components, troubleshooting network issues, and responding to operational incidents that impact service availability, escalating to senior technicians and management as needed/required \u003cbr/\u003e-Serving as a primary contact point for both internal and external stakeholders, including engineers, software developers, vendors, and contractors \u003cbr/\u003e-Performing on-call duties and participating in scheduled maintenance and change management activities \u003cbr/\u003e-Contributing to documentation and process improvement initiatives based on your analysis of operational issues \u003cbr/\u003e-Helping to train and onboard new team members \u003cbr/\u003e\u003cbr/\u003ePhysical requirements: \u003cbr/\u003e\u003cbr/\u003e-Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds \u003cbr/\u003e-Working in cramped and/or elevated locations \u003cbr/\u003e-Bending, lifting, stretching, and reaching \u003cbr/\u003e-Standing and walking for up to 8+ hours a day \u003cbr/\u003e-Ascending and descending ladders, stairs, and gangways safely and without limitation \u003cbr/\u003e-Work in a noisy environment \u003cbr/\u003e-Work shifts longer than 8 hours to support 24/7 operations (covering both night and day shifts). \u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e-Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e-Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e-Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Data Center Technician professional, you have industry-leading technical abilities and demonstrate a breadth of knowledge while you: \u003cbr/\u003e-Take ownership of technical issues brought by their customer base, engaging other teams when needed to drive resolution \u003cbr/\u003e-Solve problems at their root and step back to understand the broader context \u003cbr/\u003e-Maintain service level agreements through the implementation of proactive issue detection and reporting \u003cbr/\u003e\u003cbr/\u003eYou will be required to work shift work that will include days/nights/weekends/holidays. Traveling within and outside of the regional work area is required. You will be responsible for having a reliable personal vehicle and valid driver's license to travel within the regional work area, as company transportation will not be provided. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring","display_distance":null,"id":"48106a45-c6d0-4e3e-bc37-6109b6594157","id_icims":"3151128","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3151128/data-center-technician","job_schedule_type":"full-time","location":"US, MS, Canton","locations":["{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Canton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Canton\",\"coordinates\":\"32.61258,-90.03472\",\"normalizedCountyName\":\"Madison\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Canton, Mississippi, USA\",\"location\":\"US, MS, Canton\",\"region\":\"MS\",\"buildingCodeList\":[\"JAN200\"],\"normalizedCityName\":\"Canton\"}"],"normalized_location":"Canton, Mississippi, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"January  2, 2026","preferred_qualifications":"- Experience in data center\u003cbr/\u003e- \"Experience managing work and priorities through a ticketing system\u003cbr/\u003e- An Associate’s degree, technical certification, or equivalent professional or military experience in a relevant field (e.g., computer science, networking engineering, etc.)\u003cbr/\u003e- Understanding of network design, protocols and layer 1/2 troubleshooting\"\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MS, Canton - 25.00 - 44.00 USD hourly","primary_search_label":"aws.team-it-services","source_system":"JobCreator","state":"MS","title":"Data Center Technician","university_job":null,"updated_time":"22 minutes","url_next_step":"https://account.amazon.com/jobs/3151128/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-it-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Work a flexible schedule including weekends, nights, and holidays\u003cbr/\u003e- 18+ months of computer/server hardware troubleshooting or related IT experience\u003cbr/\u003e- 18+ months of computer layer 1/2 networking experience (including troubleshooting and repair)","business_category":"aws","city":"Wilmer","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring seamless data center operations that power millions of businesses and services worldwide. \u003cbr/\u003eData Center Technician position involves in-depth hardware and network diagnostics followed by physical repair as well as participating in an on-call rotation. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e-  Performing server rack installations, hardware break-fix on various components, troubleshooting network issues, responding to operational incidents that impact service availability, and carrying out routine network, server hardware, and operating system repairs to contribute to the overall availability of AWS services \u003cbr/\u003e\u003cbr/\u003e- Serving as a primary contact point for both internal and external stakeholders, including engineers, software developers, vendors, and contractors \u003cbr/\u003e\u003cbr/\u003e- Performing on-call duties and participating in scheduled maintenance and change management activities \u003cbr/\u003e\u003cbr/\u003e- Contributing to documentation and process improvement initiatives based on your analysis of operational issues \u003cbr/\u003e\u003cbr/\u003e- Helping to interview, train and onboard new team members \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e\u003cbr/\u003e- Lifting and moving material up to 40 pounds each \u003cbr/\u003e\u003cbr/\u003e- Working in cramped and/or elevated locations \u003cbr/\u003e\u003cbr/\u003e- Bending, lifting, stretching, and reaching \u003cbr/\u003e\u003cbr/\u003e- Standing and walking for up to 8+ hours a day \u003cbr/\u003e\u003cbr/\u003e- Ascending and descending ladders, stairs, and gangways safely and without limitation \u003cbr/\u003e\u003cbr/\u003e- Work in an industrial environment \u003cbr/\u003e\u003cbr/\u003e- Work shifts longer than 8 hours to support 24/7 operations (covering both night and day shifts). \u003cbr/\u003e\u003cbr/\u003e- This role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003e- Candidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eOur Data Center Technician professionals, who have industry-leading technical abilities and demonstrate a breadth of knowledge while they: \u003cbr/\u003e\u003cbr/\u003e- Take ownership of technical issues brought by their customer base, engaging other teams when needed to drive resolution \u003cbr/\u003e\u003cbr/\u003e- Show a strong aptitude for troubleshooting and problem solving \u003cbr/\u003e\u003cbr/\u003e- Solve problems at their root and step back to understand the broader context \u003cbr/\u003e\u003cbr/\u003e- Maintain service level agreements through the implementation of proactive issue detection and reporting \u003cbr/\u003e\u003cbr/\u003e- Are biased to act in the absence of direction or support \u003cbr/\u003e\u003cbr/\u003e- Improve effectiveness through process innovation \u003cbr/\u003e\u003cbr/\u003e You will be required to work shift work that will include days/nights/weekends/holidays. ","department_cost_center":null,"description_short":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring","display_distance":null,"id":"1874ed39-d08a-41a3-ad58-7ce80af96db0","id_icims":"3188441","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3188441/data-center-technician-night-shift-dcc-communities","job_schedule_type":"full-time","location":"US, TX, Wilmer","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Garland\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Garland\",\"coordinates\":\"32.91427,-96.63655\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Garland, Texas, USA\",\"location\":\"US, TX, Garland\",\"region\":\"TX\",\"buildingCodeList\":[\"DFW64\",\"DFW56\",\"DFW92\",\"DDA2\",\"ELRS7\",\"LSI2\",\"DFW62\",\"RBDZ\"],\"normalizedCityName\":\"Garland\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Fort Worth\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Fort Worth\",\"coordinates\":\"32.75095,-97.33086\",\"normalizedCountyName\":\"Tarrant\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Fort Worth, Texas, USA\",\"location\":\"US, TX, Fort Worth\",\"region\":\"TX\",\"buildingCodeList\":[\"AFW1\",\"DDA3\",\"DDF6\",\"DFW76\",\"JWY3\",\"ZDL4\",\"UTX7\",\"LFW2\",\"VUQK\",\"DDA9\",\"ONM203\",\"TCU1\",\"FTW4\",\"ELRS10\",\"AFW3\",\"DFW51\",\"VUBI\",\"DFW65\",\"DFW91\",\"ELRS12\",\"FTW3\",\"BAY2\",\"VUGU\",\"WFM332\",\"VUPZ\",\"KAFW\",\"DFW66\",\"XDA2\",\"XUSB\",\"DFW75\",\"DFW7\",\"ELRS11\",\"ZDL3\",\"DFW78\"],\"normalizedCityName\":\"Fort Worth\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Wilmer\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Wilmer\",\"coordinates\":\"32.5896,-96.68411\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Wilmer, Texas, USA\",\"location\":\"US, TX, Wilmer\",\"region\":\"TX\",\"buildingCodeList\":[\"DAL5\",\"DAL9\",\"JWY1\",\"VUPJ\"],\"normalizedCityName\":\"Wilmer\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Mansfield\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Mansfield\",\"coordinates\":\"32.56517,-97.14185\",\"normalizedCountyName\":\"Tarrant\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Mansfield, Texas, USA\",\"location\":\"US, TX, Mansfield\",\"region\":\"TX\",\"buildingCodeList\":[\"DDF4\",\"DFW70\"],\"normalizedCityName\":\"Mansfield\"}"],"normalized_location":"Wilmer, Texas, USA","optional_search_labels":["military","aws.team-ais","aws.team-dc","hourly"],"posted_date":"February 24, 2026","preferred_qualifications":"- Experience in a data center or other critical environment\u003cbr/\u003e- Bachelor's degree or equivalent professional or military experience in an IT-related field (e.g. computer science, network engineering, etc.)\u003cbr/\u003e- Industry standard certifications (CompTIA, CCENT, Network+)\u003cbr/\u003e- Understanding of Linux or similar operating systems\u003cbr/\u003e- Behavioral interviewing and hiring experience\u003cbr/\u003e- Experience training and onboarding of new team members\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, FORT WORTH - 30.00 - 54.00 USD hourly\u003cbr/\u003eUSA, TX, Fort Worth - 30.00 - 54.00 USD hourly\u003cbr/\u003eUSA, TX, Garland - 30.00 - 54.00 USD hourly\u003cbr/\u003eUSA, TX, Mansfield - 30.00 - 54.00 USD hourly\u003cbr/\u003eUSA, TX, Wilmer - 30.00 - 54.00 USD hourly","primary_search_label":"aws.team-it-services","source_system":"JobCreator","state":"TX","title":"Data Center Technician Night Shift, DCC Communities","university_job":null,"updated_time":"25 minutes","url_next_step":"https://account.amazon.com/jobs/3188441/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-it-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent\u003cbr/\u003e- Must be a Certified Athletic Trainer, by either the Board of Certification (BOC) or equivalent State Certification\u003cbr/\u003e- Must have a valid card evidencing successful completion of a First Aid, CPR, and AED course from the American Heart Association or American Red Cross\u003cbr/\u003e- Proficiency in Microsoft Office and digital recordkeeping","business_category":"fulfillment-and-operations","city":"Windsor","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. The Amazon Workplace Health \u0026 Safety (WHS) team is deeply committed to the safety and wellbeing of our people. WHS sets the strategic direction to provide resources, best practices, and safe environments to proactively manage the health and wellbeing of our workforce. To support these goals, Amazon is seeking an experienced Injury Prevention Specialist (IPS) to join our team. In this role, you will be a part of the local WHS team and will lead both onsite injury prevention and proactive safety. This position will work in an Amazon Fulfillment Center and report directly to the Site WHS Manager. You will work closely with AAs one-on-one with the goal to improve physical movement techniques prior to the onset of soreness or injury through ergonomic training and engagement.\u003cbr/\u003e\u003cbr/\u003eCore Impact Areas:\u003cbr/\u003eProactive Prevention - Drive injury prevention through advanced data analysis and evidence-based solutions. Design and implement targeted ergonomic interventions based on risk assessment findings and injury trends. Lead comprehensive workplace evaluations to identify and eliminate potential hazards before they cause harm. Transform complex injury data into actionable strategies that protect associates and optimize work processes.\u003cbr/\u003e\u003cbr/\u003eWellness Education - Champion a culture of proactive health and injury prevention through innovative training programs and hands-on coaching. Develop and deliver engaging ergonomic education that empowers associates to make informed decisions about their wellbeing. Build trusted partnerships with operations teams to integrate prevention strategies into daily workflows. Create sustainable behavior change through personalized coaching and positive reinforcement techniques.\u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements include: \u003cbr/\u003e- Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Stand/walk for up to 12 hours during shifts\u003cbr/\u003e- Work in an environment where the noise level varies \u003cbr/\u003e- Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e- Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e- Maintain effective care delivery in emergencies and assist emergency response at the site\u003cbr/\u003e\u003cbr/\u003eFor those that do not have an adult First Aid, CPR, AED certification from the American Heart Association or American Red Cross, must obtain within 3 weeks of start date.","department_cost_center":null,"description_short":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. The Amazon","display_distance":null,"id":"6bb5c103-d148-47ef-91a2-8edbb2e58901","id_icims":"3170284","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Onsite Medical Services","job_function_id":null,"job_path":"/en/jobs/3170284/injury-prevention-specialist","job_schedule_type":"full-time","location":"US, CT, Windsor","locations":["{\"normalizedStateName\":\"Connecticut\",\"normalizedCountryCode\":\"USA\",\"city\":\"Windsor\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CT, Windsor\",\"coordinates\":\"41.85179,-72.64351\",\"normalizedCountyName\":\"Capitol\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Windsor, Connecticut, USA\",\"location\":\"US, CT, Windsor\",\"region\":\"CT\",\"buildingCodeList\":[\"BDL4\"],\"normalizedCityName\":\"Windsor\"}"],"normalized_location":"Windsor, Connecticut, USA","optional_search_labels":[],"posted_date":"January 30, 2026","preferred_qualifications":"- Experience in an occupational or industrial setting\u003cbr/\u003e- Experience with an industrial wellness program\u003cbr/\u003e- Experience working with a cross functional team\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CT, Windsor - 60,200.00 - 90,200.00 USD annually","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"CT","title":"Injury Prevention Specialist","university_job":null,"updated_time":"28 minutes","url_next_step":"https://account.amazon.com/jobs/3170284/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 8+ years of product or program management, product marketing, business development or technology experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Experience with feature delivery and tradeoffs of a product\u003cbr/\u003e- Experience owning/driving roadmap strategy and definition\u003cbr/\u003e- Experience with end to end product delivery\u003cbr/\u003e- Experience contributing to engineering discussions around technology decisions and strategy related to a product\u003cbr/\u003e- Experience technical product management","business_category":"global-corporate","city":"Arlington","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Do you want a role with deep meaning and the ability to make a real impact? Hiring top talent is not only critical to Amazon’s success—it can literally change the world. It took a lot of great hires to deliver innovations like AWS, Prime, and Alexa, which make life better for millions of customers around the world every day. As part of Intelligent Talent Acquisition (ITA), you'll have the opportunity to reinvent the hiring process and deliver unprecedented scale, sophistication, and accuracy for Amazon's Talent Acquisition operations through the use of AI/ML solutions.\u003cbr/\u003e\u003cbr/\u003eITA is an industry-leading, award-winning people science and technology organization made up of scientists, engineers, analysts, product professionals and more. Our shared goal is to fairly and precisely connect the right people to the right jobs at the right time. Each year we help Amazon deliver billions of packages around the world by making it possible to hire hundreds of thousands of associates in the right quantity, at the right location and at exactly the right time. You’ll work on state-of-the-art agentic AI frameworks, research, advanced software tools, new AI systems, and machine learning algorithms to solve complex hiring challenges. Leveraging Amazon's in-house tech stack built on AWS, you'll have the autonomy and flexibility to bring innovative solutions to life. One day, we can bring our solutions to the rest of the world. Join ITA in using technologies to transform the hiring landscape and make a meaningful difference in people's lives. Together, we can solve the world's toughest hiring problems.\u003cbr/\u003eexperiences.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003ePrincipal, Product Manager - Technical will be responsible for owning the technical roadmap for key technology initiatives across Amazon hiring. This includes the development of internal and candidate facing technologies and experience that ensure a safe and effective way to source, match, evaluate and hire the next generation of Amazonians. This leader will work closely with business stakeholders to align technology solutions to support the organization's goals to continually improve the quality of hires while minimizing operational cost and time to fill critical roles. This role will be responsible for:\u003cbr/\u003e\u003cbr/\u003eArchitecting interconnected multi-agent systems using latetest AI frameworks\u003cbr/\u003e\u003cbr/\u003eIntegrating machine learning and GenAI-based solutions where they are game-changers\u003cbr/\u003e\u003cbr/\u003eBuilding, leading and influencing high-functional product management teams\u003cbr/\u003e\u003cbr/\u003eDefining product strategy that achieves strong customer value and business outcomes\u003cbr/\u003e\u003cbr/\u003eWorking with developers and architects to build scalable and highly reliant systems\u003cbr/\u003e\u003cbr/\u003eUsing UX, product, and business knowledge to inform decisions and communicate effectively with and influence internal teams\u003cbr/\u003e\u003cbr/\u003eProblem solving using analytical skills and a proven process of data-validated, hypothesis-driven, experiment-tested decisions\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eEach day is a new adventure and you will routinely engage with your customers, working backwards from their needs together with your UX and software development partners. This could mean defining a product vision, writing PRFAQ documents, diving deep into the technical details of agentic AI and LLM engineering frameworks and making trade-offs to deliver the highest customer value with a bias for action. You will work with our internal partners (e.g. science and engineering) to make product decisions, and with our external partners (operations center, security, etc) to launch products.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eIntelligent Talent Acquisition brings together elegant user experiences, analytics, ML and AI to ensure we continue to raise the bar with each hire. Insights become actions that support hiring across the globe, so our customers get the right service or package, each and every time.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"Do you want a role with deep meaning and the ability to make a real impact? Hiring top talent is not only critical to Amazon’s success—it can literally change the world. It took a lot of great hires to","display_distance":null,"id":"9d8aadfa-37eb-4532-aec8-16a4fdd7332b","id_icims":"3157229","is_intern":null,"is_manager":null,"job_category":"Human Resources","job_family":"Product Management - Technical","job_function_id":null,"job_path":"/en/jobs/3157229/principal-pmt-agentic-ai-pxt-workforce-intelligence","job_schedule_type":"full-time","location":"US, VA, Arlington","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS19\"],\"normalizedCityName\":\"Arlington\"}"],"normalized_location":"Arlington, Virginia, USA","optional_search_labels":[],"posted_date":"January 12, 2026","preferred_qualifications":"- Experience working directly with Engineers on product enhancements\u003cbr/\u003e- Experience in project management methodologies, business analysis, or process improvement\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Arlington - 179,900.00 - 243,400.00 USD annually","primary_search_label":"global-corporate.team-hr-for-hr","source_system":"JobCreator","state":"VA","title":"Principal PMT, Agentic AI, PXT-Workforce Intelligence","university_job":null,"updated_time":"28 minutes","url_next_step":"https://account.amazon.com/jobs/3157229/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-hr-for-hr","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience with network hardware: copper and optical fiber cabling, switches, routers\u003cbr/\u003e- 18+ months of experience in data center or critical environment or similar technical roles: Computer Hardware Repair, Infrastructure Cabling, Network Deployment, Data Center Operations\u003cbr/\u003e- 18+ months of experience with network cabling, optic types, and test equipment (VFL, power meter, OTDR, etc.)","business_category":"aws","city":"Lithia Springs","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Transform network infrastructure by joining our dynamic team! You'll be at the forefront of developing innovative solutions that drive network stability and scalability, using your technical expertise to create automated systems that power global technological advancement. \u003cbr/\u003e \u003cbr/\u003eNetwork Install Technicians will collaborate with cross-functional teams, troubleshoot complex technical scenarios, and implement strategic solutions that keep our network running seamlessly. Expect to engage in hands-on technical work that requires creativity, precision, and a passion for technological innovation. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Moving and implementing large enterprise equipment \u003cbr/\u003e- Installing Fiber and Copper cabling and patching cabling between equipment \u003cbr/\u003e- Ensuring proper safety and security standards are maintained during cabling and rack installation\u003cbr/\u003e- Following well established hardware installation procedures and break-fix activities \u003cbr/\u003e- Safely using material handling tools and equipment \u003cbr/\u003e- Traveling within and outside of the regional work area is required. \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e\u003cbr/\u003eAll physical requirements are expected with reasonable accommodations: \u003cbr/\u003e\u003cbr/\u003e- Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds \u003cbr/\u003e- Ability to work in an environment that operates 24/7 with an ability to participate in primary responder rotation and provide after-hours support as needed \u003cbr/\u003e- Working in cramped and/or elevated and/or noisy environments \u003cbr/\u003e- Bending, lifting, stretching, reaching, standing and walking for up to 8+ hours a day \u003cbr/\u003e- Ascending and descending ladders, stairs, and gangways safely and without limitation \u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e- Candidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. ","department_cost_center":null,"description_short":"Transform network infrastructure by joining our dynamic team! You'll be at the forefront of developing innovative solutions that drive network stability and scalability, using your technical expertise","display_distance":null,"id":"5108c361-5304-4c7e-846b-a600e7a3aca3","id_icims":"3186204","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3186204/network-install-technician","job_schedule_type":"full-time","location":"US, GA, Lithia Springs","locations":["{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Lithia Springs\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Lithia Springs\",\"coordinates\":\"33.79382,-84.66073\",\"normalizedCountyName\":\"Douglas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Lithia Springs, Georgia, USA\",\"location\":\"US, GA, Lithia Springs\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL72\"],\"normalizedCityName\":\"Lithia Springs\"}"],"normalized_location":"Lithia Springs, Georgia, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"February 20, 2026","preferred_qualifications":"- Experience in a data center or other critical environment\u003cbr/\u003e- Bachelor's degree or equivalent professional or military experience in an IT-related field (e.g. computer science, network engineering, etc.)\u003cbr/\u003e- Certifications in a relevant field (CCENT, Network+, CCNA)\u003cbr/\u003e- Behavioral interviewing and hiring experience\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, GA, Lithia Springs - 30.00 - 54.00 USD hourly","primary_search_label":"aws.team-it-services","source_system":"PeopleBus","state":"GA","title":"Network Install Technician","university_job":null,"updated_time":"29 minutes","url_next_step":"https://account.amazon.com/jobs/3186204/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-it-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent\u003cbr/\u003e- A minimum of 1 year in an environmental Health \u0026 Safety (EHS) related field \u003cspan style=\"font-weight: bold;\"\u003eOR;\u003c/span\u003e A bachelors degree in EHS-relevant background \u003cspan style=\"font-weight: bold;\"\u003eOR;\u003c/span\u003e 6 months experience performing in a safety-related role within Amazon\u003cbr/\u003e- Knowledge of OSHA regulations specifically 29 CFR 1910\u003cbr/\u003e- Experience using Microsoft Word and Excel in a professional capacity\u003cbr/\u003e- Experience maintaining confidentiality in matter involving security and/or personal issues in the workplace","business_category":"fulfillment-and-operations","city":"Rock Tavern","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. As a Workplace Health \u0026 Safety Specialist (WHSS), you'll be at the forefront of transforming workplace safety culture at one of the world's most innovative companies. Your expertise and dedication will directly protect employees, ensuring they return home safely to their families every day. You'll facilitate new approaches to safety, combining technology with human-centered solutions to create an environment where safety and productivity thrive together. This isn't just about maintaining safety standards – it's about revolutionizing how we think about and implement workplace safety, making a lasting impact on our people and operations. As your building's designated safety champion, you'll have the unique opportunity to build relationships, influence positive change, and help write the next chapter in Amazon's commitment to becoming Earth's Safest Place to Work.\u003cbr/\u003e\u003cbr/\u003eCore Impact Areas:\u003cbr/\u003eSafety Program Excellence \u0026 Implementation - Drive comprehensive safety programs through data-driven strategies. Lead daily safety audits, incident investigations, and risk assessments while implementing innovative solutions to prevent injuries. Deliver engaging safety training that resonates with associates and promotes a proactive safety culture. Champion continuous improvement initiatives that enhance workplace safety while maintaining operational efficiency.\u003cbr/\u003e\u003cbr/\u003eAssociate Advocacy \u0026 Cultural Leadership -  Serve as a trusted safety advisor and advocate for associate wellbeing, building strong partnerships across all levels of the organization. Foster a culture where safety is everyone's priority through effective communication, coaching, and positive reinforcement. Develop strong relationships with frontline associates and leadership to drive behavioral changes and ensure safety best practices become natural habits. Transform safety data into compelling narratives that influence positive change and drive engagement in safety initiatives.\u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements include: \u003cbr/\u003e- Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Stand/walk for up to 12 hours during shifts\u003cbr/\u003e- Work in an environment where the noise level varies \u003cbr/\u003e- Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e- Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e- Maintain effective care delivery in emergencies and assist emergency response at the site\u003cbr/\u003e\u003cbr/\u003eMust be available to work flexible shifts including days, nights and/or weekends. \u003cbr/\u003e\u003cbr/\u003eFor those that do not have an adult First Aid, CPR, AED certification from the American Heart Association or American Red Cross, must obtain within 3 weeks of start date.","department_cost_center":null,"description_short":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. As a Workplace","display_distance":null,"id":"9be4f9ac-0e59-470a-8475-97b4fa988c96","id_icims":"3163763","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3163763/ehs-specialist","job_schedule_type":"full-time","location":"US, NY, Rock Tavern","locations":["{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"Rock Tavern\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, Rock Tavern\",\"coordinates\":\"41.46662,-74.18309\",\"normalizedCountyName\":\"Orange\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Rock Tavern, New York, USA\",\"location\":\"US, NY, Rock Tavern\",\"region\":\"NY\",\"buildingCodeList\":[\"SWF1\"],\"normalizedCityName\":\"Rock Tavern\"}"],"normalized_location":"Rock Tavern, New York, USA","optional_search_labels":[],"posted_date":"January 21, 2026","preferred_qualifications":"- Bachelor’s degree or higher, preferably in a safety related field\u003cbr/\u003e- Strong communication, teamwork, analysis, judgment, and customer focus skills\u003cbr/\u003e- Experience leading and managing a team ability to analyze accident data, new processes, and machinery for potential safety concerns and conduct job hazard and job safety analyses\u003cbr/\u003e- Experience in emergency response and currently holds First Aid and CPR certificates\u003cbr/\u003e- Experience in workers compensation case management\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, Rock Tavern - 27.00 - 33.00 USD hourly","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"NY","title":"EHS Specialist","university_job":null,"updated_time":"30 minutes","url_next_step":"https://account.amazon.com/jobs/3163763/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of programming with at least one modern language such as C++, C#, Java, Python, Golang, PowerShell, Ruby experience\u003cbr/\u003e- 4+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of designing or architecting (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 4+ years of systems development in an IT or data center environment experience\u003cbr/\u003e- 4+ years of deploying and operating in a Linux/Unix environment experience\u003cbr/\u003e- 2+ years of systems design, software development, operations, automation, and process improvement experience\u003cbr/\u003e- Experience leading the design, build and deployment of complex and performant (reliable and scalable) software solutions in production","business_category":"aws","city":"Herndon","company_name":"Amazon Web Services, Inc. - A97","country_code":"USA","description":"Do you believe cloud computing will be a disruptive force in government? Do you want to architect and develop new tools to help international governments implement the cloud-enabled agencies/ministries of tomorrow? Do you enjoy mission-driven development, building awesome software, and integrating across a wide variety of services?\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services is seeking a top industry technical expert to grow our team dedicated to expanding our Controlled Working Environment (CWE) team to build, operate and maintain a Cybersecurity Maturity Model Certification (CMMC) approved infrastructure. We are seeking Senior Systems Development Engineers to build and support this working environment. You will help design architectural approaches and automate, enhance, and build new functionality for a complete separated end user workspaces environment. This role is an excellent opportunity to join Amazon’s world-class technical team, working with some of the best and brightest engineers and technical managers in the global community while also developing your skills and furthering your career within one of the most innovative and progressive technology companies anywhere.\u003cbr/\u003e\u003cbr/\u003eAmazon has a fast-paced environment where we “Work Hard, Have Fun, Make History.” On a “typical” day engineers might deep dive to root cause a customer issue, investigate why a metric is trending the wrong way, consult with the top engineers at Amazon, or discuss radical new approaches to automate operational issues.\u003cbr/\u003e\u003cbr/\u003eOur Senior Systems Development Engineers spend time:\u003cbr/\u003e\u003cbr/\u003eInvestigating new ways to improve operations.\u003cbr/\u003eDefining and developing new solutions to solve technically complex cloud issues for our customers.\u003cbr/\u003eInvestigating system variances about to affect customer applications before an actual outage occurs.\u003cbr/\u003eDiving deep into new service announcements to determine unique ways to implement them to improve the effectiveness of the CWE.\u003cbr/\u003eManaging user applications like JIRA, Confluence, BitBucket, Duo, etc\u003cbr/\u003eStudying and learning from industry recognized Amazon distinguished engineers.\u003cbr/\u003e\u003cbr/\u003eDue to federal contracts, this position requires that the candidate selected be a US Citizen.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eExperience programming with at least one modern language such as C++, C#, Java, Python, Golang, PowerShell, Ruby\u003cbr/\u003eSystems and Network Administration, or System Reliability Engineering\u003cbr/\u003eSystems engineering, network, and/or application security\u003cbr/\u003eWeb protocols, Linux/Unix tools, architecture, and experience building automated tools in Python, Java and/or Ruby","department_cost_center":null,"description_short":"Do you believe cloud computing will be a disruptive force in government? Do you want to architect and develop new tools to help international governments implement the cloud-enabled agencies/ministries","display_distance":null,"id":"bba1e0c2-b476-4250-ad9b-361d7ec9db0c","id_icims":"3176208","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"System Development Engineering","job_function_id":null,"job_path":"/en/jobs/3176208/senior-systems-development-engineer-controlled-working-environment-wwps-engineering-wwps-engineering","job_schedule_type":"full-time","location":"US, VA, Herndon","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS18\",\"MMY2\",\"WAS26\",\"WAS17R\",\"WAS35\",\"WAS21\",\"WFM531\",\"MAR9\",\"WAS17\",\"WAS25\",\"WFM870\",\"ZDC2\",\"WAS22\",\"LCYC\",\"ONM257\",\"WAS19\",\"WAS16\",\"LBAL\",\"WFM042\",\"WAS27\",\"WAS32\",\"WAS24\",\"ONM256\",\"WAS14\",\"MAX1\",\"MRG5\",\"WAS28\",\"USF5\",\"DDI4\",\"DCA25\",\"LARG\",\"MMY1\",\"LARL\",\"DCA14\",\"WFM797\",\"MRG4\",\"WAS23\",\"DCA57\",\"WAS20\"],\"normalizedCityName\":\"Arlington\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD736\",\"IAD653\",\"IAD905\",\"IAD28\",\"IAD500\",\"IAD168\",\"IAD21R\",\"IAD992\",\"IAD658\",\"DCA52\",\"IAD654\",\"IAD21\",\"IAD993\",\"IAD549\",\"IAD166\",\"IAD546\",\"IAD990\",\"IAD960\",\"IAD848\",\"IAD659\",\"IAD656\",\"IAD650\",\"IAD165\",\"IAD547\",\"IAD739\",\"IAD655\",\"IAD869\",\"IAD769\",\"IAD651\",\"IAD940\",\"IAD657\",\"IAD660\",\"IAD8\",\"IAD652\",\"IAD545\",\"IAD737\",\"IAD31\",\"IAD980\",\"IAD548\",\"IAD167\",\"IAD991\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Herndon, Virginia, USA","optional_search_labels":[],"posted_date":"February  6, 2026","preferred_qualifications":"- 1+ years of development/programming/scripting language (Python/Java/Bash/Perl) experience\u003cbr/\u003e- Knowledge of engineering practices and patterns for the full software/hardware/networks development life cycle, including coding standards, code reviews, source control management, build processes, testing, certification, and livesite operations\u003cbr/\u003e- Experience taking a leading role in building complex software or computing infrastructure that has been successfully delivered to customers\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, ARLINGTON - 151,200.00 - 204,600.00 USD annually\u003cbr/\u003eUSA, VA, Arlington - 151,200.00 - 204,600.00 USD annually\u003cbr/\u003eUSA, VA, Herndon - 151,200.00 - 204,600.00 USD annually","primary_search_label":"aws.team-public-sector","source_system":"JobCreator","state":"VA","title":"Senior Systems Development Engineer, Controlled Working Environment, WWPS Engineering, WWPS Engineering","university_job":null,"updated_time":"30 minutes","url_next_step":"https://account.amazon.com/jobs/3176208/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-public-sector","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}