{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- 1+ years of computer/server hardware troubleshooting or related IT experience","business_category":"aws","city":"Berwick","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is seeking Data Center Technicians to support our customers in multiple locations. This position requires the successful candidate report to a site location.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is a fast-paced technology company and a leader in the world of data centers. The position will help ensure overall availability and reliability to meet or exceed defined service levels of data center operations. This position may involve participation in an primary responder rotation, which includes monitoring the data center infrastructure, coordinating response to operational incidents, and partnering with other teams to rapidly resolve issues that impact service availability. Primary responder responsibilities may require evening, weekend, holiday, and/or night work to ensure our global data centers are operating at the highest levels of reliability for our customers. All candidates should be willing to work both independently and with a team. Work prioritization, organizational skills, effective communication, and the ability to react quickly are critical to success. In addition to hardware and network repair candidates will install equipment, create documentation, innovate solutions, and fix problems within the data center space. This team works in an environment that operates 24/7. Traveling within and outside of regional work area is required.\u003cbr/\u003e\u003cbr/\u003eAll physical requirements are expected with reasonable accommodations:\u003cbr/\u003e• Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds\u003cbr/\u003e• Ability to work in an environment that operates 24/7 with an ability to participate in primary responder rotation and provide after-hours support as needed\u003cbr/\u003e• Working in cramped and/or elevated and/or noisy environments\u003cbr/\u003e• Bending, lifting, stretching, reaching, standing and walking for up to 8+ hours a day\u003cbr/\u003e• Ascending and descending ladders, stairs, and gangways safely and without limitation\u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon is not able to provide sponsorship now or in the future for these positions. Eligible candidates must have work authorization without employer intervention to be considered.\u003cbr/\u003e\u003cbr/\u003eNOTE: If applying for positions in Oregon (OR) and Ohio (OH), these sites are within AWS GovCloud region. Effective May 15, 2017, logical access to the AWS GovCloud region will be restricted to Amazon employees who are U.S. Citizens (GovCloud may NOT be accessed from outside of the United States).\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Performing server rack installations, hardware break-fix on various components, troubleshooting network issues, and responding to operational incidents that impact service availability, escalating to senior technicians and management as needed/required\u003cbr/\u003e• Serving as a primary contact point for both internal and external stakeholders, including engineers, software developers, vendors, and contractors\u003cbr/\u003e• Performing on-call duties and participating in scheduled maintenance and change management activities\u003cbr/\u003e• Contributing to documentation and process improvement initiatives based on your analysis of operational issues\u003cbr/\u003e• Helping to train and onboard new team members\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Data Center Technician professional, you have industry-leading technical abilities and demonstrate a breadth of knowledge while you:\u003cbr/\u003e• Take ownership of technical issues brought by their customer base, engaging other teams when needed to drive resolution\u003cbr/\u003e• Solve problems at their root and step back to understand the broader context\u003cbr/\u003e• Maintain service level agreements through the implementation of proactive issue detection and reporting\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"2d0f6840-aa20-40eb-91cf-4cdc2ac8e30b","id_icims":"3173772","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3173772/data-center-technician-dcc-communities","job_schedule_type":"full-time","location":"US, PA, Berwick","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Berwick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Berwick\",\"coordinates\":\"41.05089,-76.24352\",\"normalizedCountyName\":\"Columbia\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Berwick, Pennsylvania, USA\",\"location\":\"US, PA, Berwick\",\"region\":\"PA\",\"buildingCodeList\":[\"PHL100\"],\"normalizedCityName\":\"Berwick\"}"],"normalized_location":"Berwick, Pennsylvania, USA","optional_search_labels":["aws.team-ais","aws.team-dc","hourly","military"],"posted_date":"February  4, 2026","preferred_qualifications":"- Experience managing work and priorities through a ticketing system\u003cbr/\u003e- Experience working in a Data Center environment\u003cbr/\u003e- An Associate’s degree, technical certification, or equivalent professional or military experience in a relevant field (e.g., computer science, networking engineering, etc.)\u003cbr/\u003e- Understanding of network design, protocols and layer 1/2 troubleshooting\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, PA, Berwick - 27.00 - 47.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"PA","title":"Data Center Technician , DCC Communities ","university_job":null,"updated_time":"2 minutes","url_next_step":"https://account.amazon.com/jobs/3173772/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of tax, finance or a related analytical field experience\u003cbr/\u003e- 5+ years of multiple finance and accounting roles experience\u003cbr/\u003e- 5+ years of applying key financial performance indicators (KPIs) to analyses experience\u003cbr/\u003e- 5+ years of building financial and operational reports/data sets that inform business decision-making experience\u003cbr/\u003e- 5+ years of creating process improvements with automation and analysis experience\u003cbr/\u003e- Bachelor's degree in engineering, statistics or business, or Bachelor's degree and 5+ years of quantitative role (engineering, process re-engineering, quality assurance) experience","business_category":"finance","city":"Sunnyvale","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Transform the financial landscape of cutting-edge device technologies by leveraging your strategic financial expertise. In this pivotal role, you'll drive critical business decisions, develop innovative financial strategies, and provide strategic insights that directly impact Amazon's Devices \u0026 Services growth and operational excellence.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Lead comprehensive financial reviews for device manufacturing and logistics operations\u003cbr/\u003e- Develop sophisticated financial models and provide strategic recommendations to senior leadership\u003cbr/\u003e- Create and maintain scalable financial processes that enhance business performance\u003cbr/\u003e- Analyze complex data sets to derive meaningful operational and financial insights\u003cbr/\u003e- Drive continuous improvement in financial reporting and analytics through innovative approaches\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour day will be a dynamic blend of strategic analysis, collaborative problem-solving, and financial innovation. You'll dive deep into complex financial data, craft compelling presentations, and engage with cross-functional teams to drive meaningful business outcomes. Expect to balance detailed financial modeling with high-level strategic thinking, all while supporting critical decision-making processes.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe are a collaborative and forward-thinking finance team dedicated to supporting Amazon's Devices \u0026 Services organization. Our team thrives on intellectual curiosity, strategic thinking, and a passion for driving operational efficiency. You'll work alongside talented professionals who are committed to pushing the boundaries of financial strategy and business performance.","department_cost_center":null,"description_short":"Transform the financial landscape of cutting-edge device technologies by leveraging your strategic financial expertise. In this pivotal role, you'll drive critical business decisions, develop innovative","display_distance":null,"id":"6714dd44-de0a-4cfe-a553-ffeb5dc22e46","id_icims":"3158375","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/Planning","job_function_id":null,"job_path":"/en/jobs/3158375/finance-manager-device-manufacturing-logistics-finance","job_schedule_type":"full-time","location":"US, CA, Sunnyvale","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sunnyvale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Sunnyvale\",\"coordinates\":\"37.37188,-122.03751\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sunnyvale, California, USA\",\"location\":\"US, CA, Sunnyvale\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC31\"],\"normalizedCityName\":\"Sunnyvale\"}"],"normalized_location":"Sunnyvale, California, USA","optional_search_labels":[],"posted_date":"January 13, 2026","preferred_qualifications":"- 6+ years of identifying incomplete or inaccurate data, identifying the root cause and creating/implementing an escalation plan experience\u003cbr/\u003e- 6+ years of solving complex business challenges by delivering accurate and timely financial models, analysis, and recommendations that have a proven impact on business (e.g., financial savings, operational improvements, or customer benefits) experience\u003cbr/\u003e- MBA, or CPA\u003cbr/\u003e- Knowledge of SQL/ETL\u003cbr/\u003e- Experience working with large-scale data mining and reporting tools (examples: SQL, MS Access, Essbase, Cognos) and other financial systems (examples: Oracle, SAP, Lawson, JD Edwards)\u003cbr/\u003e- Experience delivering forecasting, budgeting, and variance analysis, and data interpretation of results\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Sunnyvale - 104,900.00 - 179,500.00 USD annually","primary_search_label":"finance.team-devices-finance","source_system":"JobCreator","state":"CA","title":"Finance Manager, Device Manufacturing \u0026 Logistics Finance","university_job":null,"updated_time":"3 minutes","url_next_step":"https://account.amazon.com/jobs/3158375/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-devices-finance","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Knowledge of key electrical competencies and theory\u003cbr/\u003e- 1+ year of experience in data center or mission-critical facility operations (e.g., hospitals, military installations, public safety facilities, manufacturing); OR Bachelor's degree in a relevant STEM field (e.g., Electrical Engineering, Mechanical Engineering, Nuclear Engineering, Physics); OR trade school training/certification.","business_category":"aws","city":"Manassas","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"We are looking to hire a highly motivated, best-in-class UPS Battery Testing Technician to join our growing Operations Services team. The team responsibilities include maintaining critical equipment in support of providing best in class availability for our data center customers. The UPS Battery Testing Technician will work closely with both internal customers, external vendors as well as coordinate regional resources to facilitate smooth work execution. This critical role is responsible for the preventative maintenance of UPS batteries in our data centers.\u003cbr/\u003e\u003cbr/\u003eOur ideal candidate is highly autonomous, very detail oriented, possesses strong written and verbal communication skills, and has significant experience in supporting critical infrastructure. They will possess the ability to design, develop, and deploy innovative solutions to address operational challenges. This role requires both independent contribution as well as the ability to work within multi-disciplinary teams. An expert level of understanding of battery systems is desirable, as the individual will be expected to identify areas for improvement as well as act on data provided from other teams and organizations.\u003cbr/\u003e\u003cbr/\u003eIf you are passionate about the Customer Experience; you think and act globally; and you want to contribute to the operational excellence of Amazon.com data centers then this may be the challenge you’ve been looking for! Those with critical data center environment experience are strongly encouraged to apply.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Apply preventative maintenance testing techniques in support of maintaining UPS batteries across our fleet of data centers.\u003cbr/\u003e- Act as an ambassador for safety within the team and to promote safe working across the site.\u003cbr/\u003e- Remain cognizant of and act in compliance with all security protocols.\u003cbr/\u003e- Interact with engineers, technicians, project managers and management on a daily basis.\u003cbr/\u003e- Work with engineers to develop detailed and creative solutions to complex problems, while keeping a watchful eye on timelines and costs.\u003cbr/\u003e- Develop and maintain a good working relationship across all levels in the organization.\u003cbr/\u003e- Ensure consistency in deployed configurations and track exceptions for follow up.\u003cbr/\u003e- Execute predictive and preventive maintenance programs.\u003cbr/\u003e- Provide support for LSE, weather events, planned, and unplanned outages.\u003cbr/\u003e- Provide cross functional support for ATS and Non-destructive testing teams.\u003cbr/\u003e- Other duties as assigned.\u003cbr/\u003e\u003cbr/\u003eCandidate must meet and maintain all eligibility requirements to drive a company service vehicle, including but not limited to: must have a valid driver's license issued by the state in which they reside.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"We are looking to hire a highly motivated, best-in-class UPS Battery Testing Technician to join our growing Operations Services team. The team responsibilities include maintaining critical equipment in","display_distance":null,"id":"9ef5f31d-fbc2-49a0-88ea-f8fca920669e","id_icims":"3124490","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3124490/ups-battery-maintenance-technician-dcc-communities","job_schedule_type":"full-time","location":"US, VA, Manassas","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Manassas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Manassas\",\"coordinates\":\"38.75125,-77.47086\",\"normalizedCountyName\":\"Manassas (City)\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Manassas, Virginia, USA\",\"location\":\"US, VA, Manassas\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD322\"],\"normalizedCityName\":\"Manassas\"}"],"normalized_location":"Manassas, Virginia, USA","optional_search_labels":["aws.team-dc","hourly","military","aws.team-ais"],"posted_date":"November 11, 2025","preferred_qualifications":"- Proficiency in identifying safety concerns and maintaining a secure work environment in compliance with NFPA 70E guidelines.\u003cbr/\u003e- Ability to conduct quantitative and qualitative analysis.\u003cbr/\u003e- Basic scripting experience (Python).\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Manassas - 31.00 - 55.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"VA","title":"UPS Battery Maintenance Technician, DCC Communities ","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3124490/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of with Excel experience\u003cbr/\u003e- 4+ years of supply chain, inventory management or project management experience\u003cbr/\u003e- Bachelor's degree, or 3+ years of professional or military experience","business_category":"retail","city":"Heredia","company_name":"Amazon Support Services Costa Rica SRL","country_code":"CRI","description":"Amazon is looking for a smart, motivated, and self-driven Instock Manager to join our Global Direct Imports team for emerging countries. He or she will have responsibility for end-to-end business ownership of the import supply chain processes from manufacturer to the availability in our Fulfillment Centers and for developing and implementing inventory management strategies to optimize customer experience, sales and margin. \u003cbr/\u003e\u003cbr/\u003eDirect Imports is a strategic initiative for Amazon with long-term business impact and triple digit growth YoY. This individual will partner with various teams across Amazon (Operations, Global Logistics, Supply Chain Technology, Retail and Finance teams) as well as external partners to support critical new business initiatives and drive continuous improvement in all aspects of our program. The scope of the program includes Hardlines and/or Consumables categories.\u003cbr/\u003e\u003cbr/\u003eThe successful candidate is an innovator, communicator, influencer and problem solver who takes a data-driven approach to solve complex problems across our Imports supply chain. \u003cbr/\u003e\u003cbr/\u003eThe candidate possesses superb business judgment, with a track record of strong project delivery and relationship management, deep analytical acumen, with experience generating and managing forecasts, reports, and analyses. The position requires an individual who can work autonomously in a fast paced, highly demanding and often ambiguous environment.  The candidate possesses highly analytical individual, flexible, action and results oriented, self-starting, and comfortable with computer databases and tools. \u003cbr/\u003e\u003cbr/\u003eAdditionally since this position involves working with multiple stakeholders in a fast growing opportunity within Direct Imports, we need someone with strong stakeholder management capabilities and ownership with great bias for action in getting things done, with strong written and oral communication skills and that is able to meet tight deadlines while working on several projects simultaneously. The position provides opportunities to influence high visibility/impact areas throughout the organization.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the hiring group\u003cbr/\u003e\u003cbr/\u003eThe International Expansions team is responsible for helping to launch new Amazon marketplaces around the world. Our Global Retail Imports program is focused on working with top vendors through direct imports for emerging countries.\u003cbr/\u003eOur team is based in Mexico and Seattle. We work closely with our stakeholder teams in Australia, Mexico, Canada, Singapore, United Arab Emirates and US.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e1) Oversee the instock function including forecasting, ordering, capacity management, instock rates and unhealthy inventory management\u003cbr/\u003e2)  Develop and improve import ordering strategies for his/her categories to ensure Amazon meets the optimal mix of domestic and import sourcing.\u003cbr/\u003e3) Activities towards buying automation and system auditing in partnership with technical and product teams\u003cbr/\u003e4) Activities on supply chain optimization and defects reduction working with operations teams\u003cbr/\u003e5) Report, monitor, analyze and own key performance indicators such as vendor import share, out of stock      percentages, vendor lead time, fill rate, unhealthy inventory and forecast accuracy for import selection.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eInclusive team culture \u003cbr/\u003eAt Amazon we embrace our differences and we are committed to furthering our culture of inclusion. We host annual and ongoing learning experiences. Amazon’s culture of inclusion is reinforced within our 14 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.\u003cbr/\u003e \u003cbr/\u003eWork Life Balance \u003cbr/\u003eWe believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfillment. We offer flexibility in working hours and encourage you to find your own balance between your work and personal lives.\u003cbr/\u003e \u003cbr/\u003eMentorship \u0026 Career Growth \u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded professional.","department_cost_center":null,"description_short":"Amazon is looking for a smart, motivated, and self-driven Instock Manager to join our Global Direct Imports team for emerging countries. He or she will have responsibility for end-to-end business ownership","display_distance":null,"id":"12b16219-ec6e-444c-aaa2-8744b99f0cf3","id_icims":"3172428","is_intern":null,"is_manager":null,"job_category":"Buying, Planning, \u0026 Instock Management","job_family":"Buying/Planning","job_function_id":null,"job_path":"/en/jobs/3172428/instock-manager-imports-global-retail-import","job_schedule_type":"full-time","location":"CR, H, Heredia","locations":["{\"normalizedStateName\":\"Heredia\",\"normalizedCountryCode\":\"CRI\",\"city\":\"Heredia\",\"countryIso3a\":\"CRI\",\"countryIso2a\":\"CR\",\"locationNonStemming\":\"Costa Rica, H, Heredia\",\"coordinates\":\"9.99969,-84.11717\",\"normalizedCountyName\":\"Heredia\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Costa Rica\",\"normalizedLocation\":\"Heredia, Heredia, CRI\",\"location\":\"CR, H, Heredia\",\"region\":\"H\",\"buildingCodeList\":[\"SJO22\"],\"normalizedCityName\":\"Heredia\"}"],"normalized_location":"Heredia, Heredia, CRI","optional_search_labels":[],"posted_date":"February  3, 2026","preferred_qualifications":"- Knowledge of the principles of statistical inventory control\u003cbr/\u003e- Experience with process improvement techniques such as Kaizen, Lean Manufacturing or Six Sigma\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"retail.no-team-listed","source_system":"JobCreator","state":"H","title":"Instock Manager Imports, Global Retail Import","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3172428/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of professional software development experience\u003cbr/\u003e- Bachelor's degree in Computer Science or a closely related field\u003cbr/\u003e- Experience in documentation, unit testing, code reviews, test automation, continuous integration \u0026 deployment","business_category":"subsidiaries","city":"Newark","company_name":"Audible, Inc.","country_code":"USA","description":"At Audible, we believe stories have the power to transform lives. It’s why we work with some of the world’s leading creators to produce and share audio storytelling with our millions of global listeners. We are dreamers and inventors who come from a wide range of backgrounds and experiences to empower and inspire each other. Imagine your future with us.\u003cbr/\u003e\u003cbr/\u003eABOUT THIS ROLE\u003cbr/\u003eReaching millions of listeners is all in a day’s work for our iOS Software Engineers. You’ll grow and strengthen the technologies that allow us to advance Audible’s reach within the iOS ecosystem beyond the iPhone to devices like Apple Watch, CarPlay, and Apple TV. You’ll work your magic on new technologies while enabling a seamless iOS experience like no other. We want Audible customers to listen and engage with the world’s largest audiobook portfolio; all we need, is you. Plus, you’ll experience what’s possible with the strong technology foundation and infrastructure of our parent company and global e-commerce leader, Amazon. \u003cbr/\u003e\u003cbr/\u003eABOUT YOU\u003cbr/\u003e- You enjoy solving complex engineering problems\u003cbr/\u003e- You're adaptable, enthusiastic and willing to take ownership\u003cbr/\u003e- You think creatively and seek to adapt the message to the audience\u003cbr/\u003e\u003cbr/\u003eAs a Software Development Engineer, you will...\u003cbr/\u003e- Lead the way - \"Lead\" means staying up to date with tools, trends, technologies, and frameworks both industry-wide and within Amazon, and sharing that knowledge in a meaningful way with the community\u003cbr/\u003e- Partner with product management to imagine, design, develop, test, and launch software that invigorates our community and inspires our peers\u003cbr/\u003e- Manage individual project priorities, deadlines and deliverables\u003cbr/\u003e- Adopt best practices in software engineering: design, testing, version control, documentation, build, deployment, and operations\u003cbr/\u003e\u003cbr/\u003eABOUT AUDIBLE\u003cbr/\u003eAudible is the leading producer and provider of audio storytelling. We spark listeners’ imaginations, offering immersive, cinematic experiences full of inspiration and insight to enrich our customers daily lives. We are a global company with an entrepreneurial spirit. We are dreamers and inventors who are passionate about the positive impact Audible can make for our customers and our neighbors. This spirit courses throughout Audible, supporting a culture of creativity and inclusion built on our People Principles and our mission to build more equitable communities in the cities we call home.","department_cost_center":null,"description_short":"At Audible, we believe stories have the power to transform lives. It’s why we work with some of the world’s leading creators to produce and share audio storytelling with our millions of global listeners.","display_distance":null,"id":"2df0aa04-549c-4d5e-881f-df630e04bff3","id_icims":"3164933","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3164933/software-development-engineer-ios","job_schedule_type":"full-time","location":"US, NJ, Newark","locations":["{\"normalizedStateName\":\"New Jersey\",\"normalizedCountryCode\":\"USA\",\"city\":\"Newark\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NJ, Newark\",\"coordinates\":\"40.73197,-74.17421\",\"normalizedCountyName\":\"Essex\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Newark, New Jersey, USA\",\"location\":\"US, NJ, Newark\",\"region\":\"NJ\",\"buildingCodeList\":[\"EWR11\"],\"normalizedCityName\":\"Newark\"}"],"normalized_location":"Newark, New Jersey, USA","optional_search_labels":[],"posted_date":"January 22, 2026","preferred_qualifications":"- Knowledge of software engineering best practices across the development life cycle, including agile methodologies, coding standards, code reviews, source management, build processes, testing, and operations\u003cbr/\u003e- Experience building mobile UI with SwiftUI or UIKit, especially Auto Layout and related SDKs, including use of storyboard and animations\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NJ, Newark - 121,600.00 - 180,600.00 USD annually","primary_search_label":"subsidiaries.team-global-audible","source_system":"JobCreator","state":"NJ","title":"Software Development Engineer, iOS","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3164933/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-audible","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Baccalauréat ou expérience équivalente dans un domaine quantitatif (p. ex. informatique, statistiques, mathématiques). Bonne connaissance des méthodes statistiques.\u003cbr/\u003e- Plus de 10 ans d’expérience dans l’ingénierie des données ou logicielle, avec une solide compréhension du traitement distribué des données (p. ex. pipelines de données, moteurs de calcul distribués, conception de l’infrastructure d’AA).\u003cbr/\u003e- Plus de 5 ans d’expérience dans le développement de plateformes pour la modélisation prédictive, le traitement du langage naturel et l’apprentissage profond, avec une expérience démontrée dans la création, l’hébergement et le déploiement de modèles d’apprentissage automatique.\u003cbr/\u003e- Maîtrise de SQL, Python et d’au moins un langage de programmation supplémentaire (p. ex. Java, Scala, JavaScript, TypeScript). Maîtrise des bibliothèques et des cadres d’AA de pointe tels que scikit-learn, TensorFlow et PyTorch.\u003cbr/\u003e- Plus de 2 ans d’expérience dans les services infonuagiques liés à l’apprentissage automatique (p. ex. SageMaker).\u003cbr/\u003e- Maîtrise du français et de l'anglais si vous êtes basé à Montréal\u003cbr/\u003e- Puisque ce rôle nécessite que l’employé interagisse avec d’autres entités d’Amazon à l’échelle mondiale ainsi qu’avec des employés et intervenants dans d’autres provinces canadiennes, la connaissance du français et de l’anglais est exigée pour ce poste si vous êtes basé à Montréal\u003cbr/\u003e- ---\u003cbr/\u003e- Bachelor’s degree or equivalent experience in a quantitative field (e.g., Computer Science, Statistics, Mathematics). Strong understanding of statistical methods.\u003cbr/\u003e- 10+ years of experience in data or software engineering, with a strong understanding of distributed data processing. (e.g. data pipelines, distributed computing engines, ML infrastructure design).\u003cbr/\u003e- 5+ years developing platforms for predictive modeling, natural language processing, and deep learning, with a proven track record of building, hosting and deploying machine learning models.\u003cbr/\u003e- Proficiency in SQL, Python, and at least one additional programming language (e.g., Java, Scala, JavaScript, TypeScript). Proficient with industry leading ML libraries and frameworks such as scikit-learn, TensorFlow, PyTorch.\u003cbr/\u003e- 2+ year of experience with cloud services related to machine learning (e.g., SageMaker)\u003cbr/\u003e- Fluent in French and English if based in Montreal\u003cbr/\u003e- Due to the nature of the role that requires interaction with other Amazon entities globally and with Amazon employees and stakeholders in other provinces in Canada, bilingualism French and English is required for this position if based in Montreal","business_category":"aws","city":"Vancouver","company_name":"Amazon Web Services Canada, Inc.","country_code":"CAN","description":"Êtes-vous enthousiaste à l’idée de créer des solutions logicielles autour de grands systèmes complexes d’apprentissage automatique (AA) et d’apprentissage profond (AP)? Vous souhaitez aider les plus grandes entreprises mondiales à tirer une valeur commerciale de l’adoption et de l’automatisation de l’intelligence artificielle (IA)? Vous souhaitez parfaire vos connaissances au contact des cas d’utilisation de l’AA et de l’AP d’AWS mis en œuvre dans de nombreuses entreprises? Vous êtes ravi à l’idée d’être un élément clé d’Amazon, entreprise pionnière qui façonne la technologie mondiale de l’IA et investit dans l’apprentissage automatique depuis des décennies?\u003cbr/\u003e\u003cbr/\u003eChez Amazon Web Services (AWS), nous recrutons des ingénieurs techniques en apprentissage automatique, qui collaboreront avec nos scientifiques des données afin de fournir des solutions révolutionnaires aux clients. Nous recherchons des ingénieurs ayant une expérience dans la science des données et des scientifiques des données ayant une expérience dans l’ingénierie pour soutenir nos efforts auprès du milieu de l’Internet des objets (IdO), des corporations et des jeunes entreprises. Nous voulons faire passer votre savoir-faire en science des données à un niveau supérieur, tout en maximisant pour les clients les avantages de l’IA et de l’AA sur la plateforme AWS. Cela signifie concevoir et opérationnaliser des solutions d’AA et d’AP pour nos clients, tout en les aidant à adopter les bonnes pratiques actuelles en matière d’apprentissage automatique, et ce, à chaque étape du cycle de développement de leurs modèles.\u003cbr/\u003e\u003cbr/\u003eLes services professionnels AWS constituent une équipe de consultants unique en son genre. Nous sommes fiers d’être préoccupés par le client et de nous concentrer sur la mise en œuvre de l’AA chez nos clients. Si vous avez de l’expérience dans le domaine de l’AA, y compris la création, le déploiement et la surveillance de modèles, nous aimerions vous compter parmi notre équipe. Une connaissance des solutions infonuagiques (pas nécessairement AWS) et des bonnes pratiques en matière de DevOps est essentielle, car vous travaillerez avec des équipes de scientifiques des données, d’ingénieurs de données et d’architectes pour concevoir de véritables solutions de bout en bout. Vous devez être prêt(e) à découvrir de nouvelles technologies et en avoir l’envie.\u003cbr/\u003e\u003cbr/\u003eVous fournirez des informations générales et approfondies aux clients et aux partenaires pour les aider à éliminer les contraintes qui les empêchent d’exploiter les services AWS de manière à en tirer une valeur stratégique. Ce rôle exige une implication dans le travail d’équipe, un sens de l’urgence et des compétences en communication. La conception de solutions d’IA/AA fiables, évolutives et performantes nécessite une solide expertise technique, une bonne compréhension des principes fondamentaux de l’informatique et une expérience pratique dans la construction de systèmes distribués à grande échelle.\u003cbr/\u003e\u003cbr/\u003e---\u003cbr/\u003e\u003cbr/\u003eAre you excited about building software solutions around large, complex Machine Learning (ML) and Deep Learning (DL) systems? Want to help the largest global enterprises derive business value through the adoption and automation of Artificial Intelligence (AI)? Eager to learn from many different enterprises’ use cases of AWS ML and DL? Thrilled to be a key part of Amazon, who has been investing in Machine Learning for decades - pioneering and shaping the world’s AI technology?\u003cbr/\u003e\u003cbr/\u003eAt Amazon Web Services (AWS), we’re hiring technical Machine Learning Engineers to collaborate with our Data Scientists to deliver ground-breaking solutions for customers. We are looking for Engineers with Data Science experience and Data Scientists with Engineering experience to support our efforts in the Enterprise, IoT, and start-up communities. We want to take your full-stack Data Science know-how to a new level by empowering AWS customers to maximize the benefits they receive through AI/ML on the AWS platform. This means building and operationalizing ML and DL solutions for our customers while helping them adopt modern Machine Learning best practices throughout every stage of their model development lifecycle.\u003cbr/\u003e\u003cbr/\u003eAWS Professional Services is a unique consulting team. We pride ourselves on being customer obsessed and highly focused on the ML enablement of our customers. If you have experience with ML, including building, deploying, and monitoring models, we’d like you to join our team. A familiarity with cloud solutions (not necessarily AWS) and DevOps best practices is key as you will work with teams of Data Scientists, Data Engineers, and Architects to build truly end-to-end solutions. You must be prepared and eager to learn new technologies in this role.\u003cbr/\u003e\u003cbr/\u003eYou will provide deep and broad insight to customers and partners to help remove constraints that prevent them from leveraging AWS services to create strategic value. A commitment to team work, hustle, and communication skills are important in this role. Creating reliable, scalable, and high-performance AI/ML solutions requires strong technical expertise, a sound understanding of the fundamentals of Computer Science, and practical experience building large-scale distributed systems.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Diriger des projets d’apprentissage automatique (AA/IA) complets : compréhension des besoins de l’entreprise, préparation des données, développement de modèles, déploiement et surveillance. \u003cbr/\u003e* Concevoir et mettre en œuvre des plateformes de données performantes, fiables et sécurisées.\u003cbr/\u003e* Concevoir des solutions et des opérations d’AA évolutives (MLOps) à l’aide des services AWS. Tirer parti des solutions d’IA générative, le cas échéant.\u003cbr/\u003e* Créer et évaluer des modèles prédictifs afin de fournir des informations exploitables à des fins de prévision, d’optimisation des ressources et d’analyse des tendances de la clientèle.\u003cbr/\u003e* Collaborer avec des équipes interfonctionnelles (DevOps, ingénierie des données, IdO, calcul haute performance) pour préparer, analyser et rendre opérationnels les données et les modèles.\u003cbr/\u003e* Agir en tant que conseiller de confiance auprès des clients sur les solutions d’IA et d’AA et les architectures infonuagiques.\u003cbr/\u003e* Accompagner et encadrer les débutants afin de favoriser leur développement professionnel.\u003cbr/\u003e* Élaborer du contenu technique, tel que des livres blancs et des articles de blog, afin de partager les meilleures pratiques.\u003cbr/\u003e* Veiller à ce que les solutions répondent aux normes de l’industrie et aider les clients à faire progresser leurs stratégies d’adoption de l’IA, de l’AA et du nuage.\u003cbr/\u003e\u003cbr/\u003eIl s’agit d’un poste en contact avec la clientèle, avec des déplacements possibles sur les sites des clients, le cas échéant.\u003cbr/\u003e\u003cbr/\u003e---\u003cbr/\u003e\u003cbr/\u003e* Lead end-to-end machine learning (ML/AI) projects, from understanding business needs to data preparation, model development, deployment and monitoring. \u003cbr/\u003e* Design and implement data platforms that support high-performance, reliable, and secure data platforms.\u003cbr/\u003e* Design scalable ML solutions and operations (MLOps) using AWS services. Leverage Generative AI solutions when applicable.\u003cbr/\u003e* Build and evaluate predictive models to provide actionable insights for forecasting, resource optimization, and customer trends.\u003cbr/\u003e* Collaborate with cross-functional teams (DevOps, Data Engineering, IoT, HPC) to prepare, analyze, and operationalize data and models.\u003cbr/\u003e* Serve as a trusted advisor to customers on AI/ML solutions and cloud architectures\u003cbr/\u003e* Coach and mentor junior individuals to support their professional growth.\u003cbr/\u003e* Develop technical content, such as white papers and blog posts, to share best practices.\u003cbr/\u003e* Ensure solutions meet industry standards and support customers in advancing their AI/ML and cloud adoption strategies.\u003cbr/\u003e\u003cbr/\u003eThis is a customer-facing role with potential travel to customer sites as needed.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eÀ propos d'AWS (English description to follow)\u003cbr/\u003e\u003cbr/\u003eDes expériences diverses\u003cbr/\u003eAWS accorde une grande importance à la diversité des expériences. Même si vous ne répondez pas à toutes les qualifications et compétences énumérées dans la description du poste, nous encourageons les candidats à postuler. Si votre carrière débute, si vous n'avez pas suivi un parcours traditionnel ou si vous avez des expériences alternatives, cela ne doit pas vous empêcher de postuler.\u003cbr/\u003e\u003cbr/\u003ePourquoi AWS ?\u003cbr/\u003eAmazon Web Services (AWS) est la plateforme infonuagique la plus complète et la plus amplement adoptée au monde. Nous avons été les pionniers de l'informatique infonuagique et n'avons jamais cessé d'innover. C'est pourquoi nos clients, des startups les plus prospères jusqu’aux entreprises du Fortune 500, font confiance à notre gamme de produits et de services pour faire avancer leurs entreprises.\u003cbr/\u003e\u003cbr/\u003eUne culture d'équipe inclusive\u003cbr/\u003eChez AWS, c’est dans notre nature d'apprendre et d'être curieux. Nos groupes d'affinité dirigés par nos employés favorisent une culture d'inclusion qui nous permet d'être fiers de nos différences. Des événements et des expériences d'apprentissage toujours en cours, notamment les conférences sur la race et l'ethnicité (CORE) et AmazeCon (diversité des genres), nous incitent à ne jamais cesser de valoriser nos différences.\u003cbr/\u003e\u003cbr/\u003eMentorat et développement de carrière\u003cbr/\u003eNous élevons continuellement la barre de notre performance au plus haut, car nous nous efforçons de devenir le meilleur employeur de la planète. C'est ainsi que vous trouverez que nous avons de nombreuses ressources de partage de connaissances, de mentorat et d'autres ressources de développement de carrière pour vous aider à devenir un professionnel mieux équilibré.\u003cbr/\u003e\u003cbr/\u003eL’équilibre entre vie professionnelle et vie privée\u003cbr/\u003eNous accordons une grande importance à l'équilibre entre la vie professionnelle et la vie privée. La réussite professionnelle ne doit jamais croite en désavantagent la vie personnelle. C'est donc pour ça que la flexibilité d’horaires et de conditions de travail fait partie de notre culture. Lorsque nous nous sentons soutenus autant au travail qu’à la maison, il n'y a rien que nous ne puissions réaliser dans l’environnement de l’infonuagique.\u003cbr/\u003e\u003cbr/\u003e---\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"Êtes-vous enthousiaste à l’idée de créer des solutions logicielles autour de grands systèmes complexes d’apprentissage automatique (AA) et d’apprentissage profond (AP)? Vous souhaitez aider les plus grandes","display_distance":null,"id":"2be02a48-22b4-4be9-8439-fd13d6da09dc","id_icims":"3062181","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Professional Services","job_function_id":null,"job_path":"/en/jobs/3062181/ingenieur-en-apprentissage-automatique-senior-senior-machine-learning-engineer-professional-services","job_schedule_type":"full-time","location":"CA, BC, Vancouver","locations":["{\"normalizedStateName\":\"British Columbia\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Vancouver\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, BC, Vancouver\",\"coordinates\":\"49.26038,-123.11336\",\"normalizedCountyName\":\"Metro Vancouver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Vancouver, British Columbia, CAN\",\"location\":\"CA, BC, Vancouver\",\"region\":\"BC\",\"buildingCodeList\":[\"YVR26\"],\"normalizedCityName\":\"Vancouver\"}","{\"normalizedStateName\":\"Quebec\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Montreal\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, QC, Montreal\",\"coordinates\":\"45.5124,-73.55469\",\"normalizedCountyName\":\"Montreal\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Montreal, Quebec, CAN\",\"location\":\"CA, QC, Montreal\",\"region\":\"QC\",\"buildingCodeList\":[\"YUL11\"],\"normalizedCityName\":\"Montreal\"}","{\"normalizedStateName\":\"Alberta\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Calgary\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, AB, Calgary\",\"coordinates\":\"51.04532,-114.06301\",\"normalizedCountyName\":\"Alberta\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Calgary, Alberta, CAN\",\"location\":\"CA, AB, Calgary\",\"region\":\"AB\",\"buildingCodeList\":[\"YYC11\"],\"normalizedCityName\":\"Calgary\"}","{\"normalizedStateName\":\"Ontario\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Toronto\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, ON, Toronto\",\"coordinates\":\"43.64869,-79.38544\",\"normalizedCountyName\":\"Toronto\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Toronto, Ontario, CAN\",\"location\":\"CA, ON, Toronto\",\"region\":\"ON\",\"buildingCodeList\":[\"YYZ18\"],\"normalizedCityName\":\"Toronto\"}"],"normalized_location":"Vancouver, British Columbia, CAN","optional_search_labels":["aws-team-global-services-optional"],"posted_date":"August 19, 2025","preferred_qualifications":"- Expérience dans un rôle axé sur le client, idéalement dans le domaine du conseil, de la direction d’engagements techniques et de la traduction d’exigences commerciales en solutions de données évolutives. Influence démontrée sur la prise de décision de la haute direction (directeurs, cadres supérieurs et vice-présidents).\u003cbr/\u003e- Expérience dans la création de pipelines d’AA en suivant les meilleures pratiques en matière de MLOps, notamment : prétraitement des données, hébergement de modèles, sélection des caractéristiques, réglage d’hyperparamètres, entraînement distribué, entraînement de processeurs graphiques, déploiement, surveillance et réentraînement.\u003cbr/\u003e- Expérience de la création d’applications à l’aide d’outils et de technologies d’IA générative (LLM, bases de données vectorielles, orchestrateurs tels que LangChain, ingénierie de requête).\u003cbr/\u003e- Expérience des cadres distribués (p. ex. Spark, Hadoop, Kafka, Presto, Flink, S3, HDFS, BD) et compréhension de JVM ou des environnements d’exécution similaires.\u003cbr/\u003e- Expérience dans le développement d’infrastructures en tant que code (p. ex. CloudFormation, CDK, Terraform), de conteneurs et de pipelines CI/CD.\u003cbr/\u003e- Expérience des outils MLOps (p. ex. MLFlow, Kubeflow, DVC) et des outils d’orchestration (p. ex. Airflow, AWS Step Functions).\u003cbr/\u003e- ---\u003cbr/\u003e- Experience in a customer-facing role, ideally in consulting, leading technical engagements, and translating business requirements into scalable data solutions. Proven record of impact with senior leadership (director, c-level and VP) decision making.\u003cbr/\u003e- Experience building ML pipelines with best MLOps practices, including: data preprocessing, model hosting, feature selection, hyperparameter tuning, distributed training, GPU training, deployment, monitoring, and retraining.\u003cbr/\u003e- Experience building applications using Generative AI tools and technologies (LLMs, Vector Stores, Orchestrators such as LangChain, Prompt Engineering)\u003cbr/\u003e- Experience with distributed frameworks (e.g. Spark, Hadoop, Kafka, Presto, Flink, S3, HDFS, DBs) and understanding of JVM or similar runtime.\u003cbr/\u003e- Experience developing Infrastructure as Code (e.g., CloudFormation, CDK, Terraform), Containers and CI/CD Pipelines\u003cbr/\u003e- Experience with MLOps tools (e.g., MLFlow, Kubeflow, DVC) and orchestration tools (e.g., Airflow, AWS Step Functions).\u003cbr/\u003e\u003cbr/\u003eAmazon est un employeur garantissant l'égalité des chances et ne fait aucune discrimination sur la base du statut d'ancien combattant protégé, d'un handicap ou de tout autre statut protégé par la loi.\u003cbr/\u003e\u003cbr/\u003eNotre culture inclusive permet aux Amazoniens d'offrir les meilleurs résultats à nos clients. Si vous avez un handicap et que vous avez besoin de mesures d'adaptation ou d'adaptation en milieu de travail pendant le processus de candidature et d'embauche, y compris du soutien pour l'entrevue ou le processus d'intégration, veuillez visiter \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e pour plus d'informations. Si le pays ou la région dans lequel vous postulez ne figure pas dans la liste, veuillez communiquer avec votre partenaire de recrutement.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eThe base salary for this position ranges from $126,000/year up to $210,400/year. Salary is based on a number of factors and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-machine-learning-primary","source_system":"JobCreator","state":"BC","title":"Ingénieur en apprentissage automatique senior | Senior Machine Learning Engineer, Professional Services","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3062181/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-machine-learning-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"•\tPlus de 5 ans d’expérience dans l’architecture et la mise en œuvre du nuage\u003cbr/\u003e•\tPlus de 8 ans d’expérience dans la direction d’équipes techniques et la mise à profit d’une expertise pratique axée sur l’ingénierie des données ou des logiciels, avec une excellente compréhension du traitement des données distribuées.\u003cbr/\u003e•\tPlus de 8 ans d’expérience dans la conception et la création de solutions de données évolutives et hautement disponibles, y compris les pipelines ETL/ELT, la qualité des données et les processus de surveillance.\u003cbr/\u003e•\tAu moins 5 ans de maîtrise de SQL, Python et d’un autre langage de programmation a minima (par exemple, Java, Scala, etc).\u003cbr/\u003e•\t Maîtrise du français et de l’anglais requise si le poste est situé au Québec\u003cbr/\u003e\u003cbr/\u003eEn raison de la nature du poste, qui implique des interactions avec d’autres entités d’Amazon à l’échelle mondiale ainsi qu’avec des employés et parties prenantes d’Amazon dans d’autres provinces canadiennes, la maîtrise du français et de l’anglais est exigée pour ce poste si le candidat est situé au Québec.\u003cbr/\u003e\u003cbr/\u003e---\u003cbr/\u003e\u003cbr/\u003e•\t5+ years of experience in cloud architecture and implementation\u003cbr/\u003e•\t8+ years of experience leading technical teams and hands-on experience focused on data or software engineering, with a strong understanding of distributed data processing.\u003cbr/\u003e•\t8+ years of experience designing and building scalable, highly available data solutions, including ETL/ELT pipelines, data quality, and monitoring processes.\u003cbr/\u003e•\t5+ Proficiency in SQL, Python, and at least one additional programming language (e.g., Java, Scala, etc).\u003cbr/\u003e•\tFluent in French and English if located in Quebec\u003cbr/\u003e\u003cbr/\u003eDue to the nature of the role that requires interaction with other Amazon entities globally and with Amazon employees and stakeholders in other provinces in Canada, bilingualism French and English is required for this position if the candidate is located in Quebec.","business_category":"aws","city":"Montreal","company_name":"Amazon Web Services Canada, Inc.","country_code":"CAN","description":"L’équipe Services professionnels d’Amazon Web Services (ProServe) est à la recherche d’un(e) conseiller(ère) senior en prestation de services compétent(e) qui se joindra à notre équipe au sein d’Amazon Web Services (AWS). À ce poste, vous travaillerez en étroite collaboration avec les clients pour concevoir, mettre en œuvre et gérer des solutions AWS qui répondent à leurs exigences techniques et à leurs objectifs commerciaux. Vous jouerez un rôle clé dans la réussite des clients tout au long de leur parcours dans le nuage, en leur apportant une réelle expertise technique et usant des bonnes pratiques tout au long du projet. Vous dirigerez des équipes de projet axées sur le client en tant que leader technique et participerez activement au développement de solutions en apprentissage machine d’une qualité exceptionnelle.\u003cbr/\u003eFort(e) d’une connaissance approfondie des produits et services AWS, vous êtes, en votre qualité de conseiller(ère) en prestation de services, compétent(e) dans l’architecture de solutions complexes, évolutives et sécurisées, conçues pour répondre aux besoins propres à chaque client. Vous travaillerez en étroite collaboration avec les différentes parties prenantes pour inventorier les besoins, évaluer l’infrastructure actuelle et proposer des stratégies de migration efficaces vers AWS. En tant que conseiller(ère) de confiance de nos clients, vous fournirez des conseils sur les tendances du secteur, les technologies émergentes et les solutions novatrices. Vous serez chargé(e) de diriger le processus de mise en œuvre, de veiller au respect des bonnes pratiques, d’optimiser les performances et de gérer les risques tout au long du projet.  \u003cbr/\u003eL’organisation en charge des Services professionnels AWS est une équipe internationale qui aide les clients à enregistrer les résultats commerciaux attendus grâce au Nuage AWS. Nous collaborons avec les équipes clientes et le Réseau de partenaires AWS (APN) pour exécuter des initiatives infonuagiques d’entreprise. Notre équipe apporte son soutien via tout un panel d’offres qui permet d’atteindre des résultats précis liés à l’adoption du nuage par l’entreprise cliente. Elle dispense également des conseils ciblés par le biais de spécialisations qui couvrent, à l’échelle mondiale, un grand nombre de solutions, de technologies et de secteurs.\u003cbr/\u003e\u003cbr/\u003e______\u003cbr/\u003e\u003cbr/\u003eThe Amazon Web Services Professional Services (ProServe) team is seeking a skilled Delivery Consultant to join our team at Amazon Web Services (AWS). In this role, you'll work closely with customers to design, implement, and manage AWS solutions that meet their technical requirements and business objectives. You'll be a key player in driving customer success through their cloud journey, providing technical expertise and best practices throughout the project lifecycle. You will lead customer-focused project teams as a technical leader, and perform hands-on development of ML solutions with exceptional quality.\u003cbr/\u003ePossessing a deep understanding of AWS products and services, as a Delivery Consultant you will be proficient in architecting complex, scalable, and secure solutions tailored to meet the specific needs of each customer. You’ll work closely with stakeholders to gather requirements, assess current infrastructure, and propose effective migration strategies to AWS. As trusted advisors to our customers, providing guidance on industry trends, emerging technologies, and innovative solutions, you will be responsible for leading the implementation process, ensuring adherence to best practices, optimizing performance, and managing risks throughout the project.  \u003cbr/\u003eThe AWS Professional Services organization is a global team of experts that help customers realize their desired business outcomes when using the AWS Cloud. We work together with customer teams and the AWS Partner Network (APN) to execute enterprise cloud computing initiatives. Our team provides assistance through a collection of offerings which help customers achieve specific outcomes related to enterprise cloud adoption. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eEn tant que professionnel(le) aguerri(e) dans le domaine des technologies, vous devrez : \u003cbr/\u003e1.\tDiriger des équipes de projet, concevoir et mettre en œuvre des solutions AWS de données et d’analytique de bout en bout et à grande échelle qui seront complexes, évolutives, sécurisées et adaptées aux besoins des clients;\u003cbr/\u003e2.\tfournir des conseils techniques et un support de dépannage tout au long de la livraison du projet;\u003cbr/\u003e3.\tcollaborer avec les parties prenantes afin de prendre connaissance de leurs exigences et de proposer des stratégies efficaces de migration et de modernisation des données et de l’analytique;\u003cbr/\u003e4.\tagir en qualité de conseiller(ère) de confiance auprès des clients sur les tendances du secteur et les technologies émergentes, en garantissant la conformité aux normes sectorielles et aux règles de gouvernance, et en alignant les solutions de données sur les stratégies métier;\u003cbr/\u003e5.\tpartager les connaissances acquises au sein de l’organisation par le biais du mentorat, de la formation et de la création d’artefacts réutilisables\u003cbr/\u003e\u003cbr/\u003e------\u003cbr/\u003e\u003cbr/\u003eAs an experienced technology professional, you will be responsible for: \u003cbr/\u003e1.\tLeading project teams, designing and implementing end-to-end large-scale, complex, scalable, and secure Data \u0026 Analytics AWS solutions tailored to customer needs\u003cbr/\u003e2.\tProviding technical guidance and troubleshooting support throughout project delivery\u003cbr/\u003e3.\tCollaborating with stakeholders to gather requirements and propose effective Data \u0026 Analytics migration and modernization strategies\u003cbr/\u003e4.\tActing as a trusted advisor to customers on industry trends and emerging technologies, ensuring compliance with industry standards and governance whilealigning data solutions with business strategies.\u003cbr/\u003e5.\tSharing knowledge within the organization through mentoring, training, and creating reusable artifacts\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eExpériences diverses : AWS valorise les expériences diverses. Si vous n’avez pas toutes les qualifications et compétences mentionnées dans la description du poste ci-dessous, nous vous encourageons tout de même à postuler. Et si vous êtes en tout début de carrière, si vous n’avez pas suivi un cheminement traditionnel, ou si votre expérience professionnelle est hors normes et inclut des expériences alternatives, n’hésitez pas non plus à poser votre candidature.\u003cbr/\u003ePourquoi AWS? Amazon Web Services (AWS) est la plateforme infonuagique la plus complète et la plus utilisée au monde. Pionniers de l’infonuagique, nous n’avons jamais cessé d’innover. C’est pourquoi les clients, des jeunes entreprises les plus performantes aux grandes sociétés du classement Global 500, font confiance à notre solide gamme de produits et de services pour piloter leurs activités.\u003cbr/\u003eCulture d’équipe inclusive : chez AWS, il est dans notre nature d’apprendre et d’être curieux. Nos groupes d’affinités dirigés par les employés favorisent une culture de l’inclusion qui nous permet d’être fiers de nos différences. Les événements et les expériences d’apprentissage continus, notamment les Conversations sur la race et l’ethnicité (Conversations on Race and Ethnicity, CORE) et AmazeCon (diversité des genres), nous incitent à toujours affirmer notre unicité.\u003cbr/\u003eMentorat et développement de carrière : en termes de performance, nous plaçons la barre toujours plus haut, en nous efforçant de devenir le meilleur employeur au monde. C’est pourquoi vous trouverez ici une infinité de ressources sur le partage des connaissances et le mentorat, ainsi que d’autres ressources d’avancement de carrière qui contribueront à faire de vous un ou une professionnel(le) plus accompli(e).\u003cbr/\u003eÉquilibre entre vie professionnelle et vie privée : nous accordons une grande importance à l’harmonie entre la vie professionnelle et la vie privée. La réussite au travail ne doit jamais se faire au prix de sacrifices à la maison. C’est pourquoi la flexibilité fait partie intégrante de notre culture d’entreprise. Dès lors que nous nous sentons soutenus au travail comme dans la sphère privée, il n’y a pas de limites à ce que nous pouvons accomplir dans le nuage. \u003cbr/\u003e\u003cbr/\u003e----\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences: AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job below, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003eInclusive Team Culture - Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon  conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003eMentorship \u0026 Career Growth - We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003eWork/Life Balance - We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. ","department_cost_center":null,"description_short":"L’équipe Services professionnels d’Amazon Web Services (ProServe) est à la recherche d’un(e) conseiller(ère) senior en prestation de services compétent(e) qui se joindra à notre équipe au sein d’Amazon","display_distance":null,"id":"e9e0fb9b-8c52-4d7e-bfc6-51f442c7956f","id_icims":"3015866","is_intern":null,"is_manager":null,"job_category":"Data Science","job_family":"Professional Services","job_function_id":null,"job_path":"/en/jobs/3015866/architecte-principal-e-de-donnees-senior-data-architect-proserve-shared-delivery-team-data-ai","job_schedule_type":"full-time","location":"CA, QC, Montreal","locations":["{\"normalizedStateName\":\"British Columbia\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Vancouver\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, BC, Vancouver\",\"coordinates\":\"49.26038,-123.11336\",\"normalizedCountyName\":\"Metro Vancouver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Vancouver, British Columbia, CAN\",\"location\":\"CA, BC, Vancouver\",\"region\":\"BC\",\"buildingCodeList\":[\"YVR26\"],\"normalizedCityName\":\"Vancouver\"}","{\"normalizedStateName\":\"Quebec\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Montreal\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, QC, Montreal\",\"coordinates\":\"45.5124,-73.55469\",\"normalizedCountyName\":\"Montreal\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Montreal, Quebec, CAN\",\"location\":\"CA, QC, Montreal\",\"region\":\"QC\",\"buildingCodeList\":[\"YUL11\"],\"normalizedCityName\":\"Montreal\"}","{\"normalizedStateName\":\"Alberta\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Calgary\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, AB, Calgary\",\"coordinates\":\"51.04532,-114.06301\",\"normalizedCountyName\":\"Alberta\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Calgary, Alberta, CAN\",\"location\":\"CA, AB, Calgary\",\"region\":\"AB\",\"buildingCodeList\":[\"YYC11\"],\"normalizedCityName\":\"Calgary\"}","{\"normalizedStateName\":\"Ontario\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Toronto\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, ON, Toronto\",\"coordinates\":\"43.64869,-79.38544\",\"normalizedCountyName\":\"Toronto\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Toronto, Ontario, CAN\",\"location\":\"CA, ON, Toronto\",\"region\":\"ON\",\"buildingCodeList\":[\"YYZ18\"],\"normalizedCityName\":\"Toronto\"}"],"normalized_location":"Montreal, Quebec, CAN","optional_search_labels":["amazon.artificial-intelligence"],"posted_date":"June 23, 2025","preferred_qualifications":"•\tExpérience AWS de préférence, avec maîtrise d’un large éventail de services AWS (EC2, S3, RDS, Lambda, IAM, VPC, CloudFormation, par exemple)\u003cbr/\u003e•\tCertifications de niveau professionnel AWS de préférence (par exemple, architecte de solutions professionnel, ingénieur[e] DevOps professionnel[le])\u003cbr/\u003e•\tExpérience de l’automatisation et de la rédaction de scripts (Terraform ou Python, par exemple)\u003cbr/\u003e•\tConnaissance des normes de sécurité et de conformité (par exemple, HIPAA, RGPD)\u003cbr/\u003e•\tSolides compétences en matière de communication et capacité à expliquer des concepts techniques à des publics techniques et non techniques avec la capacité de diriger des équipes techniques dans le cadre de projets clients\u003cbr/\u003e•\tGrande expérience des cadres distribués (par exemple, Spark, Hadoop, Kafka, Presto, Flink, S3, HDFS, BD) et une excellente compréhension de JVM ou des environnements d’exécution similaires. Expérience de la conception et de la mise en place de mécanismes de gouvernance et de protection des données\u003cbr/\u003e•\tExpérience de la création d’applications à l’aide d’outils et de technologies d’IA générative (LLM, bases de données vectorielles, orchestrateurs tels que LangChain, ingénierie de requête)\u003cbr/\u003e\u003cbr/\u003e---\u003cbr/\u003e\u003cbr/\u003e•\tAWS experience preferred, with proficiency in a wide range of AWS services (e.g., EC2, S3, RDS, Lambda, IAM, VPC, CloudFormation)\u003cbr/\u003e•\tAWS Professional level certifications (e.g., Solutions Architect Professional, DevOps Engineer Professional) preferred\u003cbr/\u003e•\tExperience with automation and scripting (e.g., Terraform, Python)\u003cbr/\u003e•\tKnowledge of security and compliance standards (e.g., HIPAA, GDPR)\u003cbr/\u003e•\tStrong communication skills with the ability to explain technical concepts to both technical and non-technical audiences with the ability to lead technical teams in customer projects\u003cbr/\u003e•\tStrong experience with distributed frameworks (e.g. Spark, Hadoop, Kafka, Presto, Flink, S3, HDFS, DBs) and a solid understanding of JVM or similar runtime. Experience designing and building data governance and data protection mechanisms\u003cbr/\u003e•\tExperience building applications using Generative AI tools and technologies (LLMs, Vector Stores, Orchestrators such as LangChain, Prompt Engineering)\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAmazon est un employeur garantissant l'égalité des chances et ne fait aucune discrimination sur la base du statut d'ancien combattant protégé, d'un handicap ou de tout autre statut protégé par la loi.\u003cbr/\u003e\u003cbr/\u003eNotre culture inclusive permet aux Amazoniens d'offrir les meilleurs résultats à nos clients. Si vous avez un handicap et que vous avez besoin de mesures d'adaptation ou d'adaptation en milieu de travail pendant le processus de candidature et d'embauche, y compris du soutien pour l'entrevue ou le processus d'intégration, veuillez visiter \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e pour plus d'informations. Si le pays ou la région dans lequel vous postulez ne figure pas dans la liste, veuillez communiquer avec votre partenaire de recrutement.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eThe base salary for this position ranges from $126,000/year up to $210,400/year. Salary is based on a number of factors and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-data-science-primary","source_system":"JobCreator","state":"QC","title":"Architecte principal(e) de données/Senior Data Architect, ProServe Shared Delivery Team - Data \u0026 AI","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3015866/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-data-science-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience with access control and CCTV systems\u003cbr/\u003e- 6+ months' experience in security roles, preferably in a data center or similar environment.\u003cbr/\u003e- Additional education or training in security-related fields is a plus.","business_category":"aws","city":"Gilroy","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Amazon Web Services (AWS) serves customers and developers who rely on storage, compute, and our other service capabilities. Our customers trust us to handle their data with air-tight security measures, which is something that we guarantee.\u003cbr/\u003e\u003cbr/\u003eAWS is growing rapidly, and we are looking for a Data Center Security Manager to join our expanding Infrastructure Operations team.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs a Data Center Security Manager (individual contributor) you will be tasked with driving operational security excellence in several separate facilities located within a short driving distance. Your constant vigilance will discover physical security gaps and shortcomings, which you will drive to fix immediately. You will interface and direct vendors involved in new security construction, repairs, daily security operations and patrols, and planning. You will extract metrics and observe improvements by looking at hard data. You will make suggestions on improving electronic surveillance and access controls. You will direct efforts to educate data center occupants on false alarm reductions. You will write and implement security process and procedures. Your position will require you to write reports, create presentations and communicate with management on the status of physical security operations.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services (AIS)  owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. \u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Web Services (AWS) serves customers and developers who rely on storage, compute, and our other service capabilities. Our customers trust us to handle their data with air-tight security measures,","display_distance":null,"id":"09807332-d179-4e5c-84ab-b3bbad811bb4","id_icims":"3175051","is_intern":null,"is_manager":null,"job_category":"Investigation \u0026 Loss Prevention","job_family":"Data Center Security","job_function_id":null,"job_path":"/en/jobs/3175051/data-center-security-specialist-dc-security-americas-southwest","job_schedule_type":"full-time","location":"US, CA, Gilroy","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Gilroy\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Gilroy\",\"coordinates\":\"37.0046,-121.57183\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Gilroy, California, USA\",\"location\":\"US, CA, Gilroy\",\"region\":\"CA\",\"buildingCodeList\":[\"SFO080\"],\"normalizedCityName\":\"Gilroy\"}"],"normalized_location":"Gilroy, California, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"February  5, 2026","preferred_qualifications":"- College Degree (Bachelors) or Background in one or more of: Military (Career/Military Police/Military Special Operations Forces), Law Enforcement with Arrest Authority (Police Academy Graduate), TSA Security Screening, Correctional Facility Officer\u003cbr/\u003e- 2+ years Security experience or equivalent (demonstrated through work experience, training, military experience, or education)\u003cbr/\u003e- 1+ year Leadership experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Gilroy - 30.00 - 53.00 USD hourly","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"CA","title":"Data Center Security Specialist, DC Security Americas Southwest","university_job":null,"updated_time":"19 minutes","url_next_step":"https://account.amazon.com/jobs/3175051/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in developing functional specifications, design verification plans and functional test procedures\u003cbr/\u003e- Experience in aviation regulatory compliance\u003cbr/\u003e- Bachelor's degree in Computer Science, Engineering, or a related field\u003cbr/\u003e- 7+ years’ experience leading software quality assurance activities from inception of project to delivery to support DO-178C certification, and DO-330, DO-331, DO-332\u003cbr/\u003e- 7+ years' experience auditing design activities and perform process assurance activities to ensure lifecycle processes comply with approved plans and standards (ARP-4754)\u003cbr/\u003e- 5+ years' experience monitoring test execution\u003cbr/\u003e- 5+ years' experience performing conformity reviews\u003cbr/\u003e- 5+ years' experience participating FAA audits and change control boards\u003cbr/\u003e- Strong command of product development lifecycle processes\u003cbr/\u003e- Demonstrated Experience with PLM, JAMA, and other common tools","business_category":"retail","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Here at Amazon, we embrace our differences. We are committed to furthering our culture of diversity and inclusion of our teams within the organization.\u003cbr/\u003e\u003cbr/\u003eHow do you get items to customers quickly, cost-effectively, and—most importantly—safely, in less than an hour? And how do you do it in a way that can scale? Our teams of hundreds of scientists, engineers, aerospace professionals, and futurists have been working hard to do just that! We are delivering to customers, and are excited for what’s to come. Check out more information about Prime Air on the About Amazon blog (https://www.aboutamazon.com/news/transportation/amazon-prime-air-delivery-drone-reveal-photos).\u003cbr/\u003e\u003cbr/\u003eIf you are seeking an iterative environment where you can drive innovation, apply state-of-the-art technologies to solve real world delivery challenges, and provide benefits to customers, Prime Air is the place for you.\u003cbr/\u003e\u003cbr/\u003eCome work on the Amazon Prime Air Team! \u003cbr/\u003e\u003cbr/\u003ePrime Air Quality is seeking an experienced Sr. Design Quality Assurance Engineer. The successful candidate will have a strong track record of leading Hardware/Software Quality and Design Assurance engineering initiatives for certifying highly complex products in the aerospace, aviation maintenance industries. The right candidate will also be a strong integrator who prioritizes well and communicates effectively.\u003cbr/\u003e\u003cbr/\u003eExport Control License: This position may require a deemed export control license for compliance with applicable laws and regulations. Placement is contingent on Amazon’s ability to apply for and obtain an export control license on your behalf.\u003cbr/\u003e","department_cost_center":null,"description_short":"Here at Amazon, we embrace our differences. We are committed to furthering our culture of diversity and inclusion of our teams within the organization.How do you get items to customers quickly, cost-effectively,","display_distance":null,"id":"ceed094e-ab0d-4386-af93-5dc4e5e395ec","id_icims":"3175042","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/3175042/sr-design-quality-assurance-engineer-prime-air","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA109\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February  5, 2026","preferred_qualifications":"- Master's degree in electrical engineering, computer engineering, or equivalent\u003cbr/\u003e- Experience working with interdisciplinary teams to execute product design from concept to production\u003cbr/\u003e- Experience with the project management of technical projects\u003cbr/\u003e- 10+ years' experience with DQA activities in DO-178 Compliance and Auditing\u003cbr/\u003e- 5+ years' experience with DO-254 and DO-278 Compliance and Auditing\u003cbr/\u003e- Demonstrated Experience with (FAA) 14 CFR 21.137 requirements\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 137,300.00 - 185,700.00 USD annually","primary_search_label":"retail.team-global-prime-air","source_system":"JobCreator","state":"WA","title":"Sr. Design Quality Assurance Engineer, Prime Air","university_job":null,"updated_time":"19 minutes","url_next_step":"https://account.amazon.com/jobs/3175042/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-prime-air","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in computer science, electrical engineering, automation engineering, or equivalent, or 4+ years of PLC programming or automation engineering experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- 4+ years of process or production environment related PLC-controlled automation and issue diagnosis experience\u003cbr/\u003e- 4+ years of Siemens, Allen-Bradley or Codesys Ladder Logic and structure programming experience\u003cbr/\u003e- 4+ years of robotics work cells and control systems experience\u003cbr/\u003e- 4+ years of electrical theory, robotics, controls components, and automated equipment experience\u003cbr/\u003e- Travel up to 80% of the time","business_category":"operations","city":"Rockville","company_name":"Amazon.com Services LLC - A57","country_code":"USA","description":"Operations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every day. The Reliability \u0026 Maintenance Engineering (RME) team are the business partners that work tirelessly behind the scenes to make it happen. We drive continuous improvement, and maintain all of the robotics and material handling equipment (MHE) to ensure our customers are met with the Amazon smile. Come join us on our journey!\u003cbr/\u003e\u003cbr/\u003eAbout the Role:\u003cbr/\u003eAs the Regional Automation Engineer, you will engage on all aspects of high-level support for the control systems within a region of Amazon sites. This work takes the form of direct field engagement for launch and existing facilities, commissioning, on-call, continuous improvement, change management, project management, training, security, infrastructure and systems administration. You will deliver this through the use of statistics and data analytics, structured problem solving, implementation of global support mechanisms, system performance monitoring tools, identification and dissemination of best practices. In this role, you will also develop and implement standard operating procedures, optimal code/parameter sets, performance metrics, and feedback mechanisms to ensure reliability and operational efficiency of our equipment.\u003cbr/\u003e\u003cbr/\u003eWhat Do We Offer?\u003cbr/\u003eAmazon offers competitive compensation packages including comprehensive healthcare benefits starting on Day 1, matching 401(k) program, and up to 20 weeks of paid parental leave. But wait, there’s more: We provide lightweight fire-resistant daily wear and composite toe safety shoes for your safety!\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities include, but are not limited to:\u003cbr/\u003e- You will troubleshoot material handling control systems, including PLC/PC controllers, industrial networks (Ethernet, ControlNet, DeviceNet, Profibus, Profinet, ASi), motor control systems, servo drives, frequency drives, and electrical distribution systems\u003cbr/\u003e- You will apply Subject Matter Expertise (SME) on troubleshooting and dive deeps for engineering issues, supporting a region of onsite automation engineers to investigate the root cause and planning actions to eliminate/mitigate the downtime of critical assets\u003cbr/\u003e- You will  provide technical guidance and decision making for collaboration projects or initiatives with other Amazon teams, being a key stakeholder in supporting technical and major network support requests\u003cbr/\u003e- You will provide escalation support to onsite automation engineers, during and after business hours, troubleshooting locally and remotely, to ensure that all hardware or controls software within the building is repaired on time\u003cbr/\u003e- You will travel up to 80% to support sites within an assigned region ","department_cost_center":null,"description_short":"Operations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every","display_distance":null,"id":"33f3c90c-87c6-4ef8-8b96-b8a00d1a8f6a","id_icims":"3174226","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3174226/senior-automation-engineer-rockville-va","job_schedule_type":"full-time","location":"US, VA, Rockville","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Rockville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Rockville\",\"coordinates\":\"37.72805,-77.66483\",\"normalizedCountyName\":\"Hanover\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Rockville, Virginia, USA\",\"location\":\"US, VA, Rockville\",\"region\":\"VA\",\"buildingCodeList\":[\"RIC6\"],\"normalizedCityName\":\"Rockville\"}"],"normalized_location":"Rockville, Virginia, USA","optional_search_labels":[],"posted_date":"February  4, 2026","preferred_qualifications":"- Master's degree in computer science, electrical engineering, automation engineering, or equivalent\u003cbr/\u003e- Master's degree, or Six Sigma Black Belt certification\u003cbr/\u003e- Experience leading controls in manufacturing or complex industrial environments\u003cbr/\u003e- Experience identifying, maintaining, troubleshooting, and modifying Motor Controls including motor starters, Variable Frequency Drives, DC drives, and standard electrical components\u003cbr/\u003e- Experience interpreting and modifying mechanical and electrical drawings\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Rockville - 114,000.00 - 148,200.00 USD annually","primary_search_label":"operations.team-reliability-maintenance-engineering","source_system":"JobCreator","state":"VA","title":"Senior Automation Engineer - Rockville, VA","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3174226/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-reliability-maintenance-engineering","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}