{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- High school diploma or equivalent\u003cbr/\u003e- 4+ years relevant aerospace manufacturing experience\u003cbr/\u003e- 4+ years of hands-on work experience Electro-Mechanical Assembly, Final Integration and/ or Harness Integration experience\u003cbr/\u003e- 4+ years experience in a fast-paced production environment with Flight Hardware\u003cbr/\u003e- 4+ years of hand on experience with precision torque, measurement and inspection devices (i.e., automated and manual torque wrenches, calipers, micrometers, profilometers, optical inspection devices, multi-meters, torque wrenches)\u003cbr/\u003e\u003cbr/\u003eAdditional Requirements:\u003cbr/\u003e- Willing to work all shifts, overtime and weekends as needed. Estimated shift times will be on 1st shift, from 6am to 4:30pm, Sunday to Wednesday\u003cbr/\u003e- Standing for long periods of time, climbing up and down ladders, bending, grasping, sitting, pulling, pushing, stooping, and stretching may be required to perform the functions of this position\u003cbr/\u003e- Able to lift-up to 25lbs. unassisted\u003cbr/\u003e","business_category":"alexa-and-amazon-devices","city":"Kirkland","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the capacity, flexibility, and performance to serve a wide range of customers, from individual households to schools, hospitals, businesses, government agencies, and other organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eOne of the most ambitious missions that Amazon has undertaken to date, the Leo satellite constellation, is our solution to providing reliable internet to the entire world. We are looking for talented technicians to help full-scale production of the Leo satellites.\u003cbr/\u003e\u003cbr/\u003eThe success of Amazon Leo depends on the quality, reliability, cost, manufacturability, throughput, and security of the products that you deliver. If you seek a fast-paced, dynamic environment; if you thrive on solving difficult problems where resolutions have high impact; and if you love the challenge of building something from scratch, then this role will be an ideal next career step. To be successful you need to be highly motivated and detail oriented while showing the highest standards of execution.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Driving and developing departmental continuous improvement initiatives and support implementation.\u003cbr/\u003e- Assemble mechanical and electrical satellite components, sub-assemblies, and integration assemblies, fabricating and/or processing materials into complex manufactured products, and operating testing equipment and tooling, all in a Cleanroom and ESD control environment.\u003cbr/\u003e- Lead process work and review output for quality and adherence to standards and procedures\u003cbr/\u003e- Lead daily team meeting facilitation, end-of-shift reporting, and coordinating efforts to minimize production interruptions.\u003cbr/\u003e- Support new-hire training programs within your department and contribute to development and modification of training programs. You develop training plans for your team and are responsible for implementing training programs within your department.\u003cbr/\u003e- Drive safety standards and operations protocol while ensuring team compliance.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThe Lead MFG Assembly Technician will identify process improvements to improve build efficiency. You will work closely with multiple engineering teams on both early hardware development and setting the stage for later production hardware manufacturing processes. The successful candidate thrives in a fast paced, start-up like environment and are able to apply their technical expertise, leadership skills and commitment to quality to positively impact team metrics and organization goals. To be successful you need to be highly motivated and detail oriented while showing the highest standards of execution.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe are a group of Technicians with well over 20 years of diverse skills and experience. Each team member brings in willingness to train and positive team energy. With some tasks, you may be an individual contributor, but may also work in a group environment to achieve organizational goals. This group of Technicians thrive in success by working as a team. We are currently in a research and development phase but moving towards a production environment.","department_cost_center":null,"description_short":"Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the capacity,","display_distance":null,"id":"eff67a8f-e2fd-4a51-a7b7-74094666200a","id_icims":"3104528","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Manufacturing","job_function_id":null,"job_path":"/en/jobs/3104528/lead-mfg-technician-fhd-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Kirkland","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Kirkland\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Kirkland\",\"coordinates\":\"47.67887,-122.2066\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Kirkland, Washington, USA\",\"location\":\"US, WA, Kirkland\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA133\"],\"normalizedCityName\":\"Kirkland\"}"],"normalized_location":"Kirkland, Washington, USA","optional_search_labels":["devices-manufacturing","devices-services.kuiper-prod-ops"],"posted_date":"October  8, 2025","preferred_qualifications":"- 1+ years prior leadership experience, to include leading teams, projects or people\u003cbr/\u003e- Experience bringing teams and processes from development to production\u003cbr/\u003e- Aircraft \u0026 Powerplant (A\u0026P) certification/license\u003cbr/\u003e- Able to read, interpret and work from engineering documentation and/ or drawings\u003cbr/\u003e- Experience working with FOD, ESD sensitive hardware and clean room requirements\u003cbr/\u003e- Ability to work effectively in a team environment Ability to rapidly change roles/responsibilities while working in a high-paced, challenging work environment\u003cbr/\u003e- Previous military service a plus\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $63,400/year in our lowest geographic market up to $104,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Lead MFG Technician - FHD, Amazon Leo","university_job":null,"updated_time":"2 minutes","url_next_step":"https://account.amazon.com/jobs/3104528/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in a relevant field or equivalent work experience\u003cbr/\u003e- Demonstrated experience in effectively defining optimal data creation strategies and executing them\u003cbr/\u003e- 2+ years of experience in ML data operations, with a strong understanding of data annotation/ML workflows and concepts\u003cbr/\u003e- Outstanding customer communication and management skills, especially in technical consultation\u003cbr/\u003e- Ability to translate complex technical concepts into tactical applications","business_category":"amazon-artificial-general-intelligence","city":"Sunnyvale","company_name":"Amazon.com Services LLC","country_code":"USA","description":"As a Data Solutions Lead, you'll be the trusted advisor for our AGI-DS scientists, providing expert consultation on ML/Gen AI data collections and managing customer relationships. You'll drive business value through technical advisory and partnership building, creating and managing workstreams that delight our customers and deliver meaningful change for the models that back them.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eDrive and document effective ML/GenAI solutions for customer requests, transforming complex research objectives into clear, actionable data collection requirements\u003cbr/\u003eCoordinate across teams to ensure seamless delivery and stakeholder alignment\u003cbr/\u003eOwn relationships with customer scientists, becoming their go-to partner for ML data solutions\u003cbr/\u003eProvide consultation on ML workflow capabilities, helping customers maximize value\u003cbr/\u003eMonitor and optimize collection health metrics to ensure customer success\u003cbr/\u003eDrive customer adoption through providing technical value and the provision of an exemplary customer experience.\u003cbr/\u003e\u003cbr/\u003eYou'll also:\u003cbr/\u003eGuide customers on workflow feasibility and data collection best practices\u003cbr/\u003eCollaborate with implementation teams to define and validate technical requirements\u003cbr/\u003eEvaluate scalability of annotation scenarios and provide strategic recommendations\u003cbr/\u003eInfluence technical documentation and guidelines","department_cost_center":null,"description_short":"As a Data Solutions Lead, you'll be the trusted advisor for our AGI-DS scientists, providing expert consultation on ML/Gen AI data collections and managing customer relationships. You'll drive business","display_distance":null,"id":"aaa38372-a543-49f5-9f68-ea92a6efe55b","id_icims":"3150309","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Technical Account Management","job_function_id":null,"job_path":"/en/jobs/3150309/data-solutions-lead-data-collection-excellence","job_schedule_type":"full-time","location":"US, CA, Sunnyvale","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sunnyvale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Sunnyvale\",\"coordinates\":\"37.37188,-122.03751\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sunnyvale, California, USA\",\"location\":\"US, CA, Sunnyvale\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC13\"],\"normalizedCityName\":\"Sunnyvale\"}"],"normalized_location":"Sunnyvale, California, USA","optional_search_labels":[],"posted_date":"December 30, 2025","preferred_qualifications":"- Bachelor's degree in Computer Science, Business or a related field\u003cbr/\u003e- Experience in project management\u003cbr/\u003e- Working knowledge of JSON, Command Line, and Python\u003cbr/\u003e- Technical account management experience\u003cbr/\u003e- Background in customer success or solution consulting\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Sunnyvale - 70,400.00 - 104,900.00 USD annually","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":"CA","title":"Data Solutions Lead, Data Collection Excellence","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3150309/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Operations, Supply Chain Management, Engineering, or another technical field\u003cbr/\u003e- Experience with people management and operations leadership\u003cbr/\u003e- Experience in a management role in a technical/customer service/data operations environment\u003cbr/\u003e- Experience of creating and contributing to strategic planning processes\u003cbr/\u003e- Experience in managing cost center\u003cbr/\u003e- Experience in leading large teams to high levels of performance\u003cbr/\u003e- Experience in developing future leaders and creating tailored succession plans\u003cbr/\u003e- Experience as a project owner / sponsor for strategic step change initiatives and enabling innovative thinking in project teams\u003cbr/\u003e- Experience working on MS Excel, analyzing data and presenting to senior management","business_category":"amazon-artificial-general-intelligence","city":"Bellevue","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment of large language models (LLMs) across all of our businesses. Come build the future of human-technology interaction with us. We are seeking an experienced Senior Operations Manager to join our team.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Develop and drive the overall direction, coordination, service delivery and evaluation of Data Services operations activities \u003cbr/\u003e- Set the vision, direction and culture of their teams by managing individual and team performance expectations and goals, monitoring real time service levels and schedule adherence, and holding their teams accountable to meet and exceed performance targets \u003cbr/\u003e- Collaborate with internal partners to build input-focused operating plans for achievement of key measures \u003cbr/\u003e- Create a culture where accountability, transparency and collaboration are the norm and where rapid deep dives into root causes of defects is a standard operating practice \u003cbr/\u003e- Develop, implement, or change processes as necessary to allow ADS to scale at an accelerated pace, while managing cost and, without impacting customer experience \u003cbr/\u003e- Implement bar-raising programs aimed at hiring and developing top talent and build career development road-map for site operations teams \u003cbr/\u003e- Inspire front line teams to go beyond the standard “call of duty” to find creative solutions for our product issues; encourage risk-taking and advocacy on behalf of product teams. \u003cbr/\u003e- Create closed-loop feedback processes where data associates are encouraged to be active participants in identifying opportunities for improvements to customer experience, workplace conditions, and internal tools. \u003cbr/\u003e- Work with finance \u0026 operations leadership team to develop, support manage the annual expense budget and build collaborative relationships with partner organizations. \u003cbr/\u003e- Responsible for creating a coaching culture across the site where formal and informal coaching opportunities are availed of \u003cbr/\u003e- Foster a work environment that respects and is responsive to the needs of a diverse staff \u003cbr/\u003e- Achieve site-wide improvements in Operations, Quality, Productivity, Cost, Customer experience and People metrics. \u003cbr/\u003e- Build partnerships with internal and external teams to collaborate and drive measurable improvements in areas that cause customer pain and data associate frustration. \u003cbr/\u003e- Improve the experience of the data associates \u0026 managers as measured by improvements in attrition and employee engagement surveys. \u003cbr/\u003e- Work with Operations Engineering leadership / Engineering managers to clearly articulate feature requirements for associate tool sets, user interfaces, and business logic for the efficient handling of work volumes.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eSenior Ops Manager is accountable for the overall direction and operations, creating a culture of customer obsession, high performance and high quality throughput. With operations managers and team managers as direct reports this role enables the achievement of service levels, performance \u0026 cost goals and successful program implementation.\u003cbr/\u003eYou work in an ever-changing environment where every day brings ambiguously defined problems, new challenges and new opportunities. You are able to balance strategic thinking with detailed execution and solid cross-functional collaborative results-oriented work.\u003cbr/\u003eThis position involves regular communication with senior management on project status and risks. People Management, cross-team coordination, project management and executive presentation skills are essential.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe are building the speech and language solutions behind Amazon Echo and other Alexa-enabled products and services. ADS’ mission is to provide high-quality labelled data for machine learning (ML) technologies.","department_cost_center":null,"description_short":"AI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment","display_distance":null,"id":"ae8171d8-196a-43e7-a349-de9360d1539f","id_icims":"3181585","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Machine Learning Data Operatio","job_function_id":null,"job_path":"/en/jobs/3181585/senior-operations-manager-artificial-general-intelligence-data-services","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Boston\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Boston\",\"coordinates\":\"42.35866,-71.05674\",\"normalizedCountyName\":\"Suffolk\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Boston, Massachusetts, USA\",\"location\":\"US, MA, Boston\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS17\"],\"normalizedCityName\":\"Boston\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA106\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":["alexa-and-amazon-devices.team-operations-job-family","amazon.artificial-intelligence"],"posted_date":"February 16, 2026","preferred_qualifications":"- Master's degree or MBA\u003cbr/\u003e- Experience in leading speech data operations\u003cbr/\u003e- Exhibits excellent judgment\u003cbr/\u003e- Demonstrated passion and obsession for customers while maintaining a lean, highly productive operation\u003cbr/\u003e- Experience hiring and developing great people/leaders\u003cbr/\u003e- Experience in building a culture of empowerment, accountability and continuous improvement\u003cbr/\u003e- Has relentlessly high standards\u003cbr/\u003e- Proven ability to think strategically, but stay on top of tactical execution\u003cbr/\u003e- Expects and requires innovation of her/his team and creates an environment that fosters creative thinking\u003cbr/\u003e- Excellent verbal and written communication skills across all organizational levels\u003cbr/\u003e- Proven ability to make and implement decisions\u003cbr/\u003e- Degree in management or linguistics field desirable\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MA, Boston - 86,200.00 - 150,900.00 USD annually\u003cbr/\u003eUSA, WA, BELLEVUE - 86,200.00 - 150,900.00 USD annually","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":"WA","title":"Senior Operations Manager, Artificial General Intelligence Data Services","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3181585/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of complex Excel VBA macros writing experience\u003cbr/\u003e- Bachelor's degree or equivalent\u003cbr/\u003e- Experience defining requirements and using data and metrics to draw business insights\u003cbr/\u003e- Experience with SQL or ETL","business_category":"transportation-and-logistics","city":"Nashville","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The Production Planning Team (PPT) needs leaders like you to deliver the future of labor planning for our North America Customer Fulfillment Network (NACF). At Amazon, delivering great experiences for our customers is a top priority. The PPT is reinventing the way Amazon plans labor as our network continues to grow. We’re setting the bar high with new automated solutions including advanced modeling and machine learning to improve accuracy and efficiency of the process. You can be an owner of this innovation and stamp your place in history as a part of the world’s most customer centric company. \u003cbr/\u003e\u003cbr/\u003eTo join us on this journey, we are looking for individuals with strong analytical and dive deep skills who will execute high-level network decisions that have an impact at a big scale. This is a high visibility role responsible for pioneering Amazon’s Production Planning Team process with the Planning and Execution (PLEX) organization. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e→ Work with FC and regional leadership team\u003cbr/\u003e→ Build the foundation and implement an innovative model for centralized labor planning across NACF. \u003cbr/\u003e→ Deliver action plans for senior managers and directors, while being a trusted partner to these network leaders. \u003cbr/\u003e→ Leverage central teams (i.e. S\u0026OP, Central Flow, Process Engineering) to drive process and operations execution improvements.\u003cbr/\u003e→ Use data and bias for action to work through ambiguity and deliver results. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e \u003cbr/\u003e“If you are not sure that every qualification on the list above describes you exactly, we'd still love to hear from you! At Amazon, we value people with unique backgrounds, experiences, and skillsets. If you’re passionate about this role and want to make an impact on a global scale, please apply!”\u003cbr/\u003e\u003cbr/\u003e “Amazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include:\u003cbr/\u003e1. Medical, Dental, and Vision Coverage\u003cbr/\u003e2. Maternity and Parental Leave Options\u003cbr/\u003e3. Paid Time Off (PTO)\u003cbr/\u003e4. 401(k) Plan”","department_cost_center":null,"description_short":"The Production Planning Team (PPT) needs leaders like you to deliver the future of labor planning for our North America Customer Fulfillment Network (NACF). At Amazon, delivering great experiences for","display_distance":null,"id":"a6605926-4bc8-46a8-bd32-41bcba1374a4","id_icims":"3178621","is_intern":null,"is_manager":null,"job_category":"Buying, Planning, \u0026 Instock Management","job_family":"Planning/Development","job_function_id":null,"job_path":"/en/jobs/3178621/business-analyst-production-planning-plex","job_schedule_type":"full-time","location":"US, TN, Nashville","locations":["{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Nashville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Nashville\",\"coordinates\":\"36.16792,-86.77798\",\"normalizedCountyName\":\"Davidson\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Nashville, Tennessee, USA\",\"location\":\"US, TN, Nashville\",\"region\":\"TN\",\"buildingCodeList\":[\"BNA12\"],\"normalizedCityName\":\"Nashville\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA82\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Nashville, Tennessee, USA","optional_search_labels":[],"posted_date":"February 11, 2026","preferred_qualifications":"- Experience working with Tableau\u003cbr/\u003e- Experience using very large datasets\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TN, Nashville - 50,200.00 - 87,900.00 USD annually\u003cbr/\u003eUSA, WA, Bellevue - 80,200.00 - 97,600.00 USD annually","primary_search_label":"transportation-and-logistics.team-na-operations","source_system":"JobCreator","state":"TN","title":"Business Analyst , Production Planning, PLEX","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/3178621/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-na-operations","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of people management experience\u003cbr/\u003e- Experience in project management including resource planning, managing schedules, reporting project status and prioritizing tasks\u003cbr/\u003e- Demonstrated experience in effectively defining optimal data creation strategies and executing them\u003cbr/\u003e- Associate's degree or equivalent work experience\u003cbr/\u003e- 5+ years of experience in ML data operations, with a strong understanding of data annotation/ML workflows and concepts\u003cbr/\u003e- Outstanding customer communication and management skills, especially in technical consultation\u003cbr/\u003e- Working knowledge of JSON, Command Line, and Python","business_category":"amazon-artificial-general-intelligence","city":"Boston","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Are you passionate about bridging the gap between technical ML solutions and customer success? Do you thrive providing consultation in an ambiguous environment, all while building customer partnerships? Do you enjoy leading dynamic and fast paced teams with global impact? We're looking for a Data Solutions Lead Managers to join our growing team!\u003cbr/\u003e\u003cbr/\u003eAbout the Role:\u003cbr/\u003eAs a Data Solutions Lead Manager, you will manage a team of Data Collection owners who provide expert consultation on ML/Gen AI data collections and own execution from start to finish. You'll drive business value by providing regular feedback and ensuring your team is working efficiently, manage active escalations and help them build long standing partnerships with customers. If necessary you will have the technical capability to step in and take control of high priority or challenging collections, delighting our customers and deliver meaningful change for the models that back them.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eManage and monitor your teams performance, creating a culture of ownership in ambiguous situations\u003cbr/\u003eAct as an SME Manager, gaining deep domain knowledge in the field of data collection for AI and relevant products\u003cbr/\u003eOwn global program improvement initiatives for the Data Collection Excellence Organization\u003cbr/\u003eCoordinate across global teams, influencing stakeholders to ensure effective and expedient delivery\u003cbr/\u003eMonitor and optimize collection health metrics to ensure customer success\u003cbr/\u003eDrive customer adoption through providing technical value and the provision of an exemplary customer experience.\u003cbr/\u003e\u003cbr/\u003eYou'll also:\u003cbr/\u003e\u003cbr/\u003eAct as an escalation point for challenging data collections, directly assisting senior level customers and your team. \u003cbr/\u003eCollaborate with product and technology teams to implement effective long term solutions\u003cbr/\u003eConsolidate customer feedback and translate it into improvement initiatives\u003cbr/\u003e","department_cost_center":null,"description_short":"Are you passionate about bridging the gap between technical ML solutions and customer success? Do you thrive providing consultation in an ambiguous environment, all while building customer partnerships?","display_distance":null,"id":"213fa028-f808-4ee7-8bf4-f02e650a2c3c","id_icims":"3171220","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Technical Account Management","job_function_id":null,"job_path":"/en/jobs/3171220/data-solution-lead-manager-data-collection-excellence","job_schedule_type":"full-time","location":"US, MA, Boston","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Boston\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Boston\",\"coordinates\":\"42.35866,-71.05674\",\"normalizedCountyName\":\"Suffolk\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Boston, Massachusetts, USA\",\"location\":\"US, MA, Boston\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS17\"],\"normalizedCityName\":\"Boston\"}"],"normalized_location":"Boston, Massachusetts, USA","optional_search_labels":[],"posted_date":"February  2, 2026","preferred_qualifications":"- Bachelor's degree in Computer Science, Business or a related field\u003cbr/\u003e- 2+ years of technical support experience, or experience in leadership or account management positions\u003cbr/\u003e- Background in customer success or solution consulting\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MA, Boston - 81,000.00 - 141,800.00 USD annually","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":"MA","title":"Data Solution Lead Manager, Data Collection Excellence","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3171220/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience working with customers with a passion for delivering exceptional service, or experience in technical support and experience that includes strong analytical skills, attention to detail, and effective communication abilities\u003cbr/\u003e- Experience in a similar role such as technical account manager, consultant, solutions architect, Language Engineer or service delivery manager\u003cbr/\u003e- Demonstrated experience in effectively defining optimal data creation strategies and executing them in complex global environments.\u003cbr/\u003e- Associate's degree or equivalent work experience\u003cbr/\u003e- 5+ years of experience in ML data operations, with a strong understanding of data annotation/ML workflows and concepts\u003cbr/\u003e- Ability to translate complex technical concepts into tactical applications","business_category":"amazon-artificial-general-intelligence","city":"Boston","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Are you passionate about bridging the gap between technical ML solutions and customer success? Do you thrive providing consultation in an ambiguous environment, all while building customer partnerships? Do you have experience managing complex technical projects from end to end? We're looking for a Senior Data Solutions Lead to join our growing team!\u003cbr/\u003e\u003cbr/\u003eAbout the Role:\u003cbr/\u003eAs a Data Solutions Lead, you'll be the trusted advisor for our AGI-DS scientists, providing expert consultation on high complexity ML/Gen AI data collections and manage emerging customer relationships. You'll drive business value through technical advisory and partnership building, creating and managing workstreams that delight our customers and deliver meaningful change for the models that back them, while simultaneously making global process more efficient.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eWhat You'll Do:\u003cbr/\u003e\u003cbr/\u003eDrive and document effective ML/GenAI solutions for customer requests, transforming complex research objectives into clear, actionable data collection requirements\u003cbr/\u003eOwn global team improvement projects\u003cbr/\u003eCoordinate across teams to ensure seamless delivery and stakeholder alignment\u003cbr/\u003eOwn relationships with customer scientists, becoming their go-to partner for ML data solutions\u003cbr/\u003eProvide expert consultation on ML workflow capabilities, helping customers maximize value\u003cbr/\u003eMonitor and optimize collection health metrics to ensure customer success\u003cbr/\u003eDrive customer adoption through providing technical value and the provision of an exemplary customer experience.\u003cbr/\u003e\u003cbr/\u003eYou'll also:\u003cbr/\u003e\u003cbr/\u003eGuide customers on workflow feasibility and data collection best practices\u003cbr/\u003eCollaborate with implementation teams to define and validate technical requirements\u003cbr/\u003eEvaluate scalability of annotation scenarios and provide strategic recommendations\u003cbr/\u003eInfluence and author technical documentation and guidelines\u003cbr/\u003e","department_cost_center":null,"description_short":"Are you passionate about bridging the gap between technical ML solutions and customer success? Do you thrive providing consultation in an ambiguous environment, all while building customer partnerships?","display_distance":null,"id":"6a56d339-5aae-4db2-b102-fff37df91976","id_icims":"3169519","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Technical Account Management","job_function_id":null,"job_path":"/en/jobs/3169519/senior-data-solutions-lead-data-collection-excellence","job_schedule_type":"full-time","location":"US, MA, Boston","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Boston\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Boston\",\"coordinates\":\"42.35866,-71.05674\",\"normalizedCountyName\":\"Suffolk\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Boston, Massachusetts, USA\",\"location\":\"US, MA, Boston\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS17\"],\"normalizedCityName\":\"Boston\"}"],"normalized_location":"Boston, Massachusetts, USA","optional_search_labels":[],"posted_date":"January 29, 2026","preferred_qualifications":"- Master's degree in business administration, finance, economics, computer science, data science, engineering, or other related field\u003cbr/\u003e- Experience in project or program management\u003cbr/\u003e- 4+ years of technical support experience, or experience in leadership or account management positions\u003cbr/\u003e- Expertise in JSON, Command Line, and Python\u003cbr/\u003e- Background in customer success or solution consulting\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MA, Boston - 64,800.00 - 113,300.00 USD annually","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":"MA","title":"Senior Data Solutions Lead, Data Collection Excellence","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3169519/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of senior level leadership support, or 1+ years of Amazon experience\u003cbr/\u003e- High school or equivalent diploma\u003cbr/\u003e- Experience with Microsoft Office products and applications\u003cbr/\u003e- Experience with executive level calendar management","business_category":"customer-service","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The Amazon Customer Service organization seeks an exceptional Executive Assistant to support two Directors in Seattle. This role demands attention to detail, excellent organizational skills, and the ability to meet tight deadlines while managing priorities across multiple teams.\u003cbr/\u003e\u003cbr/\u003eYou'll be an experienced planner and coordinator who responds effectively and efficiently. Key requirements include understanding business priorities, proactively anticipating needs, driving improvements for geographically dispersed teams, and maintaining strict confidentiality and data privacy. You must complete complex tasks quickly with minimal guidance, react with appropriate urgency, and take effective action independently.\u003cbr/\u003e\u003cbr/\u003eResponsibilities include complex calendar management, tracking key deliverables, coordinating travel and expenses, organizing team activities and events, coordinating meeting agendas, space planning, and ad hoc project coordination.\u003cbr/\u003e\u003cbr/\u003eThis role requires five (5) days per week in office.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Manage complex calendar scheduling and domestic/international travel coordination \u003cbr/\u003e- Track and drive completion of key deliverables with proactive follow-up \u003cbr/\u003e- Coordinate and submit expense reports \u003cbr/\u003e- Organize and execute team activities including meeting agendas, all-hands meetings, off-sites, and social events \u003cbr/\u003e- Partner with leadership and Executive Assistants to support organizational needs \u003cbr/\u003e- Manage team space planning, office moves, and reconfigurations \u003cbr/\u003e- Exercise sound judgment across diverse situations \u003cbr/\u003e- Demonstrate strong administrative, technical, and organizational capabilities \u003cbr/\u003e- Navigate ambiguity and make autonomous decisions when appropriate \u003cbr/\u003e- Foster a positive work environment for the team\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour day will be a dynamic blend of strategic coordination and proactive problem-solving. You'll manage intricate calendars, orchestrate cross-functional communication, and ensure our leadership team operates with maximum efficiency. From coordinating international travel to preparing comprehensive meeting agendas, you'll be the behind-the-scenes catalyst that keeps our organization running smoothly.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe are a collaborative, innovative team dedicated to understanding and enhancing global customer experiences. Our Customer Service organization is a hub of problem-solvers who forecast, plan, and respond to real-time customer needs across Amazon's diverse business ecosystem. We work closely with multiple teams, driving continuous improvement and customer satisfaction.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"The Amazon Customer Service organization seeks an exceptional Executive Assistant to support two Directors in Seattle. This role demands attention to detail, excellent organizational skills, and the ability","display_distance":null,"id":"55d12928-2d2c-4d88-8877-57a7ce88cd90","id_icims":"3181892","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Administrative Support","job_function_id":null,"job_path":"/en/jobs/3181892/executive-assistant-customer-service","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA29\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February 16, 2026","preferred_qualifications":"- Experience in a fast-paced, high-tech company\u003cbr/\u003e- Experience managing multiple calendars\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Experience that includes strong analytical skills, attention to detail, and effective communication abilities\u003cbr/\u003e- Superior attention to detail and ability to meet tight deadlines\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 80,200.00 - 97,400.00 USD annually","primary_search_label":"customer-service.technology","source_system":"JobCreator","state":"WA","title":"Executive Assistant, Customer Service ","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3181892/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"technology","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- 5+ years of working cross functionally across several teams experience\u003cbr/\u003e- Experience using Microsoft Excel to manipulate and analyze large sets of data\u003cbr/\u003e- Experience in Supply Chain Management and Procurement","business_category":"subsidiaries","city":"N.reading","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Is your passion inspired by invention? Is problem solving through teamwork in your DNA? Do you like the idea of seeing how your work affects the bigger picture? Answer yes to any of these and you will fit right in here at Amazon Robotics (AR). We are a smart team of doers that work passionately to apply innovative advances in robotics and software to solve real-world challenges that will transform our customers’ experiences in ways we cannot even image yet. We invent new improvements every day. We are Amazon Robotics and we will give you the tools and support you need to invent with us in ways that are rewarding, fulfilling and fun. \u003cbr/\u003e\u003cbr/\u003eThe Robotics Supply Chain organization sources a portfolio of robotics technology and is responsible for getting the right materials to the right place at the right time to support our network of global fulfillment and transportation solutions. It’s an operation that works cross-functionally with teams across Amazon globally and is driven by data and metrics. The Supply Chain team is seeking an experienced Buying and Supplier Manager to manage the timely and efficient material delivery to AR sites by mitigating supply risks and addressing supply chain constraints. This role will support supplier performance management, supplier relationship management, purchase order execution, and escalation resolution.\u003cbr/\u003e\u003cbr/\u003eThe Buying and Supplier Manager will drive operational excellence through robust vendor management and performance frameworks—ensuring suppliers meet delivery, quality, and cost targets while proactively addressing risks and implementing corrective actions. The role will also lead the deployment of tools and systems that automate procurement workflows and enable real-time supplier performance monitoring, improving efficiency, visibility, and accountability across the supply base.\u003cbr/\u003e\u003cbr/\u003eThis role requires strong cross-functional collaboration and data-driven approach to scale procurement operations, enhance supplier reliability, and support the growing needs of Amazon’s Robotics Supply Chain.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Own various aspects of supply chain management from ordering, assessing supplier capacities and delivery risks to resolving delivery challenges, and communicating risks to stakeholders. \u003cbr/\u003e- Collaborate with internal stakeholders and suppliers to monitor and improve supplier performance. \u003cbr/\u003e- Be a critical escalation point for materials and service delivery risks with internal stakeholders and suppliers. \u003cbr/\u003e- Proactively identify supply chain risks, implement robust mitigation strategies, and communicate potential disruptions and mitigative actions to stakeholders to maintain business continuity. \u003cbr/\u003e- Drive supply chain delivery performance by owning key metrics, addressing constraints, and influencing stakeholders to resolve bottlenecks effectively. \u003cbr/\u003e- Ensure that purchase orders are placed on-time and receive delivery commitments from the supply base. \u003cbr/\u003e- Identify and implement tools and systems to optimize the process \u003cbr/\u003e- Improve processes and mechanisms to optimize resources and value delivery for the Robotics organization \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children can use. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include:\u003cbr/\u003e\u003cbr/\u003e1. Medical, Dental, and Vision Coverage\u003cbr/\u003e2. Maternity and Parental Leave Options\u003cbr/\u003e3. Paid Time Off (PTO)\u003cbr/\u003e4. 401(k) Plan\u003cbr/\u003e\u003cbr/\u003eIf you are not sure that every qualification on the list above describes you exactly, we'd still love to hear from you! At Amazon, we value people with unique backgrounds, experiences, and skillsets. If you’re passionate about this role and want to make an impact on a global scale, please apply!","department_cost_center":null,"description_short":"Is your passion inspired by invention? Is problem solving through teamwork in your DNA? Do you like the idea of seeing how your work affects the bigger picture? Answer yes to any of these and you will","display_distance":null,"id":"a4b20c4e-2194-4f0d-b933-6f5608f0a5fe","id_icims":"3158442","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Buying/Planning","job_function_id":null,"job_path":"/en/jobs/3158442/buying-supplier-manager-amazon-robotics-procurement-robotics-supply-chain-procurement","job_schedule_type":"full-time","location":"US, MA, N.reading","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"N.Reading\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, N.Reading\",\"coordinates\":\"42.57455,-71.07888\",\"normalizedCountyName\":\"Middlesex\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"North Reading, Massachusetts, USA\",\"location\":\"US, MA, N.Reading\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS38\"],\"normalizedCityName\":\"North Reading\"}","{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"N.reading\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, N.reading\",\"coordinates\":\"42.57455,-71.07888\",\"normalizedCountyName\":\"Middlesex\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"North Reading, Massachusetts, USA\",\"location\":\"US, MA, N.reading\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS38\"],\"normalizedCityName\":\"North Reading\"}"],"normalized_location":"North Reading, Massachusetts, USA","optional_search_labels":[],"posted_date":"January 13, 2026","preferred_qualifications":"- Master's degree\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MA, N.Reading - 121,200.00 - 163,900.00 USD annually","primary_search_label":"subsidiaries.team-amazon-robotics","source_system":"JobCreator","state":"MA","title":"Buying \u0026 Supplier Manager, Amazon Robotics Procurement , Robotics Supply Chain - Procurement","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3158442/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-robotics","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of technical product or program management experience\u003cbr/\u003e- 7+ years of working directly with engineering teams experience\u003cbr/\u003e- 3+ years of software development experience\u003cbr/\u003e- 5+ years of technical program management working directly with software engineering teams experience\u003cbr/\u003e- Experience managing programs across cross functional teams, building processes and coordinating release schedules\u003cbr/\u003e- Bachelor's degree","business_category":"retail","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"    The Team: Private Brands is a highly-visible, fast-growing business within Amazon. We have a unique business and obsess over quality and building global brands our customers love. We aspire to be part of our customers’ everyday lives by offering them unique products at compelling prices backed by Amazon’s strong customer obsessed reputation.\u003cbr/\u003e\u003cbr/\u003eThe Role: We are looking for an exceptional Senior TPM to help build a Product Lifecycle Management (PLM) solution for Global Private Brands. Product development in Private Brands is a complex and global process. Some of the steps involved in getting a product from inception to the customer include Product design, Quality certification, Third-party and in-house testing, Mass production, Finalizing product label and packing, FDA approval (if ingestible) etc. Finally, since this is a WW platform, the unique international requirements add another layer of complexity. These different workflows involve complex sub-tasks and interactions with different retail systems, making this a truly complex and challenging capability with deep tentacles across many systems. The goal of this platform is to improve speed, drastically reduce the time to market, and enhance productivity across the entire product development process. You will work with stakeholders across the US \u0026 EU in Hardlines, Softlines, and Consumables Private Brands to define requirements and gain alignment to deliver a seamless product experience.\u003cbr/\u003e   \u003cbr/\u003e  What do we expect you to do? In this highly visible role, you will help us build the PLM solution that will allow to drastically reduce the time-to-market for launching new Private Brands products. You will help us determine the right way to build the platform, and will help ensure the platform is designed to minimize operational burden and the costs of future change. To be successful in this role, you should be comfortable gathering requirements across the many systems with complex dependencies, creating and maintaining technical project plans and diving into the technical details to understand the nuances and complexities involved. \u003cbr/\u003e\u003cbr/\u003e  In this role, cross-team and cross-functional collaboration is essential, requiring you to be a great communicator, and successfully drive large-scale projects, present and align with a variety of stakeholders. There are very few opportunities to help deliver a system that operates at Amazon scale and throughput, so this is a highly visible position that will have a material impact on Amazon.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"    The Team: Private Brands is a highly-visible, fast-growing business within Amazon. We have a unique business and obsess over quality and building global brands our customers love. We aspire to be part","display_distance":null,"id":"15a4e9db-9e3d-47e0-b890-8c23a723ca0d","id_icims":"3171759","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Technical Program Management","job_function_id":null,"job_path":"/en/jobs/3171759/sr-tech-program-manager-amazon-private-brands","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA70\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February  2, 2026","preferred_qualifications":"- 5+ years of project management disciplines including scope, schedule, budget, quality, along with risk and critical path management experience\u003cbr/\u003e- Experience managing projects across cross functional teams, building sustainable processes and coordinating release schedules\u003cbr/\u003e- Experience defining KPI's/SLA's used to drive multi-million dollar businesses and reporting to senior leadership\u003cbr/\u003e- Usage of generative AI tools to enhance workflow efficiency, with a willingness to learn effective prompting and evaluation practices.\u003cbr/\u003e- Ability to recognize opportunities where generative AI could enhance products, workflows, or customer experiences.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 148,700.00 - 201,200.00 USD annually","primary_search_label":"retail.team-private-brands","source_system":"JobCreator","state":"WA","title":"Sr. Tech Program Manager, Amazon Private Brands","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3171759/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-private-brands","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"San Diego","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager. In this role, you will lead a team of hourly workforce and will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e\u003cbr/\u003eOur Operation’s workflow has three major components: First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Support, mentor, and motivate your hourly workforce\u003cbr/\u003e* Manage safety, quality, productivity, and customer delivery promises\u003cbr/\u003e* Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e* Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e* Stand/walk for up to 12 hours during shifts\u003cbr/\u003e* Work in an environment where the noise level varies and can be loud\u003cbr/\u003e* Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e* Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e\u003cbr/\u003eOur fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Area Managers based on location preference and the business’ current openings.","department_cost_center":null,"description_short":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager.","display_distance":null,"id":"1bf79a85-5b7a-4476-b989-91080f21e26a","id_icims":"3152647","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3152647/area-manager-ii","job_schedule_type":"full-time","location":"US, CA, San Diego","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Diego\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Diego\",\"coordinates\":\"32.71568,-117.16171\",\"normalizedCountyName\":\"San Diego\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Diego, California, USA\",\"location\":\"US, CA, San Diego\",\"region\":\"CA\",\"buildingCodeList\":[\"SAN3\"],\"normalizedCityName\":\"San Diego\"}"],"normalized_location":"San Diego, California, USA","optional_search_labels":[],"posted_date":"January  5, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 20+ employees\u003cbr/\u003e- Experience with process improvements (Lean process, Kaizen, and/or Six Sigma)\u003cbr/\u003e- Excellent customer service, communication, and interpersonal skills\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Industry experience in: retail, F\u0026B, military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, San Diego - 72,500.00 - 90,900.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"CA","title":"Area Manager II ","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3152647/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}