{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Bachelor’s Degree in Mechanical Engineering or related field\u003cbr/\u003e- 5+ years in consumer/handheld product development in high volume manufacturing\u003cbr/\u003e- 3D CAD skills, Tolerance Analysis\u003cbr/\u003e- Experience with rapid prototyping processes (3D printing, CNC-machining, laser cutting)\u003cbr/\u003e- Experience with mechanism design and prototyping; precision mechanical assembly","business_category":"alexa-and-amazon-devices","city":"Sunnyvale","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Lab126 is an inventive research and development company that  designs and engineers high-profile consumer electronics. Lab126 began in  2004 as a subsidiary of Amazon.com, Inc., originally creating the  best-selling Kindle family of products. Since then, we have produced  groundbreaking devices like Fire tablets, Fire TV and Amazon Echo. What  will you help us create? \u003cbr/\u003e \u003cbr/\u003eThe Role: \u003cbr/\u003e    \u003cbr/\u003eAs a Senior Product Design Engineer, the candidate should demonstrate a strong working knowledge of mechanical systems; self-motivation, desire to learn from new challenges, and the problem solving and communication skills to work within a highly interactive and experienced team. Candidates must show a hands-on passion for their work, and must be able to communicate their ideas and concepts verbally and visually. Finally, Candidates must demonstrate an ability to integrate feedback and prove their adaptability to quickly changing contexts and work environments.\u003cbr/\u003e   \u003cbr/\u003e   - Designing      and building 3D models for testing, proof-of-concept, mock-ups, and      functional appearance models.\u003cbr/\u003e   - Finding,      interfacing and managing with 3rd party suppliers and integrate their      pieces into the whole system design.\u003cbr/\u003e   - Supporting      advanced R\u0026D initiatives \u0026 prototyping efforts with team members      of other disciplines.\u003cbr/\u003e   - Participate      in the cross-discipline design process for system design, combining your      skills with HW and SW team members to arrive at integrated effective      system designs.\u003cbr/\u003e   - Work      well with support resources (technicians) to efficiently realize      appropriate design portions.\u003cbr/\u003e   - Identifying      emerging technologies to help define development opportunities.\u003cbr/\u003e   - Researching      advanced materials and manufacturing processes.\u003cbr/\u003e   - Anticipating      and correcting issues that may impact mass-production (DFx).\u003cbr/\u003e   - Supporting      positive team interactions to accomplish program objectives.\u003cbr/\u003e   - Contributing      to schedule \u0026 milestone commitments.\u003cbr/\u003e   - Providing      cross-functional program integration support.","department_cost_center":null,"description_short":"Amazon Lab126 is an inventive research and development company that  designs and engineers high-profile consumer electronics. Lab126 began in  2004 as a subsidiary of Amazon.com, Inc., originally creating","display_distance":null,"id":"52b5d79d-3b27-4f1d-ac56-7933661ca8eb","id_icims":"2956087","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/2956087/sr-product-design-engineer-pd-hardware-hw-development","job_schedule_type":"full-time","location":"US, CA, Sunnyvale","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sunnyvale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Sunnyvale\",\"coordinates\":\"37.37188,-122.03751\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sunnyvale, California, USA\",\"location\":\"US, CA, Sunnyvale\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC11\"],\"normalizedCityName\":\"Sunnyvale\"}"],"normalized_location":"Sunnyvale, California, USA","optional_search_labels":["devices-hwdev"],"posted_date":"April 15, 2025","preferred_qualifications":"- Master's degree in Mechanical Engineering, or equivalent\u003cbr/\u003e- PTC Creo experience preferred\u003cbr/\u003e- Previous experience with high-volume consumer electronics\u003cbr/\u003e- Demonstrated knowledge of materials and manufacturing methods.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $128,600/year in our lowest geographic market up to $213,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"alexa-and-amazon-devices.team-hardware-and-eero","source_system":"JobCreator","state":"CA","title":"Sr. Product Design Engineer , PD Hardware - HW Development","university_job":null,"updated_time":"1 minute","url_next_step":"https://account.amazon.com/jobs/2956087/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-hardware-and-eero","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school diploma, or equivalent\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.\u003cbr/\u003e- 1+ years of computer/server hardware troubleshooting or related IT experience\"","business_category":"aws","city":"Canton","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring seamless data center operations that power millions of businesses and services worldwide. \u003cbr/\u003e \u003cbr/\u003eData Center Technicians should be willing to work both independently and with a team. Work prioritization, organizational skills, effective communication, and the ability to react quickly are critical to success. In addition to hardware and network repair, candidates will install equipment, create documentation, innovate solutions, and fix problems within the data center space. This team works in an environment that operates 24/7. Traveling within and outside of the regional work area is required. \u003cbr/\u003e \u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e-Performing server rack installations, hardware break-fix on various components, troubleshooting network issues, and responding to operational incidents that impact service availability, escalating to senior technicians and management as needed/required \u003cbr/\u003e-Serving as a primary contact point for both internal and external stakeholders, including engineers, software developers, vendors, and contractors \u003cbr/\u003e-Performing on-call duties and participating in scheduled maintenance and change management activities \u003cbr/\u003e-Contributing to documentation and process improvement initiatives based on your analysis of operational issues \u003cbr/\u003e-Helping to train and onboard new team members \u003cbr/\u003e\u003cbr/\u003ePhysical requirements: \u003cbr/\u003e\u003cbr/\u003e-Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds \u003cbr/\u003e-Working in cramped and/or elevated locations \u003cbr/\u003e-Bending, lifting, stretching, and reaching \u003cbr/\u003e-Standing and walking for up to 8+ hours a day \u003cbr/\u003e-Ascending and descending ladders, stairs, and gangways safely and without limitation \u003cbr/\u003e-Work in a noisy environment \u003cbr/\u003e-Work shifts longer than 8 hours to support 24/7 operations (covering both night and day shifts). \u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e-Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e-Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e-Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Data Center Technician professional, you have industry-leading technical abilities and demonstrate a breadth of knowledge while you: \u003cbr/\u003e-Take ownership of technical issues brought by their customer base, engaging other teams when needed to drive resolution \u003cbr/\u003e-Solve problems at their root and step back to understand the broader context \u003cbr/\u003e-Maintain service level agreements through the implementation of proactive issue detection and reporting \u003cbr/\u003e\u003cbr/\u003eYou will be required to work shift work that will include days/nights/weekends/holidays. Traveling within and outside of the regional work area is required. You will be responsible for having a reliable personal vehicle and valid driver's license to travel within the regional work area, as company transportation will not be provided. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring","display_distance":null,"id":"cd1a5f29-fb70-45bd-a608-dd15596fa07d","id_icims":"3151116","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3151116/data-center-technician","job_schedule_type":"full-time","location":"US, MS, Canton","locations":["{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Canton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Canton\",\"coordinates\":\"32.61258,-90.03472\",\"normalizedCountyName\":\"Madison\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Canton, Mississippi, USA\",\"location\":\"US, MS, Canton\",\"region\":\"MS\",\"buildingCodeList\":[\"JAN200\"],\"normalizedCityName\":\"Canton\"}"],"normalized_location":"Canton, Mississippi, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"January  2, 2026","preferred_qualifications":"- Experience managing work and priorities through a ticketing system\u003cbr/\u003e- Experience working in a Data Center environment\u003cbr/\u003e- An Associate’s degree, technical certification, or equivalent professional or military experience in a relevant field (e.g., computer science, networking engineering, etc.)\u003cbr/\u003e- Understanding of network design, protocols and layer 1/2 troubleshooting\"\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MS, Canton - 25.00 - 44.00 USD hourly","primary_search_label":"aws.team-it-services","source_system":"JobCreator","state":"MS","title":"Data Center Technician","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3151116/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-it-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience working with Microsoft Office applications, including Outlook, Word, Excel, and PowerPoint\u003cbr/\u003e- Experience in oral and written communication in English\u003cbr/\u003e- High School diploma or equivalent\u003cbr/\u003e- Work flexible hours as business demands, including overnight, weekends and holidays\u003cbr/\u003e- Understanding of basic computer/network concepts and terms\u003cbr/\u003e- Stand/walk for 10-12 hours at a time\u003cbr/\u003e- Authorization to work in the U.S. without sponsorship\u003cbr/\u003e- Must be highly motivated and customer-centric","business_category":"fulfillment-ops","city":"Wilmington","company_name":"Amazon.com Services LLC","country_code":"USA","description":"This position is being hired for the following shifts:\u003cbr/\u003e\u003cbr/\u003eMon - Tue 09:00-19:30\u003cbr/\u003eThu - Fri 09:00-19:30\u003cbr/\u003e\u003cbr/\u003eDESCRIPTION \u003cbr/\u003e     At Amazon, we strive to be Earth’s most customer-centric company where people can find and discover anything they want to buy online. We hire the world’s brightest minds, offering them an environment in which they can relentlessly improve the customer experience. Innovation and creativity are built into the DNA of the company and are encouraged at all levels of employment. Every day we solve complex technical and business problems with ingenuity and simplicity. We’re making history and the good news is we’ve only just begun.\u003cbr/\u003e\u003cbr/\u003e    Amazon, one of the top 100 companies in the United States, has an immediate opening for a IT Equipment Coordinator in our Fulfillment Center. Fulfillment Centers throughout the U.S. handle millions of items from tens of thousands of vendors and ships them across the globe each day. The successful IT Equipment Coordinator will be responsible for utilizing his/her skills to provide assistance to the operations team by maintaining IT inventory, coordinating ordering, delivery, and audits of assets assigned to the IT department, and maintaining general standardized housekeeping of all IT areas. Amazon seeks individuals who are willing to Work Hard, Have Fun, and join us in making Worldwide History.\u003cbr/\u003e\u003cbr/\u003eResponsibilities include allocation and maintenance of IT equipment throughout the Fulfillment Center. IT Equipment Coordinators are also responsible for the RMA and repair process for all devices under warranty. The IT Equipment Coordinator is a member of the larger IT team within the Fulfillment Center and will specifically support the Junior and Senior Technicians in daily projects and activities as directed. This position reports directly to the IT manager for the Fulfillment Center\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"This position is being hired for the following shifts:Mon - Tue 09:00-19:30Thu - Fri 09:00-19:30DESCRIPTION      At Amazon, we strive to be Earth’s most customer-centric company where people can find and","display_distance":null,"id":"6d840f35-8bed-4c27-b3c4-66cf34afbd7b","id_icims":"3179264","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3179264/it-equipment-coordinator-opstech-it","job_schedule_type":"full-time","location":"US, IL, Wilmington","locations":["{\"normalizedStateName\":\"Illinois\",\"normalizedCountryCode\":\"USA\",\"city\":\"Wilmington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, IL, Wilmington\",\"coordinates\":\"41.29795,-88.14158\",\"normalizedCountyName\":\"Will\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Wilmington, Illinois, USA\",\"location\":\"US, IL, Wilmington\",\"region\":\"IL\",\"buildingCodeList\":[\"HMW1\"],\"normalizedCityName\":\"Wilmington\"}"],"normalized_location":"Wilmington, Illinois, USA","optional_search_labels":[],"posted_date":"February 11, 2026","preferred_qualifications":"- Experience managing inventory in a retail or distribution setting\u003cbr/\u003e- Experience handling multiple projects simultaneously\u003cbr/\u003e- Experience prioritizing and managing time effectively in dynamic environments\u003cbr/\u003e- Excellent customer service abilities\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below including the base pay rate plus the highest available shift differential which applies depending on the shift you select. As a total compensation company, you are eligible for additional earnings including overtime pay and performance bonuses. Final pay will be based on factors including shift selection and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, IL, Wilmington - 21.00 - 24.00 USD hourly","primary_search_label":"fulfillment-ops.team-customer-service","source_system":"JobCreator","state":"IL","title":"IT Equipment Coordinator, OpsTech IT","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3179264/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-customer-service","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in oral and written communication in English\u003cbr/\u003e- Public Speaking Experience\u003cbr/\u003e- Ability to conduct multiple tours per day (5 days per week) onsite in a Fulfillment Center. This includes frequently moving around the building and going up and down stairs while ensuring groups are adhering to all safety procedures.","business_category":"global-communications-and-community-impact","city":"Goodyear","company_name":"Amazon.com Services LLC - A57","country_code":"USA","description":"Amazon is seeking enthusiastic and engaging Tour Leaders to lead immersive 90-minute in-person tours of our state-of-the-art Robotics Fulfillment Centers. As a Tour Leader, you will play a crucial role in showcasing Amazon's technology, innovative processes, and dedicated workforce to a diverse audience. This position offers a unique opportunity to highlight Amazon's rich history, our commitment to being Earth's Best Employer, and our ambitious Climate Pledge goals. We are seeking an enthusiastic individual with good communication skills and attention to detail in providing informative and engaging tours of their fulfillment center. The ideal candidate is passionate about technology, sustainability, and creating exceptional customer experiences.\u003cbr/\u003eAt the end of each day, you'll review feedback from tour participants and contribute to continuous improvement efforts for the tour program.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e1. Conduct multiple 90-minute tours per day, providing an engaging and informative experience for visitors.\u003cbr/\u003e2. Develop a deep understanding of Amazon's fulfillment processes, robotics technology, and company history.\u003cbr/\u003e3. Effectively communicate complex technical concepts to audiences with varying levels of technical knowledge.\u003cbr/\u003e4. Highlight Amazon's commitment to employee development, safety, and well-being.\u003cbr/\u003e5. Educate visitors about Amazon's sustainability initiatives and the Climate Pledge.\u003cbr/\u003e6. Ensure tour groups adhere to all safety protocols and facility regulations.\u003cbr/\u003e7. Maintain positive site relationships and participate in site \u0026 community engagement activities\u003cbr/\u003e8. Staff and train Ambassador \u0026 Proxy teams\u003cbr/\u003e9. Respond to questions from tour participants accurately and professionally.\u003cbr/\u003e10. Collaborate with fulfillment center teams to stay updated on the latest developments and processes.\u003cbr/\u003e11. Maintain and update tour content to reflect new technologies and company initiatives.\u003cbr/\u003e12. Collect and report feedback from tour participants to improve the overall experience.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Tour Guide at an Amazon Robotics Fulfillment Center, your day will be dynamic and engaging. You'll start by reviewing the day's tour schedule and preparing any necessary materials. Before each tour, you'll greet visitors, provide safety briefings, and distribute required protective equipment.\u003cbr/\u003eDuring the tours, you'll guide groups through various sections of the fulfillment center, explaining the intricate dance between human associates and robotic systems. You'll showcase how customer orders are processed, picked, packed, and shipped with incredible efficiency. Throughout the tour, you'll weave in stories about Amazon's history, our commitment to employee growth, and our sustainability efforts.\u003cbr/\u003e\u003cbr/\u003eBetween tours, you'll have time to refresh your knowledge, update tour content, and collaborate with colleagues on our global team. You may also participate in training sessions to enhance your skills and stay current on Amazon's latest innovations.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eYou'll be joining a passionate team of Tour Leaders and program managers around the world that are dedicated to showcasing Amazon's innovation and commitment to customer obsession. Our team works closely with various departments within the fulfillment center, including operations, robotics, human resources, and sustainability teams. We're a collaborative group that values creativity, continuous learning, and the ability to inspire others. As part of this team, you'll have the opportunity to contribute to the development of tour content and help shape the public's perception of Amazon's fulfillment operations.\u003cbr/\u003eThis role offers an exciting opportunity to be at the forefront of Amazon's technological advancements while developing valuable public speaking and customer engagement skills. Join us in sharing Amazon's story and inspiring the next generation of innovators!","department_cost_center":null,"description_short":"Amazon is seeking enthusiastic and engaging Tour Leaders to lead immersive 90-minute in-person tours of our state-of-the-art Robotics Fulfillment Centers. As a Tour Leader, you will play a crucial role","display_distance":null,"id":"d31d97ed-bf86-46e6-b3b4-cc6d8038fc8e","id_icims":"3153968","is_intern":null,"is_manager":null,"job_category":"PR","job_family":"Administrative Support","job_function_id":null,"job_path":"/en/jobs/3153968/amazon-tours-leader-amazon-tours","job_schedule_type":"full-time","location":"US, AZ, Goodyear","locations":["{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Goodyear\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Goodyear\",\"coordinates\":\"33.4363,-112.35831\",\"normalizedCountyName\":\"Maricopa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Goodyear, Arizona, USA\",\"location\":\"US, AZ, Goodyear\",\"region\":\"AZ\",\"buildingCodeList\":[\"GYR1\"],\"normalizedCityName\":\"Goodyear\"}"],"normalized_location":"Goodyear, Arizona, USA","optional_search_labels":[],"posted_date":"January  6, 2026","preferred_qualifications":"- Experience in Fulfillment Operations\u003cbr/\u003e- Customer Service Experience\u003cbr/\u003e- Experience leading teams\u003cbr/\u003e- Tourism/Hospitality Industry Experience\u003cbr/\u003e- Ability to quickly adapt to a changing work environment and priorities\u003cbr/\u003e- An entrepreneurial spirit, including the ability to work independently and autonomously\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, AZ, Goodyear - 20.00 - 29.00 USD hourly","primary_search_label":"global-communications-and-community-impact.team-no-team-listed","source_system":"JobCreator","state":"AZ","title":"Amazon Tours Leader, Amazon Tours","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3153968/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in automating, deploying, and supporting large-scale infrastructure\u003cbr/\u003e- Experience programming with at least one modern language such as Python, Ruby, Golang, Java, C++, C#, Rust\u003cbr/\u003e- Experience with Linux/Unix\u003cbr/\u003e- Experience with CI/CD pipelines build processes","business_category":"entertainment","city":"Culver City","company_name":"Amazon.com LLC","country_code":"USA","description":"Amazon MGM Studios is seeking a Systems Development Engineer II to improve operational excellence and system reliability for our Studio in the Cloud (SITC) platform. SITC is transforming entertainment content creation by moving all major production and post-production workflows from traditional on-premises infrastructure to AWS cloud-based solutions. This initiative encompasses nine core workflows—Dailies, Editorial, VFX, Sound, Conform, Color, Mastering, QC/Delivery, and Remote Production—representing the complete content creation lifecycle from Original Camera Footage (OCF) ingestion through final delivery.\u003cbr/\u003e\u003cbr/\u003eIn this role, you will work independently to make SITC systems more resilient, reliable, automated, and easier to operate. You will own your team's engineering and operational excellence, delivering solutions that reduce toil, eliminate risks, improve agility, and enable engineers to deliver products and features to customers with less effort, less cost, and better quality. You may focus on CI/CD automation for media workflow deployments, infrastructure optimization, observability and monitoring improvements, disaster recovery testing, performance tuning, or developer productivity tools that accelerate delivery.\u003cbr/\u003e\u003cbr/\u003eAs a SysDE II, you will design and deliver technology solutions solving difficult business and technical problems, using appropriate combinations of software development, infrastructure automation, systems design, and process improvements. You will coach others on identifying and eliminating risk, especially risks to system resilience. You will participate in design reviews, operational readiness reviews, and post-incident analyses to identify contributing causes and deliver permanent fixes that prevent recurrence. Your work is mostly tactical, though you are beginning to participate in strategic planning processes like OP1 and OP2, ensuring appropriate investment in reliability and automation.\u003cbr/\u003e\u003cbr/\u003eThis role requires solid technical skills spanning multiple domains including software development, infrastructure automation, cloud operations, and systems design. You will implement solutions for SITC systems that handle terabyte-scale media data, maintain responsive performance for creative workflows, operate across multiple AWS regions, and integrate with proprietary vendor systems like Avid, Adobe, and Blackmagic. Success requires writing high-quality automation and tooling, building robust operational processes, and ensuring systems support Amazon MGM Studios' production slate spanning 150+ titles annually without operational failures that impact creative teams.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eImprove your team's operational health and system resilience by participating in design reviews, operations reviews, and post-incident analyses to identify risks to reliability, then delivering projects that mitigate those risks through automation, architectural improvements, or process changes\u003cbr/\u003e\u003cbr/\u003eDesign and deliver technology solutions that solve difficult operational and technical problems including: CI/CD pipeline automation for safe media workflow deployments, infrastructure-as-code implementations that reduce manual provisioning, monitoring and alerting systems that detect issues before customer impact, automated testing frameworks for vendor tool integrations, performance optimization for high-bandwidth media transfers, cost optimization tools that reduce infrastructure spending, or disaster recovery procedures that ensure multi-region availability\u003cbr/\u003e\u003cbr/\u003eWork independently on automation, infrastructure, and tooling projects, seeking direction from your manager, SDE 3s, or Principal Engineers when facing architectural or technical trade-offs\u003cbr/\u003e\u003cbr/\u003eWrite high-quality software that meets Amazon Code Bar when building automation scripts, infrastructure tools, deployment systems, monitoring frameworks, or operational utilities. Ensure implementations are logical, maintainable, tested, version-controlled, and can be understood and extended by others\u003cbr/\u003e\u003cbr/\u003eIdentify and solve ambiguous problems, architectural deficiencies, or areas where your team's infrastructure hinders innovation of other teams. Beginning to extend this work to other teams in your organization\u003cbr/\u003e\u003cbr/\u003eMake appropriate technical trade-offs and reuse or extend existing solutions where possible. Consider the legacy and scalability of systems you build, avoiding short-term workarounds or escalating their overuse when necessary\u003cbr/\u003e\u003cbr/\u003eActively participate in review processes across teams including code reviews, operational readiness reviews (ORRs), and corrections of error (COEs), providing meaningful feedback to others including those more senior. Use these as teaching mechanisms to help others identify and eliminate operational risks\u003cbr/\u003e\u003cbr/\u003eConsistently write clear, accurate, inclusive, and concise documentation for your solutions including operational runbooks, architecture diagrams, deployment procedures, troubleshooting guides, and system documentation. Improve your team's existing documentation\u003cbr/\u003e\u003cbr/\u003eBeginning to influence other teams on engineering and operational best practices, helping them apply automation, monitoring, and resilience patterns you've developed\u003cbr/\u003e\u003cbr/\u003eMentor other engineers on your team by training them on how systems are constructed, how they operate, how to troubleshoot issues, and how systems fit into the bigger picture. Participate in hiring processes to attract diverse talent\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003ePrime Video is a first-stop entertainment destination offering customers a vast collection of premium programming in one app available across thousands of devices. Prime members can customize their viewing experience and find their favorite movies, series, documentaries, and live sports – including Amazon MGM Studios-produced series and movies; licensed fan favorites; and programming from Prime Video add-on subscriptions such as Apple TV+, Max, Crunchyroll and MGM+. All customers, regardless of whether they have a Prime membership or not, can rent or buy titles via the Prime Video Store, and can enjoy even more content for free with ads.\u003cbr/\u003e\u003cbr/\u003eAre you interested in shaping the future of entertainment? Prime Video's technology teams are creating best-in-class digital video experience.\u003cbr/\u003e\u003cbr/\u003eAs a Prime Video technologist, you’ll have end-to-end ownership of the product, user experience, design, and technology required to deliver state-of-the-art experiences for our customers. You’ll get to work on projects that are fast-paced, challenging, and varied. You’ll also be able to experiment with new possibilities, take risks, and collaborate with remarkable people.\u003cbr/\u003e\u003cbr/\u003eWe’ll look for you to bring your diverse perspectives, ideas, and skill-sets to make Prime Video even better for our customers. With global opportunities for talented technologists, you can decide where a career Prime Video Tech takes you!\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon MGM Studios is seeking a Systems Development Engineer II to improve operational excellence and system reliability for our Studio in the Cloud (SITC) platform. SITC is transforming entertainment","display_distance":null,"id":"90bd7d8f-16cf-4ff0-923c-5f886e5b65b7","id_icims":"3146657","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"System Development Engineering","job_function_id":null,"job_path":"/en/jobs/3146657/system-development-engineer-production-and-post-production-technology","job_schedule_type":"full-time","location":"US, CA, Culver City","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Culver City\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Culver City\",\"coordinates\":\"34.02202,-118.39589\",\"normalizedCountyName\":\"Los Angeles\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Culver City, California, USA\",\"location\":\"US, CA, Culver City\",\"region\":\"CA\",\"buildingCodeList\":[\"LAX35\"],\"normalizedCityName\":\"Culver City\"}"],"normalized_location":"Culver City, California, USA","optional_search_labels":["primevideo.team-studios-tech"],"posted_date":"December 19, 2025","preferred_qualifications":"- Experience with distributed systems at scale\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $116,300/year in our lowest geographic market up to $201,200/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"entertainment.team-primevideo","source_system":"JobCreator","state":"CA","title":"System Development Engineer, Production and Post Production Technology","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3146657/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-primevideo","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- 1+ years of computer/server hardware troubleshooting or related IT experience\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Atlanta","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is seeking Data Center Technicians to support our customers in multiple locations. This position requires the successful candidate report to a site location.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is a fast-paced technology company and a leader in the world of data centers. The position will help ensure overall availability and reliability to meet or exceed defined service levels of data center operations. This position may involve participation in an primary responder rotation, which includes monitoring the data center infrastructure, coordinating response to operational incidents, and partnering with other teams to rapidly resolve issues that impact service availability. Primary responder responsibilities may require evening, weekend, holiday, and/or night work to ensure our global data centers are operating at the highest levels of reliability for our customers. All candidates should be willing to work both independently and with a team. Work prioritization, organizational skills, effective communication, and the ability to react quickly are critical to success. \u003cbr/\u003e\u003cbr/\u003eIn addition to hardware and network repair candidates will install equipment, create documentation, innovate solutions, and fix problems within the data center space. This team works in an environment that operates 24/7. Traveling within and outside of regional work area is required.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAll physical requirements are expected with reasonable accommodations:\u003cbr/\u003e•\tRegularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds\u003cbr/\u003e•\tAbility to work in an environment that operates 24/7 with an ability to participate in primary responder rotation and provide after-hours support as needed\u003cbr/\u003e•\tWorking in cramped and/or elevated and/or noisy environments\u003cbr/\u003e•\tBending, lifting, stretching, reaching, standing and walking for up to 8+ hours a day\u003cbr/\u003e•\tAscending and descending ladders, stairs, and gangways safely and without limitation\u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon is not able to provide sponsorship now or in the future for these positions. Eligible candidates must have work authorization without employer intervention to be considered.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tPerforming server rack installations, hardware break-fix on various components, troubleshooting network issues, and responding to operational incidents that impact service availability, escalating to senior technicians and management as needed/required\u003cbr/\u003e•\tServing as a primary contact point for both internal and external stakeholders, including engineers, software developers, vendors, and contractors\u003cbr/\u003e•\tPerforming on-call duties and participating in scheduled maintenance and change management activities\u003cbr/\u003e•\tContributing to documentation and process improvement initiatives based on your analysis of operational issues\u003cbr/\u003e•\tHelping to train and onboard new team members\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Data Center Technician professional, you have industry-leading technical abilities and demonstrate a breadth of knowledge while you:\u003cbr/\u003e•\tTake ownership of technical issues brought by their customer base, engaging other teams when needed to drive resolution\u003cbr/\u003e•\tSolve problems at their root and step back to understand the broader context\u003cbr/\u003e•\tMaintain service level agreements through the implementation of proactive issue detection and reporting\u003cbr/\u003e\u003cbr/\u003eYou will be required to work shift work that will include days/nights/weekends/holidays. Traveling within and outside of regional work area is required.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"6b9b92c7-77f9-462b-8881-5ba55458be1b","id_icims":"3180884","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3180884/data-center-technician-dcc-communities","job_schedule_type":"full-time","location":"US, GA, Atlanta","locations":["{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Atlanta\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Atlanta\",\"coordinates\":\"33.74831,-84.39111\",\"normalizedCountyName\":\"Fulton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Atlanta, Georgia, USA\",\"location\":\"US, GA, Atlanta\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL75\"],\"normalizedCityName\":\"Atlanta\"}"],"normalized_location":"Atlanta, Georgia, USA","optional_search_labels":["aws.team-ais","aws.team-dc","hourly"],"posted_date":"February 13, 2026","preferred_qualifications":"- Experience managing work and priorities through a ticketing system\u003cbr/\u003e- Experience working in a Data Center environment\u003cbr/\u003e- An Associate’s degree, technical certification, or equivalent professional or military experience in a relevant field (e.g., computer science, networking engineering, etc.)\u003cbr/\u003e- Understanding of network design, protocols and layer 1/2 troubleshooting\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, GA, Atlanta - 27.00 - 48.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"GA","title":"Data Center Technician , DCC Communities ","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3180884/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of program or project management experience\u003cbr/\u003e- Experience using data and metrics to determine and drive improvements\u003cbr/\u003e- Experience owning program strategy, end to end delivery, and communicating results to senior leadership\u003cbr/\u003e- Experience with supplier or vendor relationship management","business_category":"transportation-and-logistics","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The Global Fleet and Products organization is responsible for managing and supporting the Amazon Last Mile Fleet. We're seeking a strategic Program Manager to drive breakthrough solutions in Amazon's last-mile delivery fleet management. You'll be the catalyst for creating world-class vehicle maintenance programs and managing critical vendor relationships that ensure our delivery network remains efficient, safe, and innovative.\u003cbr/\u003e\u003cbr/\u003eAt least 25% travel is expected.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Develop and implement comprehensive maintenance and repair program strategies\u003cbr/\u003e- Create and drive cross-functional project plans with significant organizational impact\u003cbr/\u003e- Analyze data to identify improvement opportunities and quantify performance metrics\u003cbr/\u003e- Coordinate resources and align stakeholders across multiple teams and networks\u003cbr/\u003e- Monitor vendor performance against established KPIs and service level agreements, driving continuous improvement\u003cbr/\u003e- Proactively identify and mitigate potential risks before they become operational challenges\u003cbr/\u003e- Build and maintain strategic partnerships with key suppliers to ensure long-term program success and innovation\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour day will be a dynamic blend of strategic planning, cross-functional collaboration, and problem-solving. You'll navigate complex projects, engage with diverse teams, and create solutions that directly impact Amazon's delivery capabilities. Expect to dive deep into data analysis, craft comprehensive program strategies, and communicate complex insights to senior leadership.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe are the Fleet In-Life Services team, dedicated to managing Amazon's delivery fleet throughout its entire lifecycle. Our mission is to reinvent fleet management through innovative solutions, from vehicle deployment to retirement. We're passionate about improving operational efficiency, exploring electrification technologies, and ensuring our vehicles are always ready to deliver.","department_cost_center":null,"description_short":"The Global Fleet and Products organization is responsible for managing and supporting the Amazon Last Mile Fleet. We're seeking a strategic Program Manager to drive breakthrough solutions in Amazon's last-mile","display_distance":null,"id":"8b3070ac-90ce-4e18-bf59-ae2e276e96d0","id_icims":"3173776","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Program Management","job_function_id":null,"job_path":"/en/jobs/3173776/senior-program-manager-fleet-maintenance-vendor-operations-in-life-services","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Nashville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Nashville\",\"coordinates\":\"36.16792,-86.77798\",\"normalizedCountyName\":\"Davidson\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Nashville, Tennessee, USA\",\"location\":\"US, TN, Nashville\",\"region\":\"TN\",\"buildingCodeList\":[\"BNA12\"],\"normalizedCityName\":\"Nashville\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA82\"],\"normalizedCityName\":\"Bellevue\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS19\"],\"normalizedCityName\":\"Arlington\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"February  4, 2026","preferred_qualifications":"- Experience managing and negotiating contracts and vendor relationships\u003cbr/\u003e- Experience in defining and implementing process improvement initiatives using data and metrics\u003cbr/\u003e- Master's degree, or Bachelor's degree in supply chain management, operations, engineering, analytics or related field\u003cbr/\u003e- Experience in program management, logistics, operations, transportation, learning or a related field\u003cbr/\u003e- Experience working effectively across cross-functional teams and partnering well with people at all levels within an organization\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TN, Nashville - 104,100.00 - 155,400.00 USD annually\u003cbr/\u003eUSA, VA, Arlington - 115,600.00 - 160,000.00 USD annually\u003cbr/\u003eUSA, WA, Bellevue - 115,600.00 - 160,000.00 USD annually","primary_search_label":"transportation-and-logistics.team-amzl","source_system":"JobCreator","state":"WA","title":"Senior Program Manager, Fleet Maintenance \u0026 Vendor Operations, In Life Services","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3173776/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amzl","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 6+ years of team management experience\u003cbr/\u003e- Experience owning/driving roadmap strategy and definition\u003cbr/\u003e- Experience with feature delivery and tradeoffs of a product\u003cbr/\u003e- Bachelor's degree in Business Administration, Finance, Economics, Computer Science, Engineering, or related field\u003cbr/\u003e- 5+ years of product management experience\u003cbr/\u003e- 4+ years of blending product and program management skills to execute strategic initiatives about process creation, standardization, and improvement experience\u003cbr/\u003e- 5+ years of successful technology products work from ideation through launch experience\u003cbr/\u003e- Experience developing, deploying and managing AI products at scale\u003cbr/\u003e- Experience influencing senior leaders/stakeholders","business_category":"customer-service","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Have you ever wondered what it takes to make millions of complex global interactions feel effortless? We are looking for forward-thinking product leaders who are obsessed with defining the 'what' and 'why' behind perfect customer experience to join Network Planning Solutions. Here, you'll do more than just manage products; you'll create 'delight' by envisioning and delivering exactly what our customers need, right when they need it. If you're ready to transform complex technical possibilities into intuitive human experiences through strategic product vision, you've found your team.\u003cbr/\u003e\u003cbr/\u003eNetwork Planning Solutions architects and orchestrates Amazon's customer service network of the future. By building AI-native solutions that continuously learn, predict and optimize, we deliver seamless customer experiences and empower associates with high-value work - driving measurable business impact at a global scale.\u003cbr/\u003e\u003cbr/\u003eAs a Sr. Manager, Product Management - Tech, you will own the product strategy and vision that makes this reality possible. Operating at the intersection of customer needs, technology, and business strategy, you will define AI-Native product capabilities that continuously learn, predict, and optimize. You will lead cross-functional teams to deliver end-to-end product solutions that redefine our global network.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eLead Product Vision \u0026 Strategy\u003cbr/\u003e- Own the end-to-end product roadmap for AI-enabled forecasting and network optimization solutions\u003cbr/\u003e- Define product requirements that translate complex customer needs into scalable AI-native capabilities\u003cbr/\u003e- Drive strategic product decisions that balance innovation velocity with operational excellence\u003cbr/\u003eDrive Cross-Functional Execution\u003cbr/\u003e- Partner with Engineering, Science, and Operations teams to deliver products that achieve measurable business outcomes\u003cbr/\u003e- Establish clear prioritization frameworks that maximize customer and business value\u003cbr/\u003e- Lead product launches from concept through migration, ensuring seamless transitions from legacy systems\u003cbr/\u003eInfluence Through Strategic Leadership\u003cbr/\u003e- Build executive alignment across senior leadership on transformative product priorities\u003cbr/\u003e- Secure organizational buy-in for network design and orchestration initiatives through compelling product vision\u003cbr/\u003e- Navigate ambiguity by synthesizing technical constraints, customer insights, and business objectives into actionable strategies\u003cbr/\u003eEstablish Product Excellence\u003cbr/\u003e- Define success metrics and KPIs that drive continuous product improvement\u003cbr/\u003e- Implement data-driven decision frameworks and feedback loops\u003cbr/\u003e- Create mechanisms that ensure customer-centric innovation at scale\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour day will be a dynamic blend of strategic thinking and collaborative problem-solving. You'll engage with cross-functional teams, translating complex technical possibilities into user-friendly solutions. Expect to dive deep into AI-driven product development, where you'll balance innovation with operational\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe are Network Planning Solutions, a team dedicated to architecting the future of customer service networks. Our mission is to build AI-native solutions that continuously learn, predict, and optimize. We're not just managing technology; we're creating intelligent systems that redefine global customer experiences.","department_cost_center":null,"description_short":"Have you ever wondered what it takes to make millions of complex global interactions feel effortless? We are looking for forward-thinking product leaders who are obsessed with defining the 'what' and 'why'","display_distance":null,"id":"04ef9f10-1333-46e1-b07d-424dfa623c7c","id_icims":"3179196","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Product Management - Technical","job_function_id":null,"job_path":"/en/jobs/3179196/senior-manager-product-management-ai-network-solutions-network-planning-solutions","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA29\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February 11, 2026","preferred_qualifications":"- Experience delivering consumer software products and services in a high growth environment\u003cbr/\u003e- MBA, or Advanced degree\u003cbr/\u003e- Experience with AI/ML technologies\u003cbr/\u003e- Experience in creating fully automated solutions\u003cbr/\u003e- Experience working with large global teams\u003cbr/\u003e- Experience that includes strong analytical skills, attention to detail, and effective communication abilities, or experience in managing and troublshooting network and experience working with customers with a passion for delivering exceptional service\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 197,900.00 - 267,800.00 USD annually","primary_search_label":"customer-service.technology","source_system":"JobCreator","state":"WA","title":"Senior Manager, Product Management - AI Network Solutions, Network Planning Solutions","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3179196/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"technology","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of technical product or program management experience\u003cbr/\u003e- 7+ years of working directly with engineering teams experience\u003cbr/\u003e- 3+ years of software development experience\u003cbr/\u003e- 5+ years of technical program management working directly with software engineering teams experience\u003cbr/\u003e- Experience managing programs across cross functional teams, building processes and coordinating release schedules","business_category":"customer-service","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Have you ever wondered what it takes to make millions of complex global interactions feel effortless? We are looking for builders who are obsessed with the 'how' behind perfect customer experience to join Network Planning Solutions. Here, you’ll do more than just develop software; you’ll create 'delight' by delivering exactly what our customers need, right when they need it. If you’re ready to turn complex technical hurdles into intuitive human experiences, you’ve found your team.\u003cbr/\u003e\u003cbr/\u003eNetwork Planning Solutions architects and orchestrates Amazon’s customer service network of the future. By building AI-native solutions that continuously learn, predict and optimize, we deliver seamless customer experiences and empower associates with high-value work - driving measurable business impact at a global scale.\u003cbr/\u003e \u003cbr/\u003eAs a Sr. Technical Program Manager, you will own the roadmap that makes this vision real. Operating at the intersection of Engineering, Science, and Product, you will architect AI-Native capabilities that continuously learn, predict, and optimize. You will lead cross-functional partners to deploy end-to-end orchestration solutions that redefine our global network.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Lead end-to-end delivery of AI-enabled forecasting and capacity optimization initiatives that proactively anticipate customer needs and network demand.\u003cbr/\u003e- Partner with Engineering, Science, and Product teams to architect and scale systems capable of processing millions of global customer interactions with low latency.\u003cbr/\u003e- Manage the transition from legacy to future-state: Maintain business continuity of current forecasting and capacity planning functions while building and migrating to next-generation AI-native capabilities.\u003cbr/\u003e- Influence without authority: Build strategic relationships across Customer Service teams to align senior leadership on high-stakes network design decisions.\u003cbr/\u003e- Navigate ambiguity and mitigate risk: Proactively identify technical dependencies and organizational bottlenecks, developing robust mitigation strategies to maintain high-velocity delivery.\u003cbr/\u003e- Define and scale program mechanisms: Drive accountability through clear ownership and establish rigorous audit mechanisms to ensure consistent execution against strategic objectives.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour day will be a dynamic blend of strategic planning and collaborative problem-solving. You'll work closely with engineering, science, and product teams to develop AI-native capabilities that continuously learn and optimize our customer service network. Expect to dive deep into complex technical challenges, translating intricate systems into elegant, user-centric solutions.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe are Network Planning Solutions, a team dedicated to reimagining customer service through intelligent, adaptive technologies. Our vision is to create a network that doesn't just respond to customer needs but anticipates and proactively addresses them. By leveraging advanced AI and machine learning, we're building the future of customer interaction.","department_cost_center":null,"description_short":"Have you ever wondered what it takes to make millions of complex global interactions feel effortless? We are looking for builders who are obsessed with the 'how' behind perfect customer experience to join","display_distance":null,"id":"1b712f11-fd94-489c-b118-34c9f0d8a193","id_icims":"3179231","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Technical Program Management","job_function_id":null,"job_path":"/en/jobs/3179231/senior-technical-program-manager-ai-powered-network-planning-network-planning-solutions","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA29\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February 11, 2026","preferred_qualifications":"- 5+ years of project management disciplines including scope, schedule, budget, quality, along with risk and critical path management experience\u003cbr/\u003e- Experience managing projects across cross functional teams, building sustainable processes and coordinating release schedules\u003cbr/\u003e- Experience defining KPI's/SLA's used to drive multi-million dollar businesses and reporting to senior leadership\u003cbr/\u003e- Experience working with Data \u0026 AI related technologies, including, but not limited to, AI/ML, GenAI, Analytics, Database, and/or Storage\u003cbr/\u003e- Master's degree in engineering, statistics, computer science, operations research, business analytics, information systems or equivalent\u003cbr/\u003e- Experience in customer service operations, contact center planning, or workforce management\u003cbr/\u003e- Experience with AI/ML technologies including forecasting models, optimization algorithms, or GenAI applications\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 148,700.00 - 201,200.00 USD annually","primary_search_label":"customer-service.technology","source_system":"JobCreator","state":"WA","title":"Senior Technical Program Manager, AI-Powered Network Planning, Network Planning Solutions","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3179231/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"technology","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team","business_category":"advertising","city":"New York","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Advertisers and advertising tools are rapidly adopting AI agents to plan, optimize, and achieve marketing goals. The Ads Agent Fabric team’s mission is to deliver a common infrastructure supporting all advertising-aware model-based applications (i.e., agents) and accelerate development of agentic applications for our advertisers. The team is responsible for an agent-builder SDK with pre-integrated Ads features, agent-builder tools that accelerate develop, test, and model evaluation lifecycle, and a fully-managed runtime with integrated access to the Ads services, data, and foundational models. \u003cbr/\u003e\u003cbr/\u003eAs an SDE3 on the Agent Fabric team, you will own the design and delivery of critical infrastructure components that enable Amazon Ads to build and deploy AI agents at scale. You'll work at the intersection of distributed systems, machine learning infrastructure, and developer tooling, defining technical strategy for how thousands of advertisers interact with AI-powered advertising solutions. This role requires deep technical expertise in building scalable platforms and comfort with ambiguity as you'll be building in an emerging space where best practices and technical requirements are still be defined. You will need strong system design skills, ability to define technical strategy, and capability to influence architecture decisions across multiple teams.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Own the full software development lifecycle from design to production launch of core infrastructure components and services \u003cbr/\u003e- Build highly scalable, low-latency infrastructure supporting real-time agent execution\u003cbr/\u003e- Define technical standards and best practices for agent development, testing, and deployment\u003cbr/\u003e- Partner with applied scientists to translate research innovations into production-ready services \u003cbr/\u003e- Lead architecture reviews and provide technical guidance to engineers across multiple teams","department_cost_center":null,"description_short":"Advertisers and advertising tools are rapidly adopting AI agents to plan, optimize, and achieve marketing goals. The Ads Agent Fabric team’s mission is to deliver a common infrastructure supporting all","display_distance":null,"id":"b90c038d-7076-4708-8107-dff504099bd7","id_icims":"3182024","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3182024/senior-software-development-engineer-ads-agent-fabric-ads-ai-core-infrastructure","job_schedule_type":"full-time","location":"US, NY, New York","locations":["{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK19\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"New York, New York, USA","optional_search_labels":[],"posted_date":"February 16, 2026","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, New York - 184,900.00 - 250,200.00 USD annually","primary_search_label":"advertising.team-amazon-ads","source_system":"JobCreator","state":"NY","title":"Senior Software Development Engineer, Ads Agent Fabric (Ads AI Core Infrastructure) ","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3182024/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-ads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}