{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Experience in multiple finance and accounting roles\u003cbr/\u003e- Experience applying key financial performance indicators (KPIs) to analyses\u003cbr/\u003e- Experience in building financial and operational reports/data sets that inform business decision-making\u003cbr/\u003e- Experience in creating process improvements with automation and analysis\u003cbr/\u003e- Bachelor's degree in engineering, statistics or business, or a Bachelor's degree and experience in tax, finance or a related analytical field\u003cbr/\u003e- 5+ Year finance experience\u003cbr/\u003e- Fluent in English with excellent communication skills\u003cbr/\u003e- Masters/Bachelor's degree in business, finance, math or related field\u003cbr/\u003e- Demonstrated ability to build and manage financial models for business forecasting, variance analysis, and problem solving","business_category":"finance","city":"Istanbul","company_name":"Amazon Turkey Yonetim Destek Hizmetleri Limited Sirketi","country_code":"TUR","description":"Elevate Amazon Retail Finance in Turkey: Your Strategic Impact Starts Here\u003cbr/\u003e\u003cbr/\u003eAre you a strategic financial expert ready to drive growth and profitability in one of the most dynamic e-commerce markets? We're seeking a forward-thinking Finance Manager to transform financial insights into actionable business strategies that will shape Amazon's future in Turkey.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Lead comprehensive financial controllership, developing robust financial reporting and analysis frameworks\u003cbr/\u003e- Conduct in-depth data analysis to identify business improvement opportunities and cost optimization strategies\u003cbr/\u003e- Perform root cause analysis to uncover critical business insights and develop strategic improvement plans\u003cbr/\u003e- Design and implement financial policies that enhance organizational competitiveness and profitability\u003cbr/\u003e- Manage sophisticated financial planning, forecasting, and reporting models with precision and creativity\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour day will be a blend of strategic analysis, collaborative problem-solving, and financial innovation. You'll dive deep into financial data, uncovering insights that drive business decisions, and work closely with cross-functional teams to develop impactful financial strategies.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe are a collaborative and dynamic finance team committed to supporting Amazon's mission of being the most customer-centric company. Our team thrives on innovation, data-driven decision-making, and creating meaningful impact across the organization.","department_cost_center":null,"description_short":"Elevate Amazon Retail Finance in Turkey: Your Strategic Impact Starts HereAre you a strategic financial expert ready to drive growth and profitability in one of the most dynamic e-commerce markets? We're","display_distance":null,"id":"e78fef8c-4cd8-417f-8b29-8e7789789096","id_icims":"3127556","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/Planning","job_function_id":null,"job_path":"/en/jobs/3127556/finance-manager-amazon-turkey-amazon-turkey","job_schedule_type":"full-time","location":"TR, Istanbul","locations":["{\"normalizedCountryCode\":\"TUR\",\"city\":\"Istanbul\",\"countryIso3a\":\"TUR\",\"countryIso2a\":\"TR\",\"locationNonStemming\":\"Turkey, Istanbul\",\"coordinates\":\"41.06201,28.98877\",\"normalizedCountyName\":\"Istanbul\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Türkiye\",\"normalizedLocation\":\"Istanbul, TUR\",\"location\":\"TR, Istanbul\",\"region\":\"\",\"buildingCodeList\":[\"IST11\"],\"normalizedCityName\":\"Istanbul\"}"],"normalized_location":"Istanbul, TUR","optional_search_labels":[],"posted_date":"November 17, 2025","preferred_qualifications":"- Experience in solving complex business challenges by delivering accurate and timely financial models, analysis, and recommendations that have a proven business impact\u003cbr/\u003e- Knowledge of SQL/ETL\u003cbr/\u003e- Experience working with large-scale data mining and reporting tools (examples: SQL, MS Access, Essbase, Cognos).\u003cbr/\u003e- Excellent analytical skills, a passion for metrics and figures, and the ability to get into the details, while also seeing and understanding the big picture\u003cbr/\u003e- Strong skills in accessing and using analytical tools and modelling\u003cbr/\u003e- Innovative with a commercial mindset\u003cbr/\u003e- Demonstrated ability to meet deadlines while managing multiple projects\u003cbr/\u003e- Strong interpersonal skills including written and oral communication skills\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-consumer","source_system":"JobCreator","state":null,"title":"Finance Manager, Amazon Turkey, Amazon Turkey","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3127556/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-consumer","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience with Microsoft Office products and applications\u003cbr/\u003e- Speak, write, and read fluently in English\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- Experience in payments or e-commerce\u003cbr/\u003e- Ability to maintain high levels of confidentiality and data security standards","business_category":"no-business-category","city":"Hyderabad","company_name":"Amazon Dev Center India - Hyderabad","country_code":"IND","description":"AHS Specialists provide dedicated support to third-party Sellers. We eliminate frustration and consult with Sellers on best ways to address opportunities for their business on Amazon’s e-commerce platforms. The objective of this role is to deliver sustainable results that improve Seller’s Performance, while aligning to Amazon requirements. We use Standard Operation Procedure and judgment to provide guidance to Sellers on complex cases.\u003cbr/\u003eThe successful AHS Specialist will have a high degree of soft-skills, the ability to empathize with others and capable of succeeding in a fast-paced environment. AHS Specialist will also be analytical and customer service-oriented. The AHS Specialist will be required to engage in frequent written and verbal communication with Sellers, department management, risk analysts, other company associates, and third-party to accomplish goals. The AHS Specialist will be required to contact Sellers by phone and email. The successful AHS Specialist will be able to redirect difficult conversations as the Specialist engage with pre-suspension and post-suspension level Sellers who are in poor standing.\u003cbr/\u003eSummary of Responsibilities\u003cbr/\u003e•\tDemonstrates effective, clear and professional written and oral communication.\u003cbr/\u003e•\tProvides prompt and efficient service to Amazon Sellers, including the appropriate escalation of Sellers’ issues.\u003cbr/\u003e•\tMaintains a positive and professional demeanor always portraying the company in a positive light while effectively managing sensitive issues.\u003cbr/\u003e•\tDemonstrates excellent time-management skills and the ability to work independently while using departmental resources, policies and procedures.\u003cbr/\u003e•\tContributes to a positive team environment and proactively aids team members with difficult contacts as needed.\u003cbr/\u003e•\tMaintains acceptable performance metrics such as quality, productivity, first contact resolution, and attendance.\u003cbr/\u003e•\tActively seeks solutions through logical reasoning and data interpretation skills and identifies trends to appropriate channel including improvement suggestions.\u003cbr/\u003e•\tLiaises with other departments as required to resolve Seller’s issues and questions.\u003cbr/\u003eBasic Qualifications\u003cbr/\u003e•\t1+ years of customer service experience\u003cbr/\u003e•\tExperience with Microsoft Office products and applications\u003cbr/\u003e•\tWork a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e•\tExperience in payments or e-commerce\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\tMeets predetermined and assigned productivity targets and quality standards\u003cbr/\u003e\tAchieves quality (quality audits), while maintaining productivity (tasks per hour)\u003cbr/\u003e\tConsiders the impact these goals have on the Seller, the Buyer, and the Company\u003cbr/\u003e\tWorks in accordance with the SOP's to provide consistent and great Seller experience on each and every contact\u003cbr/\u003e\tUnderstands and applies knowledge on complex issues, along with directly related tools, SOP's, blurbs, and workflows\u003cbr/\u003e\tMay perform tasks which are not guided by established policies and procedures\u003cbr/\u003e\tLeverages appropriate tools and applications to dive deep into investigation issues using data\u003cbr/\u003e\tDemonstrates flexibility to transition within queues and understands/adheres to workflow directions\u003cbr/\u003e\tUnderstand the importance of adherence to AUX statuses and follows guidelines thoroughly, taking breaks as scheduled and keeping personal time to a minimum\u003cbr/\u003e\tProactively communicates with management for any time off request\u003cbr/\u003e\tHandles every work-item as per SOP and works on task in FIFO order (first in, first out)\u003cbr/\u003e\tAttends and participates in team huddles/meetings and effectively interacts with teammates both in daily interactions and huddles\u003cbr/\u003e\tRemains positive on the floor, even in the face of challenges; cognizant of their behavior and how it impacts team morale and our Sellers exhibiting a positive attitude\u003cbr/\u003e\tDemonstrates effective, clear and professional written and oral communication on investigative matters, interactions with Sellers and internal exchanges with peers or management\u003cbr/\u003e\tUses expertise to deliver impactful coaching and advises Sellers on solutions to mitigate performance issues, exhibiting expertise and educating on factors that impact Seller performance to ensure performance metrics are met\u003cbr/\u003e\tEngages with Sellers in need of a higher level of support (poor performance), educating them to become self-sufficient through time-bound support\u003cbr/\u003e\tConfidently channels Sellers into correctly identifying root causes, solutions and preventative measures, using knowledge and expertise to lead effective conversations\u003cbr/\u003e\tThoroughly listens to Sellers and addresses all performance issues to minimize the Seller stumbling and impacting the Buyer experience negatively. Considers the impact and quality their actions have on the Seller, the Company, and the Buyer. Works towards earning Seller trust on every contact\u003cbr/\u003e\tMaintains a positive and professional demeanor always portraying the company in a positive light and effectively escalating sensitive issues. Represents voice of the Seller internally\u003cbr/\u003e\tHelp develop internal communication and participates in the development of internal communication on key process changes and provides contribution on translations and content reviews\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eA day in the life AHS Specialist provide dedicated support to Sellers. They eliminate frustration and consult with Sellers on best ways to address opportunities for their business on Amazon’s eCommerce platforms. The objective of this role is to deliver sustainable results that improve Sellers performance, while aligning to Amazon requirements. They use SOPs and judgment to provide guidance to Sellers on complex cases. They make the determination if a Seller should be enforced or reinstated. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003ehttps://w.amazon.com/bin/view/Account_Health_Support/","department_cost_center":null,"description_short":"AHS Specialists provide dedicated support to third-party Sellers. We eliminate frustration and consult with Sellers on best ways to address opportunities for their business on Amazon’s e-commerce platforms.","display_distance":null,"id":"8dbc0b26-c9fe-46a4-beaf-1263c1f7d6f0","id_icims":"3158119","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Investigation","job_function_id":null,"job_path":"/en/jobs/3158119/ahs-specialist-account-health-support","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD11\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":[],"posted_date":"February 12, 2026","preferred_qualifications":"- 1+ years of customer service experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"TS","title":"AHS Specialist, Account Health Support","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3158119/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- Speak, write, and read fluently in English\u003cbr/\u003e- Experience with Microsoft Office products and applications","business_category":"fulfillment-and-operations","city":"Visakhapatnam","company_name":"ASSPL - Telangana - D82","country_code":"IND","description":"Job summary\u003cbr/\u003eAt Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Team leads for our transportation team. Amazon is one of the most recognizable brand names in the world and we distribute millions of products each year to our loyal customers\u003cbr/\u003e\u003cbr/\u003eWe're seeking a Team lead for our Delivery center. In this role you will be responsible for shift operations at our DCs and support the DC manager in performance management and driving the operational plan.\u003cbr/\u003e\u003cbr/\u003eTitle:Team Lead\u003cbr/\u003eLocation: Visakapatnam\u003cbr/\u003e\u003cbr/\u003e Essential Functions\u003cbr/\u003e\u003cbr/\u003e-Job Description\u003cbr/\u003e· Training: Deliver training \u0026 coaching of Amazon processes, products, operating model and SOP to Associates.\u003cbr/\u003e· Work on the ground to enable network with new product launches and partner with the operations and other teams.\u003cbr/\u003e· Reporting: Maintaining \u0026 publishing routine reporting on the current performance \u0026 business with Amazon. Publish recommendations and action plans based on data. Reporting the overall Network Health in the assigned territory.\u003cbr/\u003e· Team Management: Building and managing a multi-layer team and manage performance through on-the job coaching and mentoring. Driving team of associates for managing their targets.\u003cbr/\u003e· Set proper expectations, provide clear status communications, and manage relationships with the associates.\u003cbr/\u003e· Work with process associates \u0026 station team to improve operational aspects of their business in providing a great delivery experience and consistently enhance efficiency.\u003cbr/\u003e· Handling day to day operational escalations and be available to round the clock to manage the issues.\u003cbr/\u003e· Internal/External Stake holder management.\u003cbr/\u003e· Support station operations and/or customer deliveries.\u003cbr/\u003eEssential Skills\u003cbr/\u003e\u003cbr/\u003e    Strong leadership capabilities and people management skills\u003cbr/\u003e    Ability to work under pressure situations\u003cbr/\u003e    Ability to work in ambiguous situations\u003cbr/\u003e    Good communication skills. Ability to communicate and explain to individuals \u0026 the team, what needs to be achieved for the Delivery Center /Amazon to achieve its objectives. Listening skills: Gains input and commitment from all involved in delivering their specific part.\u003cbr/\u003e    Strong Bias for great customer service: Engage the Team in developing their understanding of Customer Experience and knowledge of what Customers actually needs/expects.\u003cbr/\u003e    High Ownership: Follows through to ensure the delivery of changes/solutions/services that fulfill the Customer’s needs.\u003cbr/\u003e\u003cbr/\u003eAnalytical Skills: Effectively analyze and interpret information, identifying \u0026 validating the key facts, including reviewing alternatives to determine advantages and associated risks.","department_cost_center":null,"description_short":"Job summaryAt Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Team leads for our transportation","display_distance":null,"id":"8a46ff49-b98a-4844-ad9f-c7a8c6a72d83","id_icims":"3142589","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Administrative Support","job_function_id":null,"job_path":"/en/jobs/3142589/team-lead-amzl-team-lead-amzl","job_schedule_type":"full-time","location":"IN, AP, Visakhapatnam","locations":["{\"normalizedStateName\":\"Andhra Pradesh\",\"normalizedCountryCode\":\"IND\",\"city\":\"Visakhapatnam\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, AP, Visakhapatnam\",\"coordinates\":\"17.7199,83.26281\",\"normalizedCountyName\":\"Visakhapatnam\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Visakhapatnam, Andhra Pradesh, IND\",\"location\":\"IN, AP, Visakhapatnam\",\"region\":\"AP\",\"buildingCodeList\":[\"PMND\",\"PMMJ\",\"VTZ41\",\"VTZ42\",\"UVTA\",\"PMPQ\",\"FVTB\",\"VOVZ\",\"FVTG\",\"VTZ251\",\"PMPS\",\"PNVD\",\"RJX1\",\"PMMI\",\"UVTB\",\"SVTA\"],\"normalizedCityName\":\"Visakhapatnam\"}"],"normalized_location":"Visakhapatnam, Andhra Pradesh, IND","optional_search_labels":[],"posted_date":"December 15, 2025","preferred_qualifications":"- MBA\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-last-mile-delivery","source_system":"JobCreator","state":"AP","title":"Team Lead - AMZL , Team Lead - AMZL ","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3142589/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-delivery","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- In pursuit of or obtained Bachelor’s Degree within a relevant field such as mechanical/electrical engineering OR\u003cbr/\u003e- In pursuit of or obtained certification from a Technical/Trade school program (HVAC, electrician, facilities maintenance, or similar)\u003cbr/\u003e- English language Level B2\u003cbr/\u003e- Ability to work well with others in a team environment, displaying strong time management skills\u003cbr/\u003e- Must have access to own transport","business_category":"studentprograms","city":"Paris","company_name":"AWS EMEA SARL (France Branch) - G48","country_code":"FRA","description":"At Amazon Web Services (AWS), we are working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is continually evolving and is a place where motivated employees thrive and also where employee ownership and accountability lead to meaningful results. \u003cbr/\u003e\u003cbr/\u003eAre you ready to embrace the challenge? Come build the future with us. \u003cbr/\u003e\u003cbr/\u003eData Center Engineering Operations Intern\u003cbr/\u003eThe Data Center Engineering Operations (DCEO) Team is the backbone of AWS, supporting the rapid growth of AWS business and customers 24x7. We commit to maintain the physical critical facility infrastructure of AWS and ensure the standards for operational performance in the areas of safety, security, availability, productivity, capacity, efficiency and cost.\u003cbr/\u003e\u003cbr/\u003eInterns will work in an Amazon Data Center and will provide technical support, including risk management and mitigation, corrective and preventative maintenance of critical facility infrastructure, vendor management and metrics reporting.\u003cbr/\u003eThis role is due to start in May 2026 and you MUST have access to your own transport as there is no public transportation to our Data Centers.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eDuties include:\u003cbr/\u003e· Maintain mechanical and electrical equipment\u003cbr/\u003e· Assist root cause analysis of equipment failures\u003cbr/\u003e· Assist in troubleshooting of facility and rack-level events within internal SLA\u003cbr/\u003e· Take daily operational readings of all mechanical and electrical equipment\u003cbr/\u003e· Utilize internal CMMS to manage building workflows\u003cbr/\u003e· Interact with third party vendors \u0026 contractors who are working on site\u003cbr/\u003e\u003cbr/\u003eAmazon internships are full-time (40 hours/week) for 12 consecutive weeks. Candidates must be able to provide an internship agreement from their university. Intern schedules are typically day schedules, Monday-Friday. A full time position could involve day, evening, or weekend shifts and on-call rotations. \u003cbr/\u003e\u003cbr/\u003eAmazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNote: Applications are reviewed on a rolling basis. For an update on your status, or to confirm your application was submitted successfully, please login to your candidate portal. Please note that we are reviewing a high volume of applications and appreciate your patience. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth \u003cbr/\u003eOur team is dedicated to supporting new team members in an environment that celebrates knowledge sharing and mentorship. Projects and tasks are assigned in a way that leverages your strengths and helps you further develop your skillset. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eHere at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences. \u003cbr/\u003e\u003cbr/\u003eWork/Life Harmony \u003cbr/\u003eOur team puts a high value on work-life harmony. It isn’t about how many hours you spend at home or at work; it’s about the flow you establish that brings energy to both parts of your life. We believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfillment. We offer flexibility and encourage you to find your own balance between your work and personal lives. \u003cbr/\u003e\u003cbr/\u003eEMEA Student Programs Team\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eCore technical knowledge that you will need:\u003cbr/\u003e Power Distribution \u0026 Main / backup powerflow\u003cbr/\u003e •          Power redundancy\u003cbr/\u003e •          Basic UPS system knowledge\u003cbr/\u003eHVAC / Cooling\u003cbr/\u003e •           Cooling\u003cbr/\u003e •          hot / cold aisle\u003cbr/\u003e •          PUE\u003cbr/\u003eFire Suppression\u003cbr/\u003eGenerator\u003cbr/\u003eA few daily tasks;\u003cbr/\u003e·      Maintain mechanical and electrical equipment\u003cbr/\u003e·      Assist root cause analysis of equipment failures\u003cbr/\u003e·      Assist in troubleshooting of facility and rack-level events within internal SLA\u003cbr/\u003e·      Power up newly deployed racks\u003cbr/\u003e·      Ensure all safety procedures are adhered to while performing work\u003cbr/\u003e·      Take daily operational readings of all mechanical and electrical equipment\u003cbr/\u003e·      Take daily operational readings of all mechanical and electrical equipment\u003cbr/\u003e·      Plan maintenance works and Write / review procedures\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003ehttps://www.youtube.com/watch?v=LTgCHTdRed0\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Engineering Operations team is Amazon’s front-line responders for hands-on electrical and mechanical equipment troubleshooting and operations. You will work with equipment that supports mission-critical servers and must maintain better than 99.999% uptime. This equipment includes, but is not limited to, stand-by diesel generators, switchgear, UPS’s, PDU’s, AHU’s, chillers, cooling towers, chemical treatment systems, pumps, motors, VFD’s, and building automation systems.","department_cost_center":null,"description_short":"At Amazon Web Services (AWS), we are working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is continually evolving and","display_distance":null,"id":"da9b5a7e-54f3-4f3e-ba29-defebaf8eb18","id_icims":"3125320","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3125320/2026-engineering-operations-intern-data-center-engineering-operations","job_schedule_type":"full-time","location":"FR, Paris","locations":["{\"normalizedStateName\":\"Ile-de-France\",\"normalizedCountryCode\":\"FRA\",\"city\":\"Paris\",\"countryIso3a\":\"FRA\",\"countryIso2a\":\"FR\",\"locationNonStemming\":\"France, Paris\",\"coordinates\":\"48.85717,2.3414\",\"normalizedCountyName\":\"Paris\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"France\",\"normalizedLocation\":\"Paris, Ile-de-France, FRA\",\"location\":\"FR, Paris\",\"region\":\"\",\"buildingCodeList\":[\"CDG082\",\"DIF4\",\"CDG118\",\"CDG83\",\"CDG120\",\"CDG53\",\"CDG61\",\"CAS3\",\"CDG98\",\"CDG079\",\"CDG087\",\"OMP6\",\"DIF3\",\"OIF4\",\"CDG117\",\"CDG111\",\"UFR1\",\"MRS60\",\"CDG54\",\"CDG105\",\"OHF1\",\"CDG601\",\"CDG113\",\"CDG121\",\"CDG97\",\"CDG077\",\"CDG116\",\"DIF5\",\"CDG119\",\"CDG085\",\"CDG800\",\"CDG101\",\"CDG64\",\"CDG56\",\"CDG076\",\"PTG2\",\"DIF1\",\"CDG115\",\"OMP3\",\"CDG81\",\"CDG094\",\"CPG1\",\"CDG50\",\"HFR4\",\"CAS1\",\"PTG1\",\"CDG080\",\"CDG65\",\"CDG072\",\"CDG90\",\"CDG125\",\"CDG99\",\"OMP1\",\"CDG078\",\"CDG086\",\"CDG095\",\"CDG82\",\"CDG602\",\"CDG60\",\"CDG66\",\"CDG71\",\"CDG55\",\"CAS2\",\"CDG188\",\"CDG52\"],\"normalizedCityName\":\"Paris\"}"],"normalized_location":"Paris, Ile-de-France, FRA","optional_search_labels":["auta-techeng","auta-ugnt","amazon-web-services.data-center-spain","aws.team-infrastructure-planning-optional"],"posted_date":"November 12, 2025","preferred_qualifications":"- Experience in program or project management\u003cbr/\u003e- Knowledge of mechanical systems (Mechanical, HVAC systems, Controls)\u003cbr/\u003e\u003cbr/\u003eAmazon est un employeur engagé pour l'égalité des chances. Nous sommes convaincus qu'une main d'oeuvre diversifée est essentielle à notre réussite. Nous prenons nos décisions de recrutement en fonction de votre expérience et de vos compétences. Nous apprécions votre envie de découvrir, d'inventer, de simplifier et de construire. La protection de votre vie privée et la sécurité de vos données constituent depuis longtemps une priorité absolue pour Amazon. Veuillez consulter notre Politique de Confidentialité pour en savoir plus sur la façon dont nous collectons, utilisons et traitons les données personnelles de nos candidats.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"studentprograms.team-jobs-for-grads","source_system":"JobCreator","state":null,"title":"2026 Engineering Operations Intern, Data Center Engineering Operations","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3125320/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-jobs-for-grads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Studienabschluss\u003cbr/\u003e- Führungserfahrung und Erfahrung im Stakeholdermanagement\u003cbr/\u003e- Fortgeschrittene Englisch- und Deutschkenntnisse in Wort und Schrift\u003cbr/\u003e- Relevante Erfahrung in der Verwendung von Daten oder anekdotischer Evidenz zur Begründung von geschäftlichen Entscheidungen\u003cbr/\u003e- Relevante Erfahrung in Produktions- und Lieferkettenbereichen","business_category":"fulfillment-ops","city":"Bad Hersfeld","company_name":"Amazon Logistik GmbH","country_code":"DEU","description":"Der operative Geschäftsbereich ist das Herz von Amazon. Dieser wesentliche Teil unseres Unternehmens sorgt dafür, dass wir Bestellungen effizient erfüllen und versenden, damit unsere Kund:innen ihre Artikel rechtzeitig erhalten. Getragen wird er von Operations Manager:innen, die das Team zusammenführen, um an allen unseren Standorten hervorragende Sicherheit, Qualität und Produktivität zu fördern.  Du koordinierst an Deinem Standort andere Manager:innen und erstellst den Betriebsplan, der Deinen Teams bei der Erfüllung ihrer Ziele hilft. Diese Rolle ist voll darauf ausgerichtet, die Operational Excellence zu unterstützen, um das Amazon von Morgen zu schaffen.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Leitung und Entwicklung eines Teams von Area Manager:innen\u003cbr/\u003e- Schichtleitung von Betriebsteams, Handhabung von Problemen und Förderung der Standortleistung \u003cbr/\u003e- Analyse der Schichten laut Unternehmensvorgaben und Umsetzung von Maßnahmen zur Verbesserung unserer Operational Excellence\u003cbr/\u003e- Enge Zusammenarbeit mit anderen Support-Teams, einschließlich derer für die Bereiche HR, Finanzen, Arbeitsschutz und Sicherheit\u003cbr/\u003e- Gestaltung und Umsetzung von Initiativen an allen Standorten zur Verbesserung der Betriebsleistung\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eDu übernimmst die Schichtleitung an einem unserer Betriebsstandorte. Außerdem fungierst Du als Hauptschnittstelle zwischen mehreren verschiedenen Teams, u. a. den Finanz-, Sicherheits- und Betriebsintegrationsteams. Das bedeutet, dass Du die täglichen Betriebsabläufe an Deinem Standort unmittelbar beobachtest und gleichzeitig auch zu neuen Innovationsmöglichkeiten beiträgst.\u003cbr/\u003eEin typischer Arbeitstag umfasst Treffen mit verschiedenen Geschäftsbereichen, eingehende Untersuchungen der Leistungs- und Risikokennzahlen für Standorte sowie Prognosen zur Vorbereitung auf unterschiedliche Nachfragevolumen. Weiterhin bietest Du Deinem Team täglich Mentoring und Coaching. Als Führungskraft unterstützt Du Deine Teammitglieder dabei, ihr Managementpotenzial voll zu entfalten. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eMit der Erfüllung unserer Kundenbestellungen (Customer Fulfillment oder CF) fing für Amazon alles an. Das Customer Fulfillment Team hat sich mittlerweile von einem Team von Buchhändler:innen hin zu einem hocherfahrenen globalen Team gewandelt, das täglich mehr als 1,5 Millionen Bestellungen bearbeitet. Das Team bildet die Grundlage unseres Geschäfts und hat uns bei der Verbreiterung in neue Regionen und Dienstleistungen geholfen. Mithilfe aufkommender Technologie sind wir stetig auf der Suche nach Möglichkeiten, eine größere und bessere Produktauswahl anzubieten – die schnell und erschwinglich geliefert wird.\u003cbr/\u003eDie CF-Teammitglieder sorgen als allererste dafür, dass unsere Kund:innen ihre Bestellungen mit der Geschwindigkeit erhalten, für die wir bekannt sind. Wir arbeiten in Fulfillment-Centern, die das Herzstück von Amazons dynamischem Betriebsnetz bilden. Unsere Fullfilment-Center werden manchmal auch als die „erste Meile“ (First Mile) bezeichnet – hier starten die meisten Amazon-Pakete ihren Versandweg. Wir unterstützen die Verwaltung eines dynamischen Bestands und ermöglichen schnelle Zustellungen rund um die Uhr.\u003cbr/\u003eIn unseren Fulfillment-Centern sind vielfältige Mitarbeitergruppen beschäftigt. Es gibt zahlreiche Möglichkeiten für Menschen mit den verschiedensten Fähigkeiten. Einige von uns arbeiten mit physischen Produkten. Andere analysieren Daten und helfen unternehmensweit dabei, intelligente Entscheidungen zu treffen.  ","department_cost_center":null,"description_short":"Der operative Geschäftsbereich ist das Herz von Amazon. Dieser wesentliche Teil unseres Unternehmens sorgt dafür, dass wir Bestellungen effizient erfüllen und versenden, damit unsere Kund:innen ihre Artikel","display_distance":null,"id":"fd1187ee-5475-4a56-ac12-9f98fd08478c","id_icims":"3164531","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3164531/operations-manager-bereichsleiter-in-operations-fra3","job_schedule_type":"full-time","location":"DE, HE, Bad Hersfeld","locations":["{\"normalizedStateName\":\"Hesse\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Bad Hersfeld\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, HE, Bad Hersfeld\",\"coordinates\":\"50.86952,9.71282\",\"normalizedCountyName\":\"Hersfeld-Rotenburg\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Bad Hersfeld, Hesse, DEU\",\"location\":\"DE, HE, Bad Hersfeld\",\"region\":\"HE\",\"buildingCodeList\":[\"FRA3\"],\"normalizedCityName\":\"Bad Hersfeld\"}"],"normalized_location":"Bad Hersfeld, Hesse, DEU","optional_search_labels":[],"posted_date":"January 22, 2026","preferred_qualifications":"- Erfahrung mit Lean-, Six-Sigma- und Kaizen-Methoden\u003cbr/\u003e- Erfahrung in einer ähnlichen Logistikumgebung\u003cbr/\u003e- Erfahrung in der Arbeit mit der MS Office Suite (Word, Excel, Outlook) im beruflichen Umfeld\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"HE","title":"Operations Manager / Bereichsleiter:in Operations, FRA3","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3164531/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- - Master in Mechanical or Mechatronics Engineering or equivalent by experience Proficiency in CAD and PLM software Fluent in English (written and spoken)","business_category":"operations","city":"Hamme","company_name":"D. Cloostermans-Huwaert NV","country_code":"BEL","description":"The Mechanical Engineer designs automated packaging platforms and supporting systems to enable faster and more efficient delivery to Amazon's customers.\u003cbr/\u003e\u003cbr/\u003eThe primary role of the Mechanical Engineer is to provide technical ownership and refinement of the packaging platforms and automation systems. Working with the Electrical and Controls teams, the Mechanical Engineer will execute the design and manufacturing of Amazon's in-house packaging machinery and automation.\u003cbr/\u003eUtilizing MSP’s packaging machinery \u0026 automation platforms and modules, the Mechanical Engineer in conjunction with the Electrical and Controls Engineers will execute project / platform design evolution and execution enabling the manufacturing of Amazon’s in-house packaging machinery and automation. Co-located with our electrical and controls engineers, packaging designers and materials scientist this role will execute the design duties to ensure that Amazon’s packaging machinery and supporting automation is simple, effective and delivers lower total cost while enabling more sustainable packaging, streamlined supply chains and lower total cost of ownership.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eDesign and Execution:\u003cbr/\u003e- Collaborate with cross-functional engineering teams to design and execute packaging machinery and automation projects\u003cbr/\u003e- Collaborate in the mechanical design work-streams, including 3D/2D modeling, mechanical calculations, and simulations\u003cbr/\u003eDocumentation and Compliance:\u003cbr/\u003e- Ensure comprehensive and scalable project documentation for manufacturing\u003cbr/\u003e- Partner with Electrical and Controls Engineering to complete electrical schematics, BOMs, I/O’s.\u003cbr/\u003e- Support safety certification of projects (CE, UL, CSA, TUV, etc.)\u003cbr/\u003eProject Management:\u003cbr/\u003e- Collaborate in cross-functional meetings to optimize customer experience, supply chain, and sustainability\u003cbr/\u003e- Ensure technical, cost, and timeline objectives are achieved\u003cbr/\u003eDetailed Engineering:\u003cbr/\u003e- Execute detailed design evolution of modules and subsystems, considering material specifications and geographic requirements\u003cbr/\u003e- Generate mechanical Bills of Materials (BOMs)\u003cbr/\u003e- Align designs with continuous improvement goals and platform/project level initiatives\u003cbr/\u003eCollaboration and Optimization:\u003cbr/\u003e- Work closely with project teams to ensure seamless integration of mechanical systems with other engineering disciplines\u003cbr/\u003e- Contribute to the optimization of designs for manufacturability, cost-effectiveness, and performance\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Mechatronics and Sustainable Packaging (MSP) team is a unified organization within Amazon that develops, deploys, and scales automated solutions and sustainable packaging across Amazon's operations. By aligning mechatronics and packaging, MSP enables seamless integration of innovative solutions throughout the Amazon Fulfillment Network.\u003cbr/\u003e\u003cbr/\u003eKey aspects of MSP's work include:\u003cbr/\u003e- Customer-Centric Approach: The team works backwards from deep customer insights to deliver solutions that enhance the overall customer experience.\u003cbr/\u003e- Operational Integration: MSP develops solutions that integrate smoothly into both brownfield and greenfield deployments, prioritizing safety in all implementations.\u003cbr/\u003e- Comprehensive Packaging Ownership: The team takes responsibility for the entire packaging experience.\u003cbr/\u003e- Sustainability Focus: MSP is committed to waste reduction and sustainable practices. They aim to eliminate unnecessary packaging and transition from single-use plastics to curbside recyclable paper-based materials where packaging is required.\u003cbr/\u003e- Cross-Network Impact: Sustainable Packaging solutions developed by MSP impact and connect all parts of the Amazon Stores supply chain, influencing the entire customer experience.\u003cbr/\u003e- Innovation in Automation: The team develops automated solutions that improve efficiency and accuracy across Amazon's operations.\u003cbr/\u003e","department_cost_center":null,"description_short":"The Mechanical Engineer designs automated packaging platforms and supporting systems to enable faster and more efficient delivery to Amazon's customers.The primary role of the Mechanical Engineer is to","display_distance":null,"id":"a305447e-0bd3-4c28-94f5-78c8b74ecd7c","id_icims":"3180733","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/3180733/mechanical-hardware-development-engineer-mechanical-engineering","job_schedule_type":"full-time","location":"BE, Hamme","locations":["{\"normalizedStateName\":\"Flanders\",\"normalizedCountryCode\":\"BEL\",\"city\":\"Hamme\",\"countryIso3a\":\"BEL\",\"countryIso2a\":\"BE\",\"locationNonStemming\":\"Belgium, Hamme\",\"coordinates\":\"51.09835,4.13762\",\"normalizedCountyName\":\"Oost-Vlaanderen\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Belgium\",\"normalizedLocation\":\"Hamme, Flanders, BEL\",\"location\":\"BE, Hamme\",\"region\":\"\",\"buildingCodeList\":[\"ANR10\"],\"normalizedCityName\":\"Hamme\"}"],"normalized_location":"Hamme, Flanders, BEL","optional_search_labels":["ops.lander-po3-emea","international-stores.stores-tech-emea"],"posted_date":"February 13, 2026","preferred_qualifications":"- Knowledge of SolidWorks, Teamcenter, simulation and FEA\u003cbr/\u003e- Experience in the design of mechanical products and equipment at volume\u003cbr/\u003e- GD\u0026T, and manufacturing process knowledge\u003cbr/\u003e- Understanding of packaging machinery safety standards\u003cbr/\u003e- Operations experience in a manufacturing environment\u003cbr/\u003e- - Knowledge of SolidWorks, Teamcenter, simulation and FEA\u003cbr/\u003e- - Experience in the design of mechanical products and equipment at volume\u003cbr/\u003e- - GD\u0026T, and manufacturing process knowledge\u003cbr/\u003e- - Understanding of packaging machinery safety standards\u003cbr/\u003e- - Operations experience in a manufacturing environment\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"operations.team-packaging-innovation","source_system":"JobCreator","state":null,"title":"Mechanical Hardware Development Engineer, Mechanical Engineering","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3180733/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-packaging-innovation","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Abgeschlossene technische Berufsausbildung, anerkannt durch die Industrie- und Handelskammer (IHK) oder Handwerkskammer (HWK) oder Nachweis eines erfolgreich abgeschlossen Hochschulstudium im Ingenieurwissenschaftlichen Bereich (Maschinenbau / Elektrotechnik oder artverwandt) einer deutschen Hochschule oder anerkannte ausländische Hochschulabschlüsse (BA, B. Sc., MA, M. Sc., Dipl.-Ing.)\u003cbr/\u003e- Zusätzlich, eine abgeschlossene Qualifikation als Industriemeister, Handwerksmeister oder Staatlich Geprüfter/Anerkannter Techniker oder mehrjährige einschlägige Berufserfahrung\u003cbr/\u003e- Praktische Erfahrung im Führen von Teams\u003cbr/\u003e- Erfahrung in der Automatisierung und Instandhaltung von Förderanlagen \u003cbr/\u003e- Fortgeschrittene Deutschkenntnisse in Wort und Schrift sowie Grundsprachkenntnisse in Englisch","business_category":"fulfillment-ops","city":"Wolfhagen","company_name":"Amazon SZ Wolfhagen GmbH","country_code":"DEU","description":"Unser Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) ist der Kern von Amazons Engagement für Innovation. Amazon entwickelt sich weiter und dieses Team sorgt dafür, dass dies auch die von uns verwendeten Technologien und Tools tun. Als Senior RME Technician hilfst Du uns, der Entwicklung einen Schritt voraus zu bleiben. Du setzt die neuesten Technologien ein und identifizierst neue, effiziente Arbeitsmethoden. In dieser Rolle achtest Du genau auf unsere Prozesse und trägst dazu bei, dass wir unsere höchsten Sicherheitsstandards befolgen und weiter erhöhen.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Best Practice und Unterstützen im Bedienen von Geräten und Anlagen mit den höchsten Sicherheitsstandards\u003cbr/\u003e- Verfolgen der Geräteleistung durch visuelle Prüfungen, zustandsorientierte Überwachung und vorbeugende Wartungsmaßnahmen und Einplanen zusätzlicher Wartung je nach Bedarf\u003cbr/\u003e- Verantwortung für das technische Team während seiner Schicht und dessen Unterstützung und Weiterentwicklung\u003cbr/\u003e- Lösung von Problemen an Anlagen, um Betriebsausfallzeiten zu reduzieren und die schnellstmögliche Abfertigung von Paketen zu ermöglichen\u003cbr/\u003e- Unterstützung bei der kontinuierlichen Verbesserung von Systemen und Standardisierung von Prozessen im ganzen EU-Netzwerk\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eDu betreust ein Instandhaltungsteam innerhalb einer Schicht und sorgst dafür, dass alle Mitarbeitenden die erforderlichen Werkzeuge zur Verfügung haben und diese einwandfrei funktionieren. Das beinhaltet die Überwachung von Prozessen, damit Vorschriften und Richtlinien befolgt werden, ebenso wie die Gewährleistung der Durchführung vorbeugender Wartungsmaßnahmen, um die Betriebszeit unserer Anlagen zu maximieren.\u003cbr/\u003eDurch Deine Beobachtungen während der Schichtarbeit machst Du Verbesserungsvorschläge, um unsere Systeme noch effizienter und produktiver zu gestalten, und setzt diese Verbesserungen EU-weit um. Außerdem nutzt Du Tools wie SCADA zur Überwachung von Prozessen, um deren Leistungsfähigkeit zu gewährleisten, und unterstützt administrative Aufgaben in enger Zusammenarbeit mit Deinen Führungskräften.\u003cbr/\u003eDu arbeitest vor Ort in einem unserer Logistikzentren. Du arbeitest in Schichtmodellen, die Nächte und Wochenenden umfassen können. Mit den Kenntnissen und Erfahrungen, die Du sammelst, wirst Du Dich zu weiteren Führungspositionen weiterentwickeln.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eUnser Amazon Transportation Services (ATS) Team ist essentiell, um Amazons schnelles Lieferversprechen einhalten zu können. Bei ATS wirst du Teil eines diversen Teams, welches eine zentrale Rolle für den Erfolg unserer Supply Chain spielt. In Zusammenarbeit mit Luft- und Seefrachtunternehmen, Straßenspeditionen und unseren Sortierzentren sorgst Du dafür, dass Amazon seine Kund:innen so effizient wie möglich beliefert.  \u003cbr/\u003eUnsere Mitarbeitenden und ihre Sicherheit sind dabei unsere höchste Priorität. Und wir nutzen das Können unserer Mitarbeitenden, um Pakete schnell, reibungslos und nachhaltig an ihr Ziel zu bringen. Unsere datenbasierte Entscheidungsfindung und unsere Flexibilität uns den Bedürfnissen der Kunden anzupassen macht Amazon noch effizienter und innovativer.\u003cbr/\u003eUnsere Mitarbeitenden und ihre Sicherheit sind dabei unsere höchste Priorität. Wir nutzen das Können unserer Mitarbeitenden, um Pakete schnell, reibungslos und nachhaltig an ihr Ziel zu bringen. Unsere datenbasierte Entscheidungsfindung und unsere Flexibilität und uns den Bedürfnissen der Kunden anzupassen macht Amazon effizienter und innovativer.","department_cost_center":null,"description_short":"Unser Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) ist der Kern von Amazons Engagement für Innovation. Amazon entwickelt sich weiter und dieses Team sorgt","display_distance":null,"id":"83636ae8-0137-4c3e-aa23-30625f09814a","id_icims":"3079477","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3079477/senior-instandhaltungstechniker-in","job_schedule_type":"full-time","location":"DE, HE, Wolfhagen","locations":["{\"normalizedStateName\":\"Hesse\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Wolfhagen\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, HE, Wolfhagen\",\"coordinates\":\"51.32798,9.17243\",\"normalizedCountyName\":\"Kassel (Landkreis)\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Wolfhagen, Hesse, DEU\",\"location\":\"DE, HE, Wolfhagen\",\"region\":\"HE\",\"buildingCodeList\":[\"KSF7\"],\"normalizedCityName\":\"Wolfhagen\"}"],"normalized_location":"Wolfhagen, Hesse, DEU","optional_search_labels":["jdv.operations.seniorrmetechnician"],"posted_date":"September 10, 2025","preferred_qualifications":"- Erfahrung in der Betreuung von Fremdfirmen\u003cbr/\u003e- Verständnis von SPS-basierten Steuersystemen und gesetzlichen Compliance-Anforderungen\u003cbr/\u003e- Erfahrung im Gebrauch von computergesteuerten Wartungsmanagementsystemen, um proaktive Wartungsmaßnahmen zu planen und reaktive Maßnahmen aufzuzeichnen\u003cbr/\u003e- Studienabschluss, vorzugsweise in einem technischen Fachgebiet oder in Betriebswirtschaft\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":"HE","title":"Senior Instandhaltungstechniker:in","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3079477/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Laurea.\u003cbr/\u003e- Esperienza pregressa comprovata nella gestione di team, KPI e performance.\u003cbr/\u003e- Livello di inglese minimo B2 (intermedio alto)","business_category":"fulfillment-and-operations","city":"Riese Pio X","company_name":"Amazon Italia Transport Srl","country_code":"ITA","description":"Il team Operations è il cuore pulsante di Amazon. Svolge un ruolo fondamentale per il nostro business, perché ci permette di evadere e spedire gli ordini in modo efficiente, così che i nostri clienti li ricevano nei tempi previsti. Nel ruolo di Area Manager, dovrai garantire la regolare operatività del tuo sito logistico, per riuscire a soddisfare le richieste dei clienti. Sarai a capo di un team che contribuisce a garantire la sicurezza, l’efficienza e l’alta qualità dei nostri processi e ti occuperai di una serie di progetti su tutta la nostra rete con lo scopo di incrementare la produttività. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Creare, portare avanti e promuovere una cultura incentrata sulla sicurezza e sul benessere.\u003cbr/\u003e- Analizzare e implementare cambiamenti per mantenere qualità e produttività a livelli costantemente elevati.\u003cbr/\u003e- Supervisionare progetti di miglioramento dei processi, ottimizzare la produttività e incrementare la qualità del servizio ai clienti all’interno della tua area di responsabilità.\u003cbr/\u003e- Analizzare le prestazioni dei turni rispetto agli obiettivi aziendali e mettere in atto azioni per migliorare la nostra eccellenza operativa.\u003cbr/\u003e- Lavorare in collaborazione con i colleghi manager per standardizzare le prassi adottate nei turni.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eLavorerai su turni presso uno dei nostri siti logistici, garantendo la massima produttività possibile. Il tuo obiettivo principale sarà promuovere una cultura della sicurezza e il rispetto degli standard di qualità e di performance durante i turni. Dovrai inoltre supervisionare le attività di miglioramento dei processi nella tua area e agevolarne l’implementazione. La tipica giornata di lavoro è molto varia: dovrai occuparti di attività di routine di gestione del team, avrai responsabilità quotidiane volte al miglioramento dei processi e iniziative contingenti di gestione operativa su più ampia scala. Dovrai anche fungere da esempio e da guida per i nuovi manager.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eCollaborazione con aziende di distribuzione terze. La nostra forza è focalizzarci sul pensiero creativo e sul miglioraci continuamente per assicurare che milioni di prodotti arrivino nelle mani dei nostri consumatori. Il nostro obiettivo è semplice: regalare ai clienti l’esperienza di consegna più fluida possibile e lanciare soluzioni globali per la consegna nei nostri nuovi business, come Amazon Fresh, Prime Now e Amazon Restaurants.\u003cbr/\u003eLa nostra attività si articola su due livelli. Da un lato c’è chi opera in sede e gestisce milioni di prodotti, facendoli arrivare ai team responsabili della consegna. Il nostro team è orientato alle persone e sempre pronto a darsi una mano, soprattutto considerato che molti dei nostri colleghi svolgono il turno notturno. Ci concentriamo principalmente sulle attività operative, con turni articolati sulle 24 ore, 7 giorni alla settimana, nella maggior parte delle nostre sedi.\u003cbr/\u003eDall’altro lato invece, c’è chi opera sul campo e collabora con Amazon Flex, la rete di collaboratori esterni a cui ci appoggiamo per le consegne. Di anno in anno puntiamo a offrire ai clienti un’esperienza sempre migliore, grazie a servizi di consegna innovativi. Siamo sempre alla ricerca di nuovi modi per superare le notevoli sfide logistiche tipiche del nostro settore e di nuove idee per ridurre il nostro impatto ambientale, grazie a una flotta di veicoli all’avanguardia (anche elettrici) e a soluzioni tecnologiche mirate. ","department_cost_center":null,"description_short":"Il team Operations è il cuore pulsante di Amazon. Svolge un ruolo fondamentale per il nostro business, perché ci permette di evadere e spedire gli ordini in modo efficiente, così che i nostri clienti li","display_distance":null,"id":"2184a542-5fff-48cf-9d81-a6ed37fc8cfa","id_icims":"3167377","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3167377/area-manager","job_schedule_type":"full-time","location":"IT, TS, Riese Pio X","locations":["{\"normalizedStateName\":\"Veneto\",\"normalizedCountryCode\":\"ITA\",\"city\":\"Riese Pio X\",\"countryIso3a\":\"ITA\",\"countryIso2a\":\"IT\",\"locationNonStemming\":\"Italy, TS, Riese Pio X\",\"coordinates\":\"45.72642,11.91551\",\"normalizedCountyName\":\"Treviso\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Italy\",\"normalizedLocation\":\"Riese Pio X, Veneto, ITA\",\"location\":\"IT, TS, Riese Pio X\",\"region\":\"TS\",\"buildingCodeList\":[\"DVN6\"],\"normalizedCityName\":\"Riese Pio X\"}"],"normalized_location":"Riese Pio X, Veneto, ITA","optional_search_labels":["ops.lander-ops-management-it"],"posted_date":"January 27, 2026","preferred_qualifications":"- Esperienza con le metodologie Lean, Six Sigma e Kaizen.\u003cbr/\u003e- Esperienza lavorativa nel settore logistico.\u003cbr/\u003e- Buona padronanza del pacchetto MS Office (Word, Excel, Outlook) ad uso professionale.\u003cbr/\u003e- Vasta esperienza nella comunicazione con un’ampia gamma di stakeholder, tra cui colleghi e manager.\u003cbr/\u003e- Vasta esperienza nell’utilizzo di dati o evidenze storiche per influenzare le decisioni aziendali.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-last-mile-delivery","source_system":"JobCreator","state":"TS","title":"Area Manager ","university_job":null,"updated_time":"26 minutes","url_next_step":"https://account.amazon.com/jobs/3167377/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-delivery","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Laurea.\u003cbr/\u003e- Esperienza pregressa comprovata nella gestione di team, KPI e performance.\u003cbr/\u003e- Livello di inglese minimo B2 (intermedio alto)","business_category":"fulfillment-and-operations","city":"Rome","company_name":"Amazon Italia Transport Srl","country_code":"ITA","description":"Il team Operations è il cuore pulsante di Amazon. Svolge un ruolo fondamentale per il nostro business, perché ci permette di evadere e spedire gli ordini in modo efficiente, così che i nostri clienti li ricevano nei tempi previsti. Nel ruolo di Area Manager, dovrai garantire la regolare operatività del tuo sito logistico, per riuscire a soddisfare le richieste dei clienti. Sarai a capo di un team che contribuisce a garantire la sicurezza, l’efficienza e l’alta qualità dei nostri processi e ti occuperai di una serie di progetti su tutta la nostra rete con lo scopo di incrementare la produttività. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Creare, portare avanti e promuovere una cultura incentrata sulla sicurezza e sul benessere.\u003cbr/\u003e- Analizzare e implementare cambiamenti per mantenere qualità e produttività a livelli costantemente elevati.\u003cbr/\u003e- Supervisionare progetti di miglioramento dei processi, ottimizzare la produttività e incrementare la qualità del servizio ai clienti all’interno della tua area di responsabilità.\u003cbr/\u003e- Analizzare le prestazioni dei turni rispetto agli obiettivi aziendali e mettere in atto azioni per migliorare la nostra eccellenza operativa.\u003cbr/\u003e- Lavorare in collaborazione con i colleghi manager per standardizzare le prassi adottate nei turni.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eLavorerai su turni presso uno dei nostri siti logistici, garantendo la massima produttività possibile. Il tuo obiettivo principale sarà promuovere una cultura della sicurezza e il rispetto degli standard di qualità e di performance durante i turni. Dovrai inoltre supervisionare le attività di miglioramento dei processi nella tua area e agevolarne l’implementazione. La tipica giornata di lavoro è molto varia: dovrai occuparti di attività di routine di gestione del team, avrai responsabilità quotidiane volte al miglioramento dei processi e iniziative contingenti di gestione operativa su più ampia scala. Dovrai anche fungere da esempio e da guida per i nuovi manager.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eCollaborazione con aziende di distribuzione terze. La nostra forza è focalizzarci sul pensiero creativo e sul miglioraci continuamente per assicurare che milioni di prodotti arrivino nelle mani dei nostri consumatori. Il nostro obiettivo è semplice: regalare ai clienti l’esperienza di consegna più fluida possibile e lanciare soluzioni globali per la consegna nei nostri nuovi business, come Amazon Fresh, Prime Now e Amazon Restaurants.\u003cbr/\u003eLa nostra attività si articola su due livelli. Da un lato c’è chi opera in sede e gestisce milioni di prodotti, facendoli arrivare ai team responsabili della consegna. Il nostro team è orientato alle persone e sempre pronto a darsi una mano, soprattutto considerato che molti dei nostri colleghi svolgono il turno notturno. Ci concentriamo principalmente sulle attività operative, con turni articolati sulle 24 ore, 7 giorni alla settimana, nella maggior parte delle nostre sedi.\u003cbr/\u003eDall’altro lato invece, c’è chi opera sul campo e collabora con Amazon Flex, la rete di collaboratori esterni a cui ci appoggiamo per le consegne. Di anno in anno puntiamo a offrire ai clienti un’esperienza sempre migliore, grazie a servizi di consegna innovativi. Siamo sempre alla ricerca di nuovi modi per superare le notevoli sfide logistiche tipiche del nostro settore e di nuove idee per ridurre il nostro impatto ambientale, grazie a una flotta di veicoli all’avanguardia (anche elettrici) e a soluzioni tecnologiche mirate. ","department_cost_center":null,"description_short":"Il team Operations è il cuore pulsante di Amazon. Svolge un ruolo fondamentale per il nostro business, perché ci permette di evadere e spedire gli ordini in modo efficiente, così che i nostri clienti li","display_distance":null,"id":"85084b61-38a3-438d-a7c4-fc8b6cf9e03a","id_icims":"3166319","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3166319/area-manager","job_schedule_type":"full-time","location":"IT, RM, Rome","locations":["{\"normalizedStateName\":\"Latium\",\"normalizedCountryCode\":\"ITA\",\"city\":\"Rome\",\"countryIso3a\":\"ITA\",\"countryIso2a\":\"IT\",\"locationNonStemming\":\"Italy, RM, Rome\",\"coordinates\":\"41.90325,12.49563\",\"normalizedCountyName\":\"Rome\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Italy\",\"normalizedLocation\":\"Rome, Latium, ITA\",\"location\":\"IT, RM, Rome\",\"region\":\"RM\",\"buildingCodeList\":[\"DLZ3\"],\"normalizedCityName\":\"Rome\"}"],"normalized_location":"Rome, Latium, ITA","optional_search_labels":["ops.lander-ops-management-it"],"posted_date":"January 26, 2026","preferred_qualifications":"- Esperienza con le metodologie Lean, Six Sigma e Kaizen.\u003cbr/\u003e- Esperienza lavorativa nel settore logistico.\u003cbr/\u003e- Buona padronanza del pacchetto MS Office (Word, Excel, Outlook) ad uso professionale.\u003cbr/\u003e- Vasta esperienza nella comunicazione con un’ampia gamma di stakeholder, tra cui colleghi e manager.\u003cbr/\u003e- Vasta esperienza nell’utilizzo di dati o evidenze storiche per influenzare le decisioni aziendali.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-last-mile-delivery","source_system":"JobCreator","state":"RM","title":"Area Manager ","university_job":null,"updated_time":"27 minutes","url_next_step":"https://account.amazon.com/jobs/3166319/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-delivery","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- Speak, write, and read fluently in English\u003cbr/\u003e- Experience with Microsoft Office products and applications","business_category":"fulfillment-and-operations","city":"Hyderabad","company_name":"ASSPL - Telangana - D82","country_code":"IND","description":"Job summary\u003cbr/\u003eAt Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Team leads for our transportation team. Amazon is one of the most recognizable brand names in the world and we distribute millions of products each year to our loyal customers\u003cbr/\u003e\u003cbr/\u003eWe're seeking a Team lead for our Delivery center. In this role you will be responsible for shift operations at our DCs and support the DC manager in performance management and driving the operational plan.\u003cbr/\u003e\u003cbr/\u003eTitle:Team Lead\u003cbr/\u003eLocation: Hyderabad .\u003cbr/\u003e\u003cbr/\u003e Essential Functions\u003cbr/\u003e\u003cbr/\u003e-Job Description\u003cbr/\u003e· Training: Deliver training \u0026 coaching of Amazon processes, products, operating model and SOP to Associates.\u003cbr/\u003e· Work on the ground to enable network with new product launches and partner with the operations and other teams.\u003cbr/\u003e· Reporting: Maintaining \u0026 publishing routine reporting on the current performance \u0026 business with Amazon. Publish recommendations and action plans based on data. Reporting the overall Network Health in the assigned territory.\u003cbr/\u003e· Team Management: Building and managing a multi-layer team and manage performance through on-the job coaching and mentoring. Driving team of associates for managing their targets.\u003cbr/\u003e· Set proper expectations, provide clear status communications, and manage relationships with the associates.\u003cbr/\u003e· Work with process associates \u0026 station team to improve operational aspects of their business in providing a great delivery experience and consistently enhance efficiency.\u003cbr/\u003e· Handling day to day operational escalations and be available to round the clock to manage the issues.\u003cbr/\u003e· Internal/External Stake holder management.\u003cbr/\u003e· Support station operations and/or customer deliveries.\u003cbr/\u003eEssential Skills\u003cbr/\u003e\u003cbr/\u003e    Strong leadership capabilities and people management skills\u003cbr/\u003e    Ability to work under pressure situations\u003cbr/\u003e    Ability to work in ambiguous situations\u003cbr/\u003e    Good communication skills. Ability to communicate and explain to individuals \u0026 the team, what needs to be achieved for the Delivery Center /Amazon to achieve its objectives. Listening skills: Gains input and commitment from all involved in delivering their specific part.\u003cbr/\u003e    Strong Bias for great customer service: Engage the Team in developing their understanding of Customer Experience and knowledge of what Customers actually needs/expects.\u003cbr/\u003e    High Ownership: Follows through to ensure the delivery of changes/solutions/services that fulfill the Customer’s needs.\u003cbr/\u003e\u003cbr/\u003eAnalytical Skills: Effectively analyze and interpret information, identifying \u0026 validating the key facts, including reviewing alternatives to determine advantages and associated risks.","department_cost_center":null,"description_short":"Job summaryAt Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Team leads for our transportation","display_distance":null,"id":"6c86971c-97f8-4a83-8d89-a079cee510cd","id_icims":"3148181","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Administrative Support","job_function_id":null,"job_path":"/en/jobs/3148181/team-lead-supply-chain-transportation-management","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD47\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":["amazon-operations.quality-emea"],"posted_date":"December 23, 2025","preferred_qualifications":"- MBA\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-last-mile-delivery","source_system":"JobCreator","state":"TS","title":"Team Lead, Supply Chain/Transportation Management","university_job":null,"updated_time":"31 minutes","url_next_step":"https://account.amazon.com/jobs/3148181/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-delivery","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}