{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- -Speak, write, and read fluently in English.\u003cbr/\u003e- -3+ years of retail experience, vendor management, supply chain, or commercial operations.\u003cbr/\u003e- -Experience managing Profit \u0026 Loss (P\u0026L) or financial metrics to drive business decisions.\u003cbr/\u003e- -Experience in program or project management, including cross-functional stakeholder management.\u003cbr/\u003e- -Experience using Excel and data analysis.\u003cbr/\u003e- -Bachelor's degree or equivalent.","business_category":"retail","city":"San Jose","company_name":"Amazon Support Services Costa Rica SRL - B20","country_code":"CRI","description":"The International Expansions team is seeking a Vendor Manager to support local category teams by working with our top vendors around the world to increase direct imports into emerging countries. You will have responsibility for supporting the import supply chain processes from manufacturer to the availability in our Fulfillment Centers, and for liaising with local Vendor Managers to develop and implement inventory management strategies to optimize customer experience. You will work to lay the groundwork for vendors to work with Amazon at a coordinated global level. \u003cbr/\u003e\u003cbr/\u003eThe position requires an individual who can work autonomously in a fast paced, demanding and often ambiguous environment. Additionally, since this position involves working with multiple stakeholders around the world in a fast-growing opportunity, we need someone with strong stakeholder management capabilities and ownership with great bias for action. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Educate vendors on new country opportunities.\u003cbr/\u003e- Build and maintain relationships with senior leaders of partnered vendors to support the joint import business.\u003cbr/\u003e- Develop and improve the import business to support country cost savings and new selection.\u003cbr/\u003e- Support the integration of new vendors into the Amazon supply chain, product compliance and merchandising processes.\u003cbr/\u003e- Liaise with local Vendor Managers to understand selection needs and standard contractual terms.\u003cbr/\u003e- Work with key stakeholders around the world to maintain alignment.\u003cbr/\u003e- Contribute to the development of best practices and contract standards.\u003cbr/\u003e- Support category teams to monitor, analyze and own key performance indicators such as vendor import share, out of stock rate, vendor operational metrics, marketing investments.\u003cbr/\u003e- Work with vendors and Amazon operations to ensure a reliable, operational and cost effective flow of goods, from ordering to receive.\u003cbr/\u003e- Work with internal teams to understand the systems and variables that affect purchasing and vendor management decisions.\u003cbr/\u003e- Lead projects and regular business improvement initiatives.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe International Expansions (IE) organization’s charter is to rapidly expand Amazon’s retail presence globally, partnering closely with category management, technology, and product teams to deliver the world’s largest selection to our international customers. Within the IE organization, our team's vision is build the tools that enable our vendors and sellers to go global effortlessly, discovering global business insights that drive customer engagement and ensure our success in new and emerging marketplaces.","department_cost_center":null,"description_short":"The International Expansions team is seeking a Vendor Manager to support local category teams by working with our top vendors around the world to increase direct imports into emerging countries. You will","display_distance":null,"id":"bbcf1070-86e7-45d5-a59f-08af54309e20","id_icims":"3176801","is_intern":null,"is_manager":null,"job_category":"Buying, Planning, \u0026 Instock Management","job_family":"Buying/Planning","job_function_id":null,"job_path":"/en/jobs/3176801/vendor-manager-global-purchasing-program","job_schedule_type":"full-time","location":"CR, San Jose","locations":["{\"normalizedStateName\":\"San Jose\",\"normalizedCountryCode\":\"CRI\",\"city\":\"San Jose\",\"countryIso3a\":\"CRI\",\"countryIso2a\":\"CR\",\"locationNonStemming\":\"Costa Rica, San Jose\",\"coordinates\":\"9.92975,-84.08569\",\"normalizedCountyName\":\"San Jose\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Costa Rica\",\"normalizedLocation\":\"San Jose, San Jose, CRI\",\"location\":\"CR, San Jose\",\"region\":\"\",\"buildingCodeList\":[\"SJO11\"],\"normalizedCityName\":\"San Jose\"}"],"normalized_location":"San Jose, San Jose, CRI","optional_search_labels":[],"posted_date":"February  9, 2026","preferred_qualifications":"- Experience managing large-scale projects from end to end\u003cbr/\u003e- 3+ years of experience managing import processes\u003cbr/\u003e- Demonstrated success in program or project management roles\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"retail.team-avs","source_system":"JobCreator","state":null,"title":"Vendor Manager, Global Purchasing Program","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/3176801/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-avs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 8+ years of major internet routing protocols experience\u003cbr/\u003e- 5+ years of working in a Linux/Unix environment experience\u003cbr/\u003e- 3+ years of automation scripting using Python, Bash, Shell and/or Perl experience\u003cbr/\u003e- Experience in IP networking technologies such as - BGP, OSPF, IS-IS, MPLS, TCP, SLB, network hardware platforms, and packet forwarding architectures.\u003cbr/\u003e- Network design, engineering, implementation, and/or operations experience.\u003cbr/\u003e- Experience leading solutioning, planning, engineering, growth, operations, and/or enhancement of industry leading IP network solutions.\u003cbr/\u003e- Bachelor's degree in Networking, Computer Science, Computer Engineering, or related technical discipline.","business_category":"aws","city":"Herndon","company_name":"Amazon Development Center U.S., Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services Networking is searching for hands-on Senior Network Development Engineer to join our network team that owns critical Amazon Web Services IP networks for our public sector regions. The team drives design, engineering, implementation, operations, reliability, and sustainability of these next-generation networks and works on innovative ways to automate and scale our network as we expand. Position location can be Herndon, VA, Arlington, VA, or Seattle, WA.\u003cbr/\u003e\u003cbr/\u003eOur ideal candidate is hands-on, autonomous, detail oriented, possesses strong written and verbal communication skills, strong project management and time management skills, and has a successful track record of engineering, delivering, and optimizing durable solutions. The desire and ability to work in a fast paced, collaborative environment; with geographically diverse teams is essential. This is a fantastic opportunity to work with some of the best engineers in the industry and help shape the direction of one of the largest and fastest growing cloud networks in the world.\u003cbr/\u003e  \u003cbr/\u003eResponsibilities:\u003cbr/\u003e\u003cbr/\u003e - As a Senior Network Development Engineer working in AWS Networking, you will have end to end ownership (design, engineering, implementation, operations escalation) of our current and newly developing IP networks\u003cbr/\u003e -  Lead the design and evolution of highly available hyper-scale networks, driving them from concept to launch, and beyond  \u003cbr/\u003e -  Define and influence strategy within and outside the team \u003cbr/\u003e -  Lead project teams to deliver impactful benefits to our customers \u003cbr/\u003e -  Work closely with our network engineers and software developers to automate network deployment and operations \u003cbr/\u003e -  Drive operational excellence projects to improve network performance and reliability \u003cbr/\u003e -  Troubleshoot complex problems and develop innovative solutions \u003cbr/\u003e - Hiring, mentoring and coaching engineers \u003cbr/\u003e -  Review and implement changes on the network\u003cbr/\u003ePhysical and Other Requirements:\u003cbr/\u003e -  Must be willing to support an off-hours operations escalation pager rotation. \u003cbr/\u003e -  Experience dealing with customers during problem resolution and operating efficiently under pressure.\u003cbr/\u003e -   The ability to sit in front of computer during scheduled work hours  with appropriate breaks while maintaining a high level of alertness and  attention to detail.\u003cbr/\u003e -  Travel to data center/network sites and Amazon/customer offices as needed.\u003cbr/\u003e\u003cbr/\u003eThis position requires that the candidate selected be a U.S. citizen and obtain and maintain an active TS/SCI with a polygraph.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. ","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"199dfb7d-d5be-49bd-9201-72a73a79bd7c","id_icims":"3055031","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Network Development","job_function_id":null,"job_path":"/en/jobs/3055031/sr-network-development-engineer-adc-network-design-engineering-and-solutions","job_schedule_type":"full-time","location":"US, VA, Herndon","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD21\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Herndon, Virginia, USA","optional_search_labels":["aws.team-adc-infra-optional","aws.team-neteng","military","aws.team-clearedvets","aws.team-ais"],"posted_date":"August  8, 2025","preferred_qualifications":"- Ability to lead and deliver complex network projects and drive operational excellence.\u003cbr/\u003e- Proficiency in developing network automation software.\u003cbr/\u003e- Ability to drive and manage customer impacting network events.\u003cbr/\u003e- Ability to work in a fast paced and collaborative environment.\u003cbr/\u003e- Ability to deal with ambiguity, prioritize, and time manage effectively.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $143,200/year in our lowest geographic market up to $247,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-us-security-clearance-jobs-primary","source_system":"JobCreator","state":"VA","title":"Sr. Network Development Engineer, ADC Network Design, Engineering, and Solutions","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3055031/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-us-security-clearance-jobs-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of product or program management, product marketing, business development or technology experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Experience with feature delivery and tradeoffs of a product\u003cbr/\u003e- Experience owning/driving roadmap strategy and definition\u003cbr/\u003e- Experience with end to end product delivery\u003cbr/\u003e- Experience contributing to engineering discussions around technology decisions and strategy related to a product\u003cbr/\u003e- Experience managing technical products or online services\u003cbr/\u003e- Experience in representing and advocating for a variety of critical customers and stakeholders during executive-level prioritization and planning","business_category":"alexa","city":"Sunnyvale","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The vision for Alexa is to be the world’s best personal assistant. Such an assistant will play a vital role in managing the communication lives of customers, from drafting communications to coordinating with people on behalf of customers. At Alexa Connections, we’re leveraging Generative AI to bring this assistant to life. \u003cbr/\u003e\u003cbr/\u003eIf you’re passionate about building magical experiences for customers, while solving hard, complex technical problems, then this role is for you. You will operate at the intersection of large language models, real time communications, voice and graphical user interfaces, and mixed reality, to deliver state of the art features for end customers.\u003cbr/\u003e\u003cbr/\u003eCome join us to invent the future of how millions of customers will communicate with and through their virtual AI assistants.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs a Senior Product Manager - Technical in Alexa Connections, you will be responsible for building calling, texting, emailing, and sharing experiences, where Alexa acts as an agent to get things done for customers. This role is cross-functional — you will work closely with engineering, science, design, business intelligence, operations, finance and executive teams to bring features to market and develop and grow business opportunities for Amazon. A successful candidate will be highly analytical, able to work effectively in a matrix organization, and adept at synthesizing a variety of technologies and capabilities into high quality, simple products and applications that customers love.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAs a product leader, you will:\u003cbr/\u003e\u003cbr/\u003e* Own and define the vision, strategy, and product roadmap, manage tradeoffs and dependencies with key stakeholders, and execute on deliverables\u003cbr/\u003e* Work closely with the engineering, design, and science teams to develop an offering that will delight customers\u003cbr/\u003e* Drive product launches including working with business development, Alexa partner teams, public relations team, executives in other companies, and other product management team members\u003cbr/\u003e* Monitor the business and refine the roadmap\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eGiven the scope and high level of ownership that product managers have in Alexa, rarely are two days the same. You are a business owner, customer-facing representative for the service, and the point person for partner teams. \u003cbr/\u003e\u003cbr/\u003eOn a weekly basis, you will be working with customers to learn about the problems they are trying to solve, analyzing service and business metrics, writing PRFAQs, BRDs, and naming documents, iterating on product decisions with the Science and Engineering team, working with partners in solution architecture, legal, documentation, etc.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur vision is to make Alexa the world’s most trusted connection assistant for getting things done and creating moments of joy. Our vision emphasizes a) Trust as our foundation for becoming a daily habit, knowing our customers have plentiful choices, b) Completion of end-to-end customer journeys, beyond shipping features, and c) Joy through personalized, proactive experiences, that create a memory. We are building a culture that can achieve career milestones and have fun together while progressively serving our customer to delight. Come join us. ","department_cost_center":null,"description_short":"The vision for Alexa is to be the world’s best personal assistant. Such an assistant will play a vital role in managing the communication lives of customers, from drafting communications to coordinating","display_distance":null,"id":"10f361fe-c39f-4af4-8388-4d3e0c78e5df","id_icims":"3136935","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Product Management - Technical","job_function_id":null,"job_path":"/en/jobs/3136935/senior-product-manager-technical-alexa-connections","job_schedule_type":"full-time","location":"US, CA, Sunnyvale","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sunnyvale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Sunnyvale\",\"coordinates\":\"37.37188,-122.03751\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sunnyvale, California, USA\",\"location\":\"US, CA, Sunnyvale\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC32\"],\"normalizedCityName\":\"Sunnyvale\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA41\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Sunnyvale, California, USA","optional_search_labels":["alexa-and-amazon-devices.team-product-project-program-management-job-family","amazon.artificial-intelligence"],"posted_date":"December  3, 2025","preferred_qualifications":"- Experience in using analytical tools, such as Tableau, Qlikview, QuickSight\u003cbr/\u003e- Experience in building and driving adoption of new tools\u003cbr/\u003e- Experience with communication-related B2C products\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Sunnyvale - 173,900.00 - 235,200.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 151,200.00 - 204,600.00 USD annually","primary_search_label":"alexa.team-customer-experience","source_system":"JobCreator","state":"CA","title":"Senior Product Manager - Technical, Alexa Connections","university_job":null,"updated_time":"19 minutes","url_next_step":"https://account.amazon.com/jobs/3136935/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-customer-experience","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High School diploma or equivalent\u003cbr/\u003e- 3+ years experience in mechanical or electrical hardware assembly, test, and/or installation","business_category":"alexa-and-amazon-devices","city":"Kirkland","company_name":"Amazon Kuiper Manufacturing Enterprises LLC - M90","country_code":"USA","description":"Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the capacity, flexibility, and performance to serve a wide range of customers, from individual households to schools, hospitals, businesses, government agencies, and other organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eWe are looking for talented technicians to help full-scale production of the Amazon Leo satellites. The success of Leo depends on the quality, reliability, cost, manufacturability, throughput, and security of the products that you deliver. If you seek a fast-paced, dynamic environment; if you thrive on solving difficult problems where resolutions have high impact; and if you love the challenge of building something from scratch, then this role will be an ideal next career step. To be successful you need to be highly motivated and detail oriented while showing the highest standards of execution. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Follow work instructions and safety procedures\u003cbr/\u003e- Assemble and test with emphasis to detail, an assortment of LRUs, electrical-mechanical assemblies, avionics, or other complex aerospace builds\u003cbr/\u003e- Use precision calibrated tools – torque wrenches, multimeters, optical inspection devices, micrometers and calipers\u003cbr/\u003e- Read and interpret engineering drawings and technical documentation\u003cbr/\u003e- Perform work according to procedures, specifications, and test instructions\u003cbr/\u003e- Run functional and environmental testing on units\u003cbr/\u003e- Use computer software programs for conducting tests\u003cbr/\u003e- Collaborate with manufacturing engineers to develop and document activities, including continuous improvement opportunities\u003cbr/\u003e- Perform other related duties, as assigned, for the purpose of ensuring an efficient, safe and effective work environment\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eCandidates must be 18 years or older with the ability to understand and adhere to all job requirements and safety guidelines.\u003cbr/\u003e\u003cbr/\u003eThe starting pay for this role in Washington State is up to $33.50 / hour and employees are eligible for incremental raises based on tenure. This information is provided per the Washington State Pay Transparency Act. Base pay information is based on market location. Applicants should apply via Amazon’s internal or external careers site.\u003cbr/\u003e\u003cbr/\u003eAdditional Requirements: \u003cbr/\u003eWilling to work 4 10 hour days Sun-Wed OR Wed-Sat\u003cbr/\u003eWilling to work overtime and weekends as needed. Shift will vary, depending on program needs.\u003cbr/\u003eFlexible working/commuting in between site locations Redmond, WA and Kirkland, WA\u003cbr/\u003eStanding for long periods of time, climbing up and down ladders, bending, grasping, sitting, pulling, pushing, stooping, and stretching may be required to perform the functions of this position\u003cbr/\u003eAble to lift-up to 25lbs. unassisted","department_cost_center":null,"description_short":"Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the capacity,","display_distance":null,"id":"a74df3f8-7d22-426f-bb6c-816b7f5cd6a2","id_icims":"3179234","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Manufacturing","job_function_id":null,"job_path":"/en/jobs/3179234/manufacturing-technician-ii-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Kirkland","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA99\"],\"normalizedCityName\":\"Redmond\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Kirkland\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Kirkland\",\"coordinates\":\"47.67887,-122.2066\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Kirkland, Washington, USA\",\"location\":\"US, WA, Kirkland\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA133\"],\"normalizedCityName\":\"Kirkland\"}"],"normalized_location":"Kirkland, Washington, USA","optional_search_labels":["devices-services.kuiper-prod-ops"],"posted_date":"February 11, 2026","preferred_qualifications":"- Ability to use precision measuring instruments\u003cbr/\u003e- Ability to work effectively in a team environment\u003cbr/\u003e- Experience in the aerospace industry, automotive industry, medical device industry, aviation, military or other high-reliability operating environment\u003cbr/\u003e- Experience in a fast-paced production environment\u003cbr/\u003e- Experience working with FOD, ESD sensitive hardware and clean room requirements\u003cbr/\u003e- Experience with forklifts, cranes and heavy equipment (including previous certifications)\u003cbr/\u003e- A demonstrated ability in reading/understanding technical drawings, work instructions and standard operating procedures\u003cbr/\u003e- Some basic knowledge of electrical, optical and mechanical systems, antennas, functional testing and/or satellite components\u003cbr/\u003e- Ability to use multiple types of precision measuring instruments\u003cbr/\u003e- Ability to rapidly change roles/responsibilities while working in a high-paced, challenging work environment\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below including the base pay rate plus the highest available shift differential which applies depending on the shift you select. As a total compensation company, you are eligible for additional earnings including overtime pay and performance bonuses. Final pay will be based on factors including shift selection and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Kirkland - 33.00 - 36.00 USD hourly\u003cbr/\u003eUSA, WA, REDMOND - 33.00 - 36.00 USD hourly","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Manufacturing Technician II , Amazon Leo","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3179234/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of engineering team management experience\u003cbr/\u003e- 6+ years of working directly within engineering teams experience\u003cbr/\u003e- 4+ years of designing or architecting (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience partnering with product or program management teams\u003cbr/\u003e- Excellent software design fundamentals, knowledge of software engineering principles, and a deep understanding of compilers (resource management, instruction scheduling, code generation, and compute graph optimization","business_category":"aws","city":"Toronto","company_name":"Amazon Development Centre Canada ULC","country_code":"CAN","description":"The Product: AWS Machine Learning accelerators are at the forefront of AWS innovation. The Inferentia chip delivers best-in-class ML inference performance at the lowest cost in the cloud. Trainium will deliver the best-in-class ML training performance with the most teraflops (TFLOPS) of compute power for ML in the cloud. This is all enabled by a cutting edge software stack, the AWS Neuron Software Development Kit (SDK), which includes an ML compiler, runtime and natively integrates into popular ML frameworks, such as PyTorch, TensorFlow and MxNet. The Neuron SDK optimizes performance of complex neural net models executed on AWS Inferentia and Trainium. AWS Neuron is used at scale with customers and partners like PyTorch, Epic Games, Snap, AirBnB, Autodesk, Amazon Alexa, Amazon Rekognition and more customers in various other segments.\u003cbr/\u003e\u003cbr/\u003eThe Team: The Amazon Annapurna Labs team is responsible for building innovation in silicon and software for AWS customers. We are at the forefront of innovation by combining cloud scale with the world’s most talented engineers. Our team covers multiple disciplines including silicon engineering, hardware design and verification, software and operations. With such breadth of talent, there's opportunity to learn all of the time. We operate in spaces that are very large, yet our teams remain small and agile. There is no blueprint. We're inventing. We're experimenting. When you couple that with the ability to work on so many different products and services, it's a very unique learning culture.\u003cbr/\u003e\u003cbr/\u003eLearn more about Our History:\u003cbr/\u003ehttps://www.amazon.science/how-silicon-innovation-became-the-secret-sauce-behind-awss-success\u003cbr/\u003e\u003cbr/\u003eYou: As a Manager III on the AWS Neuron team, you'll be leading a team of compiler engineers through  developing, deploying, and scaling a compiler targeting AWS Inferentia and Trainium. You'll need to be technically capable, credible and curious in your own right as a trusted AWS Neuron Manager, innovating on behalf of our customers. You’ll leverage your vision and technical communication skills as a hands-on partner to AWS ML services teams, to be involved in pre-silicon design, bring new products/optimizations/features to market, and many other exciting projects to ensure the Neuron SDK exceeds our customers' needs of high performance, low cost, and ease of use.\u003cbr/\u003e\u003cbr/\u003eYou will have deep knowledge of resource management, scheduling, code generation, optimization, and new instruction architectures including CPU, NPU, GPU and novel forms of compute.\u003cbr/\u003e\u003cbr/\u003eAWS Utility Computing (UC) provides product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for their cloud services. Additionally, this role may involve exposure to and experience with Amazon's growing suite of generative AI services and other cutting-edge cloud computing offerings across the AWS portfolio.\u003cbr/\u003e\u003cbr/\u003eAnnapurna Labs (our organization within AWS UC) designs silicon and software that accelerates innovation. Customers choose us to create cloud solutions that solve challenges that were unimaginable a short time ago—even yesterday. Our custom chips, accelerators, and software stacks enable us to take on technical challenges that have never been seen before, and deliver results that help our customers change the world.\u003cbr/\u003e\u003cbr/\u003eExplore the Product:\u003cbr/\u003ehttps://awsdocs-neuron.readthedocs-hosted.com/en/latest/neuron-guide/neuron-cc/index.html\u003cbr/\u003e\u003cbr/\u003ehttps://github.com/aws/aws-neuron-sdk\u003cbr/\u003e\u003cbr/\u003ehttps://aws.amazon.com/machine-learning/neuron/\u003cbr/\u003e\u003cbr/\u003ehttps://aws.amazon.com/machine-learning/neuron/\u003cbr/\u003e\u003cbr/\u003eIn order to be considered for this role, candidates must be currently located or willing to relocate to Toronto.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe Product: AWS Machine Learning accelerators are at the forefront of AWS innovation. The Inferentia chip delivers best-in-class ML inference performance at the lowest cost in the cloud. Trainium will deliver the best-in-class ML training performance with the most teraflops (TFLOPS) of compute power for ML in the cloud. This is all enabled by a cutting edge software stack, the AWS Neuron Software Development Kit (SDK), which includes an ML compiler, runtime and natively integrates into popular ML frameworks, such as PyTorch, TensorFlow and MxNet. The Neuron SDK optimizes performance of complex neural net models executed on AWS Inferentia and Trainium. AWS Neuron is used at scale with customers and partners like PyTorch, Epic Games, Snap, AirBnB, Autodesk, Amazon Alexa, Amazon Rekognition and more customers in various other segments.\u003cbr/\u003e\u003cbr/\u003eThe Team: The Amazon Annapurna Labs team is responsible for building innovation in silicon and software for AWS customers. We are at the forefront of innovation by combining cloud scale with the world’s most talented engineers. Our team covers multiple disciplines including silicon engineering, hardware design and verification, software and operations. With such breadth of talent, there's opportunity to learn all of the time. We operate in spaces that are very large, yet our teams remain small and agile. There is no blueprint. We're inventing. We're experimenting. When you couple that with the ability to work on so many different products and services, it's a very unique learning culture.\u003cbr/\u003e\u003cbr/\u003eLearn more about Our History:\u003cbr/\u003ehttps://www.amazon.science/how-silicon-innovation-became-the-secret-sauce-behind-awss-success\u003cbr/\u003e\u003cbr/\u003eYou: As a Manager III on the AWS Neuron team, you'll be leading a team of compiler engineers through  developing, deploying, and scaling a compiler targeting AWS Inferentia and Trainium. You'll need to be technically capable, credible and curious in your own right as a trusted AWS Neuron Manager, innovating on behalf of our customers. You’ll leverage your vision and technical communication skills as a hands-on partner to AWS ML services teams, to be involved in pre-silicon design, bring new products/optimizations/features to market, and many other exciting projects to ensure the Neuron SDK exceeds our customers' needs of high performance, low cost, and ease of use.\u003cbr/\u003e\u003cbr/\u003eYou will have deep knowledge of resource management, scheduling, code generation, optimization, and new instruction architectures including CPU, NPU, GPU and novel forms of compute.\u003cbr/\u003e\u003cbr/\u003eExplore the Product:\u003cbr/\u003ehttps://awsdocs-neuron.readthedocs-hosted.com/en/latest/neuron-guide/neuron-cc/index.html\u003cbr/\u003e\u003cbr/\u003ehttps://github.com/aws/aws-neuron-sdk\u003cbr/\u003e\u003cbr/\u003ehttps://aws.amazon.com/machine-learning/neuron/\u003cbr/\u003e\u003cbr/\u003ehttps://aws.amazon.com/machine-learning/neuron/\u003cbr/\u003e\u003cbr/\u003eIn order to be considered for this role, candidates must be currently located or willing to relocate to Toronto.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout the Team\u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge-sharing and mentorship. Our senior members enjoy one-on-one mentoring and thorough, but kind, code reviews. We care about your career growth and strive to assign projects that help our team members develop your engineering expertise so you feel empowered to take on more complex tasks in the future.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e \u003cbr/\u003eAbout AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e","department_cost_center":null,"description_short":"The Product: AWS Machine Learning accelerators are at the forefront of AWS innovation. The Inferentia chip delivers best-in-class ML inference performance at the lowest cost in the cloud. Trainium will","display_distance":null,"id":"baf775c3-5c50-44ba-90a4-29efcb13cc61","id_icims":"3006845","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3006845/software-development-manager-ml-performance-tooling-and-benchmarking-aws-neuron-annapurna-labs","job_schedule_type":"full-time","location":"CA, ON, Toronto","locations":["{\"normalizedStateName\":\"Ontario\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Toronto\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, ON, Toronto\",\"coordinates\":\"43.64869,-79.38544\",\"normalizedCountyName\":\"Toronto\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Toronto, Ontario, CAN\",\"location\":\"CA, ON, Toronto\",\"region\":\"ON\",\"buildingCodeList\":[\"YYZ18\"],\"normalizedCityName\":\"Toronto\"}"],"normalized_location":"Toronto, Ontario, CAN","optional_search_labels":["aws.team-annapurna-labs","aws.team-utility-computing","aws.team-generative-ai"],"posted_date":"June 11, 2025","preferred_qualifications":"- M.S. or Ph.D. in Computer Science or related technical field\u003cbr/\u003e- Experience with toolchains (LLVM, GCC) and code generation techniques for new hardware\u003cbr/\u003e- Knowledge of compiler internals from front end to run-time environment with emphasis on AI acceleration\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(34, 34, 34)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. As a total compensation company, Amazon's package may include other elements such as sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon offers comprehensive benefits including health insurance (medical, dental, vision, prescription, basic life \u0026amp; AD\u0026amp;D insurance), Registered Retirement Savings Plan (RRSP), Deferred Profit Sharing Plan (DPSP), paid time off, and other resources to improve health and well-being. We thank all applicants for their interest, however only those interviewed will be advised as to hiring status.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eCAN, ON, Toronto - 171,400.00 - 286,200.00 CAD annually","primary_search_label":"aws.team-aws-sdm","source_system":"JobCreator","state":"ON","title":"Software Development Manager - ML Performance Tooling and Benchmarking, AWS Neuron, Annapurna Labs ","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3006845/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-aws-sdm","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree, or 5+ years of professional experience\u003cbr/\u003e- Experience owning program strategy, end to end delivery, and communicating results to senior leadership\u003cbr/\u003e- •6+ years of experience in operations, service delivery, technical program management, or enterprise support roles.\u003cbr/\u003e- •Experience with tools such as Command Center , Case console , or Salesforce for ticket management and customer tracking\u003cbr/\u003e- •Demonstrated leadership in managing executive-level escalations and high-impact service events.\u003cbr/\u003e- •Experience leading complex, cross-organizational incidents involving engineering, network, product, legal, and field teams.\u003cbr/\u003e- •Demonstrated ability to influence senior stakeholders using data, narratives, and customer insights.","business_category":"alexa-and-amazon-devices","city":"Bellevue","company_name":"Amazon Kuiper Commercial Services LLC","country_code":"USA","description":"Amazon LEO is Amazon’s low Earth orbit satellite network, built to deliver fast, reliable internet connectivity to customers beyond the reach of traditional networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon LEO supports people and organizations operating in regions without consistent connectivity. You will join a diverse team of technical experts focused on delivering exceptional support experiences for Amazon’s most strategic customers. This role is centered on providing white-glove enterprise support and driving operational excellence across customer engagements within the Amazon LEO ecosystem.\u003cbr/\u003e \u003cbr/\u003eAs a Lead Enterprise Billing and Account Specialist, you will be responsible for owning enterprise network operations at scale and ensuring reliable, secure, and predictable connectivity for enterprise customers. This role serves as the primary escalation point for high-severity and executive-level incidents, leading complex issue resolution by coordinating across network operations, engineering, product, field services, compliance and legal teams. The role owns customer-facing executive communications during outages and major service events, drives structured post-incident reviews, and ensures corrective actions result in durable, systemic improvements. The Lead Enterprise Network Specialist identifies recurring operational and customer risks, defines scalable incident response and readiness mechanisms, and translates customer insights into actionable inputs for product and network improvements. This role sets the bar for operational rigor, mentor’s senior specialists, and partners cross-functionally to deliver a consistently high enterprise customer experience across regions and services.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tLead enterprise billing operations for LEO satellite service customers, managing complex usage-based billing for data throughput, terminal activation's, and service-level agreements\u003cbr/\u003e•\tServe as the primary escalation point for billing disputes related to satellite connectivity charges, overage fees, service credits, and multi-region account reconciliation\u003cbr/\u003e•\tManage end-to-end billing lifecycle for LEO services including ground station usage, bandwidth consumption, terminal hardware billing, and subscription management across global customer deployments\u003cbr/\u003e•\tOwn enterprise LEO operational strategy for a region, segment, or global customer cohort, steady state, incidents, and launches.\u003cbr/\u003e•\tServe as the senior escalation specialist for executive-level customer issues and systemic service events.\u003cbr/\u003e•\tLead complex, multi-customer or multi-region incidents, aligning Network, Engineering, Product, Legal, Compliance, and Field support organizations.\u003cbr/\u003e•\tDefine and enforce enterprise support standards, readiness models, and incident response mechanisms at scale.\u003cbr/\u003e•\tOwn executive customer communications during major outages (LSE’s) , regulatory events, or any service changes.\u003cbr/\u003e•\tProactively identify operational, regulatory, and customer risks related to global connectivity and service expansion; influence roadmap and launch decisions.\u003cbr/\u003e•\tPartner with senior leaders across Sales, Product, Engineering, and Launch teams to enable large-scale enterprise adoption.\u003cbr/\u003e•\tLead cross-functional programs that improve enterprise customer experience, operational efficiency, and service reliability.\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon LEO is Amazon’s low Earth orbit satellite network, built to deliver fast, reliable internet connectivity to customers beyond the reach of traditional networks. From individual households to schools,","display_distance":null,"id":"4e30d033-e511-4235-938f-c8488735f4ee","id_icims":"3175516","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Technical Customer Support","job_function_id":null,"job_path":"/en/jobs/3175516/lead-enterprise-billing-and-account-specialist-kuiper","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA106\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"February  5, 2026","preferred_qualifications":"- •Experience supporting global enterprise customers in connectivity, telecom, satellite, cloud infrastructure, or Internet services.\u003cbr/\u003e- •Experience shaping product or network roadmaps based on operational and customer insights.\u003cbr/\u003e- •Familiarity with regulatory, compliance, and security considerations for global connectivity services.\u003cbr/\u003e- •Strong business acumen, including understanding of contracts, SLAs, and enterprise service obligations.\u003cbr/\u003e- •Experience operating in highly ambiguous, fast-scaling environments or pre and post product launches.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, BELLEVUE - 123,000.00 - 166,300.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Lead Enterprise Billing and Account Specialist , Kuiper","university_job":null,"updated_time":"21 minutes","url_next_step":"https://account.amazon.com/jobs/3175516/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- Knowledge of Excel at an intermediate level (e.g., pivot tables \u0026 charts, multiple criteria lookups, nested logical/IF formulas, data cleansing, array formulas, etc.)\u003cbr/\u003e- Experience managing large data sets and utilizing to drive performance and process improvements","business_category":"transportation-and-logistics","city":"Nashville","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Transportation Services is pioneering new products, services, and technologies within our transportation network. We are building a platform and capability to ensure that our carrier partners are successful and our customer’s freight, no matter how large or small, is delivered as quickly, accurately, and cost effectively as possible. To meet this goal, we are continually striving to innovate and provide best in class service levels.\u003cbr/\u003e  \u003cbr/\u003eMiddle Mile Partner Manager team is seeking a Carrier Execution Specialist to help develop a world class logistics process that delivers goods on time at the best cost. The person in this role will work on high-level strategy and design, as well as implementation. This job will require problem solving, basic mathematics, communication, and customer service skills. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tCollaborate on the development and delivery of key programs, metrics, reports, analyses, and dashboards to drive key business decisions across customer-facing programs.\u003cbr/\u003e•\tIdentify, coach, and track Middle Mile carrier performance for Amazon’s Transportation Services (ATS) network carrier base.\u003cbr/\u003e•\tPartner with teams to identify and drive process improvements that improve carrier performance, on time, acceptance, and other key KPIs.\u003cbr/\u003e•\tPull data from numerous databases (using Excel, Access, SQL and/or other data management systems).\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Transportation Services is pioneering new products, services, and technologies within our transportation network. We are building a platform and capability to ensure that our carrier partners are","display_distance":null,"id":"162b04b7-6ca9-44f4-a3ed-dd8e9b0c93e2","id_icims":"3151292","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3151292/carrier-execution-specialist-middle-mile-partner-management-mmpm","job_schedule_type":"full-time","location":"US, TN, Nashville","locations":["{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Nashville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Nashville\",\"coordinates\":\"36.16792,-86.77798\",\"normalizedCountyName\":\"Davidson\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Nashville, Tennessee, USA\",\"location\":\"US, TN, Nashville\",\"region\":\"TN\",\"buildingCodeList\":[\"BNA12\"],\"normalizedCityName\":\"Nashville\"}"],"normalized_location":"Nashville, Tennessee, USA","optional_search_labels":["hourly"],"posted_date":"January  2, 2026","preferred_qualifications":"- 1+ years of program management, logistics, operations, supply chain, transportation, or equivalent experience\u003cbr/\u003e- 1+ years of management experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Experience with SQL\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TN, Nashville - 22.00 - 29.00 USD hourly","primary_search_label":"transportation-and-logistics.team-na-operations","source_system":"JobCreator","state":"TN","title":"Carrier Execution Specialist, Middle Mile Partner Management (MMPM)","university_job":null,"updated_time":"24 minutes","url_next_step":"https://account.amazon.com/jobs/3151292/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-na-operations","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of building machine learning models for business application experience\u003cbr/\u003e- PhD, or Master's degree and 6+ years of applied research experience\u003cbr/\u003e- Experience programming in Java, C++, Python or related language\u003cbr/\u003e- Experience with neural deep learning methods and machine learning","business_category":"aws","city":"Santa Clara","company_name":"Amazon Development Center U.S., Inc. - B02","country_code":"USA","description":"We are looking for passionate, talented, and inventive Applied Scientists with a strong machine learning background to help build industry-leading Conversational AI Systems. Our mission is to provide a delightful experience to Amazon’s customers by pushing the envelope in Natural Language Understanding (NLU), Dialog Systems including Generative AI with Large Language Models (LLMs) and Applied Machine Learning (ML).\u003cbr/\u003e\u003cbr/\u003eAs part of our Science team in AWS Console, you will work alongside internationally recognized experts to develop novel algorithms and modeling techniques to advance the state-of-the-art in human language technology. Your work will directly impact millions of our customers in the form of products and services that make use language technology. You will gain hands on experience with Amazon’s heterogeneous text, structured data sources, and large-scale computing resources to accelerate advances in language understanding.\u003cbr/\u003e\u003cbr/\u003eWe are hiring in all areas of human language technology: NLU, Dialog Management, Conversational AI, LLMs and Generative AI.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout the team\u003cbr/\u003eUtility Computing (UC)\u003cbr/\u003eAWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (IoT), Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for their cloud services.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003e AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003e Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003e We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.","department_cost_center":null,"description_short":"We are looking for passionate, talented, and inventive Applied Scientists with a strong machine learning background to help build industry-leading Conversational AI Systems. Our mission is to provide a","display_distance":null,"id":"d865251b-b4cf-44c6-bb9d-105a7f2cfa7c","id_icims":"3177929","is_intern":null,"is_manager":null,"job_category":"Research Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3177929/applied-scientist-console-science","job_schedule_type":"full-time","location":"US, CA, Santa Clara","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Santa Clara\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Santa Clara\",\"coordinates\":\"37.3558,-121.95512\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Santa Clara, California, USA\",\"location\":\"US, CA, Santa Clara\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC25\"],\"normalizedCityName\":\"Santa Clara\"}"],"normalized_location":"Santa Clara, California, USA","optional_search_labels":[],"posted_date":"February 10, 2026","preferred_qualifications":"- Experience with modeling tools such as R, scikit-learn, Spark MLLib, MxNet, Tensorflow, numpy, scipy etc.\u003cbr/\u003e- Experience with large scale distributed systems such as Hadoop, Spark etc.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Santa Clara - 192,200.00 - 260,000.00 USD annually","primary_search_label":"aws.team-data-science-primary","source_system":"JobCreator","state":"CA","title":"Applied Scientist, Console Science","university_job":null,"updated_time":"27 minutes","url_next_step":"https://account.amazon.com/jobs/3177929/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-data-science-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"ats","city":"Gurugram","company_name":"ADCI - Haryana","country_code":"IND","description":"If you are looking for an opportunity to solve deep technical problems and build innovative solutions in a fast paced environment working with smart, passionate software developers, this might be the role for you. \u003cbr/\u003e\u003cbr/\u003eWithin the Transportation Technology and Services organization, Relay Central delivers a seamless, intelligent, and trusted foundation that empowers and enables Amazon’s middle mile carriers to thrive in a fast-moving, complex environment. We believe that great products and features should be an enabler and let carriers focus on what matters most – safety, reliability, and performance on the road while delivering for Amazon to grow their business. By unifying essential capabilities into one cohesive team and experience for carriers, we reduce friction, streamline decisions, and enable carriers to operate with confidence. Our vision is to be the backbone of Amazon Relay, built on thoughtful design, deep system integrations, and continuous innovation. We aim to simplify the complexity, surface the right insights at the right time, and scale the evolving needs of the network. Ultimately, Relay Central aspires to be the trust control tower for our carriers that unlock carrier potential to help shape the future of transportation. \u003cbr/\u003e\u003cbr/\u003eRelay Central creates a unified offering for carriers that enables smooth onboarding, effective trip management, and an exciting loyalty program experience, while upholding the highest standards for safety, compliance, trust, and delivery quality.\u003cbr/\u003e\u003cbr/\u003eOur team is actively seeking motivated and multi-talented individuals who are passionate about (re)inventing and transforming the transportation and logistics operations. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eYou’ll design and develop software used worldwide by our transportation partners and will regularly interact with engineering and business leadership. You will participate in the planning and execution of technology projects and operational excellence initiatives. You’ll also mentor junior engineers in employing strong design and implementation practices.\u003cbr/\u003eTo accomplish this, you will be expected to have an established background in building scalable software systems, great communication skills, and a motivation to achieve results in a fast paced environment. You should be somebody who enjoys working on complex software, is customer-centric, and feels strongly about building good software as well as making that software achieve its operational goals. Experience with building and operating the web services backing mobile applications, especially at massive scale, will be very applicable and helpful.\u003cbr/\u003eCome and see for yourself why we are one of the most admired companies in the US, rated #1 in Innovation and # 1 in Customer Service, and be part of our tradition of working hard, having fun and making history!","department_cost_center":null,"description_short":"If you are looking for an opportunity to solve deep technical problems and build innovative solutions in a fast paced environment working with smart, passionate software developers, this might be the role","display_distance":null,"id":"3ac3e0b8-cad6-4fa9-8c51-24602e98cfe0","id_icims":"3182157","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3182157/sde-ii-relay-central","job_schedule_type":"full-time","location":"IN, HR, Gurugram","locations":["{\"normalizedStateName\":\"Haryana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Gurugram\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, HR, Gurugram\",\"coordinates\":\"28.47716,77.06847\",\"normalizedCountyName\":\"Gurugram\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Gurugram, Haryana, IND\",\"location\":\"IN, HR, Gurugram\",\"region\":\"HR\",\"buildingCodeList\":[\"DEL24\"],\"normalizedCityName\":\"Gurugram\"}"],"normalized_location":"Gurugram, Haryana, IND","optional_search_labels":[],"posted_date":"February 16, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"ats.team-middle-mile-tech","source_system":"JobCreator","state":"HR","title":"SDE II, Relay Central","university_job":null,"updated_time":"27 minutes","url_next_step":"https://account.amazon.com/jobs/3182157/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-middle-mile-tech","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"ats","city":"Gurugram","company_name":"ADCI - Haryana","country_code":"IND","description":"If you are looking for an opportunity to solve deep technical problems and build innovative solutions in a fast paced environment working with smart, passionate software developers, this might be the role for you. \u003cbr/\u003e\u003cbr/\u003eWithin the Transportation Technology and Services organization, Relay Central delivers a seamless, intelligent, and trusted foundation that empowers and enables Amazon’s middle mile carriers to thrive in a fast-moving, complex environment. We believe that great products and features should be an enabler and let carriers focus on what matters most – safety, reliability, and performance on the road while delivering for Amazon to grow their business. By unifying essential capabilities into one cohesive team and experience for carriers, we reduce friction, streamline decisions, and enable carriers to operate with confidence. Our vision is to be the backbone of Amazon Relay, built on thoughtful design, deep system integrations, and continuous innovation. We aim to simplify the complexity, surface the right insights at the right time, and scale the evolving needs of the network. Ultimately, Relay Central aspires to be the trust control tower for our carriers that unlock carrier potential to help shape the future of transportation. \u003cbr/\u003e\u003cbr/\u003eRelay Central creates a unified offering for carriers that enables smooth onboarding, effective trip management, and an exciting loyalty program experience, while upholding the highest standards for safety, compliance, trust, and delivery quality.\u003cbr/\u003e\u003cbr/\u003eOur team is actively seeking motivated and multi-talented individuals who are passionate about (re)inventing and transforming the transportation and logistics operations. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eYou’ll design and develop software used worldwide by our transportation partners and will regularly interact with engineering and business leadership. You will participate in the planning and execution of technology projects and operational excellence initiatives. You’ll also mentor junior engineers in employing strong design and implementation practices.\u003cbr/\u003eTo accomplish this, you will be expected to have an established background in building scalable software systems, great communication skills, and a motivation to achieve results in a fast paced environment. You should be somebody who enjoys working on complex software, is customer-centric, and feels strongly about building good software as well as making that software achieve its operational goals. Experience with building and operating the web services backing mobile applications, especially at massive scale, will be very applicable and helpful.\u003cbr/\u003eCome and see for yourself why we are one of the most admired companies in the US, rated #1 in Innovation and # 1 in Customer Service, and be part of our tradition of working hard, having fun and making history!","department_cost_center":null,"description_short":"If you are looking for an opportunity to solve deep technical problems and build innovative solutions in a fast paced environment working with smart, passionate software developers, this might be the role","display_distance":null,"id":"638d4d51-7ef9-4e97-b40b-1e7000aac0ba","id_icims":"3182159","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3182159/sde-ii-relay-central","job_schedule_type":"full-time","location":"IN, HR, Gurugram","locations":["{\"normalizedStateName\":\"Haryana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Gurugram\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, HR, Gurugram\",\"coordinates\":\"28.47716,77.06847\",\"normalizedCountyName\":\"Gurugram\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Gurugram, Haryana, IND\",\"location\":\"IN, HR, Gurugram\",\"region\":\"HR\",\"buildingCodeList\":[\"DEL24\"],\"normalizedCityName\":\"Gurugram\"}"],"normalized_location":"Gurugram, Haryana, IND","optional_search_labels":[],"posted_date":"February 16, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"ats.team-middle-mile-tech","source_system":"JobCreator","state":"HR","title":"SDE II, Relay Central","university_job":null,"updated_time":"28 minutes","url_next_step":"https://account.amazon.com/jobs/3182159/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-middle-mile-tech","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}