{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 3+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Coppell","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Job summary\u003cbr/\u003eOur WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Operations Manager. In this role, you will lead and develop a team of salaried and hourly talent. You will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. To achieve this, managers are expected to provide their team with the tools needed for success while driving improvements in productivity and efficiency through data-driven decisions and analytical problem-solving. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e   \u003cbr/\u003e  Our Operation’s workflow has three major components:  First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer.\u003cbr/\u003e \u003cbr/\u003e Key Responsibilities and Job Elements:\u003cbr/\u003e - Support, mentor, and motivate your salaried and hourly workforce\u003cbr/\u003e - Lead large-scope projects with site and regional impact\u003cbr/\u003e - Build and execute productivity plans through forecast reviews, determining productivity requirements, and partnering with other Leaders to load balance \u003cbr/\u003e - Manage safety, quality, productivity, and customer delivery promises \u003cbr/\u003e - Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e - Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e - Stand/walk for up to 12 hours during shifts \u003cbr/\u003e - Work in an environment where the noise level varies and can be loud\u003cbr/\u003e - Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e - Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e   Our fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Operations Managers based on location preference and the business’ current openings.  ","department_cost_center":null,"description_short":"Job summaryOur WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Operations","display_distance":null,"id":"9cd679c8-b39f-4eed-ae51-9f127b7626a1","id_icims":"3188686","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3188686/operations-manager","job_schedule_type":"full-time","location":"US, TX, Coppell","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Coppell\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Coppell\",\"coordinates\":\"32.97656,-96.99131\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Coppell, Texas, USA\",\"location\":\"US, TX, Coppell\",\"region\":\"TX\",\"buildingCodeList\":[\"FTW7\"],\"normalizedCityName\":\"Coppell\"}"],"normalized_location":"Coppell, Texas, USA","optional_search_labels":[],"posted_date":"February 24, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 2+ salaried employees and 70+ indirect employees\u003cbr/\u003e- Experience scoping, leading, and implementing process improvements through: Lean process, Kaizen, and/or Six Sigma.\u003cbr/\u003e- Demonstrated problem solving skills and analytical skills\u003cbr/\u003e- Excellent customer service skills, communication skills and interpersonal skills\u003cbr/\u003e- Track record of meeting or exceeding department performance goals\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Experience in: military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production, or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Coppell - 91,000.00 - 136,500.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"TX","title":"Operations Manager","university_job":null,"updated_time":"3 minutes","url_next_step":"https://account.amazon.com/jobs/3188686/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor’s degree in Computer Science, related field, or equivalent work experience.\u003cbr/\u003e- Experience (non-internship) in professional software development.\u003cbr/\u003e- Extensive experience in designing or architecting (design patterns, reliability and scaling) of new and existing systems.\u003cbr/\u003e- Programming experience with at least one software programming language- Java, Python, or TypeScript.\u003cbr/\u003e- Experience as a tech lead OR leading an engineering team.\u003cbr/\u003e- This role requires you to be a national of an EU member state.","business_category":"amazon-security","city":"Courbevoie","company_name":"Amazon Data Services France SAS","country_code":"FRA","description":"Amazon Security customers demand the highest quality and reliability for their services. We continuously strive to simplify and scale security operations while resolving complex issues. We are looking for highly motivated Software Developers to help build and scale security incident response platforms and tooling across the largest cloud provider in the world.\u003cbr/\u003e\u003cbr/\u003eAmazon Security OpRes is a team of Security Engineers and Software Development Engineers dedicated to enhancing security incident response through automation and innovation. Our mission involves optimizing existing processes while pioneering new solutions. We maintain and improve production services, developing advanced capabilities to streamline incident response workflows. Simultaneously, we undertake long-term innovation projects, working backwards from customer needs, analyzing data, and prototyping disruptive solutions with leadership oversight.\u003cbr/\u003e\u003cbr/\u003eLeveraging modern technologies and Amazon's robust services, we empower our security response teams with productivity-boosting tools. At a massive scale, we build innovative platforms that fortify Amazon's security. Through continuous improvement and customer-centric innovation, we redefine the boundaries of security automation, ensuring a resilient and secure future for all.\u003cbr/\u003e\u003cbr/\u003eYou are a Senior Software Engineer who thrives on delivering innovative solutions that solve complex business problems and delight customers with efficiency and productivity gains. Your passion lies in building scalable, high-quality software that drives real impact. As a senior member of our team, you will not only craft robust, efficient, and user-friendly applications but also mentor junior developers and lead technical projects. While experience in security is a plus, it's not required. What truly matters is your ability to design and implement sophisticated systems, leveraging your strong background in modern software development practices, technologies such as AWS services, Python, TypeScript, and data engineering tools. Join our team and contribute to platforms that fortify Amazon's security posture and safeguard our customers' environments, while guiding and inspiring the next generation of developers.\u003cbr/\u003e\u003cbr/\u003eLocation is Paris, France.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003e\u003cbr/\u003eAmazon Security values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy Amazon Security?\u003cbr/\u003e\u003cbr/\u003eAt Amazon, security is central to maintaining customer trust and delivering delightful customer experiences. Our organization is responsible for creating and maintaining a high bar for security across all of Amazon’s products and services. We offer talented security professionals the chance to accelerate their careers with opportunities to build experience in a wide variety of areas including cloud, devices, retail, entertainment, healthcare, operations, and physical stores.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003e\u003cbr/\u003eIn Amazon Security, it’s in our nature to learn and be curious. Ongoing DEI events and learning experiences inspire us to continue learning and to embrace our uniqueness. Addressing the toughest security challenges requires that we seek out and celebrate a diversity of ideas, perspectives, and voices.\u003cbr/\u003e\u003cbr/\u003eTraining \u0026 Career Growth\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, training, and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Security customers demand the highest quality and reliability for their services. We continuously strive to simplify and scale security operations while resolving complex issues. We are looking","display_distance":null,"id":"b0733656-7161-46d7-98e1-7217d5587fdf","id_icims":"3106073","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3106073/senior-software-development-engineer-security-automation-aws-security-opres","job_schedule_type":"full-time","location":"FR, Courbevoie","locations":["{\"normalizedStateName\":\"Ile-de-France\",\"normalizedCountryCode\":\"FRA\",\"city\":\"Courbevoie\",\"countryIso3a\":\"FRA\",\"countryIso2a\":\"FR\",\"locationNonStemming\":\"France, Courbevoie\",\"coordinates\":\"48.89617,2.25648\",\"normalizedCountyName\":\"Hauts-de-Seine\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"France\",\"normalizedLocation\":\"Courbevoie, Ile-de-France, FRA\",\"location\":\"FR, Courbevoie\",\"region\":\"\",\"buildingCodeList\":[\"CDG11\"],\"normalizedCityName\":\"Courbevoie\"}"],"normalized_location":"Courbevoie, Ile-de-France, FRA","optional_search_labels":["aws.team-security-optional","aws.team-eu-sovereign-cloud"],"posted_date":"October 10, 2025","preferred_qualifications":"- Experience with full software development life cycle, including coding standards, code reviews, source control management, build\u003cbr/\u003e- Experience in prototyping quickly new systems and solutions\u003cbr/\u003e- Experience developing using SQL and NoSQL databases.\u003cbr/\u003e- Experience in Cloud Technologies.\u003cbr/\u003e\u003cbr/\u003eAmazon est un employeur engagé pour l'égalité des chances. Nous sommes convaincus qu'une main d'oeuvre diversifée est essentielle à notre réussite. Nous prenons nos décisions de recrutement en fonction de votre expérience et de vos compétences. Nous apprécions votre envie de découvrir, d'inventer, de simplifier et de construire. La protection de votre vie privée et la sécurité de vos données constituent depuis longtemps une priorité absolue pour Amazon. Veuillez consulter notre Politique de Confidentialité pour en savoir plus sur la façon dont nous collectons, utilisons et traitons les données personnelles de nos candidats.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-security.team-aws-security","source_system":"JobCreator","state":null,"title":"Senior Software Development Engineer - Security Automation, AWS Security OpRes ","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3106073/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-aws-security","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent\u003cbr/\u003e- A minimum of 1 year in an Environmental Health \u0026 Safety (EHS) related field OR; A Bachelor’s degree in EHS-relevant background OR; 6 months experience performing in a safety-related role within Amazon\u003cbr/\u003e- Knowledge of OSHA regulations specifically 29 CFR 1910\u003cbr/\u003e- Experience using Microsoft Word and Excel in a professional capacity\u003cbr/\u003e- Experience maintaining confidentiality in matter involving security and/or personnel issues in the workplace","business_category":"fulfillment-and-operations","city":"Tallahassee","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. As a Workplace Health \u0026 Safety Specialist (WHSS), you'll be at the forefront of transforming workplace safety culture at one of the world's most innovative companies. Your expertise and dedication will directly protect employees, ensuring they return home safely to their families every day. You'll facilitate new approaches to safety, combining technology with human-centered solutions to create an environment where safety and productivity thrive together. This isn't just about maintaining safety standards – it's about revolutionizing how we think about and implement workplace safety, making a lasting impact on our people and operations. As your building's designated safety champion, you'll have the unique opportunity to build relationships, influence positive change, and help write the next chapter in Amazon's commitment to becoming Earth's Safest Place to Work.\u003cbr/\u003e\u003cbr/\u003eCore Impact Areas:\u003cbr/\u003eSafety Program Excellence \u0026 Implementation - Drive comprehensive safety programs through data-driven strategies. Lead daily safety audits, incident investigations, and risk assessments while implementing innovative solutions to prevent injuries. Deliver engaging safety training that resonates with associates and promotes a proactive safety culture. Champion continuous improvement initiatives that enhance workplace safety while maintaining operational efficiency.\u003cbr/\u003e\u003cbr/\u003eAssociate Advocacy \u0026 Cultural Leadership -  Serve as a trusted safety advisor and advocate for associate wellbeing, building strong partnerships across all levels of the organization. Foster a culture where safety is everyone's priority through effective communication, coaching, and positive reinforcement. Develop strong relationships with frontline associates and leadership to drive behavioral changes and ensure safety best practices become natural habits. Transform safety data into compelling narratives that influence positive change and drive engagement in safety initiatives.\u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements include: \u003cbr/\u003e- Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Stand/walk for up to 12 hours during shifts\u003cbr/\u003e- Work in an environment where the noise level varies \u003cbr/\u003e- Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e- Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e- Maintain effective care delivery in emergencies and assist emergency response at the site\u003cbr/\u003e\u003cbr/\u003eMust be available to work flexible shifts including days, nights and/or weekends. \u003cbr/\u003e\u003cbr/\u003eFor those that do not have an adult First Aid, CPR, AED certification from the American Heart Association or American Red Cross, must obtain within 3 weeks of start date.","department_cost_center":null,"description_short":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. As a Workplace","display_distance":null,"id":"040acba1-5c0f-43e5-af39-8447fa988869","id_icims":"3169771","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3169771/ehs-specialist","job_schedule_type":"full-time","location":"US, FL, Tallahassee","locations":["{\"normalizedStateName\":\"Florida\",\"normalizedCountryCode\":\"USA\",\"city\":\"Tallahassee\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, FL, Tallahassee\",\"coordinates\":\"30.43978,-84.28065\",\"normalizedCountyName\":\"Leon\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Tallahassee, Florida, USA\",\"location\":\"US, FL, Tallahassee\",\"region\":\"FL\",\"buildingCodeList\":[\"TLH2\"],\"normalizedCityName\":\"Tallahassee\"}"],"normalized_location":"Tallahassee, Florida, USA","optional_search_labels":[],"posted_date":"January 29, 2026","preferred_qualifications":"- Bachelor’s degree or higher, preferably in a safety related field\u003cbr/\u003e- Strong communication, teamwork, analysis, judgment, and customer focus skills\u003cbr/\u003e- Experience leading and managing a team, ability to analyze accident data, new processes, and machinery for potential safety concerns, and conduct job hazard and job safety analyses\u003cbr/\u003e- Experience in emergency response and currently holds First Aid and CPR certificates\u003cbr/\u003e- Experience in workers compensation case management\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, FL, Tallahassee - 27.00 - 33.00 USD hourly","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"FL","title":"EHS Specialist ","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3169771/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Coppell","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager. In this role, you will lead a team of hourly workforce and will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e\u003cbr/\u003eOur Operation’s workflow has three major components: First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Support, mentor, and motivate your hourly workforce\u003cbr/\u003e* Manage safety, quality, productivity, and customer delivery promises\u003cbr/\u003e* Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e* Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e* Stand/walk for up to 12 hours during shifts\u003cbr/\u003e* Work in an environment where the noise level varies and can be loud\u003cbr/\u003e* Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e* Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e\u003cbr/\u003eOur fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Area Managers based on location preference and the business’ current openings.","department_cost_center":null,"description_short":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager.","display_distance":null,"id":"8df3cd8a-0347-4230-ae75-d835d83cf64e","id_icims":"3188167","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3188167/area-manager-ii","job_schedule_type":"full-time","location":"US, TX, Coppell","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Coppell\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Coppell\",\"coordinates\":\"32.97656,-96.99131\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Coppell, Texas, USA\",\"location\":\"US, TX, Coppell\",\"region\":\"TX\",\"buildingCodeList\":[\"FTW7\"],\"normalizedCityName\":\"Coppell\"}"],"normalized_location":"Coppell, Texas, USA","optional_search_labels":[],"posted_date":"February 24, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 20+ employees\u003cbr/\u003e- Experience with process improvements (Lean process, Kaizen, and/or Six Sigma)\u003cbr/\u003e- Excellent customer service, communication, and interpersonal skills\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Industry experience in: retail, F\u0026B, military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Coppell - 70,000.00 - 90,900.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"TX","title":"Area Manager II ","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3188167/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience with behavioral data collection, quantitative data analysis, and statistics\u003cbr/\u003e- Experience in leading User Research projects with demonstrated impact\u003cbr/\u003e- Bachelor's degree in HCDE, Human Factors, Cognitive Psychology, or a related field\u003cbr/\u003e- 5+ years of proven success leading User Research projects with demonstrated impact experience\u003cbr/\u003e- 7+ years of hands-on work with: field research, ethnography, lab-based user testing, remote testing, paper prototype testing, iterative prototype testing, concept testing, and survey design experience\u003cbr/\u003e- Experience with all aspects of research (study design, recruiting, moderation, analysis, reporting)\u003cbr/\u003e- Experience with behavioral data collection, quantitative data analysis, and statistics\u003cbr/\u003e- Have a portfolio demonstrating past work experience and deliverables (e.g., study plans, reports, personas)","business_category":"advertising","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The Sponsored Products and Brands team at Amazon Ads is transforming how millions of customers discover and shop for products through innovative AI technologies. We're reimagining the shopping experience by developing intelligent solutions that help customers find relevant products while enabling brands to connect meaningfully with their audience. Our research-driven approach combines customer behavior analysis, shopping patterns, and advanced AI to create more intuitive and personalized advertising experiences. We're committed to understanding shopper needs and preferences, ensuring our AI technologies enhance the customer journey while delivering value to advertisers. Join us in building shopping experiences that put customers first while advancing the future of digital advertising.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Lead complex, high-impact quantitative research initiatives globally, establishing large-scale programs that track longitudinal trends, customer sentiment, and behavioral patterns across US, EU, and emerging markets.\u003cbr/\u003e* Design and execute sophisticated quantitative studies using advanced statistical methods, and experimental design to evaluate new features, measure their impact, then develop metrics that improve shopper experience.\u003cbr/\u003e*  Drive research innovation by integrating AI technologies throughout the research process, leveraging automation to optimize research workflows and accelerate insight generation.\u003cbr/\u003e* Partner with AI/ML teams to translate data-driven insights into model improvements, using statistical validation, and qualitative anecdotes to optimize performance across Product, Engineering, and Business initiatives.\u003cbr/\u003e*  Lead the socialization of quantitative insights, supplemented by targeted qualitative research when needed, presenting data-driven findings to senior leadership and serve as a subject matter expert in UX research methodologies.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Senior UX Researcher on our Sponsored Products team, you'll spend your days transforming large-scale survey data into actionable insights that shape how millions of shoppers discover and engage with ads. \u003cbr/\u003eA typical day might involve analyzing responses from thousands of global customers, designing multi-market perception studies, or launching studies to measure the impact of new ad experiences. You'll regularly collaborate with data scientists and engineers, helping translate customer sentiment and preference data into model improvements. When not deep in statistical analysis, you'll be presenting your findings to product leaders, turning complex metrics into compelling stories that drive product strategy.\u003cbr/\u003eWhile your foundation is in quantitative research methods, you know when to supplement with targeted qualitative research to add context to your findings. If you're energized by solving complex problems with data, passionate about the intersection of AI and user research, and want to directly impact how millions of customers interact with Amazon's ads, we want you on our team. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Sponsored Products Marketplace Intelligence team within Sponsored Products and Brands is responsible for ranking, placing and pricing billions of ads per day. We seek a Senior UX Researcher to lead initiatives focused on improving the shopper experience through innovations ranging from training AI models, influencing ML modeling to designing new interactive discovery experiences. In this role, you'll have an opportunity to deliver outsized business impact and delight hundreds of missions of customers. ","department_cost_center":null,"description_short":"The Sponsored Products and Brands team at Amazon Ads is transforming how millions of customers discover and shop for products through innovative AI technologies. We're reimagining the shopping experience","display_distance":null,"id":"6ac0b965-fcde-4dec-b706-6586d9ea69ac","id_icims":"3184140","is_intern":null,"is_manager":null,"job_category":"Design","job_family":"Design","job_function_id":null,"job_path":"/en/jobs/3184140/senior-ux-researcher-sponsored-products-market-intelligence","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA40\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February 18, 2026","preferred_qualifications":"- Master's degree in Human Factors, HCDE, Cognitive Psychology or equivalent\u003cbr/\u003e- Experience in a technical field (software development, network development, IT, other related)\u003cbr/\u003e- Experience with UX Research in non-US markets\u003cbr/\u003e- Experience working in a highly Agile/Scrum environment\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 152,200.00 - 205,900.00 USD annually","primary_search_label":"advertising.team-amazon-ads","source_system":"JobCreator","state":"WA","title":"Senior UX Researcher, Sponsored Products Market Intelligence","university_job":null,"updated_time":"25 minutes","url_next_step":"https://account.amazon.com/jobs/3184140/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-ads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of technical infrastructure management experience\u003cbr/\u003e- Knowledge of best practices and emerging technologies, related to infrastructure (i.e. network, data center, hardware, software)\u003cbr/\u003e- Experience with varying scenarios of infrastructure builds\u003cbr/\u003e- 5+ years of project management (including scope, schedule, budget, quality, risk and critical path management) experience","business_category":"aws","city":"Herndon","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eWe’re seeking an experienced Infrastructure Technical Program Manager in Herndon VA to oversee data center build projects in the Northern Virginia region. You will lead cross-functional and technical teams from conceptual design feasibility through requirements, budget, completed design, implementation, testing, and deployment. Along the way, you will use your judgment, negotiation skills, ability to influence without authority, analytical talent, technical aptitude, and leadership to collaborate with a diverse set of stakeholders across multiple time zones, manage capital budgets, eliminate non-value-add activity, design solutions, remove blockers, and find creative ways to accelerate project delivery.\u003cbr/\u003e\u003cbr/\u003eThe candidate must be comfortable managing remote project delivery teams, and possess the ability to facilitate technical whiteboard sessions to troubleshoot project implementation issues, and remove barriers to project success. Being able to stand up cross-functional teams, establish trust with a variety of stakeholders across multiple time zones, manage capital budgets, eliminate non-value-add activity, design solutions, remove blockers, and find creative ways to accelerate project delivery is a must.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will be an exceptionally strong communicator, both written and verbally, and possess  experience in tactical project management of highly technical initiatives, as well as strategic program management. They will be able to apply a variety of project management tools, methodologies and techniques for all phases of the project lifecycle and exhibit demonstrated experience in core project management disciplines including scope, schedule, budget, resources, quality and risk management, reporting and metric development/tracking. Experience with MS Project, Asana, Tableau, and systems integration a plus.\u003cbr/\u003e\u003cbr/\u003eThe candidate will work through ambiguity, competing priorities, and be capable of understanding mechanical/electrical engineering concepts. Experience in managing data center infrastructure deployments is a plus. Candidates possessing a background in architecture/design, mechanical/electrical engineering, software/hardware engineering, data center infrastructure/operations, and/or construction, who have transitioned to a program management discipline will have a distinct advantage.\u003cbr/\u003e\u003cbr/\u003eIf you enjoy the challenges of deploying highly technical and innovative projects at massive scale, this job is for you! \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003e ","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"9b316256-5d90-4d03-be8e-a0e0e8660d62","id_icims":"3189143","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Tech Infrastructure Prgrm Mgmt","job_function_id":null,"job_path":"/en/jobs/3189143/infrastructure-tpm-infra-capacity-delivery-infra-capacity-delivery-infra-capacity-delivery","job_schedule_type":"full-time","location":"US, VA, Herndon","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD31\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Herndon, Virginia, USA","optional_search_labels":[],"posted_date":"February 25, 2026","preferred_qualifications":"- Master’s Degree or advanced professional certifications in management of complex, high value technology infrastructure projects\u003cbr/\u003e- Experience with data center builds\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Herndon - 127,100.00 - 171,900.00 USD annually","primary_search_label":"aws.team-program-management-primary","source_system":"JobCreator","state":"VA","title":"Infrastructure TPM, Infra Capacity Delivery, Infra Capacity Delivery, Infra Capacity Delivery","university_job":null,"updated_time":"26 minutes","url_next_step":"https://account.amazon.com/jobs/3189143/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-program-management-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- An Associate’s Degree or related work experience\u003cbr/\u003e- CEFR C1+ or equivalent fluency in Italian language\u003cbr/\u003e- Written and spoken knowledge of English is essential (CEFR B2+)\u003cbr/\u003e- Strong business writing skills with ability to create reports, proposals, and professional correspondence\u003cbr/\u003e- Advanced reading comprehension with ability to analyze complex business documents\u003cbr/\u003e- Developed analytical thinking and structured problem-solving capabilities\u003cbr/\u003e- Strong ability to interpret and implement detailed instructions across various projects\u003cbr/\u003e- Proficient research skills with experience gathering and synthesizing information from multiple sources\u003cbr/\u003e- Proven attention to detail in managing complex tasks and documents","business_category":"amazon-artificial-general-intelligence","city":"Gdansk","company_name":"Amazon MLS Poland Sp. z o.o. - K69","country_code":"POL","description":"AI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment of large language models (LLMs) across all of our businesses. Come build the future of human-technology interaction with us.\u003cbr/\u003e\u003cbr/\u003eWe are looking for those candidates who just don’t think out of the box, but make the box they are in ‘Bigger’. The future is now, do you want to be a part of it? Then read on!\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Maintain and follow strict confidentiality as customer privacy is our most important tenet\u003cbr/\u003e- Work with a range of different types of data including, but not limited to: text, speech, audio, image, and video\u003cbr/\u003e- Deliver high-quality labelled data, using guidelines provided to meet our KPIs and using in-house tools and software, as part of Amazon's commitment to developing and deploying AI responsibly.\u003cbr/\u003e- Demonstrate proficiency in generating high quality human insight data across a range of modalities, inclusive of text, image video and audio.\u003cbr/\u003e- Capable of making sound judgments and logical decisions when faced with ambiguous or incomplete information while performing tasks.\u003cbr/\u003e- Eye for detail and ability to pivot from one category of requirement to another instantaneously.\u003cbr/\u003e- Demonstrate support on daily operational deliverables for multiple task types assigned to you and the team\u003cbr/\u003e- Analyze root causes, identify error patterns, and propose solutions to enhance the quality of labeling tasks and their outputs.\u003cbr/\u003e- Responsible for identifying day-to-day process and operational issues in Standard Operating Procedure, tools and suggest changes to unblock operations\u003cbr/\u003e- Demonstrate ownership in floor support to clarify internal queries during execution on need basis\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are looking for a ML Data Associate (MLDA) to undertake the task of foundational labeling functions, such as dialogue evaluation on speech, text, audio, video data.\u003cbr/\u003e\u003cbr/\u003eYour ability to concentrate, multi-task and your high attention to detail helps you deliver high-quality work as well as maintaining strict confidentiality and follow all applicable Amazon policies for securing confidential information. You will be a part of a diverse team with the shared vision of improving customers’ lives with practical, useful generative AI innovations. An inner drive, individuality, and a creative mind are extremely beneficial.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe team works strictly in the office Monday through Friday. We are constantly looking for ways to improve our capabilities and deliver the best product possible. Diverse team, regular meetings, trainings, and Amazon events throughout the year await you.\u003cbr/\u003e\u003cbr/\u003eThe minimum base pay salary for this position is listed below. As a total compensation company, Amazon's package may include further pay components such as performance bonuses, where applicable. Your recruiting team will share final base pay and any applicable total compensation elements depending on skills and requirements.Company discretionary, supplementary benefits apply subject to further terms, including pension plans, health insurance, life and disability insurance, business travel insurance, MultiSport card, discounts for meals at the company’s canteen, employee discount code and program (EDC/Extras), and the Employee Assistance Program (private and confidential counselling and referral service to support health and well-being).\u003cbr/\u003eThe minimum base pay for this position is PLN 7,916 monthly.","department_cost_center":null,"description_short":"AI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment","display_distance":null,"id":"11a04964-c6e4-4c2f-a5ce-fb08069f84a4","id_icims":"3178234","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Machine Learning Data Operatio","job_function_id":null,"job_path":"/en/jobs/3178234/ai-data-associate-with-italian-agi-data-services","job_schedule_type":"full-time","location":"PL, Gdansk","locations":["{\"normalizedStateName\":\"Pomeranian Voivodeship\",\"normalizedCountryCode\":\"POL\",\"city\":\"Gdansk\",\"countryIso3a\":\"POL\",\"countryIso2a\":\"PL\",\"locationNonStemming\":\"Poland, Gdansk\",\"coordinates\":\"54.35311,18.65105\",\"normalizedCountyName\":\"Gdansk\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Poland\",\"normalizedLocation\":\"Gdansk, Pomeranian Voivodeship, POL\",\"location\":\"PL, Gdansk\",\"region\":\"\",\"buildingCodeList\":[\"GDN13\"],\"normalizedCityName\":\"Gdansk\"}"],"normalized_location":"Gdansk, Pomeranian Voivodeship, POL","optional_search_labels":["alexa-and-amazon-devices.team-operations-job-family","alexa-and-amazon-devices.team-administrative-support-job-family","amazon.artificial-intelligence"],"posted_date":"February 10, 2026","preferred_qualifications":"- Bachelor’s degree in a relevant field\u003cbr/\u003e- 2+ years of professional work experience with demonstrated task execution ability\u003cbr/\u003e- Proven capacity to leverage open-source resources effectively for comprehensive research purposes\u003cbr/\u003e- Ability to adapt well to fast-paced environments with changing circumstances, direction, and strategy\u003cbr/\u003e- 2-3 years project coordination or management experience (for support functions teams)\u003cbr/\u003e- Experience managing stakeholder relationships across departments\u003cbr/\u003e- Advanced proficiency in Microsoft Office Suite and common business applications.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":null,"title":"AI Data Associate with Italian, AGI Data Services","university_job":null,"updated_time":"28 minutes","url_next_step":"https://account.amazon.com/jobs/3178234/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- An Associate’s Degree or related work experience \u003cbr/\u003e- CEFR C1+ or equivalent fluency in Italian language\u003cbr/\u003e- Written and spoken knowledge of English is essential (CEFR B2+)\u003cbr/\u003e- Strong business writing skills with ability to create reports, proposals, and professional correspondence\u003cbr/\u003e- Advanced reading comprehension with ability to analyze complex business documents\u003cbr/\u003e- Developed analytical thinking and structured problem-solving capabilities\u003cbr/\u003e- Strong ability to interpret and implement detailed instructions across various projects\u003cbr/\u003e- Proficient research skills with experience gathering and synthesizing information from multiple sources\u003cbr/\u003e- Proven attention to detail in managing complex tasks and documents","business_category":"amazon-artificial-general-intelligence","city":"Den Haag","company_name":"Amazon Development Center (Netherlands) B.V.","country_code":"NLD","description":"AI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment of large language models (LLMs) across all of our businesses. Come build the future of human-technology interaction with us.\u003cbr/\u003e\u003cbr/\u003eWe are looking for those candidates who just don’t think out of the box, but make the box they are in ‘Bigger’. The future is now, do you want to be a part of it? Then read on! \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Maintain and follow strict confidentiality as customer privacy is our most important tenet\u003cbr/\u003e- Work with a range of different types of data including, but not limited to: text, speech, audio, image, and video\u003cbr/\u003e- Deliver high-quality labelled data, using guidelines provided to meet our KPIs and using in-house tools and software, as part of Amazon's commitment to developing and deploying AI responsibly.\u003cbr/\u003e- Demonstrate proficiency in generating high quality human insight data across a range of modalities, inclusive of text, image video and audio. \u003cbr/\u003e- Capable of making sound judgments and logical decisions when faced with ambiguous or incomplete information while performing tasks.\u003cbr/\u003e- Eye for detail and ability to pivot from one category of requirement to another instantaneously.\u003cbr/\u003e- Demonstrate support on daily operational deliverables for multiple task types assigned to you and the team\u003cbr/\u003e- Analyze root causes, identify error patterns, and propose solutions to enhance the quality of labeling tasks and their outputs.\u003cbr/\u003e- Responsible for identifying day-to-day process and operational issues in Standard Operating Procedure, tools and suggest changes to unblock operations\u003cbr/\u003e- Demonstrate ownership in floor support to clarify internal queries during execution on need basis\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are looking for a ML Data Associate (MLDA) to undertake the task of foundational labeling functions, such as dialogue evaluation on speech, text, audio, video data.\u003cbr/\u003e\u003cbr/\u003eYour ability to concentrate, multi-task and your high attention to detail helps you deliver high-quality work as well as maintaining strict confidentiality and follow all applicable Amazon policies for securing confidential information. You will be a part of a diverse team with the shared vision of improving customers’ lives with practical, useful generative AI innovations. An inner drive, individuality, and a creative mind are extremely beneficial.","department_cost_center":null,"description_short":"AI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment","display_distance":null,"id":"a642c554-abaa-432d-bbc4-83662845a131","id_icims":"3042699","is_intern":null,"is_manager":null,"job_category":"Editorial, Writing, \u0026 Content Management","job_family":"Machine Learning Data Operatio","job_function_id":null,"job_path":"/en/jobs/3042699/senior-data-associate-with-italian-agi-data-services","job_schedule_type":"full-time","location":"NL, Den Haag","locations":["{\"normalizedStateName\":\"South Holland\",\"normalizedCountryCode\":\"NLD\",\"city\":\"Den Haag\",\"countryIso3a\":\"NLD\",\"countryIso2a\":\"NL\",\"locationNonStemming\":\"Netherlands, Den Haag\",\"coordinates\":\"52.08408,4.31732\",\"normalizedCountyName\":\"The Hague\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Netherlands\",\"normalizedLocation\":\"The Hague, South Holland, NLD\",\"location\":\"NL, Den Haag\",\"region\":\"\",\"buildingCodeList\":[\"AMS10\"],\"normalizedCityName\":\"The Hague\"}"],"normalized_location":"The Hague, South Holland, NLD","optional_search_labels":["alexa-and-amazon-devices.team-operations-job-family","alexa-and-amazon-devices.team-administrative-support-job-family","amazon.artificial-intelligence"],"posted_date":"July 24, 2025","preferred_qualifications":"- Bachelor’s degree in a relevant field\u003cbr/\u003e- 2+ years of professional work experience with demonstrated task execution ability\u003cbr/\u003e- Proven capacity to leverage open-source resources effectively for comprehensive research purposes\u003cbr/\u003e- Ability to adapt well to fast-paced environments with changing circumstances, direction, and strategy\u003cbr/\u003e- 2-3 years project coordination or management experience (for support functions teams)\u003cbr/\u003e- Experience managing stakeholder relationships across departments\u003cbr/\u003e- Advanced proficiency in Microsoft Office Suite and common business applications.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":null,"title":"Senior Data Associate with Italian, AGI-Data Services","university_job":null,"updated_time":"28 minutes","url_next_step":"https://account.amazon.com/jobs/3042699/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 4+ years of specific technology domain areas (e.g. software development, cloud computing, systems engineering, infrastructure, security, networking, data \u0026 analytics) experience\u003cbr/\u003e- 2+ years of design, implementation, or consulting in applications and infrastructures experience","business_category":"aws","city":"East Palo Alto","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"AWS Global Sales drives adoption of the AWS cloud worldwide, enabling customers of all sizes to innovate and expand in the cloud. Our team empowers every customer to grow by providing tailored service, unmatched technology, and unwavering support. We dive deep to understand each customer's unique challenges, then craft innovative solutions that accelerate their success. This customer-first approach is how we built the world's most adopted cloud. Join us and help us grow.  \u003cbr/\u003eAs a trusted customer advocate, the solutions architect will help organizations understand best practices around advanced cloud-based solutions, and how to migrate existing workloads to the cloud. You will have the opportunity to help shape and execute a strategy to build mindshare and broad use of AWS within enterprise customers.\u003cbr/\u003eThe ability to connect technology with measurable business value is critical to a solutions architect. You should also have a demonstrated ability to think strategically about business, products, and technical challenges.\u003cbr/\u003eHere are some other qualities we are looking for: Be great fun to work with - at AWS, we have a credo of “Work hard. Have fun. Make history”. In this role, you will love what you do, and instinctively know how to make work fun. You will be dynamic and creative, and willing to take on any challenge and make a big impact. Enjoy working with large, global customers. You will have a passion for educating, training, designing, and building cloud solutions for a diverse and challenging set off enterprise customers.\u003cbr/\u003eHave a good understanding of large scale computing solutions. You will enjoy keeping your existing technical skills honed and developing new ones, so you can make contributions to deep architecture discussions. You will regularly take part in deep-dive education and design exercises to create world-class solutions built on AWS.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Ensure success in building and migrating applications, software and services on the AWS platform.\u003cbr/\u003e* As part of the account management team, formulate and execute a strategy.\u003cbr/\u003e* Educate customers of all sizes on the value proposition of AWS, and participate in deep architectural discussions to ensure solutions are designed for successful deployment in the cloud.\u003cbr/\u003e* Conduct one-to-few and one-to-many enablement sessions to transfer knowledge to customers considering or already using AWS.\u003cbr/\u003e* Capture and share best-practice knowledge amongst the AWS solutions architect community.\u003cbr/\u003e* Author or otherwise contribute to AWS customer-facing publications such as whitepapers, blogs, workshops, and others.\u003cbr/\u003e* Build deep relationships with senior technical stakeholders within customers to enable them to be cloud advocates.\u003cbr/\u003e* Act as a technical liaison between customers, service engineering teams and support.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003e\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003e\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.","department_cost_center":null,"description_short":"AWS Global Sales drives adoption of the AWS cloud worldwide, enabling customers of all sizes to innovate and expand in the cloud. Our team empowers every customer to grow by providing tailored service,","display_distance":null,"id":"3011fce7-636a-4761-85fe-53c595270f24","id_icims":"3189154","is_intern":null,"is_manager":null,"job_category":"Solutions Architect","job_family":"Solution Architect","job_function_id":null,"job_path":"/en/jobs/3189154/solutions-architect-isv","job_schedule_type":"full-time","location":"US, CA, East Palo Alto","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Santa Clara\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Santa Clara\",\"coordinates\":\"37.3558,-121.95512\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Santa Clara, California, USA\",\"location\":\"US, CA, Santa Clara\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC25\"],\"normalizedCityName\":\"Santa Clara\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"East Palo Alto\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, East Palo Alto\",\"coordinates\":\"37.4732,-122.13957\",\"normalizedCountyName\":\"San Mateo\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"East Palo Alto, California, USA\",\"location\":\"US, CA, East Palo Alto\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC18\"],\"normalizedCityName\":\"East Palo Alto\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Francisco\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Francisco\",\"coordinates\":\"37.77702,-122.41956\",\"normalizedCountyName\":\"San Francisco\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Francisco, California, USA\",\"location\":\"US, CA, San Francisco\",\"region\":\"CA\",\"buildingCodeList\":[\"SFO28\"],\"normalizedCityName\":\"San Francisco\"}"],"normalized_location":"East Palo Alto, California, USA","optional_search_labels":[],"posted_date":"February 25, 2026","preferred_qualifications":"- Experience working within software development or Internet-related industries\u003cbr/\u003e- Experience migrating or transforming legacy customer solutions to the cloud\u003cbr/\u003e- Experience working with AWS technologies from a dev/ops perspective\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, East Palo Alto - 151,000.00 - 204,300.00 USD annually\u003cbr/\u003eUSA, CA, San Francisco - 151,000.00 - 204,300.00 USD annually\u003cbr/\u003eUSA, CA, Santa Clara - 151,000.00 - 204,300.00 USD annually","primary_search_label":"aws.team-solutions-architect-primary","source_system":"JobCreator","state":"CA","title":"Solutions Architect, ISV","university_job":null,"updated_time":"31 minutes","url_next_step":"https://account.amazon.com/jobs/3189154/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-solutions-architect-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Must be 18 years of age or older\u003cbr/\u003e- Education Requirements (must meet one):\u003cbr/\u003e- - Currently enrolled in Bachelor's degree or above in Computer Science, Computer Engineering, Data Science, Information Systems, or related STEM fields [degrees can be updated based on regional variations]\u003cbr/\u003e- - Completed Bachelor's or Graduate degree in specified fields\u003cbr/\u003e- Demonstrated experience with at least one general-purpose programming language such as Java, Python, C++, C#, Go, Rust, or TypeScript\u003cbr/\u003e- Demonstrated experience one or more of the following:\u003cbr/\u003e- - Data structures implementation\u003cbr/\u003e- - Basic algorithm development\u003cbr/\u003e- - Object-oriented design principles\u003cbr/\u003e- Experience with AI/ML technologies","business_category":"studentprograms","city":"Gdansk","company_name":"AMZN Dev Cntr Poland sp. z.o.o","country_code":"POL","description":"Do you want to solve real customer problems through innovative technology? Do you enjoy working on scalable services in a collaborative team environment? Do you want to see your code directly impact millions of customers worldwide?\u003cbr/\u003eAt Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. Customer obsession is part of our company DNA, which has made us one of the world's most beloved brands.\u003cbr/\u003eOur Software Development Engineer (SDE) interns use modern technology to solve complex problems while seeing their work's impact first-hand. The challenges SDE interns solve at Amazon are meaningful and influence millions of customers, sellers, and products globally. We seek individuals passionate about creating new products, features, and services while managing ambiguity in an environment where development cycles are measured in weeks, not years. \u003cbr/\u003eAt Amazon, we believe in ownership at every level. As an SDE intern, you'll own the entire lifecycle of your code - from design through deployment and ongoing operations. This ownership mindset, combined with our commitment to operational excellence, ensures we deliver the highest quality solutions for our customers.\u003cbr/\u003eWe're looking for curious minds who think big and want to define tomorrow's technology. At Amazon, you'll grow into the high-impact engineer you know you can be, supported by a culture of learning and mentorship. Every day brings exciting new challenges and opportunities for personal growth.\u003cbr/\u003e\u003cbr/\u003eAmazon internships across all seasons are full-time positions, and interns should expect to work in office, Monday-Friday, up to 40 hours per week typically between 8am-5pm. Specific team norms around working hours will be communicated by your manager. Interns should not have conflicts such as classes or other employment during the Amazon work-day. Applicants should have a minimum of one quarter/semester/trimester remaining in their studies after their internship concludes.\u003cbr/\u003e\u003cbr/\u003eThe minimum base pay salary for this position is listed below. Amazon reserves the right to offer a higher base salary, depending on the candidate's skills, competencies, and experience. As a total compensation company, Amazon's package may include further pay components such as a sign on payment and the eligibility to participate in a restricted stock unit scheme operated independently by Amazon.com Inc. in USA. Your recruiting team will share final base pay and any applicable total compensation elements depending on skills and requirements. Company discretionary, supplementary benefits apply subject to further terms, including pension plans, health insurance, life and disability insurance, business travel insurance, MultiSport card, employee discount code and program (EDC/Extras), commuter benefits where applicable, and the Employee Assistance Program (private and confidential counselling and referral service to support health and well-being).\u003cbr/\u003eThe base pay for this position is PLN 9,200 monthly.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tCollaborate and communicate effectively with experienced cross-disciplinary Amazonians to design, build, and operate innovative products and services that delight our customers, while participating in technical discussions to drive solutions forward.\u003cbr/\u003e•\tDesign and develop scalable solutions using cloud-native architectures and microservices in a large distributed computing environment.\u003cbr/\u003e•\tParticipate in code reviews and contribute to technical documentation.\u003cbr/\u003e•\tBuild and maintain resilient distributed systems that are scalable, fault-tolerant, and cost-effective.\u003cbr/\u003e•\tLeverage and contribute to the development of GenAI and AI-powered tools to enhance development productivity while staying current with emerging technologies. \u003cbr/\u003e•\tWrite clean, maintainable code following best practices and design patterns.\u003cbr/\u003e•\tWork in an agile environment practicing CI/CD principles while participating in operational responsibilities including on-call duties.\u003cbr/\u003e•\tDemonstrate operational excellence through monitoring, troubleshooting, and resolving production issues.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs an intern, you will be matched to a manager and a mentor and will have the opportunity to influence the evolution of Amazon technology and lead critical projects early in your career. \u003cbr/\u003e\u003cbr/\u003eThe team requires an internship duration of 3 to 6 months.\u003cbr/\u003e\u003cbr/\u003eIn addition to working on an impactful project, you will have the opportunity to engage with Amazonians for both personal and professional development, expand your network, and participate in activities with other interns throughout your internship. No matter the location of your internship, we give you the tools to own your project and learn in a real-world setting.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAt Amazon Devices \u0026 Services, we imagine the future and then create it. Join brilliant minds to build new categories of technology that become part of everyone's everyday life. Together, we create connected experiences that transform lives, communities, and the world with our work. \u003cbr/\u003e\u003cbr/\u003eSay hello to Ring, Blink, and Amazon Key. Together, we’re making neighborhoods safer with products that make homes more secure and life more convenient. Our teams are on a mission to create affordable, innovative, and easy-to-use smart home security devices.","department_cost_center":null,"description_short":"Do you want to solve real customer problems through innovative technology? Do you enjoy working on scalable services in a collaborative team environment? Do you want to see your code directly impact millions","display_distance":null,"id":"0495e9cf-f903-4fec-ab48-67d3f551258f","id_icims":"3125289","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3125289/software-dev-engineer-internship-ai","job_schedule_type":"full-time","location":"PL, Gdansk","locations":["{\"normalizedStateName\":\"Pomeranian Voivodeship\",\"normalizedCountryCode\":\"POL\",\"city\":\"Gdansk\",\"countryIso3a\":\"POL\",\"countryIso2a\":\"PL\",\"locationNonStemming\":\"Poland, Gdansk\",\"coordinates\":\"54.35311,18.65105\",\"normalizedCountyName\":\"Gdansk\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Poland\",\"normalizedLocation\":\"Gdansk, Pomeranian Voivodeship, POL\",\"location\":\"PL, Gdansk\",\"region\":\"\",\"buildingCodeList\":[\"GDN11\"],\"normalizedCityName\":\"Gdansk\"}"],"normalized_location":"Gdansk, Pomeranian Voivodeship, POL","optional_search_labels":[],"posted_date":"November 27, 2025","preferred_qualifications":"- Experience in GenAI and Agent service development using LLM/VLM.\u003cbr/\u003e- Previous technical internship(s) or demonstrated project experience\u003cbr/\u003e- Experience with one or more of the following:\u003cbr/\u003e- - AI tools for development productivity\u003cbr/\u003e- - Cloud platforms (preferably AWS)\u003cbr/\u003e- - Database systems (SQL and NoSQL)\u003cbr/\u003e- - Contributing to open-source projects\u003cbr/\u003e- - Version control systems\u003cbr/\u003e- - Debugging and troubleshooting complex systems\u003cbr/\u003e- Strong problem-solving and analytical skills\u003cbr/\u003e- Excellent written and verbal communication skills\u003cbr/\u003e- Demonstrated ability to learn and adapt to new technologies quickly\u003cbr/\u003e- Basic understanding of software development lifecycle (SDLC)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"studentprograms.team-internships-for-students","source_system":"JobCreator","state":null,"title":"Software Dev Engineer Internship - AI","university_job":null,"updated_time":"33 minutes","url_next_step":"https://account.amazon.com/jobs/3125289/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-internships-for-students","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}