{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Experience in automating, deploying, and supporting large-scale infrastructure\u003cbr/\u003e- Experience programming with at least one modern language such as Python, Ruby, Golang, Java, C++, C#, Rust\u003cbr/\u003e- Experience with Linux/Unix\u003cbr/\u003e- Experience with CI/CD pipelines build processes","business_category":"alexa-and-amazon-devices","city":"Bellevue","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the capacity, flexibility, and performance to serve a wide range of customers, from individual households to schools, hospitals, businesses, government agencies, and other organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eAs a System Development Engineer, you will build tools and processes for monitoring, operating, and scaling ground infrastructure to millions of users around the globe. Use and enhance the tools you and the team develop. Using metrics, scalability in design, and continuous improvement, you will automate repetitive processes to eliminate outages and enable high availability of the ground infrastructure. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e - Continuously strive for operational excellence by seeking to automate away manual processes\u003cbr/\u003e - Ensure that all systems are designed to be robust, scalable, maintainable and adaptable as the service scales and evolves over time\u003cbr/\u003e - Build and maintain critical infrastructure, tools and operating procedures to report on the health of ground infrastructure.\u003cbr/\u003e- Integrate with other existing systems such as trouble ticketing, dashboards, and metrics tools and services\u003cbr/\u003e- Measure and improve the performance and availability of the Amazon Leo Ground Infrastructure\u003cbr/\u003e - Provide critical operations support and incident response for the service, while taking part in an on-call rotation.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eDesign, Coding, Operational Excellence: \u003cbr/\u003e\u003cbr/\u003eWork with business partners, engineers, design of systems. We need your ideas and your ability to take initiative, innovate, and produce results as we continuously improve the customer experience. \u003cbr/\u003e\u003cbr/\u003eDay to day work will vary between automation or other scripting work, operational excellence initiatives, design meetings, coordination with engineering teams and external partners, and an on-call rotation.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe team is comprised of a leader and System Development Engineers in North America, Europe and Australia. The overall mission is to ensure Amazon Leo Ground Infrastructure is always available to serve customers.","department_cost_center":null,"description_short":"Amazon Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the","display_distance":null,"id":"7544d407-2b02-449c-a23c-4a867147ed71","id_icims":"3069484","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"System Development Engineering","job_function_id":null,"job_path":"/en/jobs/3069484/systems-development-engineer-ground-infrastructure-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA107\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":["military-operations","military-tech","military-na","military","devices-apjc","devices-manufacturing"],"posted_date":"August 29, 2025","preferred_qualifications":"- Experience with distributed systems at scale\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Bellevue - 129,200.00 - 174,800.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Systems Development Engineer - Ground Infrastructure, Amazon Leo ","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3069484/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Basic Qualifications:\u003cbr/\u003e- Technical (Military/ Trade School) School diploma or Associate degree with one year experience related to industrial instrumentation/controls or equivalent electrical or mechanical operations experience.\u003cbr/\u003e- Minimum one year of experience working with computer components and operating systems.\u003cbr/\u003e- Minimum one year of experience with mission critical low and medium voltage electrical and/or mechanical systems.","business_category":"aws","city":"Herndon","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"The Data Center Global Controls team is looking for exceptional individuals to join our Controls organization as a Controls Technician for Service \u0026 Construction of the Building Management Systems (BMS) and Electrical Power Monitoring System (EPMS) within Amazon data centers. If you are passionate about the Customer Experience, think and act globally and have the ability to contribute to major new innovations in the area of building controls and automation this is the challenge you are looking for!\u003cbr/\u003e\u003cbr/\u003eThe candidate will possess technical background and experience in installation, troubleshooting, operations and/or maintenance of field sensors, controllers, wiring, networking and programming associated with the industrial controls systems. The candidate may also have relevant experience operating and maintaining mission critical electrical and mechanical systems. A Controls Technician shall be responsible for participating in the installation, testing, troubleshooting and startup of equipment and controls system associated with the BMS and EPMS system deployment in the data centers. A Controls Technician is expected to actively innovate on behalf of their customers in the area of Data Center building automation.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e· Primarily work in and support multiple Data Centers by Deploying, Servicing, and Upgrading BMS and EPMS systems.\u003cbr/\u003e· Mentor and train Facilities team members on operation and control of the BMS and EPMS systems.\u003cbr/\u003e· Audit, maintain, and manage computer enterprise asset management systems for BMS and EPMS installations\u003cbr/\u003e· Manage small to medium size projects and programs.\u003cbr/\u003e· Perform point to point checkouts between field devices and controllers.\u003cbr/\u003e· Perform first-line diagnostics, troubleshooting and maintenance of programming code and hardware associated with the BMS and EPMS in data centers.\u003cbr/\u003e· Perform provisioning process for servers, controllers, industrial PCs and network configurations and communication testing between third party devices and controllers or servers.\u003cbr/\u003e· Installation, replacement, configuration, and calibration of sensors.\u003cbr/\u003e· Able to read and understand Electrical schematics, control panel drawings. Basic understanding of close loop controls, field sensors scaling, and functions typically performed by industrial controllers.\u003cbr/\u003e· Supervise low voltage electrical contractors who performing wiring and installation of field devices in compliance with AWS requirements.\u003cbr/\u003e· Commissioning and systems level testing support.\u003cbr/\u003e· Create red-lined drawings and documentation of systems.\u003cbr/\u003e· Follow change management process to generate work requests and method of procedures.\u003cbr/\u003e· Participate in Factory witnessed tests at vendor's or panel builder's facility.\u003cbr/\u003e· Perform other tasks as assigned by manager.\u003cbr/\u003e· Recommend design improvements based on consultation with users and system operation.\u003cbr/\u003e· Perform root cause analysis during testing and commissioning.\u003cbr/\u003e· Ensure all personnel on site utilize proper safety methodology.\u003cbr/\u003e· Work on-call and a rotating schedule when required and respond to after-hours emergencies.\u003cbr/\u003e· Perform service activities such as monitoring/reviewing ticketing systems, performing root cause analysis, and prioritizing tasks.\u003cbr/\u003e· Actively manage service agreements to include vendor labor scheduling, quality assurance, and financial invoice review.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e\u003cbr/\u003e· Walk jobsites in uneven terrain and work at heights and from ladders.\u003cbr/\u003e· Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl.\u003cbr/\u003e· On occasions, lift and/or move up to 49 pounds; and participate in group lifts for 50 pounds or more.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003e*Why AWS*\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003e*Diverse Experiences*\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003e*Work/Life Balance*\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003e*Inclusive Team Culture*\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003e*Mentorship and Career Growth*\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"The Data Center Global Controls team is looking for exceptional individuals to join our Controls organization as a Controls Technician for Service \u0026 Construction of the Building Management Systems (BMS)","display_distance":null,"id":"62983e71-f6d6-43a4-bc9f-91736c31f5cb","id_icims":"2926724","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/2926724/data-center-controls-tech-deployment","job_schedule_type":"full-time","location":"US, VA, Herndon","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD31\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Herndon, Virginia, USA","optional_search_labels":["aws.team-ais"],"posted_date":"March 13, 2025","preferred_qualifications":"- Preferred Qualifications:\u003cbr/\u003e- Basic understanding of Industrial controls system, controllers, and programming including troubleshooting of industrial controls analog, discrete and networked input/output field signals.\u003cbr/\u003e- One-year experience working in a Data Center or mission critical environment.\u003cbr/\u003e- Bachelor’s Degree in Electrical Engineering, Mechanical Engineering or relevant discipline.\u003cbr/\u003e- International Society of Automation (ISA) Certified Controls System Technician (CCST) Level I or higher certification.\u003cbr/\u003e- Fundamental knowledge of network design and layout as well as low voltage (copper/ fiber) cabling.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Herndon - 32.00 - 57.00 USD hourly","primary_search_label":"aws.team-hardware-development-primary","source_system":"JobCreator","state":"VA","title":"Data Center Controls Tech, Deployment","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/2926724/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-hardware-development-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Perrysburg","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Job summary\u003cbr/\u003eOur WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Operations Manager. In this role, you will lead and develop a team of salaried and hourly talent. You will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. To achieve this, managers are expected to provide their team with the tools needed for success while driving improvements in productivity and efficiency through data-driven decisions and analytical problem-solving. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e   \u003cbr/\u003e  Our Operation’s workflow has three major components:  First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer.\u003cbr/\u003e \u003cbr/\u003e Key Responsibilities and Job Elements:\u003cbr/\u003e - Support, mentor, and motivate your salaried and hourly workforce\u003cbr/\u003e - Lead large-scope projects with site and regional impact\u003cbr/\u003e - Build and execute productivity plans through forecast reviews, determining productivity requirements, and partnering with other Leaders to load balance \u003cbr/\u003e - Manage safety, quality, productivity, and customer delivery promises \u003cbr/\u003e - Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e - Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e - Stand/walk for up to 12 hours during shifts \u003cbr/\u003e - Work in an environment where the noise level varies and can be loud\u003cbr/\u003e - Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e - Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e   Our fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Operations Managers based on location preference and the business’ current openings.  ","department_cost_center":null,"description_short":"Job summaryOur WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Operations","display_distance":null,"id":"3c9dc7fa-1ea4-4c73-8fd5-c9173f2e2bdd","id_icims":"3124685","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3124685/operations-manager","job_schedule_type":"full-time","location":"US, OH, Perrysburg","locations":["{\"normalizedStateName\":\"Ohio\",\"normalizedCountryCode\":\"USA\",\"city\":\"Perrysburg\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OH, Perrysburg\",\"coordinates\":\"41.55707,-83.62795\",\"normalizedCountyName\":\"Wood\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Perrysburg, Ohio, USA\",\"location\":\"US, OH, Perrysburg\",\"region\":\"OH\",\"buildingCodeList\":[\"TOL3\"],\"normalizedCityName\":\"Perrysburg\"}"],"normalized_location":"Perrysburg, Ohio, USA","optional_search_labels":[],"posted_date":"November 11, 2025","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 2+ salaried employees and 70+ indirect employees\u003cbr/\u003e- Experience scoping, leading, and implementing process improvements through: Lean process, Kaizen, and/or Six Sigma.\u003cbr/\u003e- Demonstrated problem solving skills and analytical skills\u003cbr/\u003e- Excellent customer service skills, communication skills and interpersonal skills\u003cbr/\u003e- Track record of meeting or exceeding department performance goals\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Experience in: military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production, or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, OH, Perrysburg - 91,000.00 - 136,500.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"OH","title":"Operations Manager ","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3124685/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Computer Science, Engineering, or a related field\u003cbr/\u003e- 3+ years of experience in cloud architecture and implementation\u003cbr/\u003e- 3+ years of software development tools and methodologies\u003cbr/\u003e- Current, active US Government Security Clearance of TS/SCI with Polygraph","business_category":"aws","city":"Herndon","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Application deadline: Applications will be accepted on an ongoing basis\u003cbr/\u003e\u003cbr/\u003eThe Amazon Web Services Professional Services (ProServe) team is seeking a skilled Delivery Consultant to join our team at Amazon Web Services (AWS). In this role, you'll work closely with customers to design, implement, and manage AWS solutions that meet their technical requirements and business objectives. You'll be a key player in driving customer success through their cloud journey, providing technical expertise and best practices throughout the project lifecycle. Possessing a deep understanding of AWS products and services, as a Delivery Consultant you will be proficient in architecting complex, scalable, and secure solutions tailored to meet the specific needs of each customer. You’ll work closely with stakeholders to gather requirements, assess current infrastructure, and propose effective migration strategies to AWS. As trusted advisors to our customers, providing guidance on industry trends, emerging technologies, and innovative solutions, you will be responsible for leading the implementation process, ensuring adherence to best practices, optimizing performance, and managing risks throughout the project. \u003cbr/\u003e \u003cbr/\u003eThe AWS Professional Services organization is a global team of experts that help customers realize their desired business outcomes when using the AWS Cloud. We work together with customer teams and the AWS Partner Network (APN) to execute enterprise cloud computing initiatives. Our team provides assistance through a collection of offerings which help customers achieve specific outcomes related to enterprise cloud adoption. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries.\u003cbr/\u003e\u003cbr/\u003eThis position requires that the candidate selected be a US Citizen and must currently possess an active Top Secret security clearance. The position further requires that, after start, the selected candidate obtain and maintain an active TS/SCI security clearance with polygraph and satisfy other security related requirements.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs an experienced technology professional, you will be responsible for: \u003cbr/\u003e- Designing and implementing complex, scalable, and secure AWS solutions tailored to customer needs\u003cbr/\u003e- Providing technical guidance and troubleshooting support throughout project delivery\u003cbr/\u003e- Collaborating with stakeholders to gather requirements and propose effective migration strategies\u003cbr/\u003e- Acting as a trusted advisor to customers on industry trends and emerging technologies\u003cbr/\u003e- Sharing knowledge within the organization through mentoring, training, and creating reusable artifacts\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS \u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon  conferences, inspire us to never stop embracing our uniqueness. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.","department_cost_center":null,"description_short":"The Amazon Web Services Professional Services (ProServe) team is seeking a skilled Delivery Consultant to join our team at Amazon Web Services (AWS). In this role, you'll work closely with customers to","display_distance":null,"id":"e8d88b95-d5a1-4d5d-9465-4131217e437e","id_icims":"3105218","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Professional Services","job_function_id":null,"job_path":"/en/jobs/3105218/delivery-consultant-wwps-proserve","job_schedule_type":"full-time","location":"US, VA, Herndon","locations":["{\"normalizedStateName\":\"Missouri\",\"normalizedCountryCode\":\"USA\",\"city\":\"St. Louis\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MO, St. Louis\",\"coordinates\":\"38.62775,-90.19956\",\"normalizedCountyName\":\"St Louis (City)\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"St Louis, Missouri, USA\",\"location\":\"US, MO, St. Louis\",\"region\":\"MO\",\"buildingCodeList\":[\"STL252\"],\"normalizedCityName\":\"St Louis\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD21\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Herndon, Virginia, USA","optional_search_labels":["aws-team-global-services-optional","amazon-cleared-jobs"],"posted_date":"October  9, 2025","preferred_qualifications":"- AWS experience preferred, with proficiency in a wide range of AWS services (e.g., EC2, S3, RDS, Lambda, IAM, VPC, CloudFormation)\u003cbr/\u003e- AWS Professional level certifications (e.g., Solutions Architect Professional, DevOps Engineer Professional) preferred\u003cbr/\u003e- Experience with automation and scripting (e.g., Terraform, Python)\u003cbr/\u003e- Knowledge of security and compliance standards (e.g., NIST, ICD)\u003cbr/\u003e- Strong communication skills with the ability to explain technical concepts to both technical and non-technical audiences\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Denver - 131,300.00 - 177,600.00 USD annually\u003cbr/\u003eUSA, MO, St. Louis - 131,300.00 - 177,600.00 USD annually\u003cbr/\u003eUSA, VA, Herndon - 131,300.00 - 177,600.00 USD annually","primary_search_label":"aws.team-us-security-clearance-jobs-primary","source_system":"JobCreator","state":"VA","title":"Delivery Consultant, WWPS ProServe","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3105218/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-us-security-clearance-jobs-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of data scientist experience\u003cbr/\u003e- 3+ years of data querying languages (e.g. SQL), scripting languages (e.g. Python) or statistical/mathematical software (e.g. R, SAS, Matlab, etc.) experience\u003cbr/\u003e- 3+ years of machine learning/statistical modeling data analysis tools and techniques, and parameters that affect their performance experience\u003cbr/\u003e- 1+ years of working with or evaluating AI systems experience\u003cbr/\u003e- Master's degree in Science, Technology, Engineering, or Mathematics (STEM), or experience working in Science, Technology, Engineering, or Mathematics (STEM)\u003cbr/\u003e- Experience applying theoretical models in an applied environment","business_category":"retail","city":"Vancouver","company_name":"Amazon.com.ca, ULC","country_code":"CAN","description":"Join our Amazon Private Brands Selection Guidance organization in building science and tech solutions at scale to delight our customers with products across our leading private brands such as Amazon Basics, Amazon Essentials, and by Amazon.\u003cbr/\u003e\u003cbr/\u003eThe Selection Guidance team applies Generative AI, Machine Learning, Statistics, and Economics solutions to drive our private brands product assortment, strategic business decisions, and product inputs such as title, price, merchandising and ordering. We are an interdisciplinary team of Scientists, Economists, Engineers, and Product Managers incubating and building day one solutions using novel technology, to solve some of the toughest business problems at Amazon.\u003cbr/\u003e\u003cbr/\u003eAs a Data Scientist you will investigate business problems using data, invent novel solutions and prototypes, and directly contribute to bringing your ideas to life through production implementation. Current research areas include named entity recognition, product substitutes, pricing optimization, agentic AI, and large language models. You will review and guide scientists across the team on their designs and implementations, and raise the team bar for science research and prototypes.\u003cbr/\u003e\u003cbr/\u003eThis is a unique, high visibility opportunity for someone who wants to develop ambitious science solutions and have direct business and customer impact.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Partner with business stakeholders to deeply understand APB business problems and frame ambiguous business problems as science problems and solutions.\u003cbr/\u003e- Perform data analysis and build data pipelines to drive business decisions.\u003cbr/\u003e- Invent novel science solutions, develop prototypes, and deploy production software to solve business problems.\u003cbr/\u003e- Review and guide science solutions across the team.\u003cbr/\u003e- Publish and socialize your and the team's research across Amazon and external avenues as appropriate\u003cbr/\u003e- Leverage industry best practices to establish repeatable applied science practices, principles \u0026 processes.\u003cbr/\u003e","department_cost_center":null,"description_short":"Join our Amazon Private Brands Selection Guidance organization in building science and tech solutions at scale to delight our customers with products across our leading private brands such as Amazon Basics,","display_distance":null,"id":"54274d54-fd1f-45f1-ad0c-98ab5d3cc7ed","id_icims":"3171593","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Science","job_function_id":null,"job_path":"/en/jobs/3171593/data-scientist-ii-amazon-private-brands","job_schedule_type":"full-time","location":"CA, BC, Vancouver","locations":["{\"normalizedStateName\":\"British Columbia\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Vancouver\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, BC, Vancouver\",\"coordinates\":\"49.26038,-123.11336\",\"normalizedCountyName\":\"Metro Vancouver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Vancouver, British Columbia, CAN\",\"location\":\"CA, BC, Vancouver\",\"region\":\"BC\",\"buildingCodeList\":[\"YVR14\"],\"normalizedCityName\":\"Vancouver\"}"],"normalized_location":"Vancouver, British Columbia, CAN","optional_search_labels":[],"posted_date":"February  2, 2026","preferred_qualifications":"- Knowledge of machine learning concepts and their application to reasoning and problem-solving\u003cbr/\u003e- Experience in Python, Perl, or another scripting language\u003cbr/\u003e- Experience in a ML or data scientist role with a large technology company\u003cbr/\u003e- Experience working on multi-team, cross-disciplinary projects\u003cbr/\u003e- Experience applying quantitative analysis to solve business problems and making data-driven business decisions\u003cbr/\u003e- Experience effectively communicating complex concepts through written and verbal communication\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(34, 34, 34)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. As a total compensation company, Amazon's package may include other elements such as sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon offers comprehensive benefits including health insurance (medical, dental, vision, prescription, basic life \u0026amp; AD\u0026amp;D insurance), Registered Retirement Savings Plan (RRSP), Deferred Profit Sharing Plan (DPSP), paid time off, and other resources to improve health and well-being. We thank all applicants for their interest, however only those interviewed will be advised as to hiring status.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eCAN, BC, Vancouver - 109,100.00 - 182,200.00 CAD annually","primary_search_label":"retail.team-private-brands","source_system":"JobCreator","state":"BC","title":"Data Scientist II, Amazon Private Brands","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3171593/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-private-brands","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of professional non-internship marketing experience\u003cbr/\u003e- 1+ years of Salesforce, Tableau, Vidyard, and Excel experience\u003cbr/\u003e- Experience with Excel or Tableau (data manipulation, macros, charts and pivot tables)","business_category":"aws","city":"Seattle","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Do you have a desire to make a major contribution to the rapid growth of Cloud Computing and AI? Do you want to build your skills in marketing and sales for long-term career growth? If so, come build the future of tech as part of our Global Marketing Response Center (MRC) team. We are looking for ambitious individuals to join the Global MRC team to engage with new and prospective AWS customers. \u003cbr/\u003e\u003cbr/\u003eMRC is the customer engagement arm of the Marketing organization. Our mission is to learn from customers, understand their needs, and educate them about the benefits of AWS and all the services we offer, to help them embark on their cloud and AI journey quickly and easily. It is a critical function within the demand progression process, with the objective to profile, nurture, and qualify marketing leads generated from various marketing events, campaigns, and activities. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tBuild an AWS leads database by interacting with customers by phone, email and/or live chat \u003cbr/\u003e\u003cbr/\u003e•\tRespond to customers’ inquiries in a timely manner to accelerate their cloud journey\u003cbr/\u003e\u003cbr/\u003e•\tEducate customers that are in the beginning of the cloud journey and move them from warm or little interest to active interest.\u003cbr/\u003e\u003cbr/\u003e•\tNurture leads with tailored messaging to increase customer understanding of AWS services and unique differentiators with relevant customer use cases. \u003cbr/\u003e\u003cbr/\u003e•\tThrough nurture efforts, create higher value leads resulting in higher conversion rates. \u003cbr/\u003e\u003cbr/\u003e•\tActively leverage AI to catalyze your productivity and globalize any break-through solutions through structured scaling programs.\u003cbr/\u003e\u003cbr/\u003e•\tOpportunity to be part of a team to lead global cross-functional MRC projects, driving operational excellence and better customer experiences. \u003cbr/\u003e","department_cost_center":null,"description_short":"Do you have a desire to make a major contribution to the rapid growth of Cloud Computing and AI? Do you want to build your skills in marketing and sales for long-term career growth? If so, come build the","display_distance":null,"id":"f6d49baf-bdc6-4be8-9f8b-b0ba43fd7532","id_icims":"3147678","is_intern":null,"is_manager":null,"job_category":"Marketing \u0026 PR","job_family":"Marketing","job_function_id":null,"job_path":"/en/jobs/3147678/namer-marketing-response-center-mrc-representative-marketing-response-center","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS22\"],\"normalizedCityName\":\"Austin\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA44\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS16\"],\"normalizedCityName\":\"Arlington\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"December 22, 2025","preferred_qualifications":"- Experience working for Amazon or any Amazon subsidiary or affiliate\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $53,200/year in our lowest geographic market up to $113,700/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-marketing-primary","source_system":"JobCreator","state":"WA","title":"NAMER Marketing Response Center (MRC) Representative, Marketing Response Center","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3147678/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-marketing-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of procurement, supply chain, inventory management, contract management, lease administration or operations experience\u003cbr/\u003e- 5+ years of relevant strategic sourcing including vendor negotiations, global contract management, process improvement, operational and financial analysis experience\u003cbr/\u003e- Bachelor's degree in Supply Chain, Business, Engineering, Finance, or a related technical field\u003cbr/\u003e- Experience with data analysis tools such as Advanced Excel, SQL, Tableau, Python\u003cbr/\u003e- Experience in global supply chain management, managing cross-functional teams in a fast-paced consumer electronics product company","business_category":"alexa-and-amazon-devices","city":"Bellevue","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the capacity, flexibility, and performance to serve a wide range of customers, from individual households to schools, hospitals, businesses, government agencies, and other organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement: Due to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe ideal candidate will have a successful track record developing and executing sourcing strategies, negotiating master agreements and statements of work, and managing supplier performance. Experience working in new and ambiguous environments while solving complex problems with a broad range of cross functional stakeholders will be an advantage.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eJob Responsibilities Include:\u003cbr/\u003e• Wire Harnesses/Connector experience preferred.\t\u003cbr/\u003e• Drive hardware delivery through the product life cycle from requirements development to on-dock (on time at the right quality and cost)\u003cbr/\u003e•Analyze industry trends and evolving technology to proactively identify and execute projects/opportunities to reduce cost, minimize risk, protect continuity of supply, and exploit industry developments that benefit Amazon’s customers\u003cbr/\u003e•Work with a range of stakeholders including business leaders, engineering leaders, legal, program management, and supply chain to negotiate a variety of agreements and contracts including term sheets, MOUs, NDAs, SOWs, development agreements, component purchase agreements and others\u003cbr/\u003e•Influence suppliers' manufacturing processes, technology decisions, and policies in ways that are mutually beneficial and sustainable for both organizations\u003cbr/\u003e•Prioritize projects and activities to deliver maximum cost reductions and reliable supply\u003cbr/\u003e•Manage cross-functional projects against plans and objectives to meet commitments and goals\u003cbr/\u003e•Drive financial modeling of large and complex deals\u003cbr/\u003e•Evaluate and monitor critical supplier performance, including financial health, quality, on-time delivery, and cost \u003cbr/\u003e•Ensure orders are released and on schedule to meet needs of the production system\u003cbr/\u003e•Mentor junior sourcing employees on contract negotiation and vendor management\u003cbr/\u003e•Effectively lead cross-functional meetings with clear document writing, agenda creation, note capture and follow-up activity coordination\u003cbr/\u003e•Proactively identify and mitigate risks to the supply chain \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eHere at Amazon, we embrace our differences. We are committed to furthering our culture of inclusion. Amazon has ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and host annual and ongoing learning experiences. Amazon’s culture of inclusion is reinforced within our 16 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious and earn trust.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded professional and enable them to take on more complex tasks in the future.\u003cbr/\u003e\u003cbr/\u003eInnovation is part of our DNA! Our goal is to be Earth's most customer-centric company, and we are just getting started. We need people who want to join an ambitious program that continues to push the state of the art in space based systems design and wireless systems.\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the","display_distance":null,"id":"fe83713f-d52a-4b5f-8eef-eef82c7c7688","id_icims":"3170234","is_intern":null,"is_manager":null,"job_category":"Procurement","job_family":"Internal Procurement","job_function_id":null,"job_path":"/en/jobs/3170234/global-category-manager-wire-harnesses-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA107\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":["military-spouse","military-adapt","military-na","military","military-leadership","devices-services.kuiper-prod-ops"],"posted_date":"January 30, 2026","preferred_qualifications":"- Master's degree in Business Administration, Finance, Economics, Computer Science, or a related field\u003cbr/\u003e- Experience in program, project, product management, or leading a product implementation process\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Bellevue - 82,700.00 - 139,100.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Global Category Manager - Wire Harnesses, Amazon Leo","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3170234/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of aviation regulatory compliance experience\u003cbr/\u003e- Knowledge of Employee pre-screening for DOT\u003cbr/\u003e- Knowledge of 14 CFR Part 120: Establishes the core FAA requirements for aviation drug and alcohol testing programs\u003cbr/\u003e- Knowledge of 49 CFR Part 40: Mandatory procedures for all DOT drug and alcohol testing\u003cbr/\u003e- Experience conducting Drug \u0026 Alcohol (D\u0026A) Regulatory/Compliance Audits","business_category":"retail","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Prime Air is seeking a compliance specialist with experience in managing FAA-regulated programs to oversee and manage various compliance initiatives for Amazon Prime Air Drone Delivery. In this role you will be responsible for overseeing quality, safety, and regulatory compliance for Prime Air’s drone delivery operations in accordance with FAA (Federal Aviation Administration) and DOT (Department of Transportation) regulations. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAct as the DER (Designated Employer Representative) for Prime Air’s DOT and FAA-regulated drug and alcohol program.\u003cbr/\u003e• Maintain compliance with pilot record review and pilot recordkeeping requirements in accordance with 14 CFR Part 111.\u003cbr/\u003e• Work closely with Flight Standards \u0026 Publications team collaborating on review and approval of Flight operations Manuals and checklists.\u003cbr/\u003e• Ensure continuous monitoring and analysis of operational data for safety, quality, and compliance. \u003cbr/\u003e• On a daily basis, report commercial operations quality, compliance, and technical publication activity stemming from in service fleet operations especially issues impacting delivery performance and efficiency.\u003cbr/\u003e• Ensure compliance with safety, regulatory, and environmental standards across all operational sites.\u003cbr/\u003e• Conduct compliance, safety, and quality audits to ensure compliance with FAA regulations (e.g., Parts 135, 120, 91 etc).\u003cbr/\u003e• Interface and support FAA audits and inspectors.\u003cbr/\u003e• Conduct Audits, report findings, and close audit gaps/findings in a timely fashion by working with cross-functional teams.\u003cbr/\u003e• Report In-Service Quality team's progress in WBR, MBR, QBR forums.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eA day in this role will involve administrating, managing, and enhancing compliance programs required for Prime Air’s Part 135 operations. Regular tasks will include identifying and resolving quality \u0026 compliance issues. This role also involves conducting operational audits and reporting findings during audits. This role requires on-calls shifts and rotations supporting extended hours of delivery operations.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eIn-Service Quality (ISQ) team supports Drone delivery operations supporting Amazon's customer deliveries within 60 minutes. ISQ team helps ensure all the regulatory and compliance requirements from FAA, DOT, and other bodies are met in the context of aviation industry. This team also involves resolving engineering quality issues by working with cross-functional teams.","department_cost_center":null,"description_short":"Prime Air is seeking a compliance specialist with experience in managing FAA-regulated programs to oversee and manage various compliance initiatives for Amazon Prime Air Drone Delivery. In this role you","display_distance":null,"id":"846625e0-166a-4a59-8fa3-b724c09c6a74","id_icims":"3152737","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Risk Family","job_function_id":null,"job_path":"/en/jobs/3152737/in-service-compliance-specialist-in-service-quality-engineering-team","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA109\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"January  5, 2026","preferred_qualifications":"- Bachelor's degree in Mechanical Engineering, Aerospace Engineering, Manufacturing Engineering, or an equivalent field\u003cbr/\u003e- DER (Designated Employer Representative) role for DOT Regulations managing compliance requirements for safety sensitive role.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 97,900.00 - 132,200.00 USD annually","primary_search_label":"retail.team-global-prime-air","source_system":"JobCreator","state":"WA","title":"In Service Compliance Specialist, In Service Quality Engineering Team","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3152737/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-prime-air","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- An Associate’s Degree or related work experience.\u003cbr/\u003e- C1+ or equivalent fluency in English and Spanish.\u003cbr/\u003e- Strong business writing skills with ability to create reports, proposals, and professional correspondence.\u003cbr/\u003e- Advanced reading comprehension with ability to analyze complex business documents.\u003cbr/\u003e- Developed analytical thinking and structured problem-solving capabilities.\u003cbr/\u003e- Strong ability to interpret and implement detailed instructions across various projects.\u003cbr/\u003e- Proficient research skills with experience gathering and synthesizing information from multiple sources.\u003cbr/\u003e- Proven attention to detail in managing complex tasks and documents.","business_category":"amazon-artificial-general-intelligence","city":"Heredia","company_name":"Amazon Support Services Costa Rica SRL","country_code":"CRI","description":"\u003cbr/\u003eAI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment of large language models (LLMs) across all of our businesses. Come build the future of human-technology interaction with us.\u003cbr/\u003eWe are looking for those candidates who just don’t think out of the box, but make the box they are in ‘Bigger’. The future is now, do you want to be a part of it? Then read on!\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eMaintain and follow strict confidentiality as customer privacy is our most important tenet\u003cbr/\u003e• Work with a range of different types of data including, but not limited to: text, speech, audio, image, and video\u003cbr/\u003e• Deliver high-quality labelled data, using guidelines provided to meet our KPIs and using in-house tools and software, as part of Amazon's commitment to developing and deploying AI responsibly.\u003cbr/\u003e• Demonstrate proficiency in generating high quality human insight data across a range of modalities, inclusive of text, image video and audio.\u003cbr/\u003e• Capable of making sound judgments and logical decisions when faced with ambiguous or incomplete information while performing tasks.\u003cbr/\u003e• Eye for detail and ability to pivot from one category of requirement to another instantaneously.\u003cbr/\u003e• Demonstrate support on daily operational deliverables for multiple task types assigned to you and the team\u003cbr/\u003e• Analyze root causes, identify error patterns, and propose solutions to enhance the quality of labeling tasks and their outputs.\u003cbr/\u003e• Responsible for identifying day-to-day process and operational issues in Standard Operating Procedure, tools and suggest changes to unblock operations\u003cbr/\u003e• Demonstrate ownership in floor support to clarify internal queries during execution on need basis\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are looking for a ML Data Associate (MLDA) to undertake the task of foundational labeling functions, such as dialogue evaluation on speech, text, audio, video data.\u003cbr/\u003eYour ability to concentrate, multi-task and your high attention to detail helps you deliver high-quality work as well as maintaining strict confidentiality and follow all applicable Amazon policies for securing confidential information. You will be a part of a diverse team with the shared vision of improving customers’ lives with practical, useful generative AI innovations. An inner drive, individuality, and a creative mind are extremely beneficial.","department_cost_center":null,"description_short":"AI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment","display_distance":null,"id":"f837f08d-38e5-473e-99de-c879118f155a","id_icims":"3139088","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Machine Learning Data Operatio","job_function_id":null,"job_path":"/en/jobs/3139088/ml-data-associate-ii-s-agi-data-services-operations","job_schedule_type":"full-time","location":"CR, H, Heredia","locations":["{\"normalizedStateName\":\"Heredia\",\"normalizedCountryCode\":\"CRI\",\"city\":\"Heredia\",\"countryIso3a\":\"CRI\",\"countryIso2a\":\"CR\",\"locationNonStemming\":\"Costa Rica, H, Heredia\",\"coordinates\":\"9.99969,-84.11717\",\"normalizedCountyName\":\"Heredia\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Costa Rica\",\"normalizedLocation\":\"Heredia, Heredia, CRI\",\"location\":\"CR, H, Heredia\",\"region\":\"H\",\"buildingCodeList\":[\"SJO16\"],\"normalizedCityName\":\"Heredia\"}"],"normalized_location":"Heredia, Heredia, CRI","optional_search_labels":[],"posted_date":"December  8, 2025","preferred_qualifications":"- Bachelor’s degree in a relevant field\u003cbr/\u003e- 2+ years of professional work experience with demonstrated task execution ability\u003cbr/\u003e- Proven capacity to leverage open-source resources effectively for comprehensive research purposes\u003cbr/\u003e- Ability to adapt well to fast-paced environments with changing circumstances, direction, and strategy\u003cbr/\u003e- 2-3 years project coordination or management experience (for support functions teams)\u003cbr/\u003e- Experience managing stakeholder relationships across departments\u003cbr/\u003e- Advanced proficiency in Microsoft Office Suite and common business applications Our inclusive culture empowers Amazonians to deliver the best results for our customers\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":"H","title":"ML Data Associate II - (S),  AGI Data Services - Operations","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3139088/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Oak Creek","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager. In this role, you will lead a team of hourly workforce and will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e\u003cbr/\u003eOur Operation’s workflow has three major components: First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Support, mentor, and motivate your hourly workforce\u003cbr/\u003e* Manage safety, quality, productivity, and customer delivery promises\u003cbr/\u003e* Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e* Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e* Stand/walk for up to 12 hours during shifts\u003cbr/\u003e* Work in an environment where the noise level varies and can be loud\u003cbr/\u003e* Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e* Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e\u003cbr/\u003eOur fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Area Managers based on location preference and the business’ current openings.","department_cost_center":null,"description_short":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager.","display_distance":null,"id":"a02190fe-da25-4114-9dfa-41ba27e0babf","id_icims":"3182897","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3182897/area-manager-ii","job_schedule_type":"full-time","location":"US, WI, Oak Creek","locations":["{\"normalizedStateName\":\"Wisconsin\",\"normalizedCountryCode\":\"USA\",\"city\":\"Oak Creek\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WI, Oak Creek\",\"coordinates\":\"42.89005,-87.91194\",\"normalizedCountyName\":\"Milwaukee\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Oak Creek, Wisconsin, USA\",\"location\":\"US, WI, Oak Creek\",\"region\":\"WI\",\"buildingCodeList\":[\"MKE2\"],\"normalizedCityName\":\"Oak Creek\"}"],"normalized_location":"Oak Creek, Wisconsin, USA","optional_search_labels":[],"posted_date":"February 17, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 20+ employees\u003cbr/\u003e- Experience with process improvements (Lean process, Kaizen, and/or Six Sigma)\u003cbr/\u003e- Excellent customer service, communication, and interpersonal skills\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Industry experience in: retail, F\u0026B, military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WI, Oak Creek - 70,000.00 - 90,900.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"WI","title":"Area Manager II ","university_job":null,"updated_time":"21 minutes","url_next_step":"https://account.amazon.com/jobs/3182897/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}