{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 2+ years of leading multiple Agile teams (like Scrum Masters, Product Owners) concurrently or at scale experience\u003cbr/\u003e- 7+ years of leading and delivering enterprise-level IT engagements experience\u003cbr/\u003e- 5+ years of cloud computing experience\u003cbr/\u003e- Knowledge of the value proposition of the public cloud and cloud engagement delivery (IaaS, PaaS, SaaS)\u003cbr/\u003e- Experience in leading and delivering enterprise-level IT engagements","business_category":"aws","city":"Herndon","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"The Amazon Web Services Professional Services (ProServe) team is seeking a highly skilled and versatile Engagement Manager (EM) to join our team and lead the delivery of complex cloud solution projects. In this role you will combine technical expertise with strong project leadership skills to drive successful implementations of AWS-based solutions for our clients. You will bridge business requirements with technical solutions, facilitating technical discussions and ensuring alignment with customer outcomes. Applying AWS frameworks like Well-Architected and Cloud Adoption Framework while demonstrating technical credibility across diverse stakeholders, you will distill customer needs into clear technical requirements, decompose complex problems, and make informed trade-off decisions considering performance, scalability, security, and business impact.\u003cbr/\u003e\u003cbr/\u003ePossessing strong technology and program/project management experience, you will validate technical solutions against business goals, recognize when additional technical evaluation is needed, and manage technical risks. You will be expected to achieve and maintain relevant AWS certifications, develop domain-specific expertise, and effectively communicate technical concepts to both technical and business audiences. As you progress, you’ll lead increasingly complex technical projects, shape cross-organizational technical strategies, and establish best practices in your domain. In this role you will apply your management and leadership capabilities to successfully execute project plans, proactively identify and manage risks, resolve issues, escalate when appropriate, and drive projects to successful completion, while exceeding customer expectation.\u003cbr/\u003e\u003cbr/\u003eThe AWS Professional Services organization is a global team of experts that help customers realize their desired business outcomes when using the AWS Cloud. We work together with customer teams and the AWS Partner Network (APN) to execute enterprise cloud computing initiatives. Our team provides assistance through a collection of offerings which help customers achieve specific outcomes related to enterprise cloud adoption. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries.\u003cbr/\u003e\u003cbr/\u003eThis position requires that the candidate selected must currently possess and maintain an active TS/SCI security clearance.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs an experienced technology program/project manager, you will be responsible for: \u003cbr/\u003e- Leading and managing complex cloud migration and implementation projects\u003cbr/\u003e- Leveraging comprehensive knowledge of AWS services, architectures, and best practices to guide technical decisions and strategic planning\u003cbr/\u003e- Bridging business requirements with technical solutions, facilitating engineering discussions and ensuring alignment with customer business outcomes\u003cbr/\u003e- Distilling customer needs into clear technical requirements and map them to business outcomes\u003cbr/\u003e- Decomposing complex technical problems into actionable, deliverable solutions\u003cbr/\u003e- Contributing to technical documentation and define documentation standards\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences: AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job below, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture - Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth - We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance - We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.","department_cost_center":null,"description_short":"The Amazon Web Services Professional Services (ProServe) team is seeking a highly skilled and versatile Engagement Manager (EM) to join our team and lead the delivery of complex cloud solution projects.","display_distance":null,"id":"502bef53-9f6f-41b9-9515-a8bf0d6a92d7","id_icims":"3161315","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Professional Services","job_function_id":null,"job_path":"/en/jobs/3161315/senior-engagement-manager-wwps-proserve","job_schedule_type":"full-time","location":"US, VA, Herndon","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS17\"],\"normalizedCityName\":\"Arlington\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD28\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Herndon, Virginia, USA","optional_search_labels":["aws-team-global-services-optional","amazon-cleared-jobs"],"posted_date":"January 16, 2026","preferred_qualifications":"- 5+ years of delivering customer engagements in a professional services role experience\u003cbr/\u003e- active project management certification (e.g., APM, CSM, PMI-ACP, PRINCE2)\u003cbr/\u003e- AWS certification\u003cbr/\u003e- Experience in delivering customer engagements in a professional services role\u003cbr/\u003e- Experience with Agile and project management toolsets like Jira, Rally, VersionOne or Taiga\u003cbr/\u003e- Experience working with and presenting to C-level executives, IT, and lines of businesses across organizations or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Arlington - 153,600.00 - 207,700.00 USD annually\u003cbr/\u003eUSA, VA, Herndon - 153,600.00 - 207,700.00 USD annually","primary_search_label":"aws.team-us-security-clearance-jobs-primary","source_system":"JobCreator","state":"VA","title":"Senior Engagement Manager, WWPS ProServe","university_job":null,"updated_time":"1 minute","url_next_step":"https://account.amazon.com/jobs/3161315/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-us-security-clearance-jobs-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- 1+ year of experience in any of the following or similar technical or vocational roles: Computer Hardware Repair, Infrastructure Cabling, Network Deployment, Data Center Operations, Technical Project Management","business_category":"aws","city":"Avondale","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon is looking for an Infrastructure Delivery Installation Technician to join our growing team within infrastructure operations. You will work with minimum supervision in a dynamic environment to drive the stability and sustainability of our next-generation networks and assist in the development of innovative ways to automate and scale our network.\u003cbr/\u003e\u003cbr/\u003eTo be successful in this role you should possess technical aptitude, written and oral communications skills and the ability to deal effectively with people in a wide variety of situations. In addition, you must possess strong analytical skills with demonstrated problem solving ability. You will be able to leverage your experience exercising high levels of initiative, judgment, and diplomacy.\u003cbr/\u003e\u003cbr/\u003eAdditionally, all candidates should be willing to work both independently and with a team. Work prioritization, organizational skills, effective communication, and the ability to react quickly are critical to being successful.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Moving and implementing large enterprise equipment\u003cbr/\u003e- Installing Fiber and Copper cabling and patching cabling between equipment\u003cbr/\u003e- Ensuring proper safety and security standards are maintained during cabling and rack installation, \u003cbr/\u003e- Following well established hardware installation procedures and break-fix activities\u003cbr/\u003e- Safely using material handling tools and equipment\u003cbr/\u003e- Traveling within and outside of regional work area is required. You will be responsible for having a reliable personal vehicle and valid driver's license to travel within the regional work area, as company transportation will not be provided\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is committed to a diverse and inclusive workplace to deliver the best results for our customers. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status; we celebrate the diverse ways we work. For individuals with disabilities who would like to request an accommodation, please let us know and we will connect you to our accommodation team. You may also reach them directly by visiting please https://www.amazon.jobs/en/disability/us.\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"5ab9db87-0b05-49c6-b351-eadfbd4cb6b0","id_icims":"3095503","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3095503/network-install-technician-infrastructure-delivery","job_schedule_type":"full-time","location":"US, AZ, Avondale","locations":["{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Avondale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Avondale\",\"coordinates\":\"33.44096,-112.34966\",\"normalizedCountyName\":\"Maricopa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Avondale, Arizona, USA\",\"location\":\"US, AZ, Avondale\",\"region\":\"AZ\",\"buildingCodeList\":[\"PHX69\"],\"normalizedCityName\":\"Avondale\"}"],"normalized_location":"Avondale, Arizona, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"November 14, 2025","preferred_qualifications":"- Industry standard certifications (CompTIA, CCENT, Network+)\u003cbr/\u003e- Knowledge of network cabling, optic types, and test equipment\u003cbr/\u003e- Experience with cabling infrastructure best practices and methodologies\u003cbr/\u003e- Experience with medium to large, complex project scopes and ambiguous details within work environment\u003cbr/\u003e- Knowledge of major Command Line Protocols (Cisco IOS, JunOS, GNU/Linux) and common Networking Protocols (BGP, OSPF)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, AZ, Avondale - 27.00 - 47.00 USD hourly","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"AZ","title":"Network Install Technician, Infrastructure Delivery","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3095503/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-and-operations","city":"Hyderabad","company_name":"ASSPL - Telangana","country_code":"IND","description":" Amazon.com, Inc. is a US-based multinational electronic commerce company headquartered in Seattle, Washington. Jeff Bezos founded Amazon.com, Inc. in 1994 and launched it online in 1995. Amazon.com started as an online bookstore, but soon diversified, selling DVDs, CDs, MP3 downloads, computer software, video games, electronics, apparel, furniture, food, and toys. Amazon has established separate websites in Canada, the United Kingdom, Germany, France, Italy, Japan, and China. Today, as a market leader in online retail, Amazon product lines include Amazon.com, A9.com, IMDb, Kindle, Amazon Web Services, Alexa.com, Audible.com, A2Z Development, Alexa Internet and Endless.com.\u003cbr/\u003e  At Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is one of the most recognizable brand names in the world and we distribute millions of products each year to our loyal customers. Amazon has great opportunities to pursue a career as a leader in Operations Management. We know that learning through experience is what transforms talented people into great leaders. Our roles are designed to accelerate the growth of leaders through challenging field experiences that stretch individual capability. Our Operations environment presents the candidates with great challenges in dealing with front line management, and driving scalable and continuous improvements across our Fulfillment Centers, Supply Chain \u0026 Transportation execution teams.\u003cbr/\u003e  Amazon is seeking a Channel Relationship Management to work with our Last Mile Team managing end to end station operations and channel partner management.\u003cbr/\u003e  Primary Responsibilities\u003cbr/\u003e  ·       Act as the custodian of the processes \u0026 SOPs for the allotted program and consistently challenge and innovate to improvise the existing ones. Provide out of the box solutions for to enhance quality standards, reduce waste, and eliminate unnecessary work.\u003cbr/\u003e  ·       Primarily responsible for coordinating with cross-functional teams and vendors to deliver customer orders through the last mile network.\u003cbr/\u003e  ·       Responsible for in-bound, outbound, delivery, returns and forward leg pick-ups, capacity utilization , network optimization \u0026 contingency planning.\u003cbr/\u003e  ·       Ensure high all around performance in quality and customer experience through our last-mile delivery and pick-up operations.\u003cbr/\u003e  ·       Liaise with training teams to develop and update training materials on an ongoing basis to incorporate the latest relevant content for transition to a problem-solving culture. \u003cbr/\u003e  ·       Ensure new processes are communicated to relevant stakeholders and implemented in a timely manner and are standardized across locations. Perform continuous process evaluation to ensure sustainment\u003cbr/\u003e  ·       Ensure a data driven approach to solve problems and to develop solutions to reduce losses and optimize operational cost.\u003cbr/\u003e\u003cbr/\u003eAdditional responsibilities may include:\u003cbr/\u003e · Developing standard operating procedures.\u003cbr/\u003e · Direct accountability for setting and meeting operational goals, strategic planning and forecasting\u003cbr/\u003e · Leading process improvements\u003cbr/\u003e  \u003cbr/\u003e Demonstrated Abilities: \u003cbr/\u003e We are looking for smart and analytical people, who are passionate about operations, to join the Operations team at Amazon India. This role is for those candidates who thrive on driving change, building an organization and leading through others, by giving them a direct management assignment in our Operations Services and Technology Centers. Ideal candidates for this program are expected to leverage their strong analytical skills, communication, and think big.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eProcess \u0026 SOP Ownership\u003cbr/\u003eServe as the custodian of all processes and SOPs for the assigned program. Continuously challenge, refine, and innovate existing workflows to enhance quality, reduce waste, and eliminate non-value-added activities through creative, out-of-the-box solutions.\u003cbr/\u003e\u003cbr/\u003eCross-Functional Coordination\u003cbr/\u003eCollaborate with internal teams and external stakeholders to ensure seamless execution of last-mile operations and timely delivery of customer orders.\u003cbr/\u003e\u003cbr/\u003eEnd-to-End Operations Management\u003cbr/\u003eOversee in-bound, outbound, delivery, returns, forward-leg pick-ups, capacity utilization, network optimization, and contingency planning to drive operational efficiency.\u003cbr/\u003e\u003cbr/\u003ePartner Management\u003cbr/\u003eManage relationships with delivery partners and vendors to ensure alignment with performance standards, compliance requirements, and capacity needs. Drive accountability, monitor performance metrics, and enable partners with support and guidance to meet operational goals.\u003cbr/\u003e\u003cbr/\u003eQuality \u0026 Customer Experience Excellence\u003cbr/\u003eDrive high performance in quality metrics and customer experience across last-mile delivery and pick-up operations.\u003cbr/\u003e\u003cbr/\u003eTraining \u0026 Capability Building\u003cbr/\u003eWork with training teams to develop, improve, and update training materials, embedding a culture of problem-solving and continuous learning across the network.\u003cbr/\u003e\u003cbr/\u003eData-Driven Problem Solving\u003cbr/\u003eUse data insights and analytics to identify root causes, reduce losses, improve productivity, and optimize operational costs through structured problem-solving.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eReviews previous day’s metrics across inbound, outbound, delivery, returns, and customer experience.\u003cbr/\u003eLeads the Daily Business Review (DBR) to discuss performance gaps, root causes, capacity, and action plans.\u003cbr/\u003eCoordinates with cross-functional teams and delivery partners to ensure smooth last-mile operations.\u003cbr/\u003eMonitors real-time execution, resolves escalations, and activates contingency plans when required.\u003cbr/\u003eEnsures SOP adherence, drives process standardization, and evaluates improvement opportunities.\u003cbr/\u003eWorks with training teams to update materials and reinforce a problem-solving culture.\u003cbr/\u003eEnds the day by updating dashboards, tracking actions, and preparing insights for the next DBR.","department_cost_center":null,"description_short":" Amazon.com, Inc. is a US-based multinational electronic commerce company headquartered in Seattle, Washington. Jeff Bezos founded Amazon.com, Inc. in 1994 and launched it online in 1995. Amazon.com started","display_distance":null,"id":"aa98e179-06bd-4c4d-9aff-72e77f5066c5","id_icims":"3137089","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3137089/channel-relationship-manager-amzl-last-mile-hyt2","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYT2\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"December  4, 2025","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-last-mile-delivery","source_system":"JobCreator","state":"TS","title":"Channel Relationship Manager, AMZL (Last Mile) - HYT2","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3137089/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-delivery","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"Master’s degree or foreign equivalent degree in Engineering, Computer Science, or a related field and 2 years of experience in the job offered or a related occupation. In the alternative, employer will accept a Bachelor’s degree or foreign equivalent degree in Engineering, Computer Science, or a related field followed by 5 years of progressively responsible postbaccalaureate experience in the job offered or a related occupation. \u003cbr/\u003e\u003cbr/\u003eExperience must include: \u003cbr/\u003e1) 2 years of experience with emerging technologies, related to infrastructure (i.e. build environment, network, data center, hardware, software) \u003cbr/\u003e2) 2 years of experience using design engineering and drafting tools such as AutoCAD and Bluebeam. \u003cbr/\u003e3) 2 years of experience with advanced Excel including Pivot Tables \u003cbr/\u003e4) 2 years of experience with project engineering, process engineering, project management or manufacturing engineering \u003cbr/\u003e\u003cbr/\u003eThe pay range for this position in Seattle, WA is $148,700 - $201,200 (yr); however, base pay offered may vary depending on job-related knowledge, skills, and experience A sign-on bonus and restricted stock units may be provided as part of the compensation package, in addition to a full range of medical, financial, and/or other benefits, dependent on the position offered. This information is provided by Seattle, WA Equal Pay Act. Base pay information is based on market location. Applicants should apply via Amazon's internal or external careers site.\u003cbr/\u003e\u003cbr/\u003e","business_category":"no-business-category","city":"Seattle","company_name":"Amazon Data Services, Inc. - A19","country_code":"USA","description":"Employer: Amazon Data Services, Inc. \u003cbr/\u003ePosition: Tech Infra Program Manager III \u003cbr/\u003eLocation: Seattle, Washington \u003cbr/\u003e\u003cbr/\u003eMultiple Positions Available: \u003cbr/\u003e\u003cbr/\u003e1. Oversee various data center power maximization programs. \u003cbr/\u003e2. Partner with cross-functional and technical teams to create optimization recommendations, design solutions, and drive project delivery. \u003cbr/\u003e3. Partner with electrical and mechanical engineers across engineering and design engineering teams to define and implement space and design configurations that maximize resource utilization. \u003cbr/\u003e4. Fully own and manage AWS long range energy forecasts, and partner with customers across Renewable Energy, Infrastructure Energy, Finance, and REC Procurement teams to capture evolving use cases and business requirements. \u003cbr/\u003e5. Work with software development and science teams to make enhancements and continuous improvements in energy forecast generation. \u003cbr/\u003e6. Partner with engineering in tracking and forecasting which DC sites and phases require advanced mechanical cooling equipment installation, and when, to meet supportability commitments.\u003cbr/\u003e\u003cbr/\u003e(40 hours / week, 8:00am-5:00pm, Salary Range $148,700/year - $201,200/year\u003cbr/\u003e\u003cbr/\u003eAmazon.com is an Equal Opportunity – Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Employer: Amazon Data Services, Inc. Position: Tech Infra Program Manager III Location: Seattle, Washington Multiple Positions Available: 1. Oversee various data center power maximization programs. 2.","display_distance":null,"id":"cb897cc3-d7c1-43db-b55f-5faecb7553b1","id_icims":"3148515","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Tech Infrastructure Prgrm Mgmt","job_function_id":null,"job_path":"/en/jobs/3148515/tech-infra-program-manager-iii-amz13280-12","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA84\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"December 23, 2025","preferred_qualifications":"All applicants must meet all the above listed requirements.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"WA","title":"Tech Infra Program Manager III - AMZ13280.12","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3148515/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of Microsoft Office products and applications experience\u003cbr/\u003e- High school or equivalent\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- Can lift up to 49 pounds, stand/walk during shifts lasting up to 12 hours, and be able to frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Work 40 hours/week, and overtime as required","business_category":"fulfillment-ops","city":"Jeddah","company_name":"Afaq - Warehouse Branch","country_code":"SAU","description":"As a Supervisor, you’ll strive to plan beyond your own needs, ensuring the sufficient resourcing of your function. This will include identifying training needs, staying on top of absence \u0026 performance management, as well as coaching and continuous monitoring of your department to engender a greater culture of productivity. Supervising day-to-day activities with responsibility for the overall safety, quality and performance and member experience of either Inbound or Outbound FC operations; Setting and clarifying departmental requirements and expectations while creating an environment of teamwork, collaboration and open communication; Understanding safety procedures, ensuring safe working practices and documenting accidents/incidents timely; Prioritizing appropriately meeting deadlines; Exhibiting professional behavior while coping well with ambiguity and change; Driving results and approaching obstacles proactively; Ensuring company policies are communicated and enforced consistently; Sourcing and nurturing ideas and rolling them into the creation of improvement plans; Taking proactive steps to ensure that best practices are shared across all departments, shifts and within the entire organization; Working closely with (HR, Facilities, Safety and IT) to build and secure support and resources for projects and initiatives; Tracking production metrics and utilizing data to develop strategies for continuous improvement and reporting to management; Assisting with the establishment of long-term operational strategic plans; Mentoring, providing training and development to optimize performance, creating organizational depth and individual growth; Recognizing top performance, coaching and progressive discipline for poor performance; Proposing and implementing improvements in equipment and processing methods; Conducting timecard review daily and weekly to ensure pay accuracy; Performing other duties with flexibility as assigned, rotating to other shifts/departments and working extended hours and holidays as needed including an expectation to arrive at least 30 minutes early and remaining at least 30 minutes at end of shift to complete pass downs, reports and timecard reviews.","department_cost_center":null,"description_short":"As a Supervisor, you’ll strive to plan beyond your own needs, ensuring the sufficient resourcing of your function. This will include identifying training needs, staying on top of absence \u0026 performance","display_distance":null,"id":"243dbbac-e1ac-43dd-a69d-ee93fddadc64","id_icims":"3157866","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3157866/icqa-supervisor-amet-icqa","job_schedule_type":"full-time","location":"SA, 02, Jeddah","locations":["{\"normalizedCountryCode\":\"SAU\",\"city\":\"Jeddah\",\"countryIso3a\":\"SAU\",\"countryIso2a\":\"SA\",\"locationNonStemming\":\"Saudi Arabia, 02, Jeddah\",\"coordinates\":\"21.4817,39.1828\",\"normalizedCountyName\":\"Makkah\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Saudi Arabia\",\"normalizedLocation\":\"Jeddah, SAU\",\"location\":\"SA, 02, Jeddah\",\"region\":\"02\",\"buildingCodeList\":[\"JED4\"],\"normalizedCityName\":\"Jeddah\"}"],"normalized_location":"Jeddah, SAU","optional_search_labels":[],"posted_date":"January 13, 2026","preferred_qualifications":"- Honest with highest integrity; Dedicated to quality and high standards; Supportive of values following policies and procedures; Positive, ambitious, energetic, hardworking with a strong work ethic; A team player valuing co-worker's opinions treating everyone with courtesy and respect; Able to communicate effectively and take direction; Dependable, responsible, reliable and mature; Exceptional listener who is well organized and has an eye for detail; Able to work in a team environment, provide honest and direct feedback; Able to handle ambiguity, changing priorities and use good judgment in stressful situations; Experienced with performance metrics; Analytical with problem solver abilities; Self-motivated, structured, accurate, result driven, ready to improve and open to change; Proven history of illustrating a dedication to meeting requirements of internal and external customers, responding to all requests promptly, thoroughly and timely; Ability to multi-task, handling multiple issues; Experienced in MS Office, other operating systems, warehousing systems and applications such as Warehouse Management Systems (Highjump); Able to work in a fulfillment center environment that may be noisy, walking and standing for long periods of time, lifting up to 50 pounds, bending and using mechanical equipment as part of production activities; Flexible to work a variety of hours as the business demands, including overnight, weekends and holidays.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"02","title":"ICQA Supervisor, AMET ICQA","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3157866/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- 4+ years of work in a management position with 5 or more direct reports experience\u003cbr/\u003e- 5+ years of data center or mission critical facilities (example: hospital, military facility, public safety facility, etc.), or 2+ years of electrical or mechanical experience","business_category":"aws","city":"Sterling","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support the operations of some of the world’s most powerful data centers. Our Data Center Engineering Operations team maintain and operate our critical infrastructure systems so that they are prepared to stand up against any situation.\u003cbr/\u003e\u003cbr/\u003eAWS has the world’s largest cloud computing portfolio. As an Amazonian you will work in some of the most sophisticated, safe, and secure data centers in the world. Our Facility Managers help keep them that way by working with the brightest minds from around the globe to help test and implement the newest technology and work practices to meet the demands of a changing market.\u003cbr/\u003e\u003cbr/\u003eWe have a passion for learning and evolving, it’s how we have helped define ourselves as leaders in the industry. Let’s work hard, have fun, and make history!\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Oversee all aspects of the data center’s critical physical infrastructure. Maintain high availability and performance while ensuring that all work performed within the site is done to high quality without impact to internal/external customers and maintain service level agreements.\u003cbr/\u003e- Manage on-site teams of 24x7 shift technicians, sub-contractors and vendors ensuring that all work performed is in accordance with established practices, procedures and safety protocols.\u003cbr/\u003e- Drive safety and security culture and compliance within the team\u003cbr/\u003e- Hire, coach, and promote team members. Responsible for team's career development and performance management\u003cbr/\u003e- Promotes healthy team culture and peak morale\u003cbr/\u003e- Effectively and efficiently manage the operations budget and expenditures.\u003cbr/\u003e- Engage in improvement projects, often requiring reaching out to a variety of support teams, and drive them from conception to completion.\u003cbr/\u003e- Act as an escalation point for all facilities-related issues. Oversee operation and management of routine and emergency services on a variety of critical systems such as: switchgear, generators, UPS systems, power distribution equipment, chillers, cooling towers, computer room air handlers, building monitoring systems, etc.\u003cbr/\u003e- Utilize root cause analysis and troubleshooting/problem solving skills\u003cbr/\u003e- Respond to out-of-hours emergency calls.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e- May assist in the build out of new facilities and assist in projects to increase current facility efficiency\u003cbr/\u003e- Utilize Microsoft Excel, Word, Outlook and other basic administrative tools to perform day to day tasks\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are seeking an energetic Data Center Facility Manager to serve as a technical resource and leader within Amazon data centers. The position will help ensure overall availability and reliability to meet or exceed defined service levels of data center operations. The Data Center Facility Manager will oversee operations and management of technicians responsible for routine and emergency services on a variety of critical systems such as: switch gear, generators, UPS systems, power distribution equipment, chillers, cooling towers, computer room air handlers, building monitoring systems, etc. They will assist in maintaining a high reliability and performance while keeping operating costs in facilities at a minimum. This equipment supports mission-critical servers and must maintain better than 99.999% uptime.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e","department_cost_center":null,"description_short":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support the operations of some of the world’s most powerful data centers.","display_distance":null,"id":"af250ed9-6ba2-4b8a-9ac9-86611ba21822","id_icims":"3148252","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3148252/data-center-facility-operations-manager","job_schedule_type":"full-time","location":"US, VA, Sterling","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sterling\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Sterling\",\"coordinates\":\"39.03336,-77.40713\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sterling, Virginia, USA\",\"location\":\"US, VA, Sterling\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD83\"],\"normalizedCityName\":\"Sterling\"}"],"normalized_location":"Sterling, Virginia, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"December 23, 2025","preferred_qualifications":"- Advanced electrical or mechanical certifications (Bachelor's degree or higher in a relevant engineering discipline)\u003cbr/\u003e- 5+ years of experience in a management position with 5 or more direct reports\u003cbr/\u003e- 7+ years of experience working in a data center or other mission critical environment with an emphasis on building and equipment operation\u003cbr/\u003e- An excellent understanding of the electrical and mechanical systems involved in critical data center operations including systems such as feeders, transformers, generators, switchgear, UPS systems, ATS units, PDU units, chillers, pumps, air handling units, and CRAHU units\u003cbr/\u003e- Strong verbal and written communication skills, technical writing or business justifications (white paper experience)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Sterling - 132,600.00 - 198,100.00 USD annually","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"VA","title":"Data Center Facility Operations Manager","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3148252/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Work 40 hours/week throughout the course of a 12-week summer internship\u003cbr/\u003e- Are 18 years of age or older\u003cbr/\u003e- Currently enrolled in a communications, journalism, public relations, English, electronic/digital media, or similar bachelor’s degree program with a graduation conferral date between December 2026 and June 2027.","business_category":"studentprograms","city":"Seattle","company_name":"Amazon.com Services LLC - A57","country_code":"USA","description":"Please note the following eligibility requirements to apply for this role: \u003cbr/\u003e• Graduate from Bachelor's degree program between December 2026 and June 2027. \u003cbr/\u003e• Ability to relocate to Culver City, CA, USA or Seattle, WA, USA. Relocation assistance provided, if eligible. \u003cbr/\u003e• Ability to complete 12-week internship between May–August 2026. \u003cbr/\u003e• We are unable to offer visa sponsorship for this role. \u003cbr/\u003eFor more information, please visit https://amazon.jobs/content/en/faq/university-talent .\u003cbr/\u003e\u003cbr/\u003eAmazon’s Communications \u0026 Corporate Responsibility (CCR) organization invites undergraduate students in their junior year to join us for a rewarding, paid 12-week summer internship. This is the opportunity you’re looking for if you have a passion for learning about corporate communications (public relations, messaging strategy, social media, employee communications, and much more); a desire to explore and learn what it takes to deliver communications at a global scale; and thorough attention to detail. We’re looking for candidates who want to share their diverse perspectives and experiences (whether from life, school, or prior work) to help us deliver high-quality communications on behalf of Amazon. \u003cbr/\u003e\u003cbr/\u003eDuring your summer internship, your responsibilities may include working with media/journalists, analyzing news coverage, writing company communications, developing content for Amazon news channels (e.g., aboutamazon.com) and social media channels (e.g., @insideamazon), drafting communication strategy, or supporting company events. Your internship will include one or more communication projects that you get to own and then recap your learnings and recommendations for CCR leaders. Along the way, you’ll build valuable relationships with fellow interns, tenured communications professionals, and leaders from across the CCR organization. \u003cbr/\u003e\u003cbr/\u003eCCR is comprised of hundreds of communications professionals around the globe. We are responsible for informing customers, employees, media, and policymakers about Amazon’s unique culture of innovation and customer centricity. CCR aims to continuously strengthen Amazon’s reputation and trust with customers by educating the world about Amazon’s products and services, and how we support employees, small businesses, partners, content creators, developers, communities, environment, and economies where we operate. Learn more about the communications and stories we share on behalf of Amazon at https://www.aboutamazon.com/. \u003cbr/\u003e","department_cost_center":null,"description_short":"Please note the following eligibility requirements to apply for this role: • Graduate from Bachelor's degree program between December 2026 and June 2027. • Ability to relocate to Culver City, CA, USA or","display_distance":null,"id":"99094d18-d3bf-4158-bf91-88ca2d732cdc","id_icims":"3127134","is_intern":null,"is_manager":null,"job_category":"PR","job_family":"Public Relations","job_function_id":null,"job_path":"/en/jobs/3127134/2026-amazon-communications-assistant-summer-internship","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA41\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"November 15, 2025","preferred_qualifications":"- Strong organizational and time management skills.\u003cbr/\u003e- Effective interpersonal communication skills-written and verbal.\u003cbr/\u003e- Effective and comfortable collaborating with colleagues of diverse backgrounds and varying levels of seniority.\u003cbr/\u003e- Motivated self-starter who can work well autonomously.\u003cbr/\u003e- Strong academic, leadership, and/or extracurricular record.\u003cbr/\u003e- Previous work, internship, and/or other leadership experience in communications.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 80,200.00 - 100,500.00 USD annually","primary_search_label":"studentprograms.team-internships-for-students","source_system":"JobCreator","state":"WA","title":"2026  Amazon Communications Assistant Summer Internship","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3127134/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-internships-for-students","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience with prototyping and implementation\u003cbr/\u003e- 5+ years of experience with Electrical Ground Support Equipment development, test and daily usage\u003cbr/\u003e- 1+ years of experience with electrical harness development, fabrication, and test\u003cbr/\u003e- 1+ years of experience automating testing with Python or other programming languages\u003cbr/\u003e- 1+ years of experience with instrumentation systems (vibration, temperature, humidity, etc)\u003cbr/\u003e- Able to stand for long periods of time and perform repetitive assembly and test operations\u003cbr/\u003e- Able to climb and down ladders, work in tight spaces, bending, grasping, sitting, pulling, pushing, stooping, and stretching may be required to perform the functions of this position.\u003cbr/\u003e- Able to lift at least 25 lbs. unassisted\u003cbr/\u003e- Able to obtain and maintain a US Passport and Must meet customs entry requirements to include but not limited to: Yellow Fever vaccine and other immunization requirements as recommended by the U.S. Centers for Disease Control and Prevention\u003cbr/\u003e- Able to pass Kennedy Space Center background checks","business_category":"alexa-and-amazon-devices","city":"Merritt Island","company_name":"Amazon Kuiper Infrastructure LLC","country_code":"USA","description":"Amazon Leo is an initiative to launch a constellation of Low Earth Orbit satellites that will provide low-latency, high-speed broadband connectivity to unserved and underserved communities around the world.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement: Due to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eThe Hardware Development Engineer will be responsible for the design, build, commissioning, and support of payload processing technology used throughout the payload processing facility. Examples include cable harnessing, test/instrumentation racks, outdoor equipment enclosures, informational displays, and equipment monitoring systems. This individual will work closely with space/launch vehicle design teams, quality teams, vendors, and launch processing teams to ensure on-time delivery and successful operation of payload processing equipment.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tParticipate in a matrixed team of engineers to support multiple processing facilities and launch sites\u003cbr/\u003e•\tSpecify and procure various test and support equipment and systems to meet program development, calibration, and maintenance requirements\u003cbr/\u003e•\tAutomate test and data collection processes utilizing Python or other programming languages\u003cbr/\u003e•\tDefinition and implementation of Work Order and automated documentation processes\u003cbr/\u003e•\tAnomaly resolution and corrective action implementation\u003cbr/\u003e•\tTypically 1st shift, however shift schedule will vary depending on production/launch operation schedules\u003cbr/\u003e•\tRotating on-call support for second and third shift operations\u003cbr/\u003e•\tMust be willing and able to perform extended travel up to 25% annually, either domestically or internationally as business needs demand\u003cbr/\u003e•\tAble to obtain and maintain a US Passport \u0026 must meet customs entry requirements to include but not limited to: Yellow Fever vaccine and other immunization requirements as recommended by the U.S. Centers for Disease Control and Prevention\u003cbr/\u003e•\tAbility to pass Kennedy Space Center background checks\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThe Hardware Development Engineer will spend significant amounts of time collaborating with engineering, quality, and manufacturing teams in support of satellite processing, test, and charging operations in the payload processing facility and at various launch sites. They will be responsible for test rack support equipment development, maintenance/upgrade of existing equipment, automation, and process monitoring. They will implement engineering best practices in a safe and repeatable manner, implementing efficiency improvements and reducing non-conformances.\u003cbr/\u003e\u003cbr/\u003eWe are a fast-paced, data-driven team and work with leaders in multiple technology areas to deliver the best product for our customers. We hold each other to relentlessly high standards, and constantly look for ways to improve the product’s performance, quality and cost. We are excited about the technical challenges, which motivates us rather than discourages us.\u003cbr/\u003e\u003cbr/\u003eWe want individuals who are ready for this challenge and want to reach beyond what is possible today.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eHere at Amazon, we embrace our differences. We are committed to furthering our culture of inclusion. Amazon has ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and host annual and ongoing learning experiences. \u003cbr/\u003e\u003cbr/\u003eAt Amazon, our mission is to be the most customer-centric company on Earth. To get there, we need exceptionally talented, bright and driven people. We're dedicated to supporting new team members. Our team has a broad mix of experience levels and Amazon tenures, and we’re building an environment that celebrates knowledge sharing and mentorship.","department_cost_center":null,"description_short":"Amazon Leo is an initiative to launch a constellation of Low Earth Orbit satellites that will provide low-latency, high-speed broadband connectivity to unserved and underserved communities around the world.Export","display_distance":null,"id":"a8460b7c-0b66-4fef-9e2b-e1297877d0c5","id_icims":"3109402","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/3109402/hardware-development-engineer-payload-processing-technologies-amazon-leo","job_schedule_type":"full-time","location":"US, FL, Merritt Island","locations":["{\"normalizedStateName\":\"Florida\",\"normalizedCountryCode\":\"USA\",\"city\":\"Merritt Island\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, FL, Merritt Island\",\"coordinates\":\"28.35709,-80.68596\",\"normalizedCountyName\":\"Brevard\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Merritt Island, Florida, USA\",\"location\":\"US, FL, Merritt Island\",\"region\":\"FL\",\"buildingCodeList\":[\"MCO13\"],\"normalizedCityName\":\"Merritt Island\"}"],"normalized_location":"Merritt Island, Florida, USA","optional_search_labels":["devices-services.kuiper-prod-ops"],"posted_date":"October 15, 2025","preferred_qualifications":"- Bachelor's degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent work experience\u003cbr/\u003e- Experience working with networking fundamentals or Internet protocols such as TCP/IP, UDP, SSL, DNS, HTTP/S, or equivalent\u003cbr/\u003e- Experience with scripting (e.g. Python, PowerShell)\u003cbr/\u003e- Experience with network equipment installation and configuration\u003cbr/\u003e- Experience with the project management of technical projects\u003cbr/\u003e- IPC/WHMA-A-620 certification\u003cbr/\u003e- Experience with automated cable testing\u003cbr/\u003e- Knowledge of NFPA 70 National Electric Code\u003cbr/\u003e- Highly familiar with QTP/ATP and production test methods, and automated data acquisition and collection\u003cbr/\u003e- Strong organizational, analytical, root cause analysis and problem-solving skills\u003cbr/\u003e- Excellent communication and leadership skills\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, FL, Merritt Island - 117,300.00 - 160,000.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"FL","title":"Hardware Development Engineer - Payload Processing Technologies, Amazon Leo","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3109402/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of technical product or program management experience\u003cbr/\u003e- 7+ years of working directly with engineering teams experience\u003cbr/\u003e- Experience managing programs across cross functional teams, building processes and coordinating release schedules\u003cbr/\u003e- Bachelor's degree in Mechanical, Electrical, Aerospace Engineering or related field\u003cbr/\u003e- Ability to communicate clearly and effectively with engineers, key vendors, and senior business leaders.\u003cbr/\u003e- Demonstrated strong ownership, urgency to drive projects to closure, and desire to learn in a dynamic environment\u003cbr/\u003e- Experience with schedule tracking and Program Management tools such as SmartSheet, Jira, and Confluence.\u003cbr/\u003e- Ability to pass Kennedy Space Center background checks\u003cbr/\u003e- Ability to obtain and maintain a US Passport\u003cbr/\u003e- Ability to comply with the Government of French Guiana mandate that travelers receive vaccinations for yellow fever.\u003cbr/\u003e- Must be able to lift up to 49 pounds on some occasions, stand/walk for up to 8-10 hours (with breaks), and able to frequently push, pull, squat, bend, and reach.","business_category":"alexa-and-amazon-devices","city":"Merritt Island","company_name":"Amazon Kuiper Infrastructure LLC","country_code":"USA","description":"Amazon Leo is an initiative to launch a constellation of Low Earth Orbit satellites that will provide low-latency, high-speed broadband connectivity to unserved and underserved communities around the world.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement: Due to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eThe Amazon Leo team is looking for a Mission Integration Engineer to serve as the Launch Campaign Lead, owning the coordination and integration of payload and launch vehicle combined operations from launch vehicle hardware ingress into the payload processing facility through launch. This role ensures seamless execution of all mission-critical activities at the launch site by interfacing with payload teams, launch providers, range operations, and other stakeholders. Join us and make a difference to people around the world!\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eCampaign Leadership\u003cbr/\u003e- Drive end-to-end operational flow, from payload processing and encapsulation to launch vehicle integration and final countdown execution.\u003cbr/\u003e- Lead scheduling of mission ground operations activities, ensuring facility access, resource availability, and milestone alignment.\u003cbr/\u003eCross-Team Coordination\u003cbr/\u003e- Conduct daily stand-ups with launch providers, keeping Mission Managers (MM) and key stakeholders informed for awareness.\u003cbr/\u003e- Participate in Joint Operations Readiness Reviews (JORRs) and Encapsulation Readiness Reviews (ERRs) with launch providers to confirm readiness for major milestones.\u003cbr/\u003e- Coordinate with Kennedy Space Center (KSC) operations teams for site-specific requirements and resources.\u003cbr/\u003eOperations Execution\u003cbr/\u003e- Oversee execution of work orders (WOs), including set-up, hardware movement, and facility coordination.\u003cbr/\u003e- Manage logistics and equipment ingress/egress, ensuring compliance \u0026 deliverables with respect to contamination control and cleanroom standards for joint operations.\u003cbr/\u003e- Coordinate Material Handling Equipment (MHE) and crane certifications for safe payload and hardware movements.\u003cbr/\u003e- Ensure proper staffing and engineering floor support during critical operations and campaign shifts.\u003cbr/\u003eSafety, Training \u0026 Access\u003cbr/\u003e- Manage badging, site access, and required safety training for all campaign participants.\u003cbr/\u003e- Enforce safety standards during payload and launch vehicle operations, ensuring all certifications are current and risks mitigated.\u003cbr/\u003eOperational Communication\u003cbr/\u003e- Provide timely updates to internal and external teams, covering changes, issues, completions, and key timing.\u003cbr/\u003e- Act as the primary payload representative on the launch provider operations floor, resolving issues in real time.\u003cbr/\u003eAnomaly Resolution \u0026 Mission Assurance\u003cbr/\u003e- Lead root cause investigations in collaboration with launch providers.\u003cbr/\u003e- Drive closure of issues and integrate resolution paths into the campaign schedule to minimize impact on launch readiness.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eA day in the life of a Mission Integration Engineer begins with leading a morning stand-up with the launch provider to review the day’s schedule, identify risks, and align teams.  From there, the engineer coordinates facility access, logistics, and equipment movement, ensuring cleanroom conditions and safety certifications are in place for joint operations. They are also responsible for drafting and executing detailed work instructions (WOs) that guide campaign activities, from payload processing through encapsulation and launch integration. Throughout the day, they provide real-time floor support during operations, resolve issues alongside launch vehicle engineers, and manage schedule adjustments to keep the campaign on track. Between shifts, they send operational updates to internal and external teams, prepare for readiness reviews, and support anomaly resolution efforts—driving mission success from battery install through launch. The Mission Integration Engineer will work closely with the Mission Manager and PPF leadership to ensure requirements and schedule satisfaction.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eHere at Amazon, we embrace our differences. We are committed to furthering our culture of inclusion. Amazon has ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and host annual and ongoing learning experiences. Amazon’s culture of inclusion is reinforced within our 16 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.\u003cbr/\u003e\u003cbr/\u003eAt Amazon, our mission is to be the most customer-centric company on Earth. To get there, we need exceptionally talented, bright and driven people. We're dedicated to supporting new team members. Our team has a broad mix of experience levels and Amazon tenures, and we’re building an environment that celebrates knowledge sharing and mentorship.","department_cost_center":null,"description_short":"Amazon Leo is an initiative to launch a constellation of Low Earth Orbit satellites that will provide low-latency, high-speed broadband connectivity to unserved and underserved communities around the world.Export","display_distance":null,"id":"3786cbde-38f4-4d88-83a7-f92e36bf17ce","id_icims":"3089747","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Technical Program Management","job_function_id":null,"job_path":"/en/jobs/3089747/sr-mission-integrator-amazon-leo","job_schedule_type":"full-time","location":"US, FL, Merritt Island","locations":["{\"normalizedStateName\":\"Florida\",\"normalizedCountryCode\":\"USA\",\"city\":\"Merritt Island\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, FL, Merritt Island\",\"coordinates\":\"28.35709,-80.68596\",\"normalizedCountyName\":\"Brevard\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Merritt Island, Florida, USA\",\"location\":\"US, FL, Merritt Island\",\"region\":\"FL\",\"buildingCodeList\":[\"MCO13\"],\"normalizedCityName\":\"Merritt Island\"}"],"normalized_location":"Merritt Island, Florida, USA","optional_search_labels":["devices-services.kuiper-prod-ops"],"posted_date":"September 22, 2025","preferred_qualifications":"- Experience managing projects across cross functional teams, building sustainable processes and coordinating release schedules\u003cbr/\u003e- Master's degree in Mechanical, Aerospace, Astronautical Engineering.\u003cbr/\u003e- Excellent oral and written communication skills.\u003cbr/\u003e- Track record of executing complex, multi-manifest launch campaigns on time, to scope, with high quality.\u003cbr/\u003e- Excellent analytical and interpersonal skills, with ability to work successfully across all engineering disciplines.\u003cbr/\u003e- Independently driven, resourceful, and able to deliver results with minimal direction.\u003cbr/\u003e- Experience interfacing with variety of launch and dispenser system providers, Range Safety officers and legal/export/regulatory compliance.\u003cbr/\u003e- Ability to communicate effectively with both technical and non-technical individuals.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, FL, Merritt Island - 148,700.00 - 201,200.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"FL","title":"Sr. Mission Integrator, Amazon Leo","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3089747/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree","business_category":"fulfillment-ops","city":"Hofuf","company_name":"Afaq - Warehouse Branch - J02","country_code":"SAU","description":"Do you want to be part of a newly formed organization that is designing and launching new business models across AMET? If so, Amazon Ultra Fast Grocery (UFG) operations is looking for an experienced Operations Lead with a strong record of achieving results. We are looking to hire an Operations Lead to join a team that redefines fast delivery, helps us build and run this new service for our customers, run 3P Store Operations. You will ensure Amazon policies – including attendance tracking – are implemented and administered fairly and consistently. This includes motivating, coaching, reporting, and providing feedback of associates’ performance – including under the roof/on the road productivity, quality, and safety - as a means for achieving or exceeding Amazon expectations. This is your chance to make history. Our overall mission is simple: we want Amazon to be the place where our customers can find, discover and buy anything online. Whatever our customers want, we will find the means to deliver it. With your help, Amazon will continue to enable people to discover new worlds and implement innovation.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eWe're seeking a Team lead for UFG UTR operations in KSA. In this role, you will be responsible for:\u003cbr/\u003e\u003cbr/\u003eManaging, on a daily basis, end to end UTR operations for either one large site or a combination of small sites, supervising store operations:\u003cbr/\u003e\u003cbr/\u003eMeeting customer facing metrics, while maintaining operational / quality targets and upholding safety and morale of the team reporting to you.\u003cbr/\u003e\u003cbr/\u003eDriving performance management of your team members. Preparing and implementing training and development plans for the pickers.\u003cbr/\u003e\u003cbr/\u003eWorking closely with merchant stakeholders to continuously improve the operations process and attain a sustained level of performance improvement.\u003cbr/\u003e\u003cbr/\u003eConducting 4M / 5S and Safety GEMBA audits for the stores on a daily basis.\u003cbr/\u003e\u003cbr/\u003eStand-in for Area Manager.","department_cost_center":null,"description_short":"Do you want to be part of a newly formed organization that is designing and launching new business models across AMET? If so, Amazon Ultra Fast Grocery (UFG) operations is looking for an experienced Operations","display_distance":null,"id":"df63c09a-8943-4e85-82d1-2ac289ba82a2","id_icims":"3161584","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Administrative Support","job_function_id":null,"job_path":"/en/jobs/3161584/operations-executive-amazon-now-ufg","job_schedule_type":"full-time","location":"SA, 06, Hofuf","locations":["{\"normalizedCountryCode\":\"SAU\",\"city\":\"Hofuf\",\"countryIso3a\":\"SAU\",\"countryIso2a\":\"SA\",\"locationNonStemming\":\"Saudi Arabia, 06, Hofuf\",\"coordinates\":\"25.36824,49.58751\",\"normalizedCountyName\":\"Eastern Province\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Saudi Arabia\",\"normalizedLocation\":\"Ahsa, SAU\",\"location\":\"SA, 06, Hofuf\",\"region\":\"06\",\"buildingCodeList\":[\"DHU3\"],\"normalizedCityName\":\"Ahsa\"}"],"normalized_location":"Ahsa, SAU","optional_search_labels":[],"posted_date":"January 19, 2026","preferred_qualifications":"- Speak, write, and read fluently in English\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-global-specialty-fulfillment","source_system":"JobCreator","state":"06","title":"Operations Executive, Amazon Now, UFG","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3161584/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-specialty-fulfillment","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}