{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Fairless Hills","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e\u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability \u003cbr/\u003e• Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS) \u003cbr/\u003e• Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA) \u003cbr/\u003e• Perform rack installs and rack decommissioning within internal SLA \u003cbr/\u003e• Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment \u003cbr/\u003e• Technical writing to support change management program \u003cbr/\u003e• Monitor daily work requests and manage to resolution, and execute projects from conception to completion \u003cbr/\u003e• On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation \u003cbr/\u003e• Work schedule changes depending on specific site needs. Shifts can be up to 12 hours and may rotate on a predefined schedule. Some locations have on-call rotations. \u003cbr/\u003e• Role may support more than one location/site. \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e• Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodations: \u003cbr/\u003e• Regularly lift and/or move up to 39 pounds independently \u003cbr/\u003e• Participate in group lifts for 40+ pounds \u003cbr/\u003e• Maintain balance and perform construction tasks while on a ladder \u003cbr/\u003e• Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position \u003cbr/\u003e• Work in an environment requiring provided ear protection \u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e• Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e• Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e• Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. \u003cbr/\u003e","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"d5ab080a-9322-47ec-9218-3694a8247e3f","id_icims":"3161503","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3161503/data-center-engineering-operations-technician-data-center-ops","job_schedule_type":"full-time","location":"US, PA, Fairless Hills","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Fairless Hills\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Fairless Hills\",\"coordinates\":\"40.17334,-74.85369\",\"normalizedCountyName\":\"Bucks\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Fairless Hills, Pennsylvania, USA\",\"location\":\"US, PA, Fairless Hills\",\"region\":\"PA\",\"buildingCodeList\":[\"PNE102\",\"PNE109\",\"PNE110\",\"PNE105\",\"PNE103\",\"PNE106\",\"PNE100\",\"DPL4\",\"PNE108\",\"PNE111\",\"PNE107\",\"PNE101\",\"PNE112\",\"PNE104\"],\"normalizedCityName\":\"Fairless Hills\"}"],"normalized_location":"Fairless Hills, Pennsylvania, USA","optional_search_labels":["aws.team-ais","aws.team-dc","hourly","military"],"posted_date":"January 18, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Technical (Military/Trade School) training\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, PA, FAIRLESS HILLS - 31.00 - 55.00 USD hourly\u003cbr/\u003eUSA, PA, Fairless Hills - 31.00 - 55.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"PA","title":"Data Center Engineering Operations Technician, Data Center Ops","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3161503/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Currently has, or is in the process of obtaining, a Bachelor's degree or above in Mechanical, Electrical, Industrial Engineering, or related STEM field\u003cbr/\u003e- Speak, write, and read fluently in German\u003cbr/\u003e- Speak, write, and read fluently in English\u003cbr/\u003e- Experience with Microsoft Office suite, particularly Excel, Outlook, and Word","business_category":"fulfillment-ops","city":"Erfurt","company_name":"Amazon Erfurt GmbH","country_code":"DEU","description":"Amazon created one of the most sophisticated supply chains in the world. From the introduction of Amazon Prime, to the use of advanced technology for package delivery; Amazon consistently drives change from the front of the pack. As an Operations Engineer, you will lead and manage the lifecycle of challenging cross-functional projects, developing and delivering the next generation of sortation and distribution solutions.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Manage cross-functional project lifecycles across organizations and geographies, ensuring delivery of objectives and targets * Actively participate in engineering reviews, contributing to and improving proposed solutions for systems and components * Collaborate with stakeholders to set priorities, establish milestones, and drive schedules, proactively addressing dependencies and mitigating issues * Lead execution of systems and automated equipment designs, overseeing installation, throughput, and safety qualifications while optimizing processes * Conduct effective meetings, ensuring proper documentation of discussions, decisions, and action items * Provide timely and accurate project status updates, risk analyses, and mitigation plans to leadership * Clearly articulate system and equipment designs, including technical specifications and capabilities, to internal and external partners * Efficiently manage change order controls, purchase orders, and invoice approvals * Develop and maintain strong working relationships across multiple projects and stakeholders * Identify and spearhead process improvement initiatives to enhance project efficiency and value delivery\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou are managing one or multiple projects that can vary in scope, complexity and duration. Daily tasks may comprise of site coordination with operations teams and contractors on project execution activities or changes; deep diving project progress, schedule and resources, while identifying barriers, creating solutions and driving resolutions. You may be facilitating the planning and/or implementation meetings with projects’ stakeholders, ensuring alignment in objectives, expectations, and the next steps; you would capture and publish detailed notes after each meeting to drive ownership and follow-through on the actions and decisions. You may be brainstorming and developing workaround solutions while mitigating the project delays or design issues. In addition, you may be supporting/training other engineering team members, utilizing the knowledge of Amazon’s safety, mechanical, electrical and controls installation standard and guidelines. Key competencies of this position include insisting on the highest standards ensuring that contracted resources meet schedule, budgetary, safety and quality targets; analyzing and deep diving systems’ performance, inventing and simplifying solutions that allow for improved processes and results; and\u003cbr/\u003eproviding technical expertise to customers and stakeholders. You are looked to as authority for risk analysis and problem solving.","department_cost_center":null,"description_short":"Amazon created one of the most sophisticated supply chains in the world. From the introduction of Amazon Prime, to the use of advanced technology for package delivery; Amazon consistently drives change","display_distance":null,"id":"a55af8d8-f13a-4774-b68e-96bf2d023d88","id_icims":"3153567","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3153567/graduate-engineering-manager","job_schedule_type":"full-time","location":"DE, TH, Erfurt","locations":["{\"normalizedStateName\":\"Thuringia\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Erfurt\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, TH, Erfurt\",\"coordinates\":\"50.97793,11.02351\",\"normalizedCountyName\":\"Erfurt\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Erfurt, Thuringia, DEU\",\"location\":\"DE, TH, Erfurt\",\"region\":\"TH\",\"buildingCodeList\":[\"ERF1\"],\"normalizedCityName\":\"Erfurt\"}"],"normalized_location":"Erfurt, Thuringia, DEU","optional_search_labels":[],"posted_date":"January  6, 2026","preferred_qualifications":"- Experience in Design/Innovation, research \u0026 development, manufacturing, process, industrial engineering, or related work\u003cbr/\u003e- Experience leading large-scale programs/projects\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":"TH","title":"Graduate Engineering Manager","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3153567/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- CA Intermediate (Leve II)","business_category":"finance","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"Amazon.com, Inc. is a US-based multinational electronic commerce company headquartered in Seattle, Washington. Amazon.com started as an online bookstore, but soon diversified into many other categories, with a vision to be earth's most customer-centric company \u0026 to build a place where people can come to find and discover anything they might want to buy online. Amazon has websites in over 14 countries. \u003cbr/\u003eJob Description:\u003cbr/\u003eAre you looking for an opportunity to kick-start your Finance career in the exciting and fast-growing e-commerce industry with one of the largest e-commerce companies in the world? Are you excited about combining your financial skills and accounting knowledge to uncover new business opportunities? Are you a CA student, having cleared IPCC / Intermediate in the first attempt / rankholder with 18 months of articleship period left? If your answer to these questions is yes, then joining the Amazon team as a trainee is the opportunity you have been waiting for!\u003cbr/\u003eWe’re hiring Industrial Trainees (Finance Analyst Interns) across multiple teams in Amazon. The selected candidate(s) will get an opportunity to work closely with business and finance leaders to produce and deliver financial analysis that would facilitate decision making. The candidate would be working with key stakeholders in Operations team and will be part of Operations finance team supporting multiple businesses.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe team partners with operations to manage Fulfillment Center and Delivery station in the most cost efficient manner. ","department_cost_center":null,"description_short":"Amazon.com, Inc. is a US-based multinational electronic commerce company headquartered in Seattle, Washington. Amazon.com started as an online bookstore, but soon diversified into many other categories,","display_distance":null,"id":"7b6dd340-b073-432e-95b6-827287bb9376","id_icims":"3165460","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/planning","job_function_id":null,"job_path":"/en/jobs/3165460/financial-analyst-ca-industrial-trainee-amet-operations-finance","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR2\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"January 23, 2026","preferred_qualifications":"- CA Intermediate (Level II)\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-finops","source_system":"JobCreator","state":"KA","title":"Financial Analyst CA Industrial Trainee, AMET Operations Finance","university_job":null,"updated_time":"22 minutes","url_next_step":"https://account.amazon.com/jobs/3165460/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-finops","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in accounting and commerce (B. Com)\u003cbr/\u003e- Knowledge of Excel at an advanced level\u003cbr/\u003e- Experience with Microsoft Office products and applications\u003cbr/\u003e- 3+ years of finance operations/shared services, accounts payable, account receivable (collections) or general ledger experience\u003cbr/\u003e- 1+ years of participating in continuous improvement projects in your team to scale and improve controllership with measurable results experience\u003cbr/\u003e- Experience in Excel (macros, index, conditional list, arrays, pivots, lookups)\u003cbr/\u003e- Experience using data to analyze problems\u003cbr/\u003e- Experience demonstrating problem solving and root cause analysis\u003cbr/\u003e- Knowledge of Lean","business_category":"finance","city":"Bengaluru","company_name":"Amazon Digital Services Private Limited - M86","country_code":"IND","description":"At Amazon, we're working to be the world’s most customer-centric company. Driving innovation on behalf of customers is core to our mission. This is an exciting opportunity to join one of the most strategic, impactful, and fastest growing areas within Amazon.\u003cbr/\u003e\u003cbr/\u003eThe FinOps Analyst will be responsible for service delivery of our Accounts Payable/Receivable functions for a specific geo / country and will partner with a diverse set of stakeholders within the Finance Shared Service Organization as well as the business. A key responsibility will be to deliver existing services at a high degree of accuracy, timeliness and controllership, besides supporting the growth in business. \u003cbr/\u003e\u003cbr/\u003eThis role requires one to be a self-starter with strong business modeling skills, keen attention to detail and good track record of collaborating with diverse stakeholders. This role has regular interaction with senior leadership and stakeholders across Amazon and requires strong verbal and written communication skills. The candidate will need to be capable of operating with a high degree of autonomy and hence needs to demonstrate a high degree of comfort with ambiguity besides holding a high bar on performance. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e1. Performs autonomously, initiates and manages complex, departmental and/or cross- company work. \u003cbr/\u003e2. Managing workload and establishing priorities.\u003cbr/\u003e3. Is expected to set and improve policies and procedures, maintaining full compliance, implementing best practices.\u003cbr/\u003e4. Focus is broad, will serve as a consultant on projects and areas of finance or support of a business. \u003cbr/\u003e5. This position will also act as an escalation point in resolving complex outstanding issues with internal and external ","department_cost_center":null,"description_short":"At Amazon, we're working to be the world’s most customer-centric company. Driving innovation on behalf of customers is core to our mission. This is an exciting opportunity to join one of the most strategic,","display_distance":null,"id":"aa17c68a-0912-4f41-9fee-2594c40f7573","id_icims":"3157713","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/planning","job_function_id":null,"job_path":"/en/jobs/3157713/sr-finops-analyst-finops","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR13\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"January 13, 2026","preferred_qualifications":"- MBA\u003cbr/\u003e- 4+ years of finance operations/shared services, accounts payable, account receivable (collections) or general ledger experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-finops","source_system":"JobCreator","state":"KA","title":"Sr. FinOps Analyst , FinOps ","university_job":null,"updated_time":"22 minutes","url_next_step":"https://account.amazon.com/jobs/3157713/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-finops","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience using data to influence business decisions\u003cbr/\u003e- Knowledge of financial controls and procedures\u003cbr/\u003e- Bachelor's degree in accounting or related field, or a CPA and experience in accounting management in Big Four with Fortune 500 clients\u003cbr/\u003e- Should have 18 months of internship / articles-hip left from the date of joining","business_category":"finance","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"Amazon.com, Inc. is a US-based multinational electronic commerce company headquartered in Seattle, Washington. Amazon.com started as an online bookstore, but soon diversified into many other categories, with a vision to be earth's most customer-centric company \u0026 to build a place where people can come to find and discover anything they might want to buy online. Amazon has websites in over 14 countries. \u003cbr/\u003eJob Description:\u003cbr/\u003eAre you looking for an opportunity to kick-start your Finance career in the exciting and fast-growing e-commerce industry with one of the largest e-commerce companies in the world? Are you excited about combining your financial skills and accounting knowledge to uncover new business opportunities? Are you a CA student, having cleared IPCC / Intermediate in the first attempt / rankholder with 18 months of articleship period left? If your answer to these questions is yes, then joining the Amazon team as a trainee is the opportunity you have been waiting for!\u003cbr/\u003eWe’re hiring Industrial Trainees (Finance Analyst Interns) across multiple teams in Amazon. The selected candidate(s) will get an opportunity to work closely with business and finance leaders to produce and deliver financial analysis that would facilitate decision making. The candidate would be working with key stakeholders in Operations team and will be part of Operations finance team supporting multiple businesses.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe team partners with operations to manage Fulfillment Center and Delivery station in the most cost efficient manner. ","department_cost_center":null,"description_short":"Amazon.com, Inc. is a US-based multinational electronic commerce company headquartered in Seattle, Washington. Amazon.com started as an online bookstore, but soon diversified into many other categories,","display_distance":null,"id":"139fc7d6-e642-4318-9758-5ee88ea6c383","id_icims":"3160567","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/planning","job_function_id":null,"job_path":"/en/jobs/3160567/financial-analyst-ca-industrial-trainee-apac-operations-finance","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR2\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"January 15, 2026","preferred_qualifications":"- Experience in TM1, Data Warehouse and SQL\u003cbr/\u003e- Advanced user of excel\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-finops","source_system":"JobCreator","state":"KA","title":"Financial Analyst CA Industrial Trainee, APAC Operations Finance","university_job":null,"updated_time":"25 minutes","url_next_step":"https://account.amazon.com/jobs/3160567/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-finops","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- - Posiadanie wszechstronnych umiejętności z zakresu urządzeń elektrycznych i mechanicznych (mile widziane potwierdzone uprawnieniami)\u003cbr/\u003e- - Doświadczenie w pracy z systemami planowania konserwacji zapobiegawczej (PM)\u003cbr/\u003e- - Praktyczne doświadczenie w wykrywaniu i usuwaniu usterek (troubleshooting) w systemach automatyzacji oraz zmechanizowanym sprzęcie do przenoszenia towarów.\u003cbr/\u003e- - Umiejętność czytania i interpretacji schematów mechanicznych i elektrycznych\u003cbr/\u003e- - Posiadanie podstawowych umiejętności z zakresu prac warsztatowych (np. obsługa narzędzi, proste naprawy)\u003cbr/\u003e- - Doświadczenie w konserwacji przenośników oraz w obsłudze inwerterów/sterowników silników\u003cbr/\u003e- - Praktyczna wiedza i doświadczenie w pracy z zachowaniem odpowiednich standardów i przepisów BHP\u003cbr/\u003e- - Doświadczenie w zarządzaniu i koordynowaniu prac wykonawców zewnętrznych\u003cbr/\u003e- - Gotowość do pracy zmianowej w systemie ciągłym (24/7)","business_category":"fulfillment-ops","city":"Bielany Wroclawskie","company_name":"Amazon Fulfillment Poland sp. z o.o.","country_code":"POL","description":"Amazon poszukuje kandydatów na stanowisko Reliability Maintenance Engineering Technician, którzy mają doświadczenie w tej dziedzinie. Zatrudniona osoba dołączy do zespołu w jednum z najbardziej zautomatyzowanych Centrów Logistycznych Amazon w Polsce!\u003cbr/\u003e \u003cbr/\u003eCHARAKTERYSTYKA STANOWISKA:\u003cbr/\u003eOsoba pracująca na stanowisku Reliability Maintenance Engineering Technician ma zagwarantować przestrzeganie przepisów i zasad bezpieczeństwa, terminową realizację konserwacji zapobiegawczej przy jednoczesnym zachowaniu wysokich standardów oraz wysoki poziom dostępności sprzętu poprzez stałe wprowadzanie udoskonaleń.\u003cbr/\u003e \u003cbr/\u003eZAKRES OBOWIĄZKÓW:\u003cbr/\u003e - Nadawanie priorytetu najlepszym praktykom BHP we wszystkich wykonywanych zadaniach\u003cbr/\u003e - Przeprowadzanie zaplanowanej konserwacji zapobiegawczej w odniesieniu do całego wyposażenia obiektu\u003cbr/\u003e - Szybkie reagowanie na awarie, komunikacja ze stronami, których dotyczy problem, oraz skuteczne usuwanie wszelkich usterek\u003cbr/\u003e - Działanie na rzecz ciągłego wprowadzania udoskonaleń poprzez wyciąganie wniosków z awarii oraz przesyłanie uwag i sugestii dotyczących udoskonaleń za pośrednictwem kierownika liniowego\u003cbr/\u003e - Zapewnianie wysokiego poziomu dostępności sprzętu klientom wewnętrznym\u003cbr/\u003e - Wspieranie osób pracujących na stanowisku Senior Reliability Engineering Technician i korzystanie z ich zasobów wiedzy\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Proaktywne i zapobiegawcze prace konserwacyjne dla szerokiej gamy urządzeń w centrach logistycznych\u003cbr/\u003e- Przeprowadzanie nieplanowanych napraw i diagnostyka usterek w centrum logistycznym\u003cbr/\u003e- Korzystanie z najnowszych narzędzi w celu osiągnięcia maksymalnej wydajności\u003cbr/\u003e- Przestrzeganie wszystkich zasad i praktyk w zakresie BHP\u003cbr/\u003e- Wspieranie rozwoju i doskonalenia zawodowego praktykantów\u003cbr/\u003e- Prowadzenie projektów ciągłego doskonalenia i wdrażanie najlepszych praktyk w centrach na terenie UE\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eNasi technicy utrzymania ruchu i infrastruktury pracują w naszych centrach logistycznych, dzięki czemu mogą szybko reagować na wszelkie problemy związane z urządzeniami oraz przeprowadzają szereg zaplanowanych konserwacji zapobiegawczych, by zapewnić ich bezpieczne działanie. Do ich obowiązków należy również natychmiastowe reagowanie na awarie, diagnozowanie ich źródła, oraz opracowywanie i jak najszybsze wdrażanie rozwiązań. Przedstawiają również swoje sugestie dotyczące wprowadzania długoterminowych ulepszeń.\u003cbr/\u003eWspółpracując z bardziej doświadczonymi pracownikami, osoba na tym stanowisku będzie przeprowadzać bieżące zadania konserwacyjne, takie jak malowanie lub hydraulika, oraz komunikować się z kontrahentami, by w razie potrzeby zasięgać u nich fachowej wiedzy. Stanowisko to obejmuje pracę na różnych zmianach, dzięki czemu nasze centra logistyczne są pod opieką techników utrzymania ruchu i infrastruktury przez całą dobę – pozwalając firmie Amazon na dostarczanie klientom produktów z prędkością, z jakiej słyniemy.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eMinimalne wynagrodzenie zasadnicze dla tego stanowiska jest wskazane poniżej. \u003cbr/\u003eAmazon kieruje się zasadą pełnego wynagrodzenia, w związku z czym oprócz wynagrodzenia zasadniczego mogą być przewidziane dodatkowe składniki wynagrodzenia, takie jak premie (w odpowiednich przypadkach). \u003cbr/\u003eZespół rekrutacyjny poinformuje Cię o ostatecznej kwocie wynagrodzenia zasadniczego oraz o wszystkich przysługujących dodatkowych składnikach wynagrodzenia, w zależności od umiejętności i wymagań. \u003cbr/\u003eDodatkowe świadczenia przysługują na warunkach obowiązujących w Spółce i obejmują m.in. plany emerytalne, dodatkowe ubezpieczenie zdrowotne, ubezpieczenie na życie, ubezpieczenie podróży służbowych, kartę MultiSport, zniżki na posiłki w stołówce firmowej, kod rabatowy dla pracowników i program (EDC/Extras) oraz Program Pomocy Pracowników (EAP – prywatne i poufne doradztwo i usługi wsparcia zdrowia i dobrego samopoczucia). \u003cbr/\u003e\u003cbr/\u003eMinimalne wynagrodzenie zasadnicze dla tego stanowiska wynosi 52.00 PLN za godzinę.","department_cost_center":null,"description_short":"Amazon poszukuje kandydatów na stanowisko Reliability Maintenance Engineering Technician, którzy mają doświadczenie w tej dziedzinie. Zatrudniona osoba dołączy do zespołu w jednum z najbardziej zautomatyzowanych","display_distance":null,"id":"37316a55-da77-43d7-a6d6-daf7b0ee18c2","id_icims":"3136455","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3136455/technik-utrzymania-ruchu-i-infrastruktury-rme","job_schedule_type":"full-time","location":"PL, Bielany Wroclawskie","locations":["{\"normalizedStateName\":\"Lower Silesian Voivodeship\",\"normalizedCountryCode\":\"POL\",\"city\":\"Bielany Wroclawskie\",\"countryIso3a\":\"POL\",\"countryIso2a\":\"PL\",\"locationNonStemming\":\"Poland, Bielany Wroclawskie\",\"coordinates\":\"51.0326,16.96807\",\"normalizedCountyName\":\"Powiat Wrocławski\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Poland\",\"normalizedLocation\":\"Kobierzyce, Lower Silesian Voivodeship, POL\",\"location\":\"PL, Bielany Wroclawskie\",\"region\":\"\",\"buildingCodeList\":[\"WRO2\"],\"normalizedCityName\":\"Kobierzyce\"}","{\"normalizedStateName\":\"Lower Silesian Voivodeship\",\"normalizedCountryCode\":\"POL\",\"city\":\"Okmiany\",\"countryIso3a\":\"POL\",\"countryIso2a\":\"PL\",\"locationNonStemming\":\"Poland, Okmiany\",\"coordinates\":\"51.27222,15.78091\",\"normalizedCountyName\":\"Powiat Legnicki\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Poland\",\"normalizedLocation\":\"Chojnów (Gmina), Lower Silesian Voivodeship, POL\",\"location\":\"PL, Okmiany\",\"region\":\"\",\"buildingCodeList\":[\"WRO5\"],\"normalizedCityName\":\"Chojnów (Gmina)\"}"],"normalized_location":"Kobierzyce, Lower Silesian Voivodeship, POL","optional_search_labels":["ops.lander-emea-rme-reliability","ops.lander-emea-rme-technician"],"posted_date":"December  3, 2025","preferred_qualifications":"- - Znajomość i obsługa rozdzielni Niskiego Napięcia\u003cbr/\u003e- - Praktyka w utrzymaniu ruchu i diagnostyce maszyn sortujących i linii przenośnikowych\u003cbr/\u003e- - Doświadczenie w zakresie konserwacji i/lub konfiguracji skanerów kodów kreskowych\u003cbr/\u003e- - Znajomość maszyn drukujących i etykietujących\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":null,"title":"Technik utrzymania ruchu i infrastruktury, RME","university_job":null,"updated_time":"28 minutes","url_next_step":"https://account.amazon.com/jobs/3136455/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Qualifiche professionali richieste\u003cbr/\u003e- Vasta esperienza nella manutenzione di impianti meccanici e/o elettrici.\u003cbr/\u003e- Piena padronanza della lingua italiana, scritta e parlata.","business_category":"fulfillment-ops","city":"Fiumicino","company_name":"Amazon Italia Transport Srl","country_code":"ITA","description":"Job summary\u003cbr/\u003eAmazon Operations sits at the heart of the Amazon customer experience. We look after everything from the moment a customer clicks buy, to the moment their item is delivered – from desktop to doorstep.\u003cbr/\u003e   \u003cbr/\u003e  Across Europe we have more than 50 Fulfillment Centers, hundreds of Delivery Stations, thousands of machines, and tens of thousands of employees, all working together in harmony to make sure the right item gets delivered to the right person, in the right place, at the right time.\u003cbr/\u003e   \u003cbr/\u003e  Working in Amazon Operations is for people who like to be active and give their all. We work in a busy, dynamic environment and are part of a bigger team delivering on the expectations of millions of customers every single day.\u003cbr/\u003e   \u003cbr/\u003e   \u003cbr/\u003e  We are open, inclusive and welcome individuality and diversity. The culture in our Operation is built on the way teams bond and the work ethic that enables our business run like clockwork. Our teams take pride in a job well done, looking out for one another, ensuring the highest safety standards and playing their part in delivering the quality service Amazon is known for around the world.\u003cbr/\u003e   \u003cbr/\u003e  Join us in the Amazon Reliability Maintenance Engineering team. We maintain and optimize technologies in the Global Amazon Warehouse \u0026 Delivery Network.\u003cbr/\u003e     \u003cbr/\u003e  PURPOSE OF THE JOB:\u003cbr/\u003e\u003cbr/\u003eWe are looking for motivated, customer-focused people who want to join our team as a Reliability Maintenance Engineering Technician. \u003cbr/\u003e   \u003cbr/\u003eThe focus of the Reliability Maintenance Engineering Technician role is to ensure safety regulations and policies are adhered to, to ensure preventative maintenance is conducted on time to a high standard and to provide high levels of equipment availability through continuous improvement. \u003cbr/\u003e   \u003cbr/\u003eShift Pattern: This role includes working in non-traditional shift pattern, which may include nights and weekends\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tPut health \u0026 safety best practices first in all work carried out ensuring compliance with all health \u0026 safety standards and regulations.\u003cbr/\u003e•\tCarry out planned preventative maintenance on the full range of equipment within the site.\u003cbr/\u003e•\tReact quickly to breakdowns, communicate clearly with affected parties and work efficiently to fix the issue.\u003cbr/\u003e•\tSupport continuous improvement by learning from breakdowns and sending feedback and suggestions for improvements through the line manager.\u003cbr/\u003e•\tProvide high levels of equipment availability to our internal customers.\u003cbr/\u003e•\tSupport and learn from Senior Reliability Engineering Technicians.\u003cbr/\u003e•\tManagement of contractors.\u003cbr/\u003e•\tCarry out compliance tasks in line with country legislation that do not require specialist intervention.\u003cbr/\u003e•\tOn-site support and responsibility for management and escalation of high severity tickets.\u003cbr/\u003e•\tManagement of escalations to specialist subcontractors where required.\u003cbr/\u003e•\tEngineering tasks qualified as basic, standard, advanced and expert (Levels 1-4) – Responsibility is for levels 1-3 for reactive and planned tasks and Level 4 is when specialist is required.\u003cbr/\u003e•\tControl and management of cleaning and waste companies.\u003cbr/\u003e•\tCarry out scheduled/ad hoc audits using online tools (iAuditor, EAM).\u003cbr/\u003e•\tManagement of critical spare parts inventory utilizing CMMS system (EAM).\u003cbr/\u003e•\tWork in a hands-on manner and demonstrate required knowledge on all Material Handling Equipment in the building.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003eInterventi di manutenzione preventiva e a guasto su un’ampia gamma di macchinari in sede.\u003cbr/\u003e\u003cbr/\u003eEseguire riparazioni di emergenza e diagnosi dei guasti nei magazzini di distribuzione.\u003cbr/\u003e\u003cbr/\u003eUtilizzo di strumenti all’avanguardia per massimizzare l’efficacia dei macchinari.\u003cbr/\u003e\u003cbr/\u003eConformità a tutte le normative e prassi in materia di salute e sicurezza. \u003cbr/\u003e\u003cbr/\u003eFavorire lo sviluppo e l’avanzamento di chi partecipa ai programmi di apprendistato nelle nostre sedi.\u003cbr/\u003e\u003cbr/\u003eSovraintendere a progetti di miglioramento continuo e implementare procedure chiave in una gamma di sedi europee.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eLa giornata tipo\u003cbr/\u003e\u003cbr/\u003eI nostri RME Technician operano sul campo, in modo da intervenire prontamente nell’eventualità di problemi ai macchinari. A intervalli prestabiliti, eseguirai una serie di interventi di manutenzione preventiva sui macchinari delle nostre sedi, per assicurarne il corretto funzionamento. In qualità di RME Technician, interverrai prontamente in caso di guasti, investigandone le cause e implementando soluzioni in maniera tempestiva.  Inoltre, indicherai possibili miglioramenti a lungo termine da apportare per scongiurare problematiche in futuro.\u003cbr/\u003eAffiancando i colleghi senior, ti occuperai della manutenzione ordinaria, come la tinteggiatura o l’idraulica, con il supporto di professionisti esterni se necessario. Il tuo lavoro sarà organizzato su diversi turni, per assicurare assistenza 24 ore su 24, in modo da consentire ad Amazon di effettuare le consegne con la velocità che ci contraddistingue. ","department_cost_center":null,"description_short":"Job summaryAmazon Operations sits at the heart of the Amazon customer experience. We look after everything from the moment a customer clicks buy, to the moment their item is delivered – from desktop to","display_distance":null,"id":"f93986e3-19a9-4b10-b54f-1e3189fe2b73","id_icims":"3173709","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3173709/maintenance-technician-rme-dlz7","job_schedule_type":"full-time","location":"IT, RM, Fiumicino","locations":["{\"normalizedStateName\":\"Latium\",\"normalizedCountryCode\":\"ITA\",\"city\":\"Fiumicino\",\"countryIso3a\":\"ITA\",\"countryIso2a\":\"IT\",\"locationNonStemming\":\"Italy, RM, Fiumicino\",\"coordinates\":\"41.77008,12.22708\",\"normalizedCountyName\":\"Rome\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Italy\",\"normalizedLocation\":\"Fiumicino, Latium, ITA\",\"location\":\"IT, RM, Fiumicino\",\"region\":\"RM\",\"buildingCodeList\":[\"DLZ7\"],\"normalizedCityName\":\"Fiumicino\"}"],"normalized_location":"Fiumicino, Latium, ITA","optional_search_labels":[],"posted_date":"February  4, 2026","preferred_qualifications":"- Qualifiche professionali preferenziali\u003cbr/\u003e- Le qualifiche preferenziali non sono requisiti obbligatori per candidarsi a una posizione in Amazon. Se possiedi tutte le qualifiche richieste di cui sopra, non esitare a inviarci la tua candidatura: saremo felici di esaminarla!\u003cbr/\u003e- Esperienza nel monitoraggio \"Condition Based Monitoring\" (monitoraggio in base alle condizioni)\u003cbr/\u003e- Esperienza con procedure di sicurezza (LOTO, lockout-tagout)\u003cbr/\u003e- Esperienza professionale con i macchinari di stampa e applicazione etichette.\u003cbr/\u003e- Esperienza nell’individuazione dei guasti e nella manutenzione di nastri trasportatori o sistemi di automazione.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":"RM","title":"Maintenance technician, (RME), DLZ7","university_job":null,"updated_time":"34 minutes","url_next_step":"https://account.amazon.com/jobs/3173709/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Are enrolled in a Bachelor's degree in Computer Science, Computer Engineering, or related fields at time of application\u003cbr/\u003e- Knowledge of programming languages such as C/C++, Python, Java or Perl\u003cbr/\u003e- Knowledge of computer science fundamentals such as object-oriented design, operating systems, algorithms, data structures, and complexity analysis","business_category":"studentprograms","city":"Cape Town","company_name":"Amazon Development Centre (South Africa) (Proprietary) Limited - A78","country_code":"ZAF","description":"Do you want to solve real customer problems through innovative technology? Do you enjoy working on scalable services in a collaborative team environment? Do you want to see your code directly impact millions of customers worldwide?\u003cbr/\u003e\u003cbr/\u003eAt Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. Customer obsession is part of our company DNA, which has made us one of the world's most beloved brands.\u003cbr/\u003e\u003cbr/\u003eOur Software Development Engineer (SDE) interns use modern technology to solve complex problems while seeing their work's impact first-hand. The challenges SDE interns solve at Amazon are meaningful and influence millions of customers, sellers, and products globally. We seek individuals passionate about creating new products, features, and services while managing ambiguity in an environment where development cycles are measured in weeks, not years. \u003cbr/\u003e\u003cbr/\u003eAt Amazon, we believe in ownership at every level. As an SDE intern, you'll own the entire lifecycle of your code - from design through deployment and ongoing operations. This ownership mindset, combined with our commitment to operational excellence, ensures we deliver the highest quality solutions for our customers.\u003cbr/\u003e\u003cbr/\u003eWe're looking for curious minds who think big and want to define tomorrow's technology. At Amazon, you'll grow into the high impact engineer you know you can be, supported by a culture of learning and mentorship. Every day brings exciting new challenges and opportunities for personal growth.\u003cbr/\u003e\u003cbr/\u003eAmazon internships across all seasons are full-time positions, and interns should expect to work in office, Monday-Friday, up to 40 hours per week typically between 8am-5pm. Specific team norms around working hours will be communicated by your manager. Interns should not have conflicts such as classes or other employment during the Amazon workday.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Collaborate and communicate effectively with experienced cross-disciplinary Amazonians to design, build, and operate innovative products and services that delight our customers, while participating in technical discussions to drive solutions forward.\u003cbr/\u003e- Design and develop scalable solutions using cloud-native architectures and microservices in a large distributed computing environment.\u003cbr/\u003e- Participate in code reviews and contribute to technical documentation.\u003cbr/\u003e- Build and maintain resilient distributed systems that are scalable, fault-tolerant, and cost-effective.\u003cbr/\u003e- Leverage and contribute to the development of GenAI and AI-powered tools to enhance development productivity while staying current with emerging technologies. \u003cbr/\u003e- Write clean, maintainable code following best practices and design patterns.\u003cbr/\u003e- Demonstrate operational excellence through monitoring, troubleshooting, and resolving production issues.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs an intern, you will be matched to a manager and a mentor and will have the opportunity to influence the evolution of Amazon technology and lead critical projects early in your career. \u003cbr/\u003e\u003cbr/\u003eIn addition to working on an impactful project, you will have the opportunity to engage with Amazonians for both personal and professional development, expand your network, and participate in activities with other interns throughout your internship. No matter the location of your internship, we give you the tools to own your project and learn in a real-world setting.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eIntern Community: \u003cbr/\u003eAs an Amazon Intern, you'll be part of a vibrant, supportive community that empowers your growth and development. You'll collaborate with interns from around the world, networking and participating in social events to broaden your perspectives. You can also join specialized groups focused on areas like sustainability to explore your diverse interests. \u003cbr/\u003e\u003cbr/\u003eSupport: \u003cbr/\u003eThe internship program provides a robust support system, including weekly intern office hours, dedicated IT and HR support, and a program team committed to your success. This ensures you have the guidance and assistance needed to thrive. \u003cbr/\u003e\u003cbr/\u003eLearning Sessions: \u003cbr/\u003eExclusive learning sessions will further enhance your skills, granting you access to Amazon's cutting-edge learning platforms and the expertise of industry leaders. These structured development opportunities will prepare you for the next step in your career. \u003cbr/\u003e\u003cbr/\u003eOpportunities:\u003cbr/\u003eUpon successful completion of the internship, you may be considered for a graduate role or a second internship, allowing you to continue your journey with Amazon. Additionally, you'll enjoy a competitive monthly salary, relocation support, and access to a range of employee benefits. ","department_cost_center":null,"description_short":"Do you want to solve real customer problems through innovative technology? Do you enjoy working on scalable services in a collaborative team environment? Do you want to see your code directly impact millions","display_distance":null,"id":"cbf73255-2b75-4648-893f-4178a23d2647","id_icims":"3172665","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3172665/2026-software-dev-engineer-intern-student-hangout-event","job_schedule_type":"full-time","location":"ZA, Cape Town","locations":["{\"normalizedStateName\":\"Western Cape\",\"normalizedCountryCode\":\"ZAF\",\"city\":\"Cape Town\",\"countryIso3a\":\"ZAF\",\"countryIso2a\":\"ZA\",\"locationNonStemming\":\"South Africa, Cape Town\",\"coordinates\":\"-33.91909,18.42198\",\"normalizedCountyName\":\"Cape Town\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"South Africa\",\"normalizedLocation\":\"Cape Town, Western Cape, ZAF\",\"location\":\"ZA, Cape Town\",\"region\":\"\",\"buildingCodeList\":[\"CPT62\",\"XZA2\",\"CPT15\",\"CPT55\",\"CPT51\",\"CPT10\",\"CPT61\",\"CPT\",\"CPT400\",\"CPT16\",\"CPT14\",\"CPT60\",\"CPT11\",\"CPT50\",\"CPT1\",\"CPT170\",\"CPT12\",\"CPT2\"],\"normalizedCityName\":\"Cape Town\"}"],"normalized_location":"Cape Town, Western Cape, ZAF","optional_search_labels":[],"posted_date":"February  3, 2026","preferred_qualifications":"- Experience from a technical internship\u003cbr/\u003e- Experience with distributed, multi-tiered systems, algorithms, and relational databases\u003cbr/\u003e- Experience in optimization mathematics such as linear programming and nonlinear optimization\u003cbr/\u003e- Ability to effectively articulate technical challenges and solutions\u003cbr/\u003e- Adept at handling ambiguous or undefined problems as well as ability to think abstractly\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer, and we value your passion to discover, invent, simplify and build. We welcome applications from all members of society irrespective of age, sex, disability, sexual orientation, race, religion or belief. Amazon is strongly committed to diversity within its community and especially welcomes applications from South African citizens who are members of designated groups who may contribute to Employment Equity within the workplace and the further diversification of ideas. In this regard, the relevant laws and principles associated with Employment Equity will be considered when appointing potential candidates. We are required by law to verify your ability to work lawfully in South Africa. Amazon requires that you submit a copy of either your identity document or your passport and any applicable work permit if you are a foreign national, along with an updated curriculum vitae.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"studentprograms.team-internships-for-students","source_system":"JobCreator","state":null,"title":"2026 Software Dev Engineer Intern - Student Hangout Event","university_job":null,"updated_time":"35 minutes","url_next_step":"https://account.amazon.com/jobs/3172665/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-internships-for-students","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- You have received a technical (Military/ Trade School) training and/or have similar experience in that field.\u003cbr/\u003e- You will have such electrical qualification(s) as are necessary to operate Low Voltage equipment in accordance with applicable German regulations (Elektrofachkraft).\u003cbr/\u003e- You have several years of relevant work experience, ideally within Data Center operations.\u003cbr/\u003e- This role requires you to be a national of an EU member state.","business_category":"aws","city":"Ludwigsfelde","company_name":"Amazon Data Services European Sovereign Cloud GmbH - J95","country_code":"DEU","description":"Do you want to work on the world’s largest Cloud Computing Infrastructure? Then we have the perfect job for you!\u003cbr/\u003e\u003cbr/\u003eMid 2013, our Amazon Web Services S3 web service accepted its 2 trillionth object and that the service is regularly peaking at over 1.1 million requests per second. To keep up with this demand on both disk and network capacity, we continue to expand our Data Centers in every region. This requires talented people to build \u0026 manage. We hope it is you!\u003cbr/\u003e\u003cbr/\u003eWe are currently looking for an experienced, detail-oriented individual to join our Data Center Engineering Operations Team. This committed group works to maintain the critical physical infrastructure that supports our Data Center Organization within Amazon. Specifically, this team works to ensure that the data center operate at 100% availability while maintaining first-class customer service to the teams and groups within the data centers.\u003cbr/\u003e\u003cbr/\u003eThe Data Center Engineering Operations Technician (EOT) is responsible for operating and maintaining all electrical, mechanical, and fire/life safety equipment within the data center. The EOT serves as a technical resource to support Amazon within its owned and operated data centers. This is data center equipment that supports mission-critical servers must maintain better than 99.999% uptime. EOT’s are also tasked with driving innovation while reducing operational costs in the facilities.\u003cbr/\u003e\u003cbr/\u003eAmazon offers an exciting, dynamic and challenging environment encouraging creativity and personal development while maintaining our computing environments in a secure, scalable, and cost-effective manner.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e  Responsibilities:\u003cbr/\u003e   - You will assist in the operation, and maintenance of all electrical,mechanical, and HVAC equipment within the Data Center/Facility.\u003cbr/\u003e - You will assist in maintenance and monitoring of all Data Center systems to include incidents/events, problems, changes, monitoring, problem      escalation/notification/resolution and all other aspects of Data Center support.\u003cbr/\u003e - You will monitor and troubleshoot of all mechanical, electrical, HVAC systems,voice/data, chiller systems and generators.\u003cbr/\u003e - You will provide assistance to contractor or data center engineer to ensure proper operation and maintenance of all facility equipment covered under level I plus areas in which they are certified such as making and running fiber optic, electrical certification, HVAC repair (training/certification), UPS and or generator certifications and training.\u003cbr/\u003e - You will provide assistance to contractor or data center engineer to deploy new equipment, such as, building racks, cabling, and other tasks as      necessary.\u003cbr/\u003e - You will responds to internal Rack customer maintenance, repair and additions/expansion requests through the ticketing system,\u003cbr/\u003e - You will perform site walkthroughs to verify proper operation of Facility  Equipment and Monitoring Systems.\u003cbr/\u003e - You will maintain changes in state in Mission Critical infrastructure in support of corrective/ preventive maintenance.\u003cbr/\u003e - You will review the Test quality, performance, safety, and reliability of products, equipment, processes.\u003cbr/\u003e   \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAWS Infrastructure Services (AIS)\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003e\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Do you want to work on the world’s largest Cloud Computing Infrastructure? Then we have the perfect job for you!Mid 2013, our Amazon Web Services S3 web service accepted its 2 trillionth object and that","display_distance":null,"id":"1f7dc2f8-8064-4c9e-8573-783f8b3c0cae","id_icims":"3124355","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3124355/engineering-operations-technician-data-center-engineering-operations","job_schedule_type":"full-time","location":"DE, Ludwigsfelde","locations":["{\"normalizedStateName\":\"Brandenburg\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Ludwigsfelde\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, Ludwigsfelde\",\"coordinates\":\"52.30094,13.26171\",\"normalizedCountyName\":\"Teltow-Fläming\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Ludwigsfelde, Brandenburg, DEU\",\"location\":\"DE, Ludwigsfelde\",\"region\":\"\",\"buildingCodeList\":[\"THF61\"],\"normalizedCityName\":\"Ludwigsfelde\"}"],"normalized_location":"Ludwigsfelde, Brandenburg, DEU","optional_search_labels":["aws.team-dc","aws.team-eu-sovereign-cloud","aws.team-ais"],"posted_date":"November 11, 2025","preferred_qualifications":"- You have several years of working within a data center.\u003cbr/\u003e- You have an associates or Bachelor’s degree in applicable engineering field or mechanical or electrical trades.\u003cbr/\u003e- Certified electrician as per German regulations.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-aws-cloud-management","source_system":"JobCreator","state":null,"title":"Engineering Operations Technician, Data Center Engineering Operations","university_job":null,"updated_time":"43 minutes","url_next_step":"https://account.amazon.com/jobs/3124355/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-aws-cloud-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent","business_category":"fulfillment-ops","city":"Cajamar","company_name":"Amazon Servicos de Varejo do Brasil Ltda.","country_code":"BRA","description":"Na Amazon, trabalhamos para ser a empresa mais centrada no cliente do planeta. Desde a nossa fundação em 1994, evoluímos de uma livraria online para líder global em tecnologia em e-commerce, computação em nuvem, streaming digital e inteligência artificial. Distribuímos milhões de produtos todos os anos para nossos clientes fiéis em mais de 100 países. Nosso espírito inovador nos impulsiona a constantemente desafiar limites e redefinir o que é possível em logística e entrega.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eA equipe de Operações da Amazon está buscando uma pessoa recém-formada altamente qualificada e motivada para trabalhar na gestão do controle diário de estoque, garantia de qualidade e atividades de capacidade do nosso Armazém. As atividades de controle de estoque e garantia de qualidade desempenham um papel fundamental na implementação das melhores práticas de Acondicionamento e Separação, bem como na gestão da capacidade do Armazém, impactando diretamente na capacidade da Amazon de atender os clientes no prazo.\u003cbr/\u003e\u003cbr/\u003ePrincipais responsabilidades\u003cbr/\u003e • Apoiar, orientar e motivar 50-100 Associados Amazon sob sua supervisão direta\u003cbr/\u003e • Trabalhar de forma independente e operar em um ambiente autônomo \u003cbr/\u003e• Ficar em pé/caminhar durante turnos de até 12 horas \u003cbr/\u003e• Disposição e capacidade de trabalhar regularmente em padrões de turno que incluem noites, fins de semana e/ou feriados com base nas necessidades do negócio. \u003cbr/\u003eEmbora os turnos variem de local para local, a maioria segue uma semana de trabalho fixa de 3x2\u003cbr/\u003e\u003cbr/\u003e• Supervisionar entregas de caminhões, manusear e classificar pacotes usando paleteiras, operar equipamentos PIT (em instalações aplicáveis) e intervir quando necessário\u003cbr/\u003e • Trabalhar em um ambiente onde o nível de ruído varia • Levantar até 22 quilos e frequentemente empurrar, puxar, agachar, curvar e alcançar\u003cbr/\u003e • Subir e descer escadas (quando aplicável)\u003cbr/\u003e\u003cbr/\u003eQUALIFICAÇÕES BÁSICAS \u003cbr/\u003e• Concluiu o curso de Engenharia ou área correlata nos últimos 24 meses [OU] cursando o último semestre da graduação [OU] mestrado/doutorado em Engenharia ou área correlata\u003cbr/\u003e\u003cbr/\u003eQUALIFICAÇÕES PREFERÍVEIS\u003cbr/\u003e • Fortes habilidades de comunicação, tanto verbal quanto escrita\u003cbr/\u003e • Excelente atendimento ao cliente e habilidades interpessoais\u003cbr/\u003e • Conhecimento avançado em pacote office\u003cbr/\u003e• Inglês intermediário B2+ ou superior\u003cbr/\u003e\u003cbr/\u003eA Amazon está comprometida com um ambiente de trabalho diverso e inclusivo. A Amazon é uma empregadora que oferece oportunidades iguais e não discrimina com base em raça, nacionalidade, gênero, identidade de gênero, orientação sexual, status de veterano protegido, deficiência, idade ou outros status legalmente protegidos.\u003cbr/\u003e\u003cbr/\u003eNossa remuneração reflete o custo da mão de obra nos mercados geográficos do Brasil. O salário-base para este cargo permanente em tempo integral de R$12.000 por mês (além das RSUs da Amazon e dos Pagamentos de Adesão no Ano 1 e Ano 2).\u003cbr/\u003e","department_cost_center":null,"description_short":"Na Amazon, trabalhamos para ser a empresa mais centrada no cliente do planeta. Desde a nossa fundação em 1994, evoluímos de uma livraria online para líder global em tecnologia em e-commerce, computação","display_distance":null,"id":"251a1dc8-3b3c-4359-a53b-b0b4b54122ee","id_icims":"3161839","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3161839/gerente-de-area-recem-formados-e-futuros-graduados-brcf","job_schedule_type":"full-time","location":"BR, SP, Cajamar","locations":["{\"normalizedStateName\":\"Sao Paulo\",\"normalizedCountryCode\":\"BRA\",\"city\":\"Campinas\",\"countryIso3a\":\"BRA\",\"countryIso2a\":\"BR\",\"locationNonStemming\":\"Brazil, SP, Campinas\",\"coordinates\":\"-22.90904,-47.06454\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Brazil\",\"normalizedLocation\":\"Campinas, Sao Paulo, BRA\",\"location\":\"BR, SP, Campinas\",\"region\":\"SP\",\"buildingCodeList\":[\"DCP5\",\"GRU416\",\"GRU2\",\"GRU52\",\"EPN8\",\"VCP1\",\"ESP90\"],\"normalizedCityName\":\"Campinas\"}","{\"normalizedStateName\":\"Sao Paulo\",\"normalizedCountryCode\":\"BRA\",\"city\":\"Cajamar\",\"countryIso3a\":\"BRA\",\"countryIso2a\":\"BR\",\"locationNonStemming\":\"Brazil, SP, Cajamar\",\"coordinates\":\"-23.35635,-46.87702\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Brazil\",\"normalizedLocation\":\"Cajamar, Sao Paulo, BRA\",\"location\":\"BR, SP, Cajamar\",\"region\":\"SP\",\"buildingCodeList\":[\"GRU5\"],\"normalizedCityName\":\"Cajamar\"}"],"normalized_location":"Cajamar, Sao Paulo, BRA","optional_search_labels":[],"posted_date":"January 19, 2026","preferred_qualifications":"- Are enrolled in a Bachelor's degree\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-university-ops-pathways","source_system":"JobCreator","state":"SP","title":"Gerente de Área - (Recém-formados e Futuros Graduados), BRCF","university_job":null,"updated_time":"44 minutes","url_next_step":"https://account.amazon.com/jobs/3161839/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-university-ops-pathways","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}