{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Speak, write, and read fluently in English, and have the ability to take direction in English\u003cbr/\u003e- Speak, write, and read fluently in Spanish\u003cbr/\u003e- Experience in management\u003cbr/\u003e- Experience with Microsoft Office\u003cbr/\u003e- Experience in project management including resource planning, managing schedules, reporting project status and prioritizing tasks\u003cbr/\u003e- Valid driver's license with access to a personal vehicle for daily use","business_category":"aws","city":"Zaragoza","company_name":"Amazon Data Services Spain, S.L.","country_code":"ESP","description":"AWS Infrastructure Services (AIS)\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eWe are looking looking for a Manager to join our expanding Infrastructure Operations team. The Infrastructure Delivery Manager manages the implementation and delivery of inbound capacity and equipment. \u003cbr/\u003e\u003cbr/\u003eIf you would like to use people skills and technical knowledge and apply them to delivering on-time, defect-free service, we’d like to meet you. Your work will help to create sustainable processes and standards; and drive automation opportunities to reduce delivery cycle times and to improve quality without impacting network availability.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe Infra Delivery Manager will:\u003cbr/\u003e- Prioritize and assign tasks to data center technicians and operators, project management, coaching and creating documentation.\u003cbr/\u003e- Manage inbound capacity from receiving through deployment stages\u003cbr/\u003e- Manage the installation of racks in a data center environment\u003cbr/\u003e- Guide, train and educate staff on the best practices related to all service owner issues\u003cbr/\u003e- Manage tasks and deliverables across small to large-size projects\u003cbr/\u003e- Recommend, document, and oversee policies and procedures to meet industry best practices and to meet required SLAs\u003cbr/\u003e- Provide weekly report to the data center manager\u003cbr/\u003e- Coordinate team resources to support project and delivery needs, to include emergency projects, change management and maintenance window support, and potential off-hours and on-call needs.\u003cbr/\u003e- Recruit and train data technicians to ensure appropriate staffing levels\u003cbr/\u003e- Host weekly staff meetings\u003cbr/\u003e- Drive compliance to Amazon performance management requirements\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThe Infra Delivery Capacity Install Manager\u003cbr/\u003e- Manage the daily operations for installing racks across the Amazon data center platform\u003cbr/\u003e- Oversee their development and growth of their team\u003cbr/\u003e- Tracking budgets, providing strategic direction and proposing technical solutions \u003cbr/\u003e- Solve problems at their root and step back to understand the broader context\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded .professional\u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Infrastructure Services (AIS)AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running.","display_distance":null,"id":"ad804198-9782-4434-b5e1-ffe58961b252","id_icims":"3147195","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3147195/id-rack-install-manager-dcc-communities","job_schedule_type":"full-time","location":"ES, Zaragoza","locations":["{\"normalizedStateName\":\"Aragon\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Huesca\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, Huesca\",\"coordinates\":\"42.13357,-0.40919\",\"normalizedCountyName\":\"Huesca\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Huesca, Aragon, ESP\",\"location\":\"ES, Huesca\",\"region\":\"\",\"buildingCodeList\":[\"ZAZ61\"],\"normalizedCityName\":\"Huesca\"}","{\"normalizedStateName\":\"Aragon\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Zaragoza\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, Zaragoza\",\"coordinates\":\"41.65184,-0.8811\",\"normalizedCountyName\":\"Zaragoza\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Zaragoza, Aragon, ESP\",\"location\":\"ES, Zaragoza\",\"region\":\"\",\"buildingCodeList\":[\"ZAZ60\"],\"normalizedCityName\":\"Zaragoza\"}"],"normalized_location":"Zaragoza, Aragon, ESP","optional_search_labels":[],"posted_date":"January 13, 2026","preferred_qualifications":"- Experience as a network engineer with deployments for large-scale networks in a corporate environment and hands-on experience in physical infrastructure installations including hardware integration, racking, and cabling\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-data-science-primary","source_system":"JobCreator","state":null,"title":"ID Rack Install Manager , DCC Communities ","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3147195/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-data-science-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience leading and managing a team\u003cbr/\u003e- Experience working with multiple groups of stakeholders\u003cbr/\u003e- Bachelor's degree or above\u003cbr/\u003e- Fluency, both written and spoken, in two of the following languages: English, German, Arabic","business_category":"fulfillment-ops","city":"Kaiserslautern","company_name":"Amazon Kaiserslautern GmbH","country_code":"DEU","description":"Operations is the beating heart of Amazon. This key part of our business makes sure we fulfil and dispatch orders efficiently so that our customers get their items on time. As an Area Manager, you’ll make sure your site is running as smoothly as it should so that we can meet customer demand. You will be leading a team that helps keep our operations safe, efficient, and of a high quality and taking on a number of projects across our network to drive productivity. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003ePromote a culture of safety and wellbeing\u003cbr/\u003eAnalyse and implement corrective actions to make sure quality and productivity are at consistently high levels, and business objectives are met across all shifts\u003cbr/\u003eSupport and lead a team and handle administrative work alongside building and supporting a strong team culture\u003cbr/\u003eAnalyse performance and suggest process improvements to optimise work and improve customer service\u003cbr/\u003eCollaborate with other managers to standardise shift processe\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou’ll work shifts and be based at one of our operational sites. Your main focus will be to maintain safety standards within your team and across your site. You’ll also monitor and maintain process efficiency. Your days will always include prioritising routine team management and daily operational tasks, alongside other tasks like individual escalations, process improvement work and wide-scale operational contingency planning.\u003cbr/\u003eBeing a key part of the operations team involves working with colleagues in other teams and external partners to make sure we stay on track to meet our customer demands and targets. This will involve analysing data and performance metrics with leaders in your business area, as well as discussing the operational pros and cons of technical improvements with engineers.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eCustomer Fulfilment, or CF, is where it all started for Amazon. CF has scaled up from a humble team of booksellers to a sophisticated global team which handles more than 1.5 million orders every day. The team is the foundation of our business and its efforts have helped us diversify across new regions and services. With the help of emerging technology, we’re always looking for ways to offer a bigger, better product range – delivered quickly and affordably.\u003cbr/\u003e\u003cbr/\u003eThe CF team are the first people in the chain that helps customers get products at the speed we’re known for. We’re based in Fulfilment Centres, which are at the heart of Amazon’s fast-paced Operations network. Our centres are sometimes referred to as the ‘First Mile’ because it’s where most Amazon packages start their journey. We help to manage dynamic inventory and facilitate speedy deliveries round the clock.\u003cbr/\u003e\u003cbr/\u003eLots of different people work in our Fulfilment Centres, so there are plenty of opportunities for every skillset. Some of us work with physical products, while others analyse data to help everyone across the business make smart decisions.","department_cost_center":null,"description_short":"Operations is the beating heart of Amazon. This key part of our business makes sure we fulfil and dispatch orders efficiently so that our customers get their items on time. As an Area Manager, you’ll make","display_distance":null,"id":"1018872f-846e-47e1-bd85-86aade2a145a","id_icims":"3152084","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3152084/area-manager","job_schedule_type":"full-time","location":"DE, Kaiserslautern","locations":["{\"normalizedStateName\":\"Rhineland-Palatinate\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Kaiserslautern\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, Kaiserslautern\",\"coordinates\":\"49.44208,7.76045\",\"normalizedCountyName\":\"Kaiserslautern (City)\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Kaiserslautern, Rhineland-Palatinate, DEU\",\"location\":\"DE, Kaiserslautern\",\"region\":\"\",\"buildingCodeList\":[\"SCN2\"],\"normalizedCityName\":\"Kaiserslautern\"}"],"normalized_location":"Kaiserslautern, Rhineland-Palatinate, DEU","optional_search_labels":["fulfillment-and-operations.fulfillment-center-mgmt-emea"],"posted_date":"January  5, 2026","preferred_qualifications":"- Experience with data analysis\u003cbr/\u003e- Experience in warehouse operations and logistics or equivalent\u003cbr/\u003e- Experience with MS Office (Word, Excel, PowerPoint, and Outlook)\u003cbr/\u003e- Current studies or a recently obtained Bachelor’s or Master’s degree in logistics, business administration/economics, engineering, or a comparable field of study\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":null,"title":"Area Manager","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3152084/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- Knowledge of key electrical competencies and theory","business_category":"aws","city":"Frankfurt","company_name":"A100 ROW GmbH","country_code":"DEU","description":"The Data Center Engineering Operations Technician (EOT) is responsible for delivery of best practice systems and problem resolution on all data center electrical and mechanical infrastructure (UPS, MV electrical systems, generators, cooling systems etc.) within the data center environment in a specific location. The role requires a highly driven, self-managed individual who demonstrates initiative and proactively seeks solutions to complex technical problems. This position requires frequent site interventions, critical switching activities, along with troubleshooting and fixing infrastructure issues. The role would suit someone who enjoys working in a ‘hands on’ capacity on Mechanical and Electrical (M\u0026E) infrastructure such as diesel generators, switchgear, UPS’s, PDU’s, AHU’s, fire detection systems and building automation systems. You will report to the Data Center Engineering Operations Manager.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThe successful candidate will be accountable for:\u003cbr/\u003e\u003cbr/\u003e· Setting and maintaining the highest standards for safety and actively promoting a world-class safety culture in all aspects of operational procedure\u003cbr/\u003e· Driving continuous improvement efforts on infrastructure through standardization of procedures and policies, while delivering performance against agreed metrics\u003cbr/\u003e· Enabling the operations organization to delivering 100% up-time on all customer supporting infrastructure\u003cbr/\u003e· Collaborating effectively with internal \u0026 external stakeholders to deliver operational excellence for all AWS customers\u003cbr/\u003e· Responsible for ensuring that the preventive maintenance of site-critical facility infrastructure is planned and executed to the highest standards, in accordance to AWS procedures\u003cbr/\u003e· In charge of facility monitoring \u0026 supervision (via BMS, PMS, Walkthrough...etc.)\u003cbr/\u003e· Participation in the successful delivery of build-out and retrofit of Data Center infrastructure\u003cbr/\u003e· Ensuring organizational capability to react \u0026 respond appropriately to any potential customer-impacting event on any component of electrical or mechanical infrastructure.\u003cbr/\u003e· Reviewing incident reports, documenting periodic trend summaries, and providing updates and recommended actions to management\u003cbr/\u003e· Draft, update \u0026 maintain method statements, standard operating procedures, emergency response procedures, preventive maintenance programs, and all technical documentation pertaining to DCEO\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e· Work on a 24x7 schedule (where applicable)\u003cbr/\u003e· Work at heights and from ladders.\u003cbr/\u003e· Perform physical tasks during the shift\u003cbr/\u003e· Work in a noisy environment with ear protection\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003e“Work/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. This job opportunity is available both for the full time and part time employment.”\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.","department_cost_center":null,"description_short":"The Data Center Engineering Operations Technician (EOT) is responsible for delivery of best practice systems and problem resolution on all data center electrical and mechanical infrastructure (UPS, MV","display_distance":null,"id":"f5dae70f-c371-4cb9-a946-31c7fd95ee63","id_icims":"3167404","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3167404/data-center-engineering-operations-technician-m-f-d-dc-engineering-and-facility-operations-dceo","job_schedule_type":"full-time","location":"DE, HE, Frankfurt","locations":["{\"normalizedStateName\":\"Hesse\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Frankfurt\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, Frankfurt\",\"coordinates\":\"50.11208,8.68341\",\"normalizedCountyName\":\"Frankfurt\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Frankfurt, Hesse, DEU\",\"location\":\"DE, Frankfurt\",\"region\":\"\",\"buildingCodeList\":[\"FRAK\",\"FRA184\",\"FRA170\",\"FRA69\",\"FRA106\",\"FRA168\",\"FRA136\",\"FRA140\",\"FRA154\",\"FRA72\",\"FRA171\",\"FRA105\",\"FRA86\",\"FRA41\",\"FRA2\",\"FRA183\",\"FRA88\",\"FRA167\",\"FRA098\",\"FRA153\",\"FRA211\",\"FRA156\",\"FRA19\",\"FRA66\",\"FRA181\",\"FRA139\",\"FRA67\",\"FRA89\",\"FRA174\",\"FRA108\",\"FRA73\",\"FRA152\",\"FRA155\",\"FRA149\",\"FRA92\",\"FRA250\",\"FRA70\",\"FRA94\",\"FRA16\",\"FRA176\",\"FRA162\",\"FRA101\",\"FRA146\",\"FRA17\",\"FRA158\",\"FRA20\",\"FRA102\",\"FRA244\",\"FRA18\",\"FRA15\",\"FRA175\",\"FRA93\",\"FRA180\",\"FRA150\",\"FRA145\",\"FRA161\",\"FRA148\",\"FRA103\",\"FRA109\",\"FRA97\",\"FRA6\",\"FRA21\",\"FRA151\",\"FRA147\",\"FRA135\",\"FRA14\",\"FRA91\",\"FRA097\",\"FRA210\",\"FRA144\",\"FRA68\",\"FRA141\",\"FRA160\",\"FRA87\",\"FRA40\"],\"normalizedCityName\":\"Frankfurt\"}","{\"normalizedStateName\":\"Hesse\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Frankfurt\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, HE, Frankfurt\",\"coordinates\":\"50.11208,8.68341\",\"normalizedCountyName\":\"Frankfurt\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Frankfurt, Hesse, DEU\",\"location\":\"DE, HE, Frankfurt\",\"region\":\"HE\",\"buildingCodeList\":[\"FRA79\",\"FRA601\",\"FRA51\",\"FRA033\",\"FRA82\",\"FRA50\",\"FRA95\",\"FRA96\",\"FRA81\",\"FRA064\",\"FRA034\",\"FRA80\",\"FRA32\",\"FRA096\",\"FRA78\",\"FRA62\",\"FRA036\",\"FRA58\",\"FRA134\",\"FRA52\",\"FRA600\",\"FRA74\",\"FRA043\",\"FRA71\",\"FRA021\",\"FRA024\",\"FRA56\",\"FRA90\",\"FRA025\",\"FRA57\",\"FRA13\",\"FRA042\",\"FRA026\",\"FRA61\",\"FRA099\",\"FRA59\",\"DMQ9\",\"FRA75\",\"FRA06\",\"FRA044\",\"FRA53\",\"MHG6\",\"FRA045\",\"FRA54\",\"FRA63\",\"FRA4\",\"FRA602\",\"FRA60\",\"FRA035\"],\"normalizedCityName\":\"Frankfurt\"}","{\"normalizedStateName\":\"Hesse\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Frankfurt Am Main\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, Frankfurt Am Main\",\"coordinates\":\"50.11208,8.68341\",\"normalizedCountyName\":\"Frankfurt\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Frankfurt, Hesse, DEU\",\"location\":\"DE, Frankfurt Am Main\",\"region\":\"\",\"buildingCodeList\":[\"FRA222\",\"FRA212\",\"FRA64\",\"FRA98\",\"FRA02\",\"FRA05\"],\"normalizedCityName\":\"Frankfurt\"}"],"normalized_location":"Frankfurt, Hesse, DEU","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"January 27, 2026","preferred_qualifications":"- Experience in data center engineering\u003cbr/\u003e- Knowledge of mechanical systems (Mechanical, HVAC systems, Controls)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"HE","title":"Data Center Engineering Operations Technician (m/f/d), DC Engineering and Facility Operations, DCEO","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3167404/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school diploma or equivalent\u003cbr/\u003e- Experience in computer architecture, or experience with general troubleshooting/debugging of hardware\u003cbr/\u003e- Experience with Linux and/or Windows Operating System support including in-depth understanding of one or both OSs, configuring, managing or troubleshooting systems at scale\u003cbr/\u003e- Valid and active driver's license\u003cbr/\u003e- - High school or equivalent diploma\u003cbr/\u003e- - 2+ years of computer hardware experience, including troubleshooting and repairing experience\u003cbr/\u003e- - 1+ years of corporate setting Windows, Mac or Linux Operating systems support experience\u003cbr/\u003e- -Driving license","business_category":"amazon-business","city":"Okmiany","company_name":"Amazon Fulfillment Poland sp. z o.o. - D15","country_code":"POL","description":"Amazon’s EU Transportation Operations Management (TOM) Tech Integration and Execution team is looking for Technicians who want to create a best-in-class network and maintain sustainable yard systems within Amazon Transportation Services.\u003cbr/\u003eAs a TIE(Technology Integration and Execution) Technician, you will use your knowledge and specialized skills to implement technical solutions and provide high quality support for computer and electronic hardware and, operating systems, and software used in TOM managed yards. You are able to determine when it is appropriate to deviate from a standard practice to accomplish the desired result. You can troubleshoot and solve straightforward problems that do not have defined SOPs.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tManage and resolve technical tickets within SLA timelines\u003cbr/\u003e•\tComprehensively understand the Gatehouse PC configurations (hardware and software) and how 8-9 GH automation devices (per lane) are connected to the PC (their individual drivers, mac and IP address etc).\u003cbr/\u003e•\tGet a comprehensive understanding of all TIE SOPs that guide towards potential issues causing the problem. Technician has to use their developed knowledge to isolate the root cause by iterative testing of various variables in combination.\u003cbr/\u003e•\tOwn and manage the inventory of all GH automation equipment, keeping log of items checked out and raise ticket for fresh orders.\u003cbr/\u003e•\t\u003cbr/\u003e•\tCoordinate with TIE Procurement, OTS, RME, and RYA/Gate teams\u003cbr/\u003e•\tConduct daily health checks across all RRG sites and perform early fault detection\u003cbr/\u003e•\tMonitor equipment performance metrics (license plate detection, vehicle detection, audio quality)\u003cbr/\u003e•\tPerform quarterly preventive maintenance on RRG infrastructure\u003cbr/\u003e•\tConduct deep-dive investigations for critical system performance issues\u003cbr/\u003e•\tDocument findings, root cause analysis, corrective actions, and prevention recommendations\u003cbr/\u003e•\tMaintain inventory accuracy through weekly monitoring and audits\u003cbr/\u003e•\tServe as primary liaison with vendors and conduct post-work inspections\u003cbr/\u003e•\tCollaborate with RYA and Gate teams on operational issues and dashboard accuracy\u003cbr/\u003e•\tRaise tickets with clear problem descriptions, impact assessments, and supporting documentation\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon couldn’t deliver at pace without the Amazon Transportation Service (ATS) team. As part of ATS, you’ll be welcomed into a diverse team that plays a central role in our success. Using air, sea and road transport, as well as sortation centres equipped with the latest technology, you’ll help Amazon’s transport run at maximum efficiency. Our team captures data and uses it to drive decisions. They are key to making Amazon more innovative and efficient.\u003cbr/\u003eWe put safety first as our people are our priority. And we use the expertise of our people to get packages to their destination.\u003cbr/\u003e\u003cbr/\u003eThe minimum basic salary for this position is PLN 5,908 gross per month. In accordance with the applicable legal requirements, we also state that the minimum salary for this position is determined by the relevant collective bargaining agreement. Depending on experience and qualifications, there is a willingness to overpay. In addition, depending on the position, we offer sign-on payments and restricted stock unit (RSU) award as well as employee discount.","department_cost_center":null,"description_short":"Amazon’s EU Transportation Operations Management (TOM) Tech Integration and Execution team is looking for Technicians who want to create a best-in-class network and maintain sustainable yard systems within","display_distance":null,"id":"7d2f41aa-01ac-498b-8ff5-d3a435adee00","id_icims":"3176973","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Support Engineering","job_function_id":null,"job_path":"/en/jobs/3176973/tom-technician-level-3-eu-tom-tie","job_schedule_type":"full-time","location":"PL, Okmiany","locations":["{\"normalizedStateName\":\"Lower Silesian Voivodeship\",\"normalizedCountryCode\":\"POL\",\"city\":\"Okmiany\",\"countryIso3a\":\"POL\",\"countryIso2a\":\"PL\",\"locationNonStemming\":\"Poland, Okmiany\",\"coordinates\":\"51.27222,15.78091\",\"normalizedCountyName\":\"Powiat Legnicki\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Poland\",\"normalizedLocation\":\"Chojnów (Gmina), Lower Silesian Voivodeship, POL\",\"location\":\"PL, Okmiany\",\"region\":\"\",\"buildingCodeList\":[\"WRO5\"],\"normalizedCityName\":\"Chojnów (Gmina)\"}"],"normalized_location":"Chojnów (Gmina), Lower Silesian Voivodeship, POL","optional_search_labels":[],"posted_date":"February 10, 2026","preferred_qualifications":"- Bachelor's degree in engineering, technology, computer science, machine learning, robotics, operations research, statistics, mathematics or equivalent quantitative field, or PhD\u003cbr/\u003e- Experience in managing and troublshooting network, or experience in technical support\u003cbr/\u003e- Bachelor's degree, or experience in professional or military settings\u003cbr/\u003e- Experience in technical support, or experience in networking administration and troubleshooting and experience troubleshooting and debugging technical systems\u003cbr/\u003e- - Bachelor's degree in engineering, technology, computer science, machine learning, robotics, operations research, statistics, mathematics or equivalent quantitative field\u003cbr/\u003e- - 2+ years of supporting and maintaining a corporate network environment experience\u003cbr/\u003e- - 2+ years of professional or military experience\u003cbr/\u003e- - 2+ years of network troubleshooting and support experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-business.team-consumer-3p-job-posting","source_system":"JobCreator","state":null,"title":"TOM Technician (Level 3), EU TOM TIE","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3176973/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-consumer-3p-job-posting","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"\u003cstrong\u003eWhat are your hours?\u003c/strong\u003e\u003cbr\u003eThis role requires working variable hours to match when customers need us most. You will work day shifts and late evening, and your work week is minimum 40hrs, i.e., 5x8hrs.\u003cstrong\u003e \u003c/strong\u003eIn order to match our customer demand, we schedule based on a variety of different shift patterns within the operating hours of 9am to 8pm Monday to Sunday. You may be required to work on national holidays and Sundays and will be compensated accordingly. Schedules will be known 6 weeks in advance to ensure that your personal life can plan well around your work. You will learn more about your exact schedule closer to your start date.\u003cbr\u003e\u003cbr\u003e\u003cstrong\u003eWhat qualifications do we need from you?\u003c/strong\u003e\n\u003cul\u003e\u003cli\u003eMinimum age: 18 years old\u003c/li\u003e\u003cli\u003eHave the right to work in the Netherlands\u003c/li\u003e\u003cli\u003eStrong communication skills in Dutch (both written and oral fluency)\u003c/li\u003e\u003cli\u003eExperience working with a computer\u003c/li\u003e\u003cli\u003eThe availability to work varying shifts from Monday to Sunday within the operating hours of 9am to 8pm\u003c/li\u003e\u003cli\u003eWillingness and ability to work in rotating shifts (i.e., early, late, weekend and compensated overtime as required)\u003c/li\u003e\u003cli\u003eInitial nine weeks availability for full-time training (paid)\u003c/li\u003e\u003cli\u003eYou\u0026#39;ll need a quiet, distraction free work space (dedicated office space with a desk and chair)\u003c/li\u003e\u003cli\u003eFrom a technical perspective, a minimum 50 Mbps broadband connection speed using a hard-wire ethernet internet connection (no WIFI). We will provide you with a complete equipment package ahead of your first day of training.\u003c/li\u003e\u003c/ul\u003e\n\u003cbr\u003e\u003cstrong\u003eWhat strengths will you bring?\u003c/strong\u003e\n\n\u003cul\u003e\u003cli\u003eHard-working, articulate, and detail-oriented\u003c/li\u003e\u003cli\u003eFriendly and customer-focused in every situation\u003c/li\u003e\u003cli\u003eAbility to learn quickly and embrace change\u003c/li\u003e\u003cli\u003eComfortable multi-tasking in a high-energy environment.\u003c/li\u003e\u003c/ul\u003e\n\u003cbr\u003e\u003cstrong\u003eWhat benefits will you receive?\u003c/strong\u003e\u003cbr\u003eOne of the great things about joining Amazon’s Customer Service team is that you don’t need past experience in customer service. You’ll receive training and be provided with a complete equipment package when you join. Additionally, we offer a number of benefits, including:\n\u003cul\u003e\u003cli\u003eLife insurance\u003c/li\u003e\u003cli\u003eInternet allowance\u003c/li\u003e\u003cli\u003eAmazon employee discount\u003c/li\u003e\u003cli\u003eLifestyle benefits and retail discounts through our Amazon Extras program\u003c/li\u003e\u003cli\u003eExpert training and ongoing opportunities to learn more and develop your skills\u003c/li\u003e\u003c/ul\u003e\n\u003cbr\u003e\u003cstrong\u003eIf this role sounds like it’s for you, then click on the link below to start the application process!\u003c/strong\u003e\u003cbr\u003eYou’ll need to allow 1-2 hours to complete the full application, including assessments which will evaluate your suitability for the role. We recommend using a laptop/desktop computer in order to get the best experience. You will have the option to save your application between each stage of the application process and return to it, if necessary, but we strongly advise you to complete the process in one sitting where possible. If you\u0026#39;re selected to move forward, your Dutch language skills will be assessed.\u003cbr\u003e\u003cbr\u003eIf successful, we will contact you about next steps!\u003cbr\u003e\u003cbr\u003e\u003cem\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build.\u003cbr\u003eProtecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice to know more about how we collect, use and transfer the personal data of our candidates.\u003c/em\u003e","business_category":"amazon-customer-service","city":"VCC - Netherlands - Virtual","company_name":"Amazon CS Netherlands B.V.","country_code":"NLD","description":"\u003cstrong\u003eRole: \u003c/strong\u003eCustomer Service Associate\u003cbr\u003e\u003cstrong\u003eJob Type: \u003c/strong\u003e12 month fixed-term contract, full time 40 hours per week\u003cbr\u003e\u003cstrong\u003eLocation: \u003c/strong\u003eNetherlands (virtual, work from home in the Netherlands at your registered Dutch home address)\u003cbr\u003e\u003cstrong\u003ePay Rate: \u003c/strong\u003e€15.25 per hour; salary increase after 6 months tenure\u003cbr\u003e\u003cstrong\u003eStart date:\u003c/strong\u003e  01 June 2026 (\u003cu\u003esubject to change/to be confirmed\u003c/u\u003e)\u003cbr\u003e\u003cbr\u003eOur mission at Amazon is to be Earth’s most customer-centric company, and our award-winning Customer Service team is a key part of achieving that goal. Doing our best for our customers is where we get our energy, and that’s why you’ll find we approach things differently here. You won’t be asked to read from a script or learn dialogue by heart. Instead, we’ll provide you with the training you need to problem solve for our customers. You’ll bring your unique personality to every customer conversation and deliver the exceptional support experience our customers love.\u003cbr\u003e\u003cbr\u003e\u003cstrong\u003eWhat will you do as a Customer Service Associate?\u003c/strong\u003e\u003cbr\u003eAs an Amazon Customer Service Associate, you have a very clear purpose: to prevent issues, solve queries, and delight our customers. You’ll be the first point of contact for our customers based in the Netherlands by answering their requests through phone, chat and/or email – this includes everything from order and product questions to payment matters and website guidance. Our Customer Service Associates use a variety of tools to navigate, research, and review solutions, and communicate effectively with customers.","department_cost_center":null,"description_short":"Role:Customer Service Associate Job Type:12 month fixed-term contract, full time 40 hours per week Location:Netherlands (virtual, work from home in the Netherlands at your registered Dutch home address) Pay Rate:15.25 per hour; salary increase after 6 mon","display_distance":null,"id":"a0Rar000002NMQ5EAO","id_icims":"SF260122591","is_intern":null,"is_manager":null,"job_category":"Customer Service","job_family":"Customer Service","job_function_id":null,"job_path":"/en/jobs/SF260122591/klantenservice-medewerker-virtueel-thuiswerken","job_schedule_type":"full-time","location":"NL, VCC - Netherlands - Virtual","locations":["{\"normalizedCountryCode\":\"NLD\",\"city\":\"VCC - Netherlands - Virtual\",\"countryIso3a\":\"NLD\",\"countryIso2a\":\"NL\",\"locationNonStemming\":\"Netherlands, VCC - Netherlands - Virtual\",\"coordinates\":\"52.36993,4.90787\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"Netherlands\",\"normalizedLocation\":\"NLD\",\"location\":\"NL, VCC - Netherlands - Virtual\",\"buildingCodeList\":[\"Virtual ContactCtr Netherlands\"]}"],"normalized_location":"NLD","optional_search_labels":["hvh-amazon-customer-service"],"posted_date":"February 11, 2026","preferred_qualifications":null,"primary_search_label":null,"source_system":"HVH","state":null,"title":"Klantenservice medewerker, Virtueel (thuiswerken)","university_job":null,"updated_time":"15 minutes","url_next_step":"https://hvr-amazon.my.site.com/JobDetails?reqid=a0Rar000002NMQ5EAO\u0026isapply=1","team":{"id":null,"business_category_id":null,"identifier":null,"label":null,"created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience as a mentor, tech lead or leading an engineering team\u003cbr/\u003e- Experience leading the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems\u003cbr/\u003e- Experience in professional, non-internship software development\u003cbr/\u003e- Experience programming with at least one modern language such as Java, C++, or C# including object-oriented design\u003cbr/\u003e- Experience in development in the last 3 years","business_category":"north-america-stores","city":"Barcelona","company_name":"Amazon Spain Services, S.L.U.","country_code":"ESP","description":"The Merchandising Tech team builds the technology that helps customers discover new, popular, and relevant products across Amazon worldwide. We are building the next generation of AI-driven systems that improve how millions of customers discover products across Amazon’s shopping experiences. By combining large language models (LLMs), vision-language models (VLMs), and Amazon’s first-party data on shopper behavior and conversion patterns, we design systems that assist in generating, selecting, and optimizing marketing and merchandising experiences at scale. We train, evaluate, and operate models end-to-end in-house, from data pipelines to model lifecycle management and large-scale inference, ensuring that AI capabilities are tightly integrated into our distributed systems and measurable in customer and business impact.\u003cbr/\u003e\u003cbr/\u003eWe are looking for a Senior Software Engineer who will lead the design and evolution of systems that generate, assemble, and optimize creative assets at scale across regions and business surfaces. You will build systems that automatically produce and adapt images, text, layouts, and multimodal content used across merchandising surfaces. These systems must balance creative flexibility, brand constraints, performance signals, and operational reliability. These platforms support high-traffic global events across Amazon marketplaces worldwide, requiring predictable scalability and operational resilience under peak conditions.\u003cbr/\u003e\u003cbr/\u003eAs a Senior Software Engineer, you are a recognized technical leader who drives the engineering strategy, mentors team members, and partners with cross-functional teams to deliver complex end-to-end AI solutions. Your work focuses on architecting and implementing robust systems in ambiguous problem areas where both the business problem and solution approach need to be defined. This role requires end-to-end ownership across model integration, distributed services, and measurement frameworks. You will identify structural bottlenecks in AI system evolution and design architectural boundaries that allow model development, experimentation, and application services to evolve independently without compromising reliability or scalability.\u003cbr/\u003e\u003cbr/\u003eYou will define architectural patterns for creative automation, establish engineering standards for AI-driven asset generation, and ensure that experimentation, ranking integration, and monitoring are designed as first-class system capabilities. You will collaborate closely with applied scientists, product managers, and downstream platform teams to translate model capabilities into reliable, scalable creative services used globally. This role offers the opportunity to take cross-organizational technical ownership, drive highly visible initiatives, and influence how GenAI systems are designed and adopted across multiple teams.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs a member of our software engineering team you can expect to:\u003cbr/\u003e\u003cbr/\u003e- Solve problems which require novel solutions in low-latency systems\u003cbr/\u003e- Solve problems that center around scale, across all realms, over hundreds of millions of customers\u003cbr/\u003e- Write high quality, maintainable code\u003cbr/\u003e- Perform peer code-reviews and contribute to technical designs\u003cbr/\u003e- Integrate and collaborate with applied science experts specialized in machine learning recommendation models\u003cbr/\u003e- Think outside the box when it comes to innovating for the customer. Our team is looking for fresh ideas to engage with customers across both internal and external mediums\u003cbr/\u003e- Learn and grow from a talented group of individuals within our team and within our sister teams\u003cbr/\u003e- Mentor new members as we continue to add to our footprint and scope","department_cost_center":null,"description_short":"The Merchandising Tech team builds the technology that helps customers discover new, popular, and relevant products across Amazon worldwide. We are building the next generation of AI-driven systems that","display_distance":null,"id":"76522f7b-0033-4eec-83eb-bf359e7517fa","id_icims":"3172676","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3172676/senior-software-development-engineer-discovery-tech","job_schedule_type":"full-time","location":"ES, B, Barcelona","locations":["{\"normalizedStateName\":\"Catalonia\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Barcelona\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, B, Barcelona\",\"coordinates\":\"41.38804,2.17001\",\"normalizedCountyName\":\"Barcelona\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Barcelona, Catalonia, ESP\",\"location\":\"ES, B, Barcelona\",\"region\":\"B\",\"buildingCodeList\":[\"BCN10\"],\"normalizedCityName\":\"Barcelona\"}"],"normalized_location":"Barcelona, Catalonia, ESP","optional_search_labels":[],"posted_date":"February  3, 2026","preferred_qualifications":"- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- Experience with full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"north-america-stores.team-upmt","source_system":"JobCreator","state":"B","title":"Senior Software Development Engineer, Discovery Tech","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3172676/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-upmt","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience using data to influence business decisions\u003cbr/\u003e- CA fresher / 1+ years of experience in FP\u0026A, closing of Books of accounts and reporting \u0026 analytics","business_category":"finance","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"About the Organization: Amazon is a US-based multinational electronic commerce company headquartered in Seattle, Washington. Amazon.com started as an online bookstore, but soon diversified into many other categories, with a vision to be earth's most customer-centric company \u0026 to build a place where people can come to find and discover anything they might want to buy online. \u003cbr/\u003e\u003cbr/\u003eAbout the role: Amazon's Global Finance Solutions (GFS) team is a fast-paced, team-focused, dynamic environment and delivering great experiences for our customers is top priority. GFS is seeking a Financial Analyst for EU CCT Finance team. The candidate would be responsible for financial close and performing related reporting, accruals etc. Additionally, the role would support monthly P\u0026L analysis, perform financial reporting and forecasts, use financial systems and advanced MS Excel functions to work with large data sets, and perform headcount reporting, planning and forecasting. Additional responsibilities would include establishing, measuring and monitoring weekly KPI metric discussions for new and/or existing business initiatives and operational performance and assisting in measuring and reporting progress on key goals for the business team in a timely and accurate manner. The candidate would also perform ad-hoc business analyses and financial modeling, provide inputs for monthly and quarterly business reviews in a timely manner, facilitate business reviews with data analysis, identify and implement solutions to resolve, improve, automate, standardize, or simplify finance processes, and identify incomplete or inaccurate data, root cause of data issues, escalate discrepancies, fix data where possible or partner to deliver a solution.","department_cost_center":null,"description_short":"About the Organization: Amazon is a US-based multinational electronic commerce company headquartered in Seattle, Washington. Amazon.com started as an online bookstore, but soon diversified into many other","display_distance":null,"id":"484a4f19-87d4-4506-8782-bc2259e8a927","id_icims":"3161367","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/Planning","job_function_id":null,"job_path":"/en/jobs/3161367/financial-analyst-gfs-fp-a","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR13\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"January 16, 2026","preferred_qualifications":"- Experience in managing, evaluating, analyzing data quickly and creating meaningful business reporting.\u003cbr/\u003e- Good financial acumen with problem-solving and decision-making skills.\u003cbr/\u003e- Manage competing priorities and meet deadlines.\u003cbr/\u003e- Good interpersonal skills — including written and oral communication skills.\u003cbr/\u003e- Advanced proficiency in Excel.\u003cbr/\u003e- Retail industry experience.\u003cbr/\u003e- Experience in VBA, COGNOS and SQL is a plus.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-fpa","source_system":"JobCreator","state":"KA","title":"Financial Analyst, GFS FP\u0026A","university_job":null,"updated_time":"22 minutes","url_next_step":"https://account.amazon.com/jobs/3161367/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fpa","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience with Excel or Tableau (data manipulation, macros, charts and pivot tables)","business_category":"no-business-category","city":"Hyderabad","company_name":"ADCI HYD 13 SEZ","country_code":"IND","description":"We are seeking an experienced, innovative and detail-oriented User research professional to join our dynamic team. Professional plays a crucial role in supporting Product \u0026 UX manager strategic decision-making by providing accurate market intelligence.\u003cbr/\u003eThe Market Researcher gathers market data from internal and external sources, industry reports, and primary research to assist internal stakeholders with data to support their business needs. The Product support team focuses on collecting, analyzing, and interpreting market data to produce actionable insights to inform our business decisions and drive growth. This role requires fast learning capabilities, deep curiosity about seller behavior and voices, and the research \u0026 analytical horsepower to offer actionable insights.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will be a self-starter who is energized by a fast-paced and highly entrepreneurial environment. She/he will be comfortable working in an environment with minimal supervision, and across multiple functions to drive consensus among stakeholders across various teams. Keys to success will be the ability to utilize customer insight and data to develop marketing programs, own topical and high-value events for the categories and design high engagement campaigns. The candidate will be comfortable in analyzing data, gathering actionable conclusions and delivering stretch results in a fast-paced environment.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003ePerform Basic Quantitative and Qualitative Analysis of Research Data: Process and digest market research data to understand industry trends, emerging technologies, and market shifts relevant to the organization's products, services, or strategies. Design, plan, and execute user research projects using appropriate methodologies.\u003cbr/\u003e• Assist Internal Stakeholders with Market Research: Qualify and timely assist in internal inquiries from stakeholders seeking for market research data and insights through various research activities.\u003cbr/\u003e• Insight Generation and Reporting: Produce basic intelligence reports, presentations, and summaries for specific business needs and provide actionable insights to inform feature-level decisions and improve product design.\u003cbr/\u003e• Escalations: Reach out and escalate to Market Research providers for customized research or insights required by the business. Manage straightforward projects with measurable objectives, advocate for customer needs and maintain positive relationships with users ","department_cost_center":null,"description_short":"We are seeking an experienced, innovative and detail-oriented User research professional to join our dynamic team. Professional plays a crucial role in supporting Product \u0026 UX manager strategic decision-making","display_distance":null,"id":"27e654c7-948e-43bb-a696-72ab5109c925","id_icims":"3098326","is_intern":null,"is_manager":null,"job_category":"Research Science","job_family":"Marketing","job_function_id":null,"job_path":"/en/jobs/3098326/research-specialist-isg-international-seller-growth-isg","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD13\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":[],"posted_date":"September 30, 2025","preferred_qualifications":"- Experience working with a major brand or entertainment company in project/production management\u003cbr/\u003e- Experience in e-commerce, start ups, advertising, commercial\u003cbr/\u003e- Experience using data visualization tools\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"TS","title":"Research Specialist, ISG, International Seller Growth - ISG","university_job":null,"updated_time":"24 minutes","url_next_step":"https://account.amazon.com/jobs/3098326/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Formation et expérience : Bac Pro, BTS, BUT ou équivalent (Bac+2 minimum) en maintenance industrielle, électrotechnique ou mécanique, avec expérience en maintenance électrique et mécanique ou une expérience sur un poste similaire pour une durée d'au moins de deux ans.\u003cbr/\u003e- Maintenance préventive et GMAO : Expérience prouvée avec les systèmes de maintenance préventive planifiée et maîtrise des plateformes GMAO\u003cbr/\u003e- Dépannage et diagnostic : Capacités avancées de dépannage sur équipements de manutention et systèmes d'automatisation, avec maîtrise de la lecture des plans mécaniques et électriques\u003cbr/\u003e- Compétences techniques : Expérience pratique avec systèmes de convoyeurs, contrôleurs moteur, variateurs de fréquence et technologies de capteurs\u003cbr/\u003e- Compétences opérationnelles : Connaissance des normes de santé et sécurité, fortes compétences organisationnelles et excellentes capacités de communication","business_category":"fulfillment-ops","city":"Boves","company_name":"Amazon France Logistique SAS","country_code":"FRA","description":"Technicien de Maintenance (F/H) Chaque jour, des millions de clients comptent sur Amazon pour recevoir leurs commandes à temps. Derrière cette promesse se cache un réseau d'automatisation sophistiqué où chaque seconde compte. En tant que Technicien/ne RME, vous serez au cœur de cette mécanique de précision, gardien des technologies qui permettent à nos centres de distribution de fonctionner 24h/24 et 7j/7.\u003cbr/\u003eCe qui rend ce rôle unique ? Vous travaillerez sur des équipements à la pointe de la technologie, parfois conçus en interne, dans un environnement où l'innovation rencontre l'excellence opérationnelle. Votre expertise technique aura un impact direct et mesurable : chaque intervention réussie, c'est des milliers de colis qui arrivent à destination comme prévu.\u003cbr/\u003eSi vous adorez les challenges techniques, que vous vous épanouissez dans des environnements dynamiques et que vous voulez voir l'impact concret de votre travail à l'échelle mondiale, ce poste est fait pour vous.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eResponsabilités Clés\u003cbr/\u003eGarantir la sécurité et la conformité\u003cbr/\u003e• Promouvoir les meilleures pratiques de santé et sécurité dans toutes les activités de maintenance, en assurant la conformité totale aux normes et réglementations\u003cbr/\u003e• Effectuer des évaluations de risques et mettre en place des protocoles de sécurité pour les travaux de maintenance\u003cbr/\u003eAssurer l'excellence en maintenance préventive\u003cbr/\u003e• Exécuter des programmes complets de maintenance préventive planifiée sur des équipements automatisés diversifiés : convoyeurs, robots, systèmes de tri et d'emballage\u003cbr/\u003e• Utiliser les systèmes informatisés de gestion de la maintenance (GMAO) pour suivre, programmer et documenter les activités de maintenance\u003cbr/\u003e• Collaborer avec les fabricants d'équipements et prestataires externes pour optimiser les procédures de maintenance\u003cbr/\u003eIntervenir rapidement et résoudre les problèmes complexes\u003cbr/\u003e• Fournir une réponse rapide aux pannes d'équipement avec communication claire aux équipes opérationnelles\u003cbr/\u003e• Effectuer un dépannage avancé sur les systèmes électriques, mécaniques et d'automatisation complexes\u003cbr/\u003e• Utiliser les outils de diagnostic et documentation technique pour identifier efficacement les causes racines\u003cbr/\u003eMaîtriser les technologies d'automatisation\u003cbr/\u003e• Maintenir et configurer des systèmes d'automatisation sophistiqués incluant les contrôleurs logiques programmables (API) et réseaux de terrain\u003cbr/\u003e• Entretenir et calibrer les scanners de codes-barres, systèmes d'impression-application et équipements de tri\u003cbr/\u003eContribuer à l'amélioration continue\u003cbr/\u003e• Analyser les données de performance des équipements pour identifier les opportunités d'amélioration\u003cbr/\u003e• Développer et mettre en œuvre des initiatives de réduction des coûts par l'optimisation des équipements\u003cbr/\u003e• Partager les connaissances techniques et encadrer les techniciens juniors\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eHoraires de travail : Ce poste fonctionne dans un environnement 24h/24 et 7j/7 nécessitant une flexibilité avec des horaires variables, incluant nuits, week-ends et jours fériés.","department_cost_center":null,"description_short":"Technicien de Maintenance (F/H) Chaque jour, des millions de clients comptent sur Amazon pour recevoir leurs commandes à temps. Derrière cette promesse se cache un réseau d'automatisation sophistiqué où","display_distance":null,"id":"20ba6397-52d3-4dc7-aaf4-1f68c046b4d5","id_icims":"3178610","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3178610/technicien-de-maintenance-m-f-rme","job_schedule_type":"full-time","location":"FR, Boves","locations":["{\"normalizedStateName\":\"Hauts-de-France\",\"normalizedCountryCode\":\"FRA\",\"city\":\"Boves\",\"countryIso3a\":\"FRA\",\"countryIso2a\":\"FR\",\"locationNonStemming\":\"France, Boves\",\"coordinates\":\"49.84859,2.39268\",\"normalizedCountyName\":\"Somme\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"France\",\"normalizedLocation\":\"Boves, Hauts-de-France, FRA\",\"location\":\"FR, Boves\",\"region\":\"\",\"buildingCodeList\":[\"BVA1\"],\"normalizedCityName\":\"Boves\"}"],"normalized_location":"Boves, Hauts-de-France, FRA","optional_search_labels":["jdv.operations.rmetechnician","ops.lander-emea-rme-reliability","ops.lander-emea-rme-technician","ops.rme-technician","operations-team.reliability-maintenance-engineering-eu"],"posted_date":"February 11, 2026","preferred_qualifications":"- Certifications électriques : Habilitations électriques avec expérience en travaux d'ordre électrique et maintenance des contrôleurs moteur/variateurs\u003cbr/\u003e- Expertise en automatisation : Expérience avec systèmes Siemens (API), réseaux de terrain, robotique et systèmes automatisés de stockage/récupération\u003cbr/\u003e- Technologies de traçabilité : Expertise en configuration et maintenance de scanners de codes-barres et systèmes d'impression-application\u003cbr/\u003e- Technologie de maintenance 4.0: Utilisation et/ou exploitation des différentes technologies liées à la maintenance 4.0\u003cbr/\u003e- Leadership technique : Expérience d'encadrement de techniciens juniors avec compétences en rédaction technique pour la documentation\u003cbr/\u003e- Gestion de projets : Expérience en gestion de projet d'installations d'équipements et capacités multilingues (un atout)\u003cbr/\u003e- Machine de conditionnement: Entretien et mise au point de machine de conditionnement automatique\u003cbr/\u003e\u003cbr/\u003eAmazon est un employeur engagé pour l'égalité des chances. Nous sommes convaincus qu'une main d'oeuvre diversifée est essentielle à notre réussite. Nous prenons nos décisions de recrutement en fonction de votre expérience et de vos compétences. Nous apprécions votre envie de découvrir, d'inventer, de simplifier et de construire. La protection de votre vie privée et la sécurité de vos données constituent depuis longtemps une priorité absolue pour Amazon. Veuillez consulter notre Politique de Confidentialité pour en savoir plus sur la façon dont nous collectons, utilisons et traitons les données personnelles de nos candidats.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":null,"title":"Technicien de Maintenance M/F, RME","university_job":null,"updated_time":"24 minutes","url_next_step":"https://account.amazon.com/jobs/3178610/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Formation et expérience : Bac Pro, BTS, BUT ou équivalent (Bac+2 minimum) en maintenance industrielle, électrotechnique ou mécanique, avec expérience en maintenance électrique et mécanique ou une expérience sur un poste similaire pour une durée d'au moins de deux ans.\u003cbr/\u003e- Maintenance préventive et GMAO : Expérience prouvée avec les systèmes de maintenance préventive planifiée et maîtrise des plateformes GMAO\u003cbr/\u003e- Dépannage et diagnostic : Capacités avancées de dépannage sur équipements de manutention et systèmes d'automatisation, avec maîtrise de la lecture des plans mécaniques et électriques\u003cbr/\u003e- Compétences techniques : Expérience pratique avec systèmes de convoyeurs, contrôleurs moteur, variateurs de fréquence et technologies de capteurs\u003cbr/\u003e- Compétences opérationnelles : Connaissance des normes de santé et sécurité, fortes compétences organisationnelles et excellentes capacités de communication","business_category":"fulfillment-ops","city":"Boves","company_name":"Amazon France Logistique SAS","country_code":"FRA","description":"Technicien de Maintenance (F/H) Chaque jour, des millions de clients comptent sur Amazon pour recevoir leurs commandes à temps. Derrière cette promesse se cache un réseau d'automatisation sophistiqué où chaque seconde compte. En tant que Technicien/ne RME, vous serez au cœur de cette mécanique de précision, gardien des technologies qui permettent à nos centres de distribution de fonctionner 24h/24 et 7j/7.\u003cbr/\u003eCe qui rend ce rôle unique ? Vous travaillerez sur des équipements à la pointe de la technologie, parfois conçus en interne, dans un environnement où l'innovation rencontre l'excellence opérationnelle. Votre expertise technique aura un impact direct et mesurable : chaque intervention réussie, c'est des milliers de colis qui arrivent à destination comme prévu.\u003cbr/\u003eSi vous adorez les challenges techniques, que vous vous épanouissez dans des environnements dynamiques et que vous voulez voir l'impact concret de votre travail à l'échelle mondiale, ce poste est fait pour vous.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eResponsabilités Clés\u003cbr/\u003eGarantir la sécurité et la conformité\u003cbr/\u003e• Promouvoir les meilleures pratiques de santé et sécurité dans toutes les activités de maintenance, en assurant la conformité totale aux normes et réglementations\u003cbr/\u003e• Effectuer des évaluations de risques et mettre en place des protocoles de sécurité pour les travaux de maintenance\u003cbr/\u003eAssurer l'excellence en maintenance préventive\u003cbr/\u003e• Exécuter des programmes complets de maintenance préventive planifiée sur des équipements automatisés diversifiés : convoyeurs, robots, systèmes de tri et d'emballage\u003cbr/\u003e• Utiliser les systèmes informatisés de gestion de la maintenance (GMAO) pour suivre, programmer et documenter les activités de maintenance\u003cbr/\u003e• Collaborer avec les fabricants d'équipements et prestataires externes pour optimiser les procédures de maintenance\u003cbr/\u003eIntervenir rapidement et résoudre les problèmes complexes\u003cbr/\u003e• Fournir une réponse rapide aux pannes d'équipement avec communication claire aux équipes opérationnelles\u003cbr/\u003e• Effectuer un dépannage avancé sur les systèmes électriques, mécaniques et d'automatisation complexes\u003cbr/\u003e• Utiliser les outils de diagnostic et documentation technique pour identifier efficacement les causes racines\u003cbr/\u003eMaîtriser les technologies d'automatisation\u003cbr/\u003e• Maintenir et configurer des systèmes d'automatisation sophistiqués incluant les contrôleurs logiques programmables (API) et réseaux de terrain\u003cbr/\u003e• Entretenir et calibrer les scanners de codes-barres, systèmes d'impression-application et équipements de tri\u003cbr/\u003eContribuer à l'amélioration continue\u003cbr/\u003e• Analyser les données de performance des équipements pour identifier les opportunités d'amélioration\u003cbr/\u003e• Développer et mettre en œuvre des initiatives de réduction des coûts par l'optimisation des équipements\u003cbr/\u003e• Partager les connaissances techniques et encadrer les techniciens juniors\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eHoraires de travail : Ce poste fonctionne dans un environnement 24h/24 et 7j/7 nécessitant une flexibilité avec des horaires variables, incluant nuits, week-ends et jours fériés.","department_cost_center":null,"description_short":"Technicien de Maintenance (F/H) Chaque jour, des millions de clients comptent sur Amazon pour recevoir leurs commandes à temps. Derrière cette promesse se cache un réseau d'automatisation sophistiqué où","display_distance":null,"id":"bf94b80f-4b5d-45c0-981a-32844f39c6ac","id_icims":"3178616","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3178616/technicien-de-maintenance-m-f-rme","job_schedule_type":"full-time","location":"FR, Boves","locations":["{\"normalizedStateName\":\"Hauts-de-France\",\"normalizedCountryCode\":\"FRA\",\"city\":\"Boves\",\"countryIso3a\":\"FRA\",\"countryIso2a\":\"FR\",\"locationNonStemming\":\"France, Boves\",\"coordinates\":\"49.84859,2.39268\",\"normalizedCountyName\":\"Somme\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"France\",\"normalizedLocation\":\"Boves, Hauts-de-France, FRA\",\"location\":\"FR, Boves\",\"region\":\"\",\"buildingCodeList\":[\"BVA1\"],\"normalizedCityName\":\"Boves\"}"],"normalized_location":"Boves, Hauts-de-France, FRA","optional_search_labels":["jdv.operations.rmetechnician","ops.lander-emea-rme-reliability","ops.lander-emea-rme-technician","ops.rme-technician","operations-team.reliability-maintenance-engineering-eu"],"posted_date":"February 11, 2026","preferred_qualifications":"- Certifications électriques : Habilitations électriques avec expérience en travaux d'ordre électrique et maintenance des contrôleurs moteur/variateurs\u003cbr/\u003e- Expertise en automatisation : Expérience avec systèmes Siemens (API), réseaux de terrain, robotique et systèmes automatisés de stockage/récupération\u003cbr/\u003e- Technologies de traçabilité : Expertise en configuration et maintenance de scanners de codes-barres et systèmes d'impression-application\u003cbr/\u003e- Technologie de maintenance 4.0: Utilisation et/ou exploitation des différentes technologies liées à la maintenance 4.0\u003cbr/\u003e- Leadership technique : Expérience d'encadrement de techniciens juniors avec compétences en rédaction technique pour la documentation\u003cbr/\u003e- Gestion de projets : Expérience en gestion de projet d'installations d'équipements et capacités multilingues (un atout)\u003cbr/\u003e- Machine de conditionnement: Entretien et mise au point de machine de conditionnement automatique\u003cbr/\u003e\u003cbr/\u003eAmazon est un employeur engagé pour l'égalité des chances. Nous sommes convaincus qu'une main d'oeuvre diversifée est essentielle à notre réussite. Nous prenons nos décisions de recrutement en fonction de votre expérience et de vos compétences. Nous apprécions votre envie de découvrir, d'inventer, de simplifier et de construire. La protection de votre vie privée et la sécurité de vos données constituent depuis longtemps une priorité absolue pour Amazon. Veuillez consulter notre Politique de Confidentialité pour en savoir plus sur la façon dont nous collectons, utilisons et traitons les données personnelles de nos candidats.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":null,"title":"Technicien de Maintenance M/F, RME","university_job":null,"updated_time":"29 minutes","url_next_step":"https://account.amazon.com/jobs/3178616/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}