{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Formation et expérience : Bac Pro, BTS, BUT ou équivalent (Bac+2 minimum) en maintenance industrielle, électrotechnique ou mécanique, avec expérience en maintenance électrique et mécanique ou une expérience sur un poste similaire pour une durée d'au moins de deux ans.\u003cbr/\u003e- Maintenance préventive et GMAO : Expérience prouvée avec les systèmes de maintenance préventive planifiée et maîtrise des plateformes GMAO\u003cbr/\u003e- Dépannage et diagnostic : Capacités avancées de dépannage sur équipements de manutention et systèmes d'automatisation, avec maîtrise de la lecture des plans mécaniques et électriques\u003cbr/\u003e- Compétences techniques : Expérience pratique avec systèmes de convoyeurs, contrôleurs moteur, variateurs de fréquence et technologies de capteurs\u003cbr/\u003e- Compétences opérationnelles : Connaissance des normes de santé et sécurité, fortes compétences organisationnelles et excellentes capacités de communication\u003cbr/\u003e- • Formation et expérience : Bac Pro, BTS, BUT ou équivalent (Bac+2 minimum) en maintenance industrielle, électrotechnique ou mécanique, avec expérience en maintenance électrique et mécanique ou une expérience sur un poste similaire pour une durée d'au moins de deux ans.\u003cbr/\u003e- • Maintenance préventive et GMAO : Expérience prouvée avec les systèmes de maintenance préventive planifiée et maîtrise des plateformes GMAO\u003cbr/\u003e- • Dépannage et diagnostic : Capacités avancées de dépannage sur équipements de manutention et systèmes d'automatisation, avec maîtrise de la lecture des plans mécaniques et électriques\u003cbr/\u003e- • Compétences techniques : Expérience pratique avec systèmes de convoyeurs, contrôleurs moteur, variateurs de fréquence et technologies de capteurs\u003cbr/\u003e- • Compétences opérationnelles : Connaissance des normes de santé et sécurité, fortes compétences organisationnelles et excellentes capacités de communication","business_category":"fulfillment-ops","city":"Colombier-saugnieu","company_name":"Amazon France Logistique SAS","country_code":"FRA","description":"Technicien de Maintenance (F/H) Chaque jour, des millions de clients comptent sur Amazon pour recevoir leurs commandes à temps. Derrière cette promesse se cache un réseau d'automatisation sophistiqué où chaque seconde compte. En tant que Technicien/ne RME, vous serez au cœur de cette mécanique de précision, gardien des technologies qui permettent à nos centres de distribution de fonctionner 24h/24 et 7j/7.\u003cbr/\u003eCe qui rend ce rôle unique ? Vous travaillerez sur des équipements à la pointe de la technologie, parfois conçus en interne, dans un environnement où l'innovation rencontre l'excellence opérationnelle. Votre expertise technique aura un impact direct et mesurable : chaque intervention réussie, c'est des milliers de colis qui arrivent à destination comme prévu.\u003cbr/\u003eSi vous adorez les challenges techniques, que vous vous épanouissez dans des environnements dynamiques et que vous voulez voir l'impact concret de votre travail à l'échelle mondiale, ce poste est fait pour vous.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eResponsabilités Clés\u003cbr/\u003e\u003cbr/\u003eGarantir la sécurité et la conformité\u003cbr/\u003e\u003cbr/\u003e• Promouvoir les meilleures pratiques de santé et sécurité dans toutes les activités de maintenance, en assurant la conformité totale aux normes et réglementations\u003cbr/\u003e• Effectuer des évaluations de risques et mettre en place des protocoles de sécurité pour les travaux de maintenance\u003cbr/\u003e\u003cbr/\u003eAssurer l'excellence en maintenance préventive\u003cbr/\u003e\u003cbr/\u003e• Exécuter des programmes complets de maintenance préventive planifiée sur des équipements automatisés diversifiés : convoyeurs, robots, systèmes de tri et d'emballage\u003cbr/\u003e• Utiliser les systèmes informatisés de gestion de la maintenance (GMAO) pour suivre, programmer et documenter les activités de maintenance\u003cbr/\u003e• Collaborer avec les fabricants d'équipements et prestataires externes pour optimiser les procédures de maintenance\u003cbr/\u003e\u003cbr/\u003eIntervenir rapidement et résoudre les problèmes complexes\u003cbr/\u003e\u003cbr/\u003e• Fournir une réponse rapide aux pannes d'équipement avec communication claire aux équipes opérationnelles\u003cbr/\u003e• Effectuer un dépannage avancé sur les systèmes électriques, mécaniques et d'automatisation complexes\u003cbr/\u003e• Utiliser les outils de diagnostic et documentation technique pour identifier efficacement les causes racines\u003cbr/\u003e\u003cbr/\u003eMaîtriser les technologies d'automatisation\u003cbr/\u003e\u003cbr/\u003e• Maintenir et configurer des systèmes d'automatisation sophistiqués incluant les contrôleurs logiques programmables (API) et réseaux de terrain\u003cbr/\u003e• Entretenir et calibrer les scanners de codes-barres, systèmes d'impression-application et équipements de tri\u003cbr/\u003eContribuer à l'amélioration continue\u003cbr/\u003e• Analyser les données de performance des équipements pour identifier les opportunités d'amélioration\u003cbr/\u003e• Développer et mettre en œuvre des initiatives de réduction des coûts par l'optimisation des équipements\u003cbr/\u003e• Partager les connaissances techniques et encadrer les techniciens juniors\u003cbr/\u003e\u003cbr/\u003eHoraires de travail : Ce poste fonctionne dans un environnement 24h/24 et 7j/7 nécessitant une flexibilité avec des horaires variables, incluant nuits, week-ends et jours fériés.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eNos techniciens RME sont basés sur site, afin de répondre rapidement à tout problème technique affectant nos opérations. Vous effectuerez une série de travaux de maintenance préventive planifiée sur les équipements en place sur nos sites afin de vous assurer qu’ils fonctionnent et ne présentent aucun risque de sécurité. En tant que technicien RME, vous interviendrez rapidement en cas de panne, et vous mènerez l’enquête pour détecter les pannes et les solutionner aussi vite que possible.  Il vous appartiendra également de faire des suggestions pour améliorer durablement les processus.\u003cbr/\u003e\u003cbr/\u003eEn collaboration avec des collègues expérimentés, vous effectuerez des tâches de maintenance quotidiennes telles que la peinture et la plomberie et assurerez la liaison avec les sous-traitants externes en cas de besoin si nécessaire. Vous travaillerez en équipe afin de vous assurer que nos sites bénéficient d’une assistance 24 heures sur 24, ce qui permet à Amazon de livrer ses produits à la vitesse qui fait sa réputation. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eNotre équipe d’ingénieurs RME (Reliability Maintenance Engineering) veille à ce que nos équipements fonctionnent au mieux. Guidés par des responsables expérimentés, nous sommes une équipe à l’esprit analytique. Nos collaborateurs·trices possèdent à la fois des connaissances techniques poussées et un bon esprit d’équipe. Nous travaillons ensemble pour assurer l’entretien, le dépannage et la réparation des ressources de notre réseau mondial de centres d’expédition. Certains de nos employé·es occupent des postes à responsabilités et sont chargés de superviser l’équipe dans son travail sur des technologies passionnantes, dont certaines n’existent que chez Amazon.\u003cbr/\u003e\u003cbr/\u003eDe l’installation de systèmes d’emballage automatisés à la supervision de la maintenance générale d’un site, en passant par la réparation d’équipements de distribution essentiels, notre équipe assure le bon fonctionnement de la plupart des éléments techniques d’Amazon. Nous veillons, par exemple, à ce que les bâtiments soient conformes à la législation, afin d’assurer la sécurité de tous et le fonctionnement à plein régime de nos sites. Les possibilités d’évolution sont nombreuses, tant au sein de l’équipe RME qu’à l’échelle d’Amazon.\u003cbr/\u003eTout ce que nous faisons vise à réduire les temps d’arrêt dans les principaux sites logistiques d’Amazon, afin que les clients reçoivent leurs commandes à temps. Nous travaillons souvent tôt ou tard pour effectuer les tâches de maintenance avec un minimum de perturbations, y compris en équipes de nuit. Si nous voyons qu’il existe une méthodologie plus aboutie pour faire les choses, nous avons les compétences nécessaires pour développer et introduire des processus nouveaux ou des technologies de pointe, comme Amazon Robotics ou notre robot de tri ultra sophistiqué.","department_cost_center":null,"description_short":"Technicien de Maintenance (F/H) Chaque jour, des millions de clients comptent sur Amazon pour recevoir leurs commandes à temps. Derrière cette promesse se cache un réseau d'automatisation sophistiqué où","display_distance":null,"id":"2e56c673-7b37-4b44-bc8b-029fb4712bfe","id_icims":"3176929","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3176929/technicien-de-maintenance","job_schedule_type":"full-time","location":"FR, Colombier-saugnieu","locations":["{\"normalizedStateName\":\"Auvergne-Rhone-Alpes\",\"normalizedCountryCode\":\"FRA\",\"city\":\"Colombier-saugnieu\",\"countryIso3a\":\"FRA\",\"countryIso2a\":\"FR\",\"locationNonStemming\":\"France, Colombier-saugnieu\",\"coordinates\":\"45.71521,5.12736\",\"normalizedCountyName\":\"Rhône\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"France\",\"normalizedLocation\":\"Colombier-Saugnieu, Auvergne-Rhone-Alpes, FRA\",\"location\":\"FR, Colombier-saugnieu\",\"region\":\"\",\"buildingCodeList\":[\"LYS2\"],\"normalizedCityName\":\"Colombier-Saugnieu\"}"],"normalized_location":"Colombier-Saugnieu, Auvergne-Rhone-Alpes, FRA","optional_search_labels":["operations-team.reliability-maintenance-engineering-eu","ops.lander-emea-rme-reliability","ops.lander-emea-rme-technician","ops.rme-technician"],"posted_date":"February  9, 2026","preferred_qualifications":"- Certifications électriques : Habilitations électriques avec expérience en travaux d'ordre électrique et maintenance des contrôleurs moteur/variateurs\u003cbr/\u003e- Expertise en automatisation : Expérience avec systèmes Siemens (API), réseaux de terrain, robotique et systèmes automatisés de stockage/récupération\u003cbr/\u003e- Technologies de traçabilité : Expertise en configuration et maintenance de scanners de codes-barres et systèmes d'impression-application\u003cbr/\u003e- Technologie de maintenance 4.0: Utilisation et/ou exploitation des différentes technologies liées à la maintenance 4.0\u003cbr/\u003e- Leadership technique : Expérience d'encadrement de techniciens juniors avec compétences en rédaction technique pour la documentation\u003cbr/\u003e- Gestion de projets : Expérience en gestion de projet d'installations d'équipements et capacités multilingues (un atout)\u003cbr/\u003e- Machine de conditionnement: Entretien et mise au point de machine de conditionnement automatique.\u003cbr/\u003e\u003cbr/\u003eAmazon est un employeur engagé pour l'égalité des chances. Nous sommes convaincus qu'une main d'oeuvre diversifée est essentielle à notre réussite. Nous prenons nos décisions de recrutement en fonction de votre expérience et de vos compétences. Nous apprécions votre envie de découvrir, d'inventer, de simplifier et de construire. La protection de votre vie privée et la sécurité de vos données constituent depuis longtemps une priorité absolue pour Amazon. Veuillez consulter notre Politique de Confidentialité pour en savoir plus sur la façon dont nous collectons, utilisons et traitons les données personnelles de nos candidats.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":null,"title":"Technicien de Maintenance","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3176929/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Marketing, Advertising, or Business\u003cbr/\u003e- Experience in advertising solutions including sales, ad operations, and online marketing","business_category":"advertising","city":"Bengaluru","company_name":"ASSPL - Karnataka - B56","country_code":"IND","description":"The Amazon Advertising operates at the intersection of Advertising and e-Commerce and offers advertisers a rich array of innovative advertising solutions across Amazon.in. These solutions help businesses build brand awareness, increase product sales, and more.\u003cbr/\u003e\u003cbr/\u003eAs a recognized and experienced expert in this fast-growing business, you will take responsibility for a portfolio of leading Consumer companies as a display advertising consultant. You will advise your customers from the initial contact to the long-term development of a partnership. In doing so, you will act on the same level as senior decision-makers on the customer side and define holistic marketing strategies, leveraging all of Amazon’s innovative advertising solutions. Our goal is to establish and expand long-term business relations, and drive sustainable success for our advertiser customers.\u003cbr/\u003e\u003cbr/\u003eTo achieve that, you will completely own the display advertising revenue of your portfolio and lead the engagement with your customers, supported by a cross-functional team of sales, program managers, analysts and designers. By managing your account pipeline independently, gaining a deep understanding of the needs of your brands and the ecosystem, and developing convincing solutions you will ensure the achievement of your short and long-term objectives.\u003cbr/\u003e\u003cbr/\u003eIf you are excited to work in the fast-paced and rapidly evolving e-commerce marketing space, have a consultative selling style and yield from the Electronics/ FMCG/Durable/marketing/media/consulting world, please apply\u003cbr/\u003e\u003cbr/\u003eThis position is based at the Amazon India office in Bengaluru, with travel as required\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Analyze data, trends, performance and leverage your understanding of marketing and Amazon's advertising solutions to create holistic marketing strategies for brands by working with senior decision-makers on the customer side.\u003cbr/\u003e• Act as the advertisers’ advocate to evangelize for their success working with Amazon India, by partnering with product, sales, support, and global technology teams to drive advertiser success on Amazon’s advertising platform.\u003cbr/\u003e• Establish and build strong, profitable, long-term relationships with strategic advertisers. Contribute to the overall growth and profit of Amazon India’s business by expanding our partner ecosystem.\u003cbr/\u003e• Serve as a key member of advertising business development team, helping to drive overall Amazon Advertising strategy and business growth.\u003cbr/\u003e• Build scale into the account management function by collaborating with internal stakeholders (vendor managers, seller sales and account teams) to develop joint business plans and upsell opportunities with coherent messaging/positioning for vendors/sellers/partners.\u003cbr/\u003e• Prepare and give business reviews to the senior management team regarding progress and roadblocks to increasing adoption customers.","department_cost_center":null,"description_short":"The Amazon Advertising operates at the intersection of Advertising and e-Commerce and offers advertisers a rich array of innovative advertising solutions across Amazon.in. These solutions help businesses","display_distance":null,"id":"a4cf0252-6ca7-47cb-8a38-0036b53c7737","id_icims":"3178606","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Ad Sales","job_function_id":null,"job_path":"/en/jobs/3178606/display-ads-account-manager-amazon-advertising","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR37\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"February 11, 2026","preferred_qualifications":"- 1+ years of program or project management experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"advertising.team-amazon-ads","source_system":"JobCreator","state":"KA","title":"Display Ads Account Manager, Amazon Advertising","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3178606/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-ads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience working with a variety of design tools such as Photoshop, Illustrator, and InDesign\u003cbr/\u003e- Experience in prototyping\u003cbr/\u003e- 1-2 years of working experience in Gen-AI content creation, virtual production, or related field\u003cbr/\u003e- Good communication skills, able to convey technical concepts clearly\u003cbr/\u003e- Ability to work both independently and as part of a team\u003cbr/\u003e- Understanding of content generation pipeline\u003cbr/\u003e- Problem-solving abilities\u003cbr/\u003e- Good documentation skills\u003cbr/\u003e- Working knowledge of Gen-AI tools and virtual production software","business_category":"no-business-category","city":"Tokyo","company_name":"Amazon Japan G.K. - A43","country_code":"JPN","description":"We're looking for a Content Specialist who can work in Gen-AI content generation, virtual production, and hybrid customer experience (CX) experiments under the guidance of senior team members and managers. This role will support creating innovative experiences using various 3D and Gen-AI technologies for e-commerce. The Content Specialist will work closely with team members to implement production techniques and ensure compatibility with existing platforms.\u003cbr/\u003e\u003cbr/\u003eシニアチームメンバーやマネージャーの指導の下、生成AIコンテンツの作成、バーチャルプロダクション、ハイブリッドカスタマーエクスペリエンス（CX）の実験的な取り組みに携わるコンテンツスペシャリストを募集しています。このポジションは、e-コマース向けの3Dや生成AIテクノロジーを使用した体験を創り出し、技術実装を通じて既存プラットフォームとの互換性を確保します。\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tSupport Gen-AI content generation initiatives and virtual production projects\u003cbr/\u003e•\tAssist in hybrid CX experiments and solutions for e-commerce\u003cbr/\u003e•\tHelp troubleshoot technical challenges with Internal \u0026 External Stakeholders\u003cbr/\u003e•\tExecute content creation while maintaining quality and scalability standards\u003cbr/\u003e•\tCollaborate with team members to implement automation and efficiency improvements\u003cbr/\u003e•\tSupport workflow optimization initiatives\u003cbr/\u003e•\tFollow and implement technical best practices\u003cbr/\u003e•\tMaintain documentation of processes\u003cbr/\u003e•\tParticipate in research for workflow improvements\u003cbr/\u003e•\tFluency in English and Japanese\u003cbr/\u003e\u003cbr/\u003e主な業務内容\u003cbr/\u003e• 生成コンテンツ制作とバーチャルプロダクションプロジェクトのサポート\u003cbr/\u003e• e-コマース向けハイブリッドCX 実験とソリューションのサポート\u003cbr/\u003e• 社内外ステークホルダーに対する技術的トラブルシューティングのサポート\u003cbr/\u003e• 品質と拡張性の基準を維持したコンテンツ制作\u003cbr/\u003e• 自動化と効率改善におけるチームメンバーとの連携\u003cbr/\u003e• ワークフローの最適化サポート\u003cbr/\u003e• ベストプラクティスに従った技術実装\u003cbr/\u003e• プロセスの文書化およびメンテナンス\u003cbr/\u003e• ワークフロー改善のための研究への参加","department_cost_center":null,"description_short":"We're looking for a Content Specialist who can work in Gen-AI content generation, virtual production, and hybrid customer experience (CX) experiments under the guidance of senior team members and managers.","display_distance":null,"id":"d86c503e-404a-4325-b1da-cb8b52c52e74","id_icims":"3098165","is_intern":null,"is_manager":null,"job_category":"Editorial, Writing, \u0026 Content Management","job_family":"Design","job_function_id":null,"job_path":"/en/jobs/3098165/content-specialist-ds-digital-studios","job_schedule_type":"full-time","location":"JP, Tokyo","locations":["{\"normalizedStateName\":\"Tokyo\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Tokyo\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, Tokyo\",\"coordinates\":\"35.68946,139.69172\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Tokyo, JPN\",\"location\":\"JP, Tokyo\",\"region\":\"\",\"buildingCodeList\":[\"HND14\"]}"],"normalized_location":"Tokyo, JPN","optional_search_labels":[],"posted_date":"September 30, 2025","preferred_qualifications":"- Knowledge of user-centered design methodologies, usability principles, web-based information architecture and design\u003cbr/\u003e- Experience working in a collaborative team and working directly with developers for implementation of designs\u003cbr/\u003e- Experience working in a production environment\u003cbr/\u003e- Familiarity with Gen-AI platforms and virtual production technologies\u003cbr/\u003e- Ability to work effectively in a fast-paced environment\u003cbr/\u003e- Basic experience with hybrid CX experiments\u003cbr/\u003e- Knowledge of product photography and lighting\u003cbr/\u003e- Strong interpersonal and communication skills (both written and verbal)\u003cbr/\u003e- Portfolio of artistic work\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":null,"title":"Content Specialist, DS, Digital Studios","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3098165/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of program or project management experience\u003cbr/\u003e- 3+ years of working cross functionally with tech and non-tech teams experience\u003cbr/\u003e- 3+ years of defining and implementing process improvement initiatives using data and metrics experience\u003cbr/\u003e- Knowledge of Excel (Pivot Tables, VLookUps) at an advanced level and SQL\u003cbr/\u003e- Experience defining program requirements and using data and metrics to determine improvements","business_category":"retail","city":"Bengaluru","company_name":"ADCI - BLR 14 SEZ","country_code":"IND","description":"RBS SPEG (Selling Partner Engagement and Growth) team is looking for a Program Manager to drive Automation program. In this role you will be expected to partner with Amazon Retail and 3P teams WW on identify automation opportunities, size the problem and own E2E automation via Sapien by collaborating with Business ,Tech and other partner amazon teams He will also be responsible to scale solutions across multiple geographies. Key success factors for this role will be to drive meaningful automations which will drive productivity gains for business teams, drive WW Parity of programs, lowering CTS for Retail/3P and RBS Teams.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eCandidate Profile:\u003cbr/\u003eCandidate will have 5+ years of experience in Program Management and online Retail. You will have program management skills with the ability to influence internal and external stakeholders and drive project execution. You will be expected to deliver solutions and programs that are technology based, highly scalable - while maintaining a good customer and business partner focus. You will have a demonstrated record of working with multiple teams and drive execution in a high volume operational environments. Be able to lead not only at the strategic level, but also tactically by diving deep into business and technical domains.\u003cbr/\u003e\u003cbr/\u003eKey skills for the role include ability to deal with ambiguity, to network effectively and influence partner teams without authority, to overcome unforeseen obstacles, and a passion for developing a deep understanding of the program, product and ops excellence.\u003cbr/\u003eInternal job description\u003cbr/\u003e\u003cbr/\u003eBasic qualifications:\u003cbr/\u003e\u003cbr/\u003e    5+ years of working cross functionally with tech and non-tech teams experience\u003cbr/\u003e    5+ years of program or project management experience\u003cbr/\u003e    5+ years of delivering cross functional projects experience\u003cbr/\u003e    Experience defining program requirements and using data and metrics to determine improvements\u003cbr/\u003e\u003cbr/\u003ePreferred qualifications\u003cbr/\u003e\u003cbr/\u003e    2+ years of driving process improvements experience\u003cbr/\u003e    Master's degree, or MBA in business, operations, human resources, adult education, organizational development, instructional design or related field\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","department_cost_center":null,"description_short":"RBS SPEG (Selling Partner Engagement and Growth) team is looking for a Program Manager to drive Automation program. In this role you will be expected to partner with Amazon Retail and 3P teams WW on identify","display_distance":null,"id":"713af643-514a-415f-bbb9-327c5c93448d","id_icims":"3160266","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Program Management","job_function_id":null,"job_path":"/en/jobs/3160266/program-manager-rbs-speg-automations-rbs-speg","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR14\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"January 15, 2026","preferred_qualifications":"- 3+ years of driving end to end delivery, and communicating results to senior leadership experience\u003cbr/\u003e- 3+ years of driving process improvements experience\u003cbr/\u003e- Experience in stakeholder management, dealing with multiple stakeholders at varied levels of the organization\u003cbr/\u003e- Experience building processes, project management, and schedules\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"retail.team-avs","source_system":"JobCreator","state":"KA","title":"Program Manager, RBS SPEG Automations, RBS SPEG ","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3160266/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-avs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in Adobe Creative Suit applications, with high proficiency in Adobe Illustrator, Photoshop, InDesign, and Acrobat using macOS\u003cbr/\u003e- Minimum 3 years of working experience in Gen-AI content creation, virtual production, or related field\u003cbr/\u003e- Strong communication skills, particularly in conveying technical concepts to non-technical partners\u003cbr/\u003e- Ability to establish priorities, work independently or within a group\u003cbr/\u003e- Experience building solutions for content generation pipeline\u003cbr/\u003e- Leadership and problem solving abilities\u003cbr/\u003e- Excellent communication and documentation skills\u003cbr/\u003e- Broad knowledge of Gen-AI tools, virtual production software, and ability to quickly learn new technologies","business_category":"no-business-category","city":"Tokyo","company_name":"Amazon Japan G.K. - A43","country_code":"JPN","description":"We're looking for a proficient Sr. Content Specialist who can work in Digital (2D Image, Video and 3D), Gen-AI content generation, virtual production, and new hybrid customer experience (CX) experiments. This role will focus on creating exciting and innovative experiences using various 3D and Gen-AI technologies for e-commerce. The Sr. Content Specialist is responsible for training team members in new production techniques and must ensure that those methods are scalable and compatible with all existing platforms. \u003cbr/\u003eThe ideal candidate will have experience in building solutions, working directly with technical program managers, build hybrid workflow between Physical and Digital Studios, R\u0026D leads who will be building new tools and workflows, and consistently raising the bar on quality and support the team in enriching customer experience.\u003cbr/\u003e\u003cbr/\u003eデジタル（2D画像、動画、3D）、生成コンテンツ制作、バーチャルプロダクション、ハイブリッドカスタマーエクスペリエンス（CX）の実験的な取り組みに携わる、シニアコンテンツスペシャリストを募集しています。このポジションは、e-コマース向けの3Dや生成AIテクノロジーを使用した革新的な体験を創造します。また、チームメンバーの育成を担い、新しい技術の拡張性や既存プラットフォームとの互換性を確保します。\u003cbr/\u003e以下のような経験を持つ方にとって理想的なポジションです：ソリューションを構築した経験、テクニカルプログラムマネージャーと直接連携した経験、物理スタジオとデジタルスタジオのハイブリッドワークフローを構築した経験、研究開発リードとして新規ツールやワークフローを構築した経験、チームをサポートして品質水準と顧客体験を向上した経験.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tDrive Gen-AI content generation initiatives and virtual production projects\u003cbr/\u003e•\tLead hybrid CX experiments and innovative solutions for e-commerce\u003cbr/\u003e•\tProvide front-line support for Internal \u0026 External Stakeholders to troubleshoot technical challenges\u003cbr/\u003e•\tOptimize content creation for both quality and scalability\u003cbr/\u003e•\tWork with artists and the larger team to understand areas of current process that have the biggest opportunity for automation and efficiency\u003cbr/\u003e•\tIdentify opportunities in workflows that are most ripe for innovation\u003cbr/\u003e•\tHave a POV on content types that optimize for sustainability and scalability\u003cbr/\u003e•\tWork with Art leads to establish and educate technical best practices\u003cbr/\u003e•\tDocument development processes and update as necessary\u003cbr/\u003e•\tConduct ongoing research to recommend workflow improvements\u003cbr/\u003e•\tFluently in English \u0026 Japanese\u003cbr/\u003e\u003cbr/\u003e主な業務内容\u003cbr/\u003e• 生成コンテンツ制作とバーチャルプロダクションプロジェクトの推進\u003cbr/\u003e• ハイブリッドCX 実験とe-コマース向けソリューションのリード\u003cbr/\u003e• 社内外ステークホルダーの技術課題解決に向けたフロントサポート\u003cbr/\u003e• 品質と拡張性を担保したコンテンツ制作の最適化\u003cbr/\u003e• アーティストや大規模なチームと協業し、プロセス内で自動化・効率化できる分野の特定\u003cbr/\u003e• ワークフローにおける先進的なイノベーション機会の特定\u003cbr/\u003e• 持続可能性と拡張性を最適化するコンテンツに関する視点提示\u003cbr/\u003e• アートリードとの協業を通じた、技術的なベストプラクティスの確立と育成\u003cbr/\u003e• 開発プロセスの文書化および更新\u003cbr/\u003e• ワークフロー改善のための継続的なリサーチの実施","department_cost_center":null,"description_short":"We're looking for a proficient Sr. Content Specialist who can work in Digital (2D Image, Video and 3D), Gen-AI content generation, virtual production, and new hybrid customer experience (CX) experiments.","display_distance":null,"id":"859dbaec-5998-4bdb-b9fa-9fe890a0e6ab","id_icims":"3098160","is_intern":null,"is_manager":null,"job_category":"Editorial, Writing, \u0026 Content Management","job_family":"Design","job_function_id":null,"job_path":"/en/jobs/3098160/sr-content-specialist-digital-studios","job_schedule_type":"full-time","location":"JP, Tokyo","locations":["{\"normalizedStateName\":\"Tokyo\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Tokyo\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, Tokyo\",\"coordinates\":\"35.68946,139.69172\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Tokyo, JPN\",\"location\":\"JP, Tokyo\",\"region\":\"\",\"buildingCodeList\":[\"HND14\"]}"],"normalized_location":"Tokyo, JPN","optional_search_labels":[],"posted_date":"September 30, 2025","preferred_qualifications":"- Experience creating services and applications with multiple user touch points on different platforms and devices\u003cbr/\u003e- Experience working in a photo realistic production environment\u003cbr/\u003e- Experience with Gen-AI platforms and virtual production technologies\u003cbr/\u003e- Be able to excel in a fast-paced collaborative production environment\u003cbr/\u003e- Innovative and self-directed\u003cbr/\u003e- Experience with hybrid CX experiments and customer-focused solutions\u003cbr/\u003e- Experience/knowledge with product photography and lighting\u003cbr/\u003e- Exceptional interpersonal and communication skills (both written and verbal)\u003cbr/\u003e- Ability to showcase artistic work in a portfolio\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":null,"title":"Sr. Content Specialist, Digital Studios","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3098160/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"--","business_category":"fulfillment-and-operations","city":"Messkirch","company_name":"Amazon Deutschland S15 Transport GmbH","country_code":"DEU","description":"--","department_cost_center":null,"description_short":"--","display_distance":null,"id":"a0Rar0000020KDLEA2","id_icims":"SF250121439","is_intern":null,"is_manager":null,"job_category":"Fulfillment / Warehouse Associate","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/SF250121439/sortiermitarbeiter-m-f-d-88605-messkirch","job_schedule_type":"full-time","location":"DE, BW, Messkirch","locations":["{\"normalizedStateName\":\"Baden-Wurttemberg\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Messkirch\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, BW, Messkirch\",\"coordinates\":\"47.9952,9.11568\",\"normalizedCountyName\":\"Sigmaringen\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Meßkirch, Baden-Wurttemberg, DEU\",\"location\":\"DE, BW, Messkirch\",\"region\":\"BW\",\"buildingCodeList\":[],\"normalizedCityName\":\"Meßkirch\"}"],"normalized_location":"Meßkirch, Baden-Wurttemberg, DEU","optional_search_labels":["hvh-fulfillment-and-operations"],"posted_date":"January 12, 2026","preferred_qualifications":null,"primary_search_label":null,"source_system":"HVH","state":"BW","title":"Sortiermitarbeiter (m/f/d) – 88605 Messkirch","university_job":null,"updated_time":"14 minutes","url_next_step":"https://hvr-amazon.my.site.com/JobDetails?reqid=a0Rar0000020KDLEA2\u0026isapply=1","team":{"id":null,"business_category_id":null,"identifier":null,"label":null,"created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"\u003cfont face=\"Calibri, sans-serif\"\u003e\u003cspan style=\"font-size: 14.6667px;\"\u003e--\u003c/span\u003e\u003c/font\u003e","business_category":"fulfillment-and-operations","city":"Hannover","company_name":"Amazon Deutschland N11 Transport GmbH","country_code":"DEU","description":"--","department_cost_center":null,"description_short":"--","display_distance":null,"id":"a0Rar0000020KDEEA2","id_icims":"SF250121432","is_intern":null,"is_manager":null,"job_category":"Fulfillment / Warehouse Associate","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/SF250121432/sortiermitarbeiter-m-w-d-31319-sehnde","job_schedule_type":"full-time","location":"DE, NI, Hannover","locations":["{\"normalizedStateName\":\"Lower-Saxony\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Hannover\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, NI, Hannover\",\"coordinates\":\"52.37227,9.73815\",\"normalizedCountyName\":\"Hanover\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Hanover, Lower-Saxony, DEU\",\"location\":\"DE, NI, Hannover\",\"region\":\"NI\",\"buildingCodeList\":[],\"normalizedCityName\":\"Hanover\"}"],"normalized_location":"Hanover, Lower-Saxony, DEU","optional_search_labels":["hvh-fulfillment-and-operations"],"posted_date":"January 22, 2026","preferred_qualifications":null,"primary_search_label":null,"source_system":"HVH","state":"NI","title":"Sortiermitarbeiter (m/w/d) - 31319 Sehnde","university_job":null,"updated_time":"15 minutes","url_next_step":"https://hvr-amazon.my.site.com/JobDetails?reqid=a0Rar0000020KDEEA2\u0026isapply=1","team":{"id":null,"business_category_id":null,"identifier":null,"label":null,"created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"aws","city":"East Palo Alto","company_name":"Amazon Development Center U.S., Inc.","country_code":"USA","description":"Amazon Analytics offers fully managed cloud data warehouse and data lake capabilities. Tens of thousands of enterprise customers use Analytics services to crunch through exabytes of data in the cloud to make business critical decisions every day. To stay ahead in such a mission critical setting, we must always re-invent ourselves for customers. We are always looking for the innovative engineers to help shape the future of Analytics.\u003cbr/\u003e\u003cbr/\u003eWe are actively hiring a talented Software Engineer in the Query Processing team. Query processing is at the heart of Analytics data plane and is responsible for the massive parallel execution engine.\u003cbr/\u003e\u003cbr/\u003eUtility Computing (UC)\u003cbr/\u003eAWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for customers who require specialized security solutions for their cloud services.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003eAs a Software Development Engineer, you will build systems that benefit Analytics customers across the world. You will take significant ownership on the overall product vision by defining new features and architecture. You will distill complex and ambiguous requirements, converting them into meaningful projects that provide immense customer value. You will own and code end-to-end deliverables from design, development, deployment, monitoring, and operations. You will lead engineers on substantial projects and help develop a flourishing team through active mentoring and hiring.\u003cbr/\u003e\u003cbr/\u003eThis is a unique and rare opportunity to get in on the ground floor within a fast-growing business and help shape the technology powering analytical workloads for Fortune 500 companies, startups, and everything in between. You will bring deep technical, algorithmic and coding expertise with the ability to work within a fast moving and collaborative environment in the industry leading cloud company to deliver a broad business impact.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Analytics offers fully managed cloud data warehouse and data lake capabilities. Tens of thousands of enterprise customers use Analytics services to crunch through exabytes of data in the cloud to","display_distance":null,"id":"a75e4268-f699-4941-8f61-1b9d6dceefef","id_icims":"3170107","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3170107/software-development-engineer-open-data-analytics-engines","job_schedule_type":"full-time","location":"US, CA, East Palo Alto","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"East Palo Alto\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, East Palo Alto\",\"coordinates\":\"37.4732,-122.13957\",\"normalizedCountyName\":\"San Mateo\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"East Palo Alto, California, USA\",\"location\":\"US, CA, East Palo Alto\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC18\"],\"normalizedCityName\":\"East Palo Alto\"}"],"normalized_location":"East Palo Alto, California, USA","optional_search_labels":["aws.team-database"],"posted_date":"January 29, 2026","preferred_qualifications":"- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Experience or understanding of Apache Spark or other distributed query execution engines (e.g., Velox, Presto, Trino) is a huge plus\u003cbr/\u003e- Knowledge of query processing fundamentals including parsing, logical planning, and physical execution is a nice to have\u003cbr/\u003e- Understanding of various storage/OTF formats (Parquet, ORC) and their impact on query performance is beneficial but not necessary\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, East Palo Alto - 165,200.00 - 223,600.00 USD annually","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"CA","title":"Software Development Engineer, Open Data Analytics Engines","university_job":null,"updated_time":"23 minutes","url_next_step":"https://account.amazon.com/jobs/3170107/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 4年制大学学士号または同等の業務経験\u003cbr/\u003e- パソコンスキル初級（四則演算ができるレベル）\u003cbr/\u003e- ビジネスレベルの日本語力","business_category":"transportation-and-logistics","city":"Tomigusuku","company_name":"Amazon Japan G.K.","country_code":"JPN","description":"※このポジションの勤務地は沖縄県豊見城市に位置する物流拠点です。\u003cbr/\u003e\u003cbr/\u003e当社のワールドワイドオペレーションネットワークは、毎日何百万ものパッケージと笑顔をAmazonのお客様にお届けしています。私たちは、エリアマネージャーとして私たちのチームに参加したいと考えている、やる気があり、顧客中心の人材を求めています。この役職では、時間給制の従業員で構成されるチームを率い、シフト中にチームの安全性、品質、出勤、パフォーマンスを最高レベルに維持する責任があります。また、お客様の注文が適切なタイミングで適切な場所に確実に届けられるように、お客様の期待に応えるためにも重要な役割を果たします。\u003cbr/\u003e\u003cbr/\u003e当社のオペレーションのワークフローには、主に3つの要素があります。1つは、製品を保管して注文できる状態にするファーストマイル、ミドルマイルは注文品をお客様の地域まで運ぶ場所、ラストマイルは製品をお客様の玄関先に届けるときです。すべてのワークフローには若干の構築上の違いがありますが、変わらないことが1つあります。それは、私たちのビジョンとお客様への献身です。\u003cbr/\u003e\u003cbr/\u003e◆当日配送に特化したこのステーションは、Amazon JPの中でもお客様に最速で商品をお届けすることを目的とした新しいタイプのステーションです。\u003cbr/\u003e最速でお客様のお手元に商品をお届けします。私たちはオペレーションチームとサポートチームが連携し、ラストワンマイルのカスタマーエクスペリエンスを実現するため革新的に取り組んでいます。私たちと一緒に新たな未来を作りましょう！\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e■業務内容■\u003cbr/\u003e「エリアマネージャー」には、他業種・職種も含めこれまでの経験、スキルを活かし、改善点を模索しながら、「People First」の考え方で、各種プロジェクトをリードし、またピープルマネージメントを行っていただきます。また、「エリアマネージャー」は拠点の全ての工程を担当し、上司の示す部署全体の方針や安全・品質・生産性の年間目標に沿って、担当工程における改善を積み重ね、日々の計画、進捗、実績管理に責任をもち活動いただきます。\u003cbr/\u003e\u003cbr/\u003e具体的な業務は以下の通りです。\u003cbr/\u003e\u003cbr/\u003e主な責任と職務内容：\u003cbr/\u003e① チームメンバーの育成とサポート\u003cbr/\u003e現場の最前線にいるマネージャーとしてチームメンバーと積極的に関わり、メンバーからの意見に基づく職場改善によりエンゲージメントを高めます。また、数名から数十名のチームのマネージャーとして、業務上の知識・スキル、アマゾンカルチャー等の指導を行うことはもちろん、部下の悩みに傾聴し、問題の解決に向けて自ら動きます。さらに、部下の勤怠や労働時間等の把握、管理を適切に行います。\u003cbr/\u003e\u003cbr/\u003e② 担当プロセスの安全・品質・作業効率の向上\u003cbr/\u003eマネージャーはそれぞれ特定のプロセスを担当し、そのプロセスの安全・品質・作業効率の向上をリードします。日々の安全活動、品質チェックに加え、作業環境の改善、トレーニングの進捗管理など多岐にわたる改善活動が該当します。問題を特定し、対策を立案し、チームメンバーを巻き込みながら実行に移し、結果を出していくことが求められます。\u003cbr/\u003e\u003cbr/\u003e③ 日々のオペレーション対応\u003cbr/\u003e物流拠点のすべての工程を管理し、商品の管理からお客様へお届けするまでの一連の流れの中で計画を立案し管理していただきます。日々のオペレーションにおいてお客様にお約束した納期を確実に守るため、物量の上振れや下振れ、急な労働力不足、システムトラブル等の変動要素に際し、適切に判断して対応していくことが求められます。\u003cbr/\u003e\u003cbr/\u003e④ プロジェクトリーダーとして改善を推進\u003cbr/\u003eAmazonでは日々改善が推進されています。エリアマネージャーは通常業務と並行して、安全上のリスクや生産性を改善するプロジェクトのリーダーとして拠点内の年次/月次プロジェクト活動を推進します。これらのプロジェクトにおいては関連部署との協業等も含まれます。\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e※勤務は日勤夜勤/土日祝を含むシフト勤務です。詳細は選考時にご確認ください。\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003e【More Information】\u003cbr/\u003e■部門紹介：\u003ca href=\"https://www.amazon.co.jp/b?node=5637337051\"\u003eフルフィルメントセンター (FC)部門\u003c/a\u003e / \u003ca href=\"https://www.amazon.co.jp/b?node=5637343051\"\u003eラストマイル(AMZL)部門\u003c/a\u003e\u003cbr/\u003e■\u003ca href=\"https://www.amazon.co.jp/b?node=5609898051\"\u003eオペレーション職種の紹介\u003c/a\u003e\u003cbr/\u003e■\u003ca href=\"https://www.amazon.co.jp/b?node=8521086051\"\u003e勤務地（沖縄豊見城）の紹介\u003c/a\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e◆Meet our team(Video)\u003cbr/\u003e#\u003ca href=\"https://www.youtube.com/watch?v=yy5xEB8DD6k\"\u003eManager at a Delivery Station/DSで活躍するマネージャーの紹介\u003c/a\u003e\u003cbr/\u003e#\u003ca href=\"https://youtu.be/wR9QlsPdPNg?si=alq3CJll25TdsR3U\"\u003eAmazonStars\u003c/a\u003e\u003cbr/\u003e#\u003ca href=\"https://youtu.be/LprkohGn2no?si=WZILJKjUd0saHXiq\"\u003eShe is Amazon\u003c/a\u003e\u003cbr/\u003e\u003cbr/\u003e――――――――――――――――――\u003cbr/\u003eAmazon は多様かつインクルーシブな職場づくりを目指しています。Amazonは男女雇用機会均等法を順守しています。人種、 出身国、性別、性的指向、障がい、年齢、その他の属性によって差別することなく、平等に採用選考の機会を提供しています。障がいをお持ちの方は、以下をご覧ください。 \u003ca href=\"https://www.amazon.jobs/disability/jp\"\u003ehttps://www.amazon.jobs/disability/jp\u003c/a\u003e\u003cbr/\u003e\u003cbr/\u003e＊\u003ca href=\"https://www.amazon.co.jp/b?node=16748914051\"\u003eオペレーション部門 DEIの取り組み\u003c/a\u003e","department_cost_center":null,"description_short":"※このポジションの勤務地は沖縄県豊見城市に位置する物流拠点です。当社のワールドワイドオペレーションネットワークは、毎日何百万ものパッケージと笑顔をAmazonのお客様にお届けしています。私たちは、エリアマネージャーとして私たちのチームに参加したいと考えている、やる気があり、顧客中心の人材を求めています。この役職では、時間給制の従業員で構成されるチームを率い、シフト中にチームの安全性、品質、出勤、パフォーマンスを最高レベルに維持する責任があります。また、お客様の注文が適切なタイミングで適切な場所に確実に届けられるように、お客様の期待に応えるためにも重要な役割を果たします。当社のオペレーションのワ","display_distance":null,"id":"4b47643b-d020-4140-8dd7-68893712c874","id_icims":"3144479","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3144479/area-manager","job_schedule_type":"full-time","location":"JP, 47, Tomigusuku","locations":["{\"normalizedStateName\":\"Okinawa\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Tomigusuku\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, 47, Tomigusuku\",\"coordinates\":\"26.17712,127.68119\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Tomigusuku-shi, Okinawa, JPN\",\"location\":\"JP, 47, Tomigusuku\",\"region\":\"47\",\"buildingCodeList\":[\"SOW1\"],\"normalizedCityName\":\"Tomigusuku-shi\"}"],"normalized_location":"Tomigusuku-shi, Okinawa, JPN","optional_search_labels":["amazon-operations.japan-area-management"],"posted_date":"December 17, 2025","preferred_qualifications":"- 業界を問わず、スタッフの指導やチームリーダの経験3年以上\u003cbr/\u003e- 5名以上のマネジメント経験\u003cbr/\u003e- 業務管理ツールを使用して業務を遂行し、課題があった場合にシステムから抽出したデータを用いて業務改善をした経験\u003cbr/\u003e- コミュニケーション能力（社内外の関係者と効果的にコミュニケーションを取ることができる。）\u003cbr/\u003e- 問題解決能力（課題発見時にあらゆる側面から要因を抽出・分析して問題解決することができる。）\u003cbr/\u003e- 基本PCスキル（ Outlook, Word, Excel (関数、グラフ), Power Pointを業務上で有効に使用し、必要な分析・報告ができる。）\u003cbr/\u003e- 英語力\u003cbr/\u003e- インクルーシブなカルチャーへの貢献や多様性に富んだグループで働くことに対して前向きであること\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-amzl","source_system":"JobCreator","state":"47","title":"Area Manager","university_job":null,"updated_time":"24 minutes","url_next_step":"https://account.amazon.com/jobs/3144479/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amzl","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"aws","city":"East Palo Alto","company_name":"Amazon Development Center U.S., Inc.","country_code":"USA","description":"Amazon Analytics offers fully managed cloud data warehouse and data lake capabilities. Tens of thousands of enterprise customers use Analytics services to crunch through exabytes of data in the cloud to make business critical decisions every day. To stay ahead in such a mission critical setting, we must always re-invent ourselves for customers. We are always looking for the innovative engineers to help shape the future of Analytics.\u003cbr/\u003e\u003cbr/\u003eWe are actively hiring a talented Software Engineer in the Query Processing team. Query processing is at the heart of Analytics data plane and is responsible for the massive parallel execution engine.\u003cbr/\u003e\u003cbr/\u003eUtility Computing (UC)\u003cbr/\u003eAWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for customers who require specialized security solutions for their cloud services.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003eAs a Software Development Engineer, you will build systems that benefit Analytics customers across the world. You will take significant ownership on the overall product vision by defining new features and architecture. You will distill complex and ambiguous requirements, converting them into meaningful projects that provide immense customer value. You will own and code end-to-end deliverables from design, development, deployment, monitoring, and operations. You will lead engineers on substantial projects and help develop a flourishing team through active mentoring and hiring.\u003cbr/\u003e\u003cbr/\u003eThis is a unique and rare opportunity to get in on the ground floor within a fast-growing business and help shape the technology powering analytical workloads for Fortune 500 companies, startups, and everything in between. You will bring deep technical, algorithmic and coding expertise with the ability to work within a fast moving and collaborative environment in the industry leading cloud company to deliver a broad business impact.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Analytics offers fully managed cloud data warehouse and data lake capabilities. Tens of thousands of enterprise customers use Analytics services to crunch through exabytes of data in the cloud to","display_distance":null,"id":"69c58569-95c4-4498-8050-63c659b23348","id_icims":"3170108","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3170108/software-development-engineer-open-data-analytics-engines","job_schedule_type":"full-time","location":"US, CA, East Palo Alto","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"East Palo Alto\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, East Palo Alto\",\"coordinates\":\"37.4732,-122.13957\",\"normalizedCountyName\":\"San Mateo\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"East Palo Alto, California, USA\",\"location\":\"US, CA, East Palo Alto\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC18\"],\"normalizedCityName\":\"East Palo Alto\"}"],"normalized_location":"East Palo Alto, California, USA","optional_search_labels":["aws.team-database"],"posted_date":"January 29, 2026","preferred_qualifications":"- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Experience or understanding of Apache Spark or other distributed query execution engines (e.g., Velox, Presto, Trino) is a huge plus\u003cbr/\u003e- Knowledge of query processing fundamentals including parsing, logical planning, and physical execution is a nice to have\u003cbr/\u003e- Understanding of various storage/OTF formats (Parquet, ORC) and their impact on query performance is beneficial but not necessary\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, East Palo Alto - 165,200.00 - 223,600.00 USD annually","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"CA","title":"Software Development Engineer, Open Data Analytics Engines","university_job":null,"updated_time":"24 minutes","url_next_step":"https://account.amazon.com/jobs/3170108/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}