{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Experience in natural language data labeling, data annotation, linguistic annotation or other forms of data markup","business_category":"amazon-artificial-general-intelligence","city":"Den Haag","company_name":"Amazon Development Center (Netherlands) B.V.","country_code":"NLD","description":"AI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment of large language models (LLMs) across all of our businesses. Come build the future of human-technology interaction with us.\u003cbr/\u003e\u003cbr/\u003eWe are looking for those candidates who just don’t think out of the box, but make the box they are in ‘Bigger’. The future is now, do you want to be a part of it? Then read on! \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Maintain and follow strict confidentiality as customer privacy is our most important tenet\u003cbr/\u003e- Work with a range of different types of data including, but not limited to: text, speech, audio, image, and video\u003cbr/\u003e- Deliver high-quality labelled data, using guidelines provided to meet our KPIs and using in-house tools and software, as part of Amazon's commitment to developing and deploying AI responsibly.\u003cbr/\u003e- Demonstrate proficiency in generating high quality human insight data across a range of modalities, inclusive of text, image video and audio. \u003cbr/\u003e- Capable of making sound judgments and logical decisions when faced with ambiguous or incomplete information while performing tasks.\u003cbr/\u003e- Eye for detail and ability to pivot from one category of requirement to another instantaneously.\u003cbr/\u003e- Demonstrate support on daily operational deliverables for multiple task types assigned to you and the team\u003cbr/\u003e- Analyze root causes, identify error patterns, and propose solutions to enhance the quality of labeling tasks and their outputs.\u003cbr/\u003e- Responsible for identifying day-to-day process and operational issues in Standard Operating Procedure, tools and suggest changes to unblock operations\u003cbr/\u003e- Demonstrate ownership in floor support to clarify internal queries during execution on need basis\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are looking for a ML Data Associate (MLDA) to undertake the task of foundational labeling functions, such as dialogue evaluation on speech, text, audio, video data.\u003cbr/\u003e\u003cbr/\u003eYour ability to concentrate, multi-task and your high attention to detail helps you deliver high-quality work as well as maintaining strict confidentiality and follow all applicable Amazon policies for securing confidential information. You will be a part of a diverse team with the shared vision of improving customers’ lives with practical, useful generative AI innovations. An inner drive, individuality, and a creative mind are extremely beneficial.","department_cost_center":null,"description_short":"AI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment","display_distance":null,"id":"1fb44b47-17a3-41ba-9f34-86bbdea4046c","id_icims":"3122105","is_intern":null,"is_manager":null,"job_category":"Editorial, Writing, \u0026 Content Management","job_family":"Machine Learning Data Operatio","job_function_id":null,"job_path":"/en/jobs/3122105/data-entry-clerk-german-agi-data-services","job_schedule_type":"full-time","location":"NL, Den Haag","locations":["{\"normalizedStateName\":\"South Holland\",\"normalizedCountryCode\":\"NLD\",\"city\":\"Den Haag\",\"countryIso3a\":\"NLD\",\"countryIso2a\":\"NL\",\"locationNonStemming\":\"Netherlands, Den Haag\",\"coordinates\":\"52.08408,4.31732\",\"normalizedCountyName\":\"The Hague\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Netherlands\",\"normalizedLocation\":\"The Hague, South Holland, NLD\",\"location\":\"NL, Den Haag\",\"region\":\"\",\"buildingCodeList\":[\"AMS10\"],\"normalizedCityName\":\"The Hague\"}"],"normalized_location":"The Hague, South Holland, NLD","optional_search_labels":["alexa-and-amazon-devices.team-operations-job-family","alexa-and-amazon-devices.team-administrative-support-job-family","amazon.artificial-intelligence"],"posted_date":"November  6, 2025","preferred_qualifications":"- Speak, write, and read fluently in German\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":null,"title":"Data Entry Clerk - German, AGI-Data Services","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3122105/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience leading the design, development and deployment of business software at scale or recent hands-on technology infrastructure, network, compute, storage, and virtualization experience\u003cbr/\u003e- Experience and technical expertise (design and implementation) in cloud computing technologies\u003cbr/\u003e- Experience that includes strong analytical skills, attention to detail, and effective communication abilities\u003cbr/\u003e- Experience communicating clearly and effectively with different functional groups including senior business leaders, finance, HR and developers","business_category":"aws","city":"London","company_name":"AWS EMEA SARL (UK Branch)","country_code":"GBR","description":"Revolutionize Financial Technology by Bridging Business and Cloud Innovation\u003cbr/\u003e\u003cbr/\u003eTransform the financial services landscape by connecting cloud solutions with strategic business outcomes. As a Solutions Architect, you'll be the critical link between technological potential and real-world customer success in the dynamic world of Financial Services. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Architect Transformative Solutions: Design and recommend cloud architectures that align seamlessly with customer business objectives in the financial services sector\u003cbr/\u003e- Customer Advocacy: Serve as a trusted technical advisor, translating complex technological capabilities into tangible business value\u003cbr/\u003e- Innovation Catalyst: Develop and share technical content, reference architectures, and best practices that inspire and educate customers\u003cbr/\u003e- Technical Evangelism: Represent AWS through workshops, speaking engagements, and thought leadership in financial technology forums\u003cbr/\u003e- Collaborative Growth: Contribute to team development through mentorship, knowledge sharing, and supporting organizational excellence\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour day will be a dynamic blend of technical exploration and strategic collaboration. You'll engage with financial services customers, unravelling their unique challenges and crafting innovative cloud solutions that drive meaningful business transformation. From designing sophisticated architectures to presenting compelling technical strategies, you'll be at the forefront of technological innovation.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe are a diverse collective of technology enthusiasts passionate about empowering businesses through cloud innovation. Our team thrives on continuous learning, collaborative problem-solving, and a commitment to customer success. We value individual perspectives and believe that breakthrough solutions emerge from a rich tapestry of backgrounds and experiences.\u003cbr/\u003e\u003cbr/\u003eAbout AWS\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Revolutionize Financial Technology by Bridging Business and Cloud InnovationTransform the financial services landscape by connecting cloud solutions with strategic business outcomes. As a Solutions Architect,","display_distance":null,"id":"5f4dfc36-0526-446f-80a8-5f0595676e38","id_icims":"3181898","is_intern":null,"is_manager":null,"job_category":"Solutions Architect","job_family":"Solution Architect","job_function_id":null,"job_path":"/en/jobs/3181898/senior-solutions-architect-uki-financial-services","job_schedule_type":"full-time","location":"GB, London","locations":["{\"normalizedStateName\":\"England\",\"normalizedCountryCode\":\"GBR\",\"city\":\"London\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, London\",\"coordinates\":\"51.50643,-0.12719\",\"normalizedCountyName\":\"London\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"London, England, GBR\",\"location\":\"GB, London\",\"region\":\"\",\"buildingCodeList\":[\"LHR14\"],\"normalizedCityName\":\"London\"}"],"normalized_location":"London, England, GBR","optional_search_labels":[],"posted_date":"February 16, 2026","preferred_qualifications":"- Bachelor's degree in Computer Science, Engineering, a related technical field or equivalent\u003cbr/\u003e- Experience in large scale migration- data center to data center or data center to cloud infrastructure\u003cbr/\u003e- Experience leading or developing high quality, enterprise scale software products using a structured system development lifecycle\u003cbr/\u003e- Experience in technology-related sales, business development, or sales engineering/consulting\u003cbr/\u003e- Experience conveying complex technical concepts to both technical and business audiences\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-solutions-architect-primary","source_system":"JobCreator","state":null,"title":"Senior Solutions Architect, UKI Financial Services","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3181898/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-solutions-architect-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent\u003cbr/\u003e- 6+ years of compliance, audit or risk management experience\u003cbr/\u003e- Experience effectively communicating complex concepts through written and verbal communication\u003cbr/\u003e- Experience in Anti-Money Laundering (AML), sanctions, fraud, or risk management\u003cbr/\u003e- Previous experience as a senior member of a Compliance Office in a major bank or e-money/payment institution.","business_category":"customer-trust-and-partner-support","city":"Cape Town","company_name":"Amazon Commercial Services (South Africa) (Pty) Ltd","country_code":"ZAF","description":"Amazon's Risk and Compliance Solutions team is looking for an experienced compliance professional to lead our South Africa Compliance office.\u003cbr/\u003e   \u003cbr/\u003eThe Compliance Officer is a senior role within the MEA Compliance team and is responsible for operating and improving our 2nd line compliance programs in South Africa.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003eThe Compliance Officer will: \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e - Provide effective and timely advice on complex regulatory compliance matters to the business, in conjunction with our legal teams. \u003cbr/\u003e - Accurately Interpret and advise on applicable ZA regulations, with an emphasis on AML-CTF.\u003cbr/\u003e - Work with legal, risk and business leads to develop and maintain our compliance policies and controls. \u003cbr/\u003e - Communicate conduct and compliance risks to Senior Management, preparing the reading materials for risk committees as may required.\u003cbr/\u003e - Operate and continuously improve the Compliance Monitoring plan for the ZA regulated entity.\u003cbr/\u003e -  Respond to requests for information from auditors and regulators in a timely manner.\u003cbr/\u003e- Lead the digesting and analysis of regulatory change and look for opportunities to influence the regulatory agenda on behalf of our customers. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe MEA compliance team at RCS operates Amazon's 2nd line Compliance Programs in the Middle East and Africa.  We enable Amazon to operate its regulated businesses in compliance with applicable regulation while maintaining great customer experiences. We are experts in regulatory compliance, adept at managing compliance risk and continuously obsess about delighting our customers.  ","department_cost_center":null,"description_short":"Amazon's Risk and Compliance Solutions team is looking for an experienced compliance professional to lead our South Africa Compliance office.   The Compliance Officer is a senior role within the MEA Compliance","display_distance":null,"id":"f0e9592f-458d-436a-b309-a19be795e998","id_icims":"3138839","is_intern":null,"is_manager":null,"job_category":"Legal","job_family":"Risk Family","job_function_id":null,"job_path":"/en/jobs/3138839/compliance-officer-risk-and-compliance-solutions","job_schedule_type":"full-time","location":"ZA, Cape Town","locations":["{\"normalizedStateName\":\"Western Cape\",\"normalizedCountryCode\":\"ZAF\",\"city\":\"Cape Town\",\"countryIso3a\":\"ZAF\",\"countryIso2a\":\"ZA\",\"locationNonStemming\":\"South Africa, Cape Town\",\"coordinates\":\"-33.91909,18.42198\",\"normalizedCountyName\":\"Cape Town\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"South Africa\",\"normalizedLocation\":\"Cape Town, Western Cape, ZAF\",\"location\":\"ZA, Cape Town\",\"region\":\"\",\"buildingCodeList\":[\"CPT14\"],\"normalizedCityName\":\"Cape Town\"}"],"normalized_location":"Cape Town, Western Cape, ZAF","optional_search_labels":[],"posted_date":"December  8, 2025","preferred_qualifications":"- Held regulated roles (CO/MLRO) vis-a-vis regulators in the South Africa.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer, and we value your passion to discover, invent, simplify and build. We welcome applications from all members of society irrespective of age, sex, disability, sexual orientation, race, religion or belief. Amazon is strongly committed to diversity within its community and especially welcomes applications from South African citizens who are members of designated groups who may contribute to Employment Equity within the workplace and the further diversification of ideas. In this regard, the relevant laws and principles associated with Employment Equity will be considered when appointing potential candidates. We are required by law to verify your ability to work lawfully in South Africa. Amazon requires that you submit a copy of either your identity document or your passport and any applicable work permit if you are a foreign national, along with an updated curriculum vitae.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"customer-trust-and-partner-support.team-selling-partner-risk","source_system":"JobCreator","state":null,"title":"Compliance Officer, Risk and Compliance Solutions","university_job":null,"updated_time":"37 minutes","url_next_step":"https://account.amazon.com/jobs/3138839/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-selling-partner-risk","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- Can push and pull wheeled dollies loaded with products up to 100 pounds during shifts","business_category":"fulfillment-and-operations","city":"Vadodara","company_name":"ASSPL - Gujarat","country_code":"IND","description":"At Amazon, we're working to be the most customer-centric company on  earth. To get there, we need exceptionally talented, bright, and driven  people. Amazon is seeking Team leads for our transportation team. Amazon  is one of the most recognizable brand names in the world and we  distribute millions of products each year to our loyal customers\u003cbr/\u003e \u003cbr/\u003e  We're seeking Channel Team Lead for our Delivery Stations. In this role  you will be responsible to expand and manage operations for a new  delivery channel, people and performance management and driving the  operational plan.\u003cbr/\u003e \u003cbr/\u003e Title: Channel Team Lead \u003cbr/\u003e \u003cbr/\u003e Typical responsibilities will include:\u003cbr/\u003e  · Quickly understand the business issues and challenges of  Transportations operations; identify strengths/weaknesses and suggest  areas for improvement\u003cbr/\u003e · Map business requirements, understand  business process, study and analyze workflows, design solutions and  prepare functional specifications\u003cbr/\u003e · Be data driven, develop and  report performance metrics, executive updates, forecasting, budgeting  and analysis to identify potential opportunities for improving Customer  Experience.\u003cbr/\u003e · Deep dive and acquire an extensive knowledge of emerging industry practices and apply when solving business problems.\u003cbr/\u003e  · Design, develop, pilot \u0026 rollout enterprise wide programs around  performance improvement, cycle time improvement for returns, delivery  experience, financial auditing, identification of alternate delivery  services etc.,\u003cbr/\u003e \u003cbr/\u003e Essential Skills\u003cbr/\u003e - Strong execution skills, Action oriented, go getter\u003cbr/\u003e - Resourceful to identify the way to get things done using limited resources\u003cbr/\u003e - Ability to work under pressure situations\u003cbr/\u003e - Ability to work in ambiguous situations and to come out with solutions as per the situations faced","department_cost_center":null,"description_short":"At Amazon, we're working to be the most customer-centric company on  earth. To get there, we need exceptionally talented, bright, and driven  people. Amazon is seeking Team leads for our transportation","display_distance":null,"id":"3aa2e4d5-427b-48e6-879d-128bcc7e2466","id_icims":"3176630","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3176630/channel-team-lead","job_schedule_type":"full-time","location":"IN, GJ, Vadodara","locations":["{\"normalizedStateName\":\"Gujarat\",\"normalizedCountryCode\":\"IND\",\"city\":\"Vadodara\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, GJ, Vadodara\",\"coordinates\":\"22.30946,73.17991\",\"normalizedCountyName\":\"Vadodara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Vadodara, Gujarat, IND\",\"location\":\"IN, GJ, Vadodara\",\"region\":\"GJ\",\"buildingCodeList\":[\"BDQ42\"],\"normalizedCityName\":\"Vadodara\"}"],"normalized_location":"Vadodara, Gujarat, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"February  9, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-last-mile-delivery","source_system":"JobCreator","state":"GJ","title":"Channel Team Lead","university_job":null,"updated_time":"41 minutes","url_next_step":"https://account.amazon.com/jobs/3176630/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-delivery","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor’s degree in a relevant area of expertise such as healthcare, business, or finance\u003cbr/\u003e- Prior experience of at least 2 years in Accounts Receivable in RCM space\u003cbr/\u003e- Experience working in shared services environment with productivity targets\u003cbr/\u003e- Exposure to US healthcare and insurance landscape\u003cbr/\u003e- Understanding of basic accounting principles and receivables management\u003cbr/\u003e- Proven ability to adhere to policies and procedures, as defined by leadership\u003cbr/\u003e- Bachelor’s degree in a relevant area of expertise such as healthcare, business, or finance • Prior experience of at least 2 years in Accounts Receivable in RCM space • Experience working in shared services environment with productivity targets • Exposure to US healthcare and insurance landscape • Understanding of basic accounting principles and receivables management • Proven ability to adhere to policies and procedures, as defined by leadership","business_category":"finance","city":"Manila","company_name":"AOSP - Manila","country_code":"PHL","description":"The Finance Operations organization works with every part of Amazon to provide operations accounting and operations excellence services with the highest level of controllership at the lowest cost to the company. We provide the backbone systems and operational processes which completely, accurately, and validly pay Amazon’s suppliers, invoice our customers and report financial results. Amazon is quickly building the Finance Operations capabilities in the healthcare industry by creating the Healthcare Finance Operations Services.\u003cbr/\u003e\u003cbr/\u003eAs part of the Amazon Healthcare Global Finance Operations Services team, you will find yourself working with exceptionally talented and determined people committed to driving financial improvement, scalability, and process excellence. To support the growth of Amazon Healthcare, this candidate must possess a strong passion for accountability, setting high standards, raising the bar, and driving results through constant focus on improving existing and future state operations, systems, and processes in collaboration with Senior Management. \u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will not only have exposure to healthcare revenue cycle, including shared services functions (e.g. billing, collections, cash application) but also have exceptional customer obsessed skills to resolve complex dispute management and provide excellent customer service. They will be able to learn quickly and be willing to experiment with new ideas. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tContributes to the successful management of healthcare receivables operations, including collections, cash application, account reconciliations and denials management.\u003cbr/\u003e•\tInterfaces with payers, employers and patients to ensure timely and accurate resolution of accounts receivables. \u003cbr/\u003e•\tIndependently identifies areas of operational opportunity. Prioritizes using analysis and investigation, presents recommendations and drive implementation by collaborating with cross functional teams. \u003cbr/\u003e•\tReviews and recommends changes to policies and procedures to improve Accounts Receivables processes. \u003cbr/\u003e•\tActs as the Voice of the Customer by acting and reporting on observed areas for improvement.\u003cbr/\u003e•\tParticipates in the development of training materials and quality assurance programs. \u003cbr/\u003e•\tAdheres to collection and productivity standards as set by leadership\u003cbr/\u003e","department_cost_center":null,"description_short":"The Finance Operations organization works with every part of Amazon to provide operations accounting and operations excellence services with the highest level of controllership at the lowest cost to the","display_distance":null,"id":"e4c13490-42e4-4e9c-8232-71f9899ba4cc","id_icims":"3184704","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/planning","job_function_id":null,"job_path":"/en/jobs/3184704/senior-cash-application-analyst-revenue-cycle-management-healthcare-healthcare","job_schedule_type":"full-time","location":"PH, Manila","locations":["{\"normalizedStateName\":\"National Capital Region\",\"normalizedCountryCode\":\"PHL\",\"city\":\"Manila\",\"countryIso3a\":\"PHL\",\"countryIso2a\":\"PH\",\"locationNonStemming\":\"Philippines, Manila\",\"coordinates\":\"14.60488,120.98626\",\"normalizedCountyName\":\"First District NCR\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Philippines\",\"normalizedLocation\":\"Manila, National Capital Region, PHL\",\"location\":\"PH, Manila\",\"region\":\"\",\"buildingCodeList\":[\"MNL12\"],\"normalizedCityName\":\"Manila\"}"],"normalized_location":"Manila, National Capital Region, PHL","optional_search_labels":[],"posted_date":"February 19, 2026","preferred_qualifications":"- Experience with US healthcare and health insurance industry\u003cbr/\u003e- Prior AR Collections or back office experience\u003cbr/\u003e- Has led or been part of a team that worked on a Six Sigma belt project / Kaizen / Lean projects\u003cbr/\u003e- Experience with US healthcare and health insurance industry • Prior AR Collections or back office experience • Has led or been part of a team that worked on a Six Sigma belt project / Kaizen / Lean projects\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-finops","source_system":"JobCreator","state":null,"title":"Senior Cash Application Analyst - Revenue Cycle Management, Healthcare, HealthCare","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3184704/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-finops","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Completed University degree before the start date OR graduated within the last 24 months\u003cbr/\u003e- Advanced proficiency in written and verbal English and local language\u003cbr/\u003e- Relevant experience in performing data analysis","business_category":"studentprograms","city":"Fiumicino","company_name":"Amazon Italia Logistica S.R.L.","country_code":"ITA","description":"When you join Amazon as an Area/Shift Manager, you’ll gain experience leading a large and diverse team to make sure your area of the business keeps pace with demand. In this hands-on role, you’ll learn about the complexity of operations at a global business and what it takes to make everything run seamlessly. While you implement your team’s approach to drive productivity, you’ll also work closely with your colleagues to address challenges, which means no two days will be the same.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Promote a culture of safety and wellbeing\u003cbr/\u003e- Analyse and implement corrective actions to make sure quality and productivity are at consistently high levels, and business objectives are met across all shifts\u003cbr/\u003e- Support and lead a team and handle administrative work alongside building and supporting a strong team culture\u003cbr/\u003e- Analyse performance and suggest process improvements to optimise work and improve customer service\u003cbr/\u003e- Collaborate with other managers to standardise shift processes\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou’ll work shifts and be based at one of our operational sites. Your main focus will be to maintain safety standards within your team and across your site. You’ll also monitor and maintain process efficiency. Your days will always include prioritising routine team management and daily operational tasks, alongside other tasks like individual escalations, process improvement work and wide-scale operational contingency planning.\u003cbr/\u003e\u003cbr/\u003eBeing a key part of the operations team involves working with colleagues in other teams and external partners to make sure we stay on track to meet our customer demands and targets. This will involve analysing data and performance metrics with leaders in your business area, as well as discussing the operational pros and cons of technical improvements with engineers.","department_cost_center":null,"description_short":"When you join Amazon as an Area/Shift Manager, you’ll gain experience leading a large and diverse team to make sure your area of the business keeps pace with demand. In this hands-on role, you’ll learn","display_distance":null,"id":"e8edf611-5259-4d43-8988-cc86be684d7a","id_icims":"3185818","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3185818/graduate-area-shift-manager-fiumicino","job_schedule_type":"full-time","location":"IT, RM, Fiumicino","locations":["{\"normalizedStateName\":\"Latium\",\"normalizedCountryCode\":\"ITA\",\"city\":\"Fiumicino\",\"countryIso3a\":\"ITA\",\"countryIso2a\":\"IT\",\"locationNonStemming\":\"Italy, RM, Fiumicino\",\"coordinates\":\"41.77008,12.22708\",\"normalizedCountyName\":\"Rome\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Italy\",\"normalizedLocation\":\"Fiumicino, Latium, ITA\",\"location\":\"IT, RM, Fiumicino\",\"region\":\"RM\",\"buildingCodeList\":[\"DLZ7\"],\"normalizedCityName\":\"Fiumicino\"}"],"normalized_location":"Fiumicino, Latium, ITA","optional_search_labels":["university-ops-europe-full-time"],"posted_date":"February 20, 2026","preferred_qualifications":"- Preferred qualifications are not required to apply for a position at Amazon. If you have all the basic qualifications above, we’d love to hear from you.\u003cbr/\u003e- Currently enrolled in or recently graduated with a Bachelor’s or Master’s degree in Supply Chain, Business/Management, Engineering or another related field.\u003cbr/\u003e- Experience of communicating with a wide range of stakeholders, including your peers and leadership\u003cbr/\u003e- Experience in a logistical working environment\u003cbr/\u003e- Experience working with the MS Office suite (Word, Excel, Outlook) in a professional environment\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"studentprograms.team-jobs-for-grads","source_system":"JobCreator","state":"RM","title":"Graduate Area/Shift Manager - Fiumicino","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3185818/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-jobs-for-grads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of tax, finance or a related analytical field experience\u003cbr/\u003e- 4+ years of Accounts Receivable or Account Payable experience\u003cbr/\u003e- 4+ years of applying key financial performance indicators (KPIs) to analyses experience\u003cbr/\u003e- 4+ years of creating process improvements with automation and analysis experience\u003cbr/\u003e- 4+ years of identifying, leading, and executing opportunities to improve, automate, standardize or simplify finance or business tools and processes experience","business_category":"finance","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"Amazon is a US-based multinational electronic commerce company headquartered in Seattle, Washington. Amazon.com started as an online bookstore, but soon diversified into many other categories, with a vision to be earth's most customer-centric company \u0026 to build a place where people can come to find and discover anything they might want to buy online. Amazon's Finance Operations, Accounting \u0026 Analysis (FOAA) team is a fast-paced, team-focused, dynamic environment and delivering great experiences for our customers is top priority. FOAA is seeking a Finance Analyst II to support our Central Accounting and Tax Compliance.\u003cbr/\u003eKey Roles and Responsibilities are:\u003cbr/\u003e1. Perform/Support the month end activities which include closing of sub ledgers, general ledger account reconciliations, reporting and balance sheet account analysis.\u003cbr/\u003e2. Prepare month end Flux analysis for all P\u0026L and Balance sheet accounts and share with Stakeholders along with the analysis on the reasons for the changes.\u003cbr/\u003e3. Demonstrate a proficient level of professional skill and knowledge in accounting and apply this in-depth knowledge, principles and systems design to recognize complex and unique issues and develop resolution and/or consistently consult with leadership in order to achieve resolution\u003cbr/\u003e4. Ensure appropriate financial policies, procedures and internal controls are in place, documented and also work on process improvements.\u003cbr/\u003e5. Responsible for Reviewing Balance sheet reconciliations (reconciliations with GST Tax returns/sub-ledger reports) and highlighting and taking necessary action upon the issues appropriately.\u003cbr/\u003e6. Interact and working closely with the auditors on audit related queries and ensure smooth completion of the audits .\u003cbr/\u003e7. Responsible for GRC compliance, internal control and get the alignment of improvements/changes with the Stakeholder.\u003cbr/\u003e8. Perform and support new business/system launches including UAT of the accounting entries and financial reporting.","department_cost_center":null,"description_short":"Amazon is a US-based multinational electronic commerce company headquartered in Seattle, Washington. Amazon.com started as an online bookstore, but soon diversified into many other categories, with a vision","display_distance":null,"id":"38774ee4-d7e5-46af-92b4-04437377afb2","id_icims":"3176970","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/Planning","job_function_id":null,"job_path":"/en/jobs/3176970/financial-analyst-ii-foaa-gst","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR13\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"February  9, 2026","preferred_qualifications":"- 4+ years of participating in continuous improvement projects in your team to scale and improve controllership with measurable results experience\u003cbr/\u003e- Experience working with large-scale data mining and reporting tools (examples: SQL, MS Access, Essbase, Cognos) and other financial systems (examples: Oracle, SAP, Lawson, JD Edwards)\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-accounting","source_system":"JobCreator","state":"KA","title":"Financial Analyst II, FOAA GST","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3176970/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-accounting","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- Experience with Microsoft Office products and applications","business_category":"retail","city":"Bengaluru","company_name":"ARIPL - Karnataka","country_code":"IND","description":"Vendor Operations team is designed to guide and assist customers/vendors to ensure seamless experience while working with Amazon systems. As a part of this team, the primary role will be providing all reasonable support to customer/vendors in improving their capabilities to ensure that they are able execute their business in the most optimum way. The role will comprise of assisting the customer /vendor to get well versed with various Amazon tools and provide on ground support to assess inputs like PO management, shipment etc.\u003cbr/\u003eThese tasks include, but are not limited to, assisting in training on populating/procuring catalog content, face to face interacting/coordinating with the vendors/manufacturers/customers, identifying and correcting errors, maintaining records of work received and work performed etc. In addition to being a support associate grooming customers/vendor’s to become self-sufficient on the platform, the individual is expected to take on larger responsibilities such as initiating and owning process improvement projects, participating actively in stakeholder calls/meetings etc.\u003cbr/\u003eI. Skills\u003cbr/\u003ea. Strong written and spoken communication skills\u003cbr/\u003eb. Good working knowledge of MS Office Suite\u003cbr/\u003e\u003cbr/\u003eII. Ability to\u003cbr/\u003ea. Multi task in a fast paced environment\u003cbr/\u003eb. Operate in the system with speed and accuracy necessary to meet Amazon standards\u003cbr/\u003ec. Handle stressful situations, maintain composure, and communicate clearly with both internal and external stakeholders\u003cbr/\u003e\u003cbr/\u003eIII. Demonstrate\u003cbr/\u003ea. Passion for Business Development\u003cbr/\u003eb. Strong interpersonal skills\u003cbr/\u003ec. Excellent listening skills\u003cbr/\u003ed. Excellent data accuracy skills, eye for detail, and commitment to meet deadlines\u003cbr/\u003e\u003cbr/\u003eIV. Critical Qualities / Characteristics\u003cbr/\u003ea. Pace of implementation and consistency in performance\u003cbr/\u003eb. Willingness to take initiatives and additional responsibilities\u003cbr/\u003ec. Willingness to travel\u003cbr/\u003ed. Commitment and completion factor\u003cbr/\u003ee. Peer respect - establish and maintain cooperative working relationships\u003cbr/\u003ef. Creative and analytical problem solvers with a passion for operational excellence\u003cbr/\u003eg. Identify areas of possible process improvements\u003cbr/\u003e\u003cbr/\u003eV. Operations\u003cbr/\u003ea. Meet and interact with Local vendors on Day-to-Day basis in initial process setup.\u003cbr/\u003eb. Flag possible escalation, dive deep to recommend and implement corrective actions\u003cbr/\u003ec. Flag any updates received from stakeholders on process to Team Lead/Manager\u003cbr/\u003ed. Be part of client calls to raise challenges, lead, and document conference discussions","department_cost_center":null,"description_short":"Vendor Operations team is designed to guide and assist customers/vendors to ensure seamless experience while working with Amazon systems. As a part of this team, the primary role will be providing all","display_distance":null,"id":"1b9f0b1d-10c2-48f9-938b-dfc14aae4e75","id_icims":"3185816","is_intern":null,"is_manager":null,"job_category":"Business \u0026 Merchant Development","job_family":"Catalog","job_function_id":null,"job_path":"/en/jobs/3185816/senior-vendor-ops-associate-aripl","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR37\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"February 20, 2026","preferred_qualifications":"- Experience in procurement, supply chain, inventory management, contract management, lease administration or operations\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"retail.team-icb-in","source_system":"JobCreator","state":"KA","title":"Senior Vendor Ops Associate, ARIPL","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3185816/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-icb-in","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience with Microsoft Word, Excel, and PowerPoint\u003cbr/\u003e- 2+ years previous experience in Environment, Health \u0026 Safety·\u003cbr/\u003e- Bachelor’s degree in engineering or a related Safety field required.\u003cbr/\u003e- Experience in reputed organizations · Experience managing multiple direct reports.\u003cbr/\u003e- Must be flexible regarding shifts. · Experience implementing lean principles and process improvement in an operational environment.\u003cbr/\u003e- Experience managing multiple direct reports\u003cbr/\u003e- Nebosh/ADIS Or any Bachelor's Degree with Safety experience","business_category":"operations","city":"Hyderabad","company_name":"ASSPL - Telangana - D82","country_code":"IND","description":"The Site WHS officer will be responsible for partnering with a site operations team in a Sort Center to execute company safety policies and ensure compliance to all applicable local and regional regulations. By leveraging lean principles and kaizens, this individual will lead continuous improvement initiatives to reduce conditional and   ergonomic risk in our processes to ensure a safe and healthful working   environment for our Associates. The Site WHS officer must  demonstrate  the ability to build trust and confidence with the  Operations Team and  influence change through providing comprehensive  risk assessments and  safety data analysis. \u003cbr/\u003e \u003cbr/\u003e The Site WHS officer must be an  effective communicator and send clear, concise and  consistent messages,  both verbally and in writing. This individual must  instruct and train  Operations Leaders in company safety policies and  assist the operations  site teams in incorporating our safety standards  at their site. The Site WHS officer will be required to identify  best practices and  incorporate these best practices into our standards  to continuously  improve company safety policies. The Site WHS officer will be  required to possess excellent safety program and  relevant safety,  environmental and ergonomic knowledge and demonstrates  this expertise  when working with Operations. \u003cbr/\u003e \u003cbr/\u003eWHS Officer  must create  and execute leadership development plans for  their Safety Associates on  their team. They must communicate safety  team expectations and give  frequent and appropriate feedback to their  safety teams and ensure they  are executing to the core competencies of  an Amazon safety professional.","department_cost_center":null,"description_short":"The Site WHS officer will be responsible for partnering with a site operations team in a Sort Center to execute company safety policies and ensure compliance to all applicable local and regional regulations.","display_distance":null,"id":"9cb95887-1bf5-4a90-8de3-f84f689c2e7d","id_icims":"3176710","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Real Estate/facilities","job_function_id":null,"job_path":"/en/jobs/3176710/whs-officer","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD8\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"February  9, 2026","preferred_qualifications":"- Experience in Distribution Center or Manufacturing EHS with mix of exempt and non-exempt employees at a site of at least 250 people\u003cbr/\u003e- Master's degree or above\u003cbr/\u003e- Experience in a fast paced, dynamic organization\u003cbr/\u003e- Bachelor's degree in safety, environmental, or equivalent, or 4+ years of team management, budget responsibilities, supplier management, problem solving, and client/ customer relations experience\u003cbr/\u003e- Experience in written and oral communication, including the ability to communicate with all levels in the organization (technical, business, executive)\u003cbr/\u003e- Experience developing and implementing KPI goals and strategies based on broader organization goals\u003cbr/\u003e- Experience that includes strong analytical skills, attention to detail, and effective communication abilities, or experience in technical support\u003cbr/\u003e- · Ability to adapt well to fast-paced environments with changing circumstances, direction, and strategy\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"operations.team-whs","source_system":"JobCreator","state":"TS","title":"WHS Officer","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3176710/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-whs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of with Excel experience\u003cbr/\u003e- 5+ years of retail, operations, product or program management, or business management/consulting with negotiations and delivering results experience\u003cbr/\u003e- Bachelor's degree, or 3+ years of professional or military experience\u003cbr/\u003e- Experience with financial analysis and P\u0026L ownership","business_category":"retail","city":"Dubai","company_name":"Q Tech General Trading LLC","country_code":"ARE","description":"This is a fixed term contact for 1 year, expected to join in April 2026. \u003cbr/\u003e\u003cbr/\u003eWork hard. Have fun. Make history. At Amazon we expect no more and no less from you. Ever since Amazon opened its doors, it has been the aim to become the most customer-centric company in the world. How is this achieved? By having people like you who make sure that customers find everything that they are looking for online – at great prices and convenience. Both Amazon and sellers who list their products on the site already offer millions of new and used items in a wide range of categories. And this is just the beginning. Come and experience a company that reinvents itself every day. Immerse yourself in an environment that is fast-paced, expanding and is continuously inventing new efficiencies and offering great opportunity for our customers and for you!\u003cbr/\u003e\u003cbr/\u003eThe Vendor Manager will be responsible for developing and owning the strategy for categories at Amazon. Within this role, the individual will have the opportunity establish and maintain strong vendor partnerships, manage category profitability, and identify means to improve the customer experience. We are seeking a seasoned business leader with a broad skill-set which demonstrates analytical horsepower, ability to lead and motivate a team, excellent business judgment, strong vendor management and negotiations skills, deep curiosity to uncover how things work, and a passion for creating a world class shopping experience for our customers. You will work with vendors of all sizes and must have the leadership presence and communication skills to represent Amazon at all levels of these organizations. Experience in business analytics, strategic thinking, negotiations and operations are required. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Managing a full P\u0026L, including planning, forecasting and driving growth for the category, possessing a complete understanding of internal and external variables that impact the business.\u003cbr/\u003e• Execute a strategic business development plan while working with key internal stakeholders (e.g., operations, marketing legal, tech).\u003cbr/\u003e• Lead day-to-day operational aspects of the business, including gathering and addressing customer and vendor feedback, price management, and business improvement initiatives.\u003cbr/\u003e• Setting goals and strategic direction for the category, ensuring alignment with broader business goals and vision.\u003cbr/\u003e• Representing Amazon when meeting with senior teams from top vendors and building long term strategic relationships.\u003cbr/\u003e• Generating and implementing big ideas to drive business improvements, innovation, and scale within the category and across the Retail business.\u003cbr/\u003e• Leading cross functional collaboration on necessary systems and processes to support business needs, including retail systems, site merchandising and in-stock.\u003cbr/\u003e• Innovating and implementing new customer and vendor programs.\u003cbr/\u003e• Collaborating on Marketing and Merchandising initiatives. ","department_cost_center":null,"description_short":"This is a fixed term contact for 1 year, expected to join in April 2026. Work hard. Have fun. Make history. At Amazon we expect no more and no less from you. Ever since Amazon opened its doors, it has","display_distance":null,"id":"93522ad9-3c46-40ae-899c-2401578f978b","id_icims":"3175682","is_intern":null,"is_manager":null,"job_category":"Buying, Planning, \u0026 Instock Management","job_family":"Buying/Planning","job_function_id":null,"job_path":"/en/jobs/3175682/vendor-manager-ftc-softlines","job_schedule_type":"full-time","location":"AE, Dubai","locations":["{\"normalizedCountryCode\":\"ARE\",\"city\":\"Dubai\",\"countryIso3a\":\"ARE\",\"countryIso2a\":\"AE\",\"locationNonStemming\":\"United Arab Emirates, Dubai\",\"coordinates\":\"25.26951,55.30884\",\"normalizedCountyName\":\"Dubai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Arab Emirates\",\"normalizedLocation\":\"Dubai, ARE\",\"location\":\"AE, Dubai\",\"region\":\"\",\"buildingCodeList\":[\"DXB30\"],\"normalizedCityName\":\"Dubai\"}"],"normalized_location":"Dubai, ARE","optional_search_labels":[],"posted_date":"February  6, 2026","preferred_qualifications":"- Experience managing large data sets and utilizing to drive performance and process improvements\u003cbr/\u003e- Experience in vendor negotiations, pricing and promotion, inventory management, and product development\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"retail.no-team-listed","source_system":"JobCreator","state":null,"title":"Vendor Manager (FTC), Softlines","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3175682/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}