{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Bachelor's degree in Electrical Engineering, Mechanical Engineering, or a related field\u003cbr/\u003e- Experience carrying new design concepts through exploration, development, and into deployment or mass production\u003cbr/\u003e- Experience in MS Excel, Word, and Windows Operating Systems\u003cbr/\u003e- Experience with power management and power monitoring systems","business_category":"aws","city":"Lubbock","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe Data Center Construction Manager will be responsible for construction project management and oversight of construction related activities as they relate to new builds or general capital projects which includes the ownership of the project scope, quality, schedule, and budget.\u003cbr/\u003e\u003cbr/\u003eSome of the typical daily tasks of the Construction Manager:\u003cbr/\u003eDirect interface with construction general contractors during the bidding, award, execution, and project closeout/punch list phases.\u003cbr/\u003eConduct negotiations with general contractors and evaluate bids/proposals with detail and accuracy.\u003cbr/\u003eCreate construction project scope and request for proposals.\u003cbr/\u003eFinancial analysis of construction.\u003cbr/\u003eConstruction project management for specific initiatives aimed at increasing the resiliency of our data centers.\u003cbr/\u003eConstructability reviews of electrical and mechanical designs associated with the construction of new data centers or optimization of existing data centers.\u003cbr/\u003eConstruction document management including submittal review, RFI’s, change orders, and invoicing.\u003cbr/\u003eConstruction project quality control.\u003cbr/\u003eRecord and report key construction metrics to team members and management.\u003cbr/\u003eDrive teams to perform troubleshooting and root-cause failure analysis associated with equipment failures.\u003cbr/\u003eBe a leader within the group as well as within internal and external teams that support the data center.\u003cbr/\u003eAble to read and interpret construction specifications and drawings for all disciplines.\u003cbr/\u003eDefine data center system-level architecture, specify/document performance and equipment requirements, create/communicate conceptual designs, and create/maintain project documentation.\u003cbr/\u003eExperience with large scale technical operations or large-scale compute farms.\u003cbr/\u003eKnowledge of building codes and regulations including Life Safety, BOCA, NFPA, NEC, and OSHA.\u003cbr/\u003eExperience in controls and commissioning of large scale projects.\u003cbr/\u003eExperience with power management and power monitoring systems.\u003cbr/\u003eCertifications such as Professional Engineer (PE), LEED, and/or Certified Construction Manager (CCM)\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003e**Why AWS**\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003e*Diverse Experiences*\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003e*Work/Life Balance*\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003e*Inclusive Team Culture*\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003e*Mentorship and Career Growth*\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003e#DCCD_AMER ","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"b317aabc-2485-4891-9e50-20fa108debb6","id_icims":"3179072","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3179072/construction-manager-aws","job_schedule_type":"full-time","location":"US, TX, Lubbock","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Lubbock\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Lubbock\",\"coordinates\":\"33.58451,-101.84462\",\"normalizedCountyName\":\"Lubbock\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Lubbock, Texas, USA\",\"location\":\"US, TX, Lubbock\",\"region\":\"TX\",\"buildingCodeList\":[\"LBB5\"],\"normalizedCityName\":\"Lubbock\"}"],"normalized_location":"Lubbock, Texas, USA","optional_search_labels":["aws.team-ais"],"posted_date":"February 11, 2026","preferred_qualifications":"- 5+ years of project management in data centers or comparable critical infrastructure experience\u003cbr/\u003e- Knowledge of critical data center equipment\u003cbr/\u003e- Knowledge of engineering documentation, electrical diagrams and standard operating procedures\u003cbr/\u003e- Knowledge of building codes and regulations including Life Safety, BOCA, NFPA, NEC, or OSHA\u003cbr/\u003e- Experience in project management in data centers or comparable critical infrastructure\u003cbr/\u003e- Experience in Data Center Engineering Operations, with a deep understanding of electrical and mechanical data center infrastructure\u003cbr/\u003e- Experience reading and interpreting construction specifications and drawings for all domains\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Lubbock - 111,300.00 - 186,100.00 USD annually","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"TX","title":"Construction Manager, AWS ","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3179072/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 7+ years of people management experience\u003cbr/\u003e- 7+ years of technical program management experience\u003cbr/\u003e- Bachelor's degree in Engineering, Computer Science, or a related technical field\u003cbr/\u003e- Experience in people management\u003cbr/\u003e- Experience in technical program management\u003cbr/\u003e- Experience managing projects across cross functional teams, building sustainable processes and coordinating release schedules","business_category":"entertainment","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Prime Video is a first-stop entertainment destination offering customers a vast collection of premium programming in one app available across thousands of devices. Prime members can customize their viewing experience and find their favorite movies, series, documentaries, and live sports – including Amazon MGM Studios-produced series and movies; licensed fan favorites; and programming from Prime Video add-on subscriptions such as Apple TV+, Max, Crunchyroll and MGM+. All customers, regardless of whether they have a Prime membership or not, can rent or buy titles via the Prime Video Store, and can enjoy even more content for free with ads.\u003cbr/\u003e\u003cbr/\u003eAre you interested in shaping the future of entertainment? Prime Video's technology teams are creating best-in-class digital video experience.\u003cbr/\u003e\u003cbr/\u003eAs a Prime Video technologist, you’ll have end-to-end ownership of the product, user experience, design, and technology required to deliver state-of-the-art experiences for our customers. You’ll get to work on projects that are fast-paced, challenging, and varied. You’ll also be able to experiment with new possibilities, take risks, and collaborate with remarkable people.\u003cbr/\u003e\u003cbr/\u003eWe’ll look for you to bring your diverse perspectives, ideas, and skill-sets to make Prime Video even better for our customers. With global opportunities for talented technologists, you can decide where a career Prime Video Tech takes you!\u003cbr/\u003e\u003cbr/\u003eAmazon Prime Video is looking for a motivated and experienced leader to oversee Piracy Prevention \u0026 Privacy Engineering functions reporting directly to the leader of the READI (Resilience, Availability \u0026 Demand Insights) team within Amazon Prime Video. The main objective of the role is to ensure that Prime Video applications are designed, operated, maintained and protected to maintain customer trust. The role requires a rare mix of broad, business and technical acumen wrapped in a persona that motivates business leaders, peers, partners, stakeholders and employees to continually act in a way that helps to secure the commercial success and customer experience for Prime Video. This role requires strong people-management skills, the ability to inspire and lead in a global context and relevant industry credentials.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate must be a strong leader who can prioritize well, communicate clearly and compellingly and who understands how to drive a high level of operational and strategic excellence within a team and collaborate with a variety of internal and external business partners. A proven history of leading security and privacy engineering teams, setting security and privacy strategy, developing risk assessment and mitigation programs. Additionally, strong Program Management experience and the ability to influence and manage deliverables across a highly diverse global organization is essential.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eDrive the creation, review, and implementation of technical security and privacy related requirements across multiple engineering teams.\u003cbr/\u003e\u003cbr/\u003eLead strategic piracy prevention and privacy planning to achieve business goals by prioritizing pragmatic, layered, defense initiatives and coordinating the evaluation, deployment, and management of current and future content security and privacy technologies.\u003cbr/\u003e\u003cbr/\u003eTranslate security and privacy controls to technical and non-technical partners.\u003cbr/\u003e\u003cbr/\u003eDesign, deploy, and automate benchmarking to piracy prevention and privacy controls in AWS.\u003cbr/\u003e\u003cbr/\u003eOperate effectively in fast-paced consumer facing product development environment.\u003cbr/\u003e\u003cbr/\u003eDrive security and privacy efforts to enable Prime Video to enter regulated markets, identify gaps for continuous improvement and action.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou will work with product and engineering teams from initiation to deployment and will be responsible for the security and privacy throughout the development lifecycle, interfacing with key stakeholders and driving programs to secure the customer experience. This includes finding new ways to streamline and scale security and privacy initiatives across Prime Video.","department_cost_center":null,"description_short":"Prime Video is a first-stop entertainment destination offering customers a vast collection of premium programming in one app available across thousands of devices. Prime members can customize their viewing","display_distance":null,"id":"577a27bd-dafd-4e93-8b29-3ab908bb92c9","id_icims":"3144524","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Technical Program Management","job_function_id":null,"job_path":"/en/jobs/3144524/senior-manager-piracy-privacy-prime-video","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA40\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"December 17, 2025","preferred_qualifications":"- 7+ years of work in internet-related program or technical product management in a software applications environment experience\u003cbr/\u003e- Knowledge of cloud computing services or deployment architecture\u003cbr/\u003e- Experience working in an internet-related program or technical product management in a software applications environment\u003cbr/\u003e- Experience communicating across technical and non-technical audiences, including executive level stakeholders or clients\u003cbr/\u003e- Experience with agile or other program management methodologies\u003cbr/\u003e- Master's degree or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $175,200/year in our lowest geographic market up to $302,900/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"entertainment.team-primevideo","source_system":"JobCreator","state":"WA","title":"Senior Manager, Piracy \u0026 Privacy , Prime Video ","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/3144524/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-primevideo","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 8+ years of technical product or program management experience\u003cbr/\u003e- Experience with feature delivery and tradeoffs of a product\u003cbr/\u003e- 6+ years of end to end product delivery experience\u003cbr/\u003e- Experience owning/driving roadmap strategy and definition\u003cbr/\u003e- Experience leading engineering discussions around technology decisions and strategy related to a product\u003cbr/\u003e- Bachelor's degree","business_category":"entertainment","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Prime Video is a first-stop entertainment destination offering customers a vast collection of premium programming in one app available across thousands of devices. Prime members can customize their viewing experience and find their favorite movies, series, documentaries, and live sports – including Amazon MGM Studios-produced series and movies; licensed fan favorites; and programming from Prime Video add-on subscriptions such as Apple TV+, Max, Crunchyroll and MGM+. All customers, regardless of whether they have a Prime membership or not, can rent or buy titles, and can enjoy even more content for free with ads. \u003cbr/\u003e\u003cbr/\u003eAre you interested in shaping the future of entertainment? Prime Video's technology teams are creating best-in-class digital video experience.\u003cbr/\u003e\u003cbr/\u003eAs a Prime Video technologist, you’ll have end-to-end ownership of the product, user experience, design, and technology required to deliver state-of-the-art experiences for our customers. You’ll get to work on projects that are fast-paced, challenging, and varied. You’ll also be able to experiment with new possibilities, take risks, and collaborate with remarkable people. \u003cbr/\u003e\u003cbr/\u003eWe’ll look for you to bring your diverse perspectives, ideas, and skill-sets to make Prime Video even better for our customers. With global opportunities for talented technologists, you can decide where a career Prime Video Tech takes you!\u003cbr/\u003e\u003cbr/\u003eWe are looking for an experienced Principal Product Manager to own the vision, strategy, and roadmap for the core algorithms that power our personalization and discovery experiences. You will operate at the intersection of machine learning, customer experience, and business strategy, leading fast-paced, high-impact projects and partnering with experts in data science, ML engineering, and customer experience to ship ML-powered features at scale.\u003cbr/\u003e\u003cbr/\u003eThis role is ideal for a PM with deep experience in data and models who anchors every decision in customer value and measurable business outcomes. You will formulate the product and science vision for your algorithm domain, translate ambiguous customer and business problems into clear algorithmic objectives and technical requirements, and guide sound science decisions throughout the ML lifecycle—from problem framing and data strategy through experimentation, deployment, and ongoing optimization. Throughout, you’ll ensure that complex algorithmic capabilities become intuitive, high-quality customer experiences.\u003cbr/\u003e\u003cbr/\u003e*Other Locations Available: Culver City, CA; New York, NY, San Francisco, CA; Sunnyvale, CA; Arlington, VA; Austin, TX\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Own the roadmap and strategy for personalization products, including recommendation systems and ML/science-based models.\u003cbr/\u003e* Collaborate with applied scientists and ML engineers to translate business problems into model requirements and convert them into clear algorithmic objectives, metrics, and guardrails.\u003cbr/\u003e* Define, track, and analyze key metrics to measure recommendation quality, customer outcomes, and business impact; analyze user behavior data to identify opportunities to improve personalization.\u003cbr/\u003e* Lead A/B testing strategy and experimentation to validate algorithmic improvements and inform roadmap decisions.\u003cbr/\u003e* Partner with stakeholder teams to understand business needs and translate them into technical specifications and prioritized work.\u003cbr/\u003e* Communicate complex technical and algorithmic concepts clearly to senior leadership and cross-functional partners.\u003cbr/\u003e* Balance trade-offs between model complexity, latency, scalability, and business value to ensure robust, production-ready solutions.\u003cbr/\u003e\u003cbr/\u003eBasic Qualifications\u003cbr/\u003e\u003cbr/\u003e* 8+ years of technical product management experience.\u003cbr/\u003e* 6+ years of end to end product delivery experience\u003cbr/\u003e* Bachelor's degree\u003cbr/\u003e* Experience with feature delivery and tradeoffs of a product\u003cbr/\u003e* Experience owning/driving roadmap strategy and definition\u003cbr/\u003e* Experience managing consumer-facing products where ML directly impacts user experience and engagement.\u003cbr/\u003e* Experience leading science and technology discussions and influencing strategy for ML- or science-driven products.\u003cbr/\u003e* Background in an applied science, engineering, or quantitative field, with a solid understanding of the model lifecycle, data readiness, and model evaluation frameworks.\u003cbr/\u003e\u003cbr/\u003ePreferred Qualifications\u003cbr/\u003e\u003cbr/\u003e* Experience in content discovery, e-commerce, search, or recommendation systems \u003cbr/\u003e* Knowledge of modern ML techniques (deep learning, NLP,  LLM, Agentic AIs) and their practical trade-offs.\u003cbr/\u003e* Strong leadership skills with ability to influence cross-functional teams \u003cbr/\u003e* Experience working with senior-level stakeholders \u003cbr/\u003e* Experience in project management methodologies, business analysis, or process improvement\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Prime Video is a first-stop entertainment destination offering customers a vast collection of premium programming in one app available across thousands of devices. Prime members can customize their viewing","display_distance":null,"id":"af0a41da-3928-402d-8214-546dad6c3595","id_icims":"2956622","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Product Management - Technical","job_function_id":null,"job_path":"/en/jobs/2956622/principal-product-manager-tech-recommender-systems-prime-video-personalization-discovery","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA40\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Virtual Location - Washington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Virtual Location - Washington\",\"coordinates\":\"47.03954,-122.89165\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Washington, USA\",\"location\":\"US, WA, Virtual Location - Washington\",\"region\":\"WA\",\"buildingCodeList\":[\"VIR\"]}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"April 16, 2025","preferred_qualifications":"- Experience in project management methodologies, business analysis, or process improvement\u003cbr/\u003e- Bachelor's degree in a quantitative/technical field such as computer science, engineering, statistics\u003cbr/\u003e- Experience as a strong leader who can prioritize well, communicate clearly and effectively influence across cross-functional teams\u003cbr/\u003e- Experience working with and influencing senior level stakeholders\u003cbr/\u003e- Experience developing consumer-impacting applications of machine learning or artificial intelligence\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The Colorado base pay for this position ranges from $179,900/year up to $243,400/year. The National base pay for this position ranges from $161,900/year in our lowest geographic market up to $279,900/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"entertainment.team-primevideo","source_system":"JobCreator","state":"WA","title":"Principal Product Manager - Tech, Recommender Systems, Prime Video Personalization \u0026 Discovery ","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/2956622/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-primevideo","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience defining data center system-level architecture, documenting performance and equipment requirements, creating and communicating conceptual designs, and creating and maintaining project documentation\u003cbr/\u003e- Experience directly related to the design or construction of data centers or critical infrastructure or large-scale mechanical and electrical plants\u003cbr/\u003e- Experience in construction management of large, complex projects involving large-scale mechanical, electrical and plumbing (MEP) plants\u003cbr/\u003e- Experience in Data Center Engineering Operations, with a deep understanding of electrical and mechanical data center infrastructure\u003cbr/\u003e- Bachelor’s degree in Mechanical Engineering, Electrical Engineering, Construction Management or an equivalent engineering science +5 Years of experience OR 10+ years of related construction management experience in lieu of a degree.","business_category":"aws","city":"Lubbock","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe Data Center Construction Manager will be responsible for construction project management and oversight of construction related activities as they relate to new builds or general capital projects which includes the ownership of the project scope, quality, schedule, and budget.\u003cbr/\u003e\u003cbr/\u003eSome of the typical daily tasks of the Construction Manager:\u003cbr/\u003eDirect interface with construction general contractors during the bidding, award, execution, and project closeout/punch list phases.\u003cbr/\u003eConduct negotiations with general contractors and evaluate bids/proposals with detail and accuracy.\u003cbr/\u003eCreate construction project scope and request for proposals.\u003cbr/\u003eFinancial analysis of construction.\u003cbr/\u003eConstruction project management for specific initiatives aimed at increasing the resiliency of our data centers.\u003cbr/\u003eConstructability reviews of electrical and mechanical designs associated with the construction of new data centers or optimization of existing data centers.\u003cbr/\u003eConstruction document management including submittal review, RFI’s, change orders, and invoicing.\u003cbr/\u003eConstruction project quality control.\u003cbr/\u003eRecord and report key construction metrics to team members and management.\u003cbr/\u003eDrive teams to perform troubleshooting and root-cause failure analysis associated with equipment failures.\u003cbr/\u003eBe a leader within the group as well as within internal and external teams that support the data center.\u003cbr/\u003eAble to read and interpret construction specifications and drawings for all disciplines.\u003cbr/\u003eDefine data center system-level architecture, specify/document performance and equipment requirements, create/communicate conceptual designs, and create/maintain project documentation.\u003cbr/\u003eExperience with large scale technical operations or large-scale compute farms.\u003cbr/\u003eKnowledge of building codes and regulations including Life Safety, BOCA, NFPA, NEC, and OSHA.\u003cbr/\u003eExperience in controls and commissioning of large scale projects.\u003cbr/\u003eExperience with power management and power monitoring systems.\u003cbr/\u003eCertifications such as Professional Engineer (PE), LEED, and/or Certified Construction Manager (CCM)\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003e**Why AWS**\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003e*Diverse Experiences*\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003e*Work/Life Balance*\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003e*Inclusive Team Culture*\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003e*Mentorship and Career Growth*\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003e#DCCD_AMER ","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"039771d4-084f-4c12-a1de-24f41a40d3d5","id_icims":"3175257","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3175257/construction-manager-aws","job_schedule_type":"full-time","location":"US, TX, Lubbock","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Lubbock\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Lubbock\",\"coordinates\":\"33.58451,-101.84462\",\"normalizedCountyName\":\"Lubbock\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Lubbock, Texas, USA\",\"location\":\"US, TX, Lubbock\",\"region\":\"TX\",\"buildingCodeList\":[\"LBB5\"],\"normalizedCityName\":\"Lubbock\"}"],"normalized_location":"Lubbock, Texas, USA","optional_search_labels":["aws.team-ais"],"posted_date":"February  5, 2026","preferred_qualifications":"- Experience in construction or project management\u003cbr/\u003e- Experience managing and negotiating contracts and vendor relationships\u003cbr/\u003e- Experience reading and interpreting construction specifications and drawings for all domains\u003cbr/\u003e- Experience carrying new design concepts through exploration, development, and into deployment or mass production\u003cbr/\u003e- Knowledge of building codes and regulations including Life Safety, BOCA, NFPA, NEC, or OSHA\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Lubbock - 111,300.00 - 186,100.00 USD annually","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"TX","title":"Construction Manager, AWS ","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3175257/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 8+ years of technical product or program management experience\u003cbr/\u003e- 2+ years of end to end product delivery experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Experience with feature delivery and tradeoffs of a product\u003cbr/\u003e- Experience owning/driving roadmap strategy and definition\u003cbr/\u003e- Experience leading engineering discussions around technology decisions and strategy related to a product\u003cbr/\u003e- Experience technical product management","business_category":"entertainment","city":"Culver City","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Prime Video is a first-stop entertainment destination offering customers a vast collection of premium programming in one app available across thousands of devices. Prime members can customize their viewing experience and find their favorite movies, series, documentaries, and live sports – including Amazon MGM Studios-produced series and movies; licensed fan favorites; and programming from Prime Video add-on subscriptions such as Apple TV+, Max, Crunchyroll and MGM+. All customers, regardless of whether they have a Prime membership or not, can rent or buy titles via the Prime Video Store, and can enjoy even more content for free with ads.\u003cbr/\u003e\u003cbr/\u003eAre you interested in shaping the future of entertainment? Prime Video's technology teams are creating best-in-class digital video experience.\u003cbr/\u003e\u003cbr/\u003eAs a Prime Video technologist, you’ll have end-to-end ownership of the product, user experience, design, and technology required to deliver state-of-the-art experiences for our customers. You’ll get to work on projects that are fast-paced, challenging, and varied. You’ll also be able to experiment with new possibilities, take risks, and collaborate with remarkable people.\u003cbr/\u003e\u003cbr/\u003eWe’ll look for you to bring your diverse perspectives, ideas, and skill-sets to make Prime Video even better for our customers. With global opportunities for talented technologists, you can decide where a career Prime Video Tech takes you!\u003cbr/\u003e\u003cbr/\u003eShape the future of cinematic storytelling: for creators, by creators. We’re seeking a founding Principal Product Manager – Tech to reimagine how premium live-action, VFX, and animation content is made with breakthrough multimodal AI. At Prime Video and Amazon MGM Studios, you’ll lead product strategy for a next-generation production toolkit that puts AI superpowers directly in the hands of content creators.\u003cbr/\u003e\u003cbr/\u003eYou’ll define product vision and E2E workflows for an AI-powered creative suite that blends art and science, uniting pre-production, virtual production, VFX, editorial, audio, localization, and real-time iteration in a unified workspace that amplifies, not replaces, human creativity. You'll focus on our Live Action/VFX customer experience, while partnering closely with our Animation leads to ensure shared platform capabilities, consistent interaction patterns, and cross-pipeline interoperability. You’ll partner directly with engineering, science, creative teams, and studio leaders to set new standards for AI-assisted production and establish the product culture from the ground up. You will:\u003cbr/\u003e\u003cbr/\u003e- Act as a founding PM-T with high ownership and transformational impact\u003cbr/\u003e- Think systems-first across complex, collaborative studio pipelines (from previs to final pixels) for both live-action/VFX and animation\u003cbr/\u003e- Define product patterns and scale platform capabilities for global, multi-user production use cases\u003cbr/\u003e- Operate from first principles; raise the bar for craft, simplicity, safety, and creator delight\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThis isn’t just another PM role, it’s your chance to define an entirely new category of creative tools. You’ll lead product strategy for an AI-powered platform that transforms how teams bring stories to life. More on what you’ll do:\u003cbr/\u003e- Own end-to-end product strategy for AI-assisted workflows from previs to production to post.\u003cbr/\u003e- Translate emerging model capabilities into shippable features that creators love.\u003cbr/\u003e- Define interoperability with DCCs and review/handoff primitives that fit real studio pipelines.\u003cbr/\u003e- Champion safety and IP provenance: content controls, auditability, model/version traceability, data governance, and IP-respecting defaults.\u003cbr/\u003e- Run creator-in-the-loop validation: recruit filmmakers/VFX supervisors/animation leads, design pilots, and turn qualitative insights and production data into roadmap decisions.\u003cbr/\u003e- Build PR/FAQs, tenets, and success metrics; drive specs through delivery/QA with Engineering and Science; iterate quickly toward measurable time-to-screen and cost improvements.\u003cbr/\u003e- Communicate at the right altitude, from detailed product reviews to executive narratives and live demos.\u003cbr/\u003e- Partner with Studio Ops, Production Technology, and Content leaders to align requirements, milestones, and slate needs; influence cross-team roadmaps.\u003cbr/\u003e- Raise the bar on product craft and team culture; mentor PMs and help recruit a diverse, creator-obsessed team.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eA typical day starts with a cross-functional sync (Eng, Science, UX, Studio Ops) to unblock releases and review shot-to-shot consistency. You hop into a pilot with a VFX supervisor to test video-to-video transforms and motion fidelity, then meet an animation lead to confirm asset-consistency services also support character shots. After lunch, you co-spec DCC handoffs for previs-to-on-set, and adjust roadmap priorities. You review creator feedback, clarify acceptance criteria with engineering, and prep an exec-level demo. You wrap by updating success metrics, and pilot plans for tomorrow’s build.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe’re a small, high-ownership “startup within Amazon,” formed by Prime Video and Amazon MGM Studios to invent a unified, AI-powered creative toolkit that accelerates how premium content gets made. Our mission is to empower creators with tools that are powerfully capable yet delightfully simple, preserving creative control while unlocking new velocity through AI. We operate from first principles, learn directly from working creators, and hold a high bar for craft, safety, and storytelling magic. If you’re motivated by invention and inspired by storytellers, this is your seat at the table.","department_cost_center":null,"description_short":"Prime Video is a first-stop entertainment destination offering customers a vast collection of premium programming in one app available across thousands of devices. Prime members can customize their viewing","display_distance":null,"id":"3505236b-3206-46a3-8fdc-a1575524cdb9","id_icims":"3167941","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Product Management - Technical","job_function_id":null,"job_path":"/en/jobs/3167941/principal-product-manager-tech-prime-video-amazon-mgm-studios","job_schedule_type":"full-time","location":"US, CA, Culver City","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Culver City\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Culver City\",\"coordinates\":\"34.02202,-118.39589\",\"normalizedCountyName\":\"Los Angeles\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Culver City, California, USA\",\"location\":\"US, CA, Culver City\",\"region\":\"CA\",\"buildingCodeList\":[\"LAX35\"],\"normalizedCityName\":\"Culver City\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sunnyvale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Sunnyvale\",\"coordinates\":\"37.37188,-122.03751\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sunnyvale, California, USA\",\"location\":\"US, CA, Sunnyvale\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC13\"],\"normalizedCityName\":\"Sunnyvale\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA40\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK24\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"Culver City, California, USA","optional_search_labels":[],"posted_date":"January 27, 2026","preferred_qualifications":"- Experience working directly with Engineers on product enhancements\u003cbr/\u003e- Experience in project management methodologies, business analysis, or process improvement\u003cbr/\u003e- Experience as a strong leader who can prioritize well, communicate clearly and effectively influence across cross-functional teams\u003cbr/\u003e- Experience developing, deploying and managing AI products at scale\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Culver City - 179,900.00 - 243,400.00 USD annually\u003cbr/\u003eUSA, CA, Sunnyvale - 206,900.00 - 279,900.00 USD annually\u003cbr/\u003eUSA, NY, New York - 197,900.00 - 267,800.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 179,900.00 - 243,400.00 USD annually","primary_search_label":"entertainment.team-primevideo","source_system":"JobCreator","state":"CA","title":"Principal Product Manager - Tech, Prime Video \u0026 Amazon MGM Studios","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3167941/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-primevideo","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team\u003cbr/\u003e- Bachelor's degree in computer science or equivalent","business_category":"no-business-category","city":"Gurugram","company_name":"ADCI - Haryana","country_code":"IND","description":"Transform the future of transportation logistics by developing cutting-edge technological solutions that optimize fleet management and operational efficiency. You'll be at the forefront of creating intelligent systems that support Amazon's global transportation network, leveraging advanced technologies to solve complex challenges and drive innovation in asset management.\u003cbr/\u003e\u003cbr/\u003eYour day will be a dynamic blend of strategic planning, cross-functional collaboration, and technological innovation. You'll work closely with engineering teams to design and implement solutions that track, manage, and optimize transportation assets across our global network. Expect to dive into data-driven decision-making, prototype new technologies, and develop products that directly impact the efficiency and safety of our transportation ecosystem.\u003cbr/\u003e\u003cbr/\u003eWe are a passionate group of technologists and problem-solvers dedicated to reinventing transportation logistics. Our team sits at the intersection of technology and operational excellence, working to create intelligent systems that support drivers, carriers, and associates. We embrace collaborative innovation and are committed to developing solutions that make a tangible difference in how transportation networks operate.\u003cbr/\u003e","department_cost_center":null,"description_short":"Transform the future of transportation logistics by developing cutting-edge technological solutions that optimize fleet management and operational efficiency. You'll be at the forefront of creating intelligent","display_distance":null,"id":"a6b99164-6539-4ece-ab6b-882f4e5fee20","id_icims":"3168416","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3168416/software-development-engineer-relay-fleet-tech-tts","job_schedule_type":"full-time","location":"IN, HR, Gurugram","locations":["{\"normalizedStateName\":\"Haryana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Gurugram\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, HR, Gurugram\",\"coordinates\":\"28.47716,77.06847\",\"normalizedCountyName\":\"Gurugram\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Gurugram, Haryana, IND\",\"location\":\"IN, HR, Gurugram\",\"region\":\"HR\",\"buildingCodeList\":[\"DEL24\"],\"normalizedCityName\":\"Gurugram\"}"],"normalized_location":"Gurugram, Haryana, IND","optional_search_labels":[],"posted_date":"January 28, 2026","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"HR","title":"Software Development Engineer, Relay Fleet Tech (TTS)","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3168416/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 4+ years of building scripts, tooling, and automation for large-scale computing environments experience\u003cbr/\u003e- Bachelor's degree in Systems Engineering, Computer Science, or related field or relevant work experience\u003cbr/\u003e- Experience with service-oriented architecture and web services\u003cbr/\u003e- Experience maintaining the resilience and reliability of services by troubleshooting deployment failures, creating infrastructure as code, creating resources (alarms, metrics, IAM role credentials), infrastructure provisioning and patching hosts","business_category":"aws","city":"Seattle","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eThe Data Center Availability team works with the hundreds of AWS data centers around the globe to deliver the highest quality and lowest cost physical security, availability, capacity, and scaling results for our customers. Our aim is to standardize operations globally by delivering tools, policy, processes and procedures to our internal teams. The Availability tech team is seeking a System Engineer to design, develop, and implement software tools that streamline operations by automating tedious manual processes.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs a System Engineer, you will:\u003cbr/\u003e• Design software tools using advanced automation methods such as Agentic AI\u003cbr/\u003e* Work with business stakeholders to understand the opportunities to automate the manual work and streamline the process\u003cbr/\u003e* Develop and maintain software pipelines using best practices for smooth production code release.\u003cbr/\u003e* Suggest and implement best practices for coding, design and operational excellence.\u003cbr/\u003e* Mentor engineers and develop them","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"a714409a-5870-49d5-9a8d-e41ef86e57d0","id_icims":"3182681","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"System Planning/Administration","job_function_id":null,"job_path":"/en/jobs/3182681/system-engineer-data-center-availability-team","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA84\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"February 17, 2026","preferred_qualifications":"- Experience designing and developing scripts to automate operational burdens and reviewing scripting changes to ensure they meet the standards for maintainability, scalability and security\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 104,500.00 - 160,000.00 USD annually","primary_search_label":"aws.team-system-development-engineer-primary","source_system":"JobCreator","state":"WA","title":"System Engineer, Data Center Availability Team","university_job":null,"updated_time":"23 minutes","url_next_step":"https://account.amazon.com/jobs/3182681/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-system-development-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in mechanical engineering, electrical engineering, or an equivalent engineering science\u003cbr/\u003e- Experience in industrial or commercial engineering or project management in Mission Critical facilities including but not limited to: data centers, power generation, or oil/gas facilities\u003cbr/\u003e- 5+ years of engineering team management experience with global scope\u003cbr/\u003e- 7+ years in mission critical HVAC design","business_category":"aws","city":"Seattle","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we're the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensures our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we're looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou'll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You'll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you'll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eWithin AIS and Data Center Engineering, the Mechanical Products and Services team is driving rapid innovation in mechanical cooling and controls systems used by AWS. Our designs are fundamentally changing the data center, providing operational and financial benefits that are critical to the success of the AWS business and its millions of customers. Our engineers solve challenging technology problems and take big bets on new concepts, enabling AWS services to continue to revolutionize the industry. \u003cbr/\u003e\u003cbr/\u003eThis role provides the opportunity to work closely with our team of innovative mechanical engineers developing and deploying the next generation of heat rejection infrastructure for our data centers.\u003cbr/\u003e\u003cbr/\u003eWe're seeking a Mechanical Engineering Manager to lead development and first of kind deployments of infrastructure solutions that enable large-scale deployment of air and liquid-cooled racks into AWS data centers. You'll drive system-level solution strategy and provide technical guidance to your team, working closely with AWS builders and third-party manufacturers to develop innovative data center infrastructure.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate brings experience leading engineering teams to deliver system-level mechanical designs, with deep understanding of mission-critical systems and/or air-cooled data center solutions. You know how to operate products to ensure quality and scalability. This role requires strong leadership and communication skills to develop engineers, inspire teams, and influence partners while creating innovative cooling solutions.\u003cbr/\u003e\u003cbr/\u003eThis position requires approximately 30% travel to AWS offices, data centers, suppliers, vendors, and product validation sites. While most travel is domestic, some international travel may be required.\u003cbr/\u003e\u003cbr/\u003eOpen to hiring this position in Seattle, Austin, or Northern Virginia. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Make high-judgment trade-offs between competing priorities, balancing short-term team needs with long-term business objectives, and determining essential features versus those that can be triaged\u003cbr/\u003e• Drive strategic direction for the team's technical roadmap and influence partner teams across overlapping business and technical domains\u003cbr/\u003e• Build and lead a high-performing engineering team by hiring talent that demonstrates Amazon Leadership Principles, managing performance and promotions, and creating clear growth plans for each team member\u003cbr/\u003e• Establish operational excellence through metrics development, process improvements, and efficiency gains in repeatable work while maintaining quality and meeting customer requirements\u003cbr/\u003e• Identify and mitigate risks, unblock engineers and partner teams, and navigate difficult situations including escalations to ensure project timeliness and success\u003cbr/\u003e• Collaborate directly with partner teams to implement and improve processes regionally and propagate best practices globally\u003cbr/\u003e• Provide clear technical strategy and communication across all organizational levels, managing both managers and individual contributors with varying technical experience\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eOur MPS team members work closely with key partners to innovate, create, manage, and support the complete lifecycle of our mechanical cooling infrastructure portfolio. This role will collaborate with internal and external partner teams to ensure products and solutions perform as intended. As a Mechanical Engineering Manager you will work closely with mechanical engineers to identify and mitigate design issues and build infrastructure strategies to execute at scale.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Mechanical Products \u0026 Services team provides engineering expertise and design and product lifecycle support for mechanical equipment in data centers globally. This includes support for new products and design features that address the mechanical cooling systems included in data center deployments. We own and support mechanical products throughout their lifecycle. Our scope also includes emergent global scale remediation strategic efforts that impact Data Center capacity or availability and introducing and driving business improvement initiatives increasing visibility and enabling data driven decision making. \u003cbr/\u003e\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we're the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"869ccea3-251d-42ef-b6f5-35e7df33b495","id_icims":"3186300","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Infrastructure Eng","job_function_id":null,"job_path":"/en/jobs/3186300/manager-mechanical-systems-engineering-dce-mechanical-products-services","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA84\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["aws.team-ais"],"posted_date":"February 20, 2026","preferred_qualifications":"- 11+ years of data center design, HVAC design, or related product development experience\u003cbr/\u003e- Experience developing strategies that influence leadership decisions at the organizational level\u003cbr/\u003e- Master's degree in mechanical engineering or equivalent\u003cbr/\u003e- 7+ years of engineering team management experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 150,200.00 - 203,300.00 USD annually","primary_search_label":"aws.team-no-matching-primary-label-listed","source_system":"JobCreator","state":"WA","title":"Manager, Mechanical Systems Engineering, DCE - Mechanical Products \u0026 Services","university_job":null,"updated_time":"24 minutes","url_next_step":"https://account.amazon.com/jobs/3186300/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-no-matching-primary-label-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 社会人経験（業界は問わず）\u003cbr/\u003e- 業務または工程の改善経験（規模の大小は問わず）\u003cbr/\u003e- エクセル初級レベル（四則演算/SUM関数ができる）\u003cbr/\u003e- ビジネスレベルの日本語力","business_category":"transportation-and-logistics","city":"Amagasaki","company_name":"Amazon Japan G.K. - A43","country_code":"JPN","description":"このポジションの勤務地は兵庫県尼崎市を予定しています。\u003cbr/\u003e\u003cbr/\u003e私たちのグローバルオペレーションネットワークは、日々何百万もの荷物と笑顔をアマゾンのお客様にお届けしています。私たちは、シフトアシスタントとして私たちのチームに加わってほしいと考え、意欲的で顧客重視の人材を探しています。この役割では他業種・職種も含めこれまでの経験、スキルを活かし、改善点を模索しながら、より便利でお客様に満足いただける高い品質のサービスを提供できるビジネスをつくる事、安全・快適・楽しい職場環境の構築を行う、将来の組織のリーダーを目指していただける事を期待しています。また、お客様の注文が適切な時間に適切な場所へ確実に配送されるよう、お客様の期待に応えることにおいても重要な役割を担います。\u003cbr/\u003e\u003cbr/\u003e私たちの業務の流れには3つの主要な要素があります。\u003cbr/\u003e商品が保管され注文に備える「ファーストマイル」、注文品をお客様のエリアまで輸送する「ミドルマイル」、そして商品をお客様の玄関先までお届けする「ラストマイル」です。各拠点で運営方法に若干の違いはありますが、一貫して変わらないものが一つあります、それは顧客を第一に考える私たちのビジョンと献身的な姿勢です。\u003cbr/\u003e\u003cbr/\u003e本ポジションはアマゾンの新しいエキサイティングな配送拠点で業務を行います。可能な限り最速でお客様のご自宅に商\u003cbr/\u003e品をお届けすることでお客様のカスタマーエクスペリエンスを向上します。私たちと一緒に歴史をつくりましょう！\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e■業務内容■\u003cbr/\u003e具体的にはマネージャーのサポートのもと、以下の業務に責任をもち遂行いただきます。\u003cbr/\u003e\u003cbr/\u003e① 安全・品質・作業効率の向上\u003cbr/\u003e安全安心な作業環境の維持・向上のため、日々の安全活動、品質チェックに加え、標準作業手順書の作成や多岐にわたる問題解決・改善活動を行います。\u003cbr/\u003e\u003cbr/\u003e② 日々のオペレーション対応\u003cbr/\u003e商品を入荷、在庫として管理し、注文があった商品を出荷するという一連の流れを各工程間で連携をとりながら、業務を円滑に進める事が求められます。お客様とお約束した期日までに商品を迅速かつ正確にお届けするため、時間ごとの計画に沿ってオペレーションを実施することに責任を持ちます。\u003cbr/\u003e\u003cbr/\u003e③ 新規プロジェクトの導入・セール時など、オペレーション拡大時の準備\u003cbr/\u003e新しいサービスやシステムの導入に備え、現場での手順変更・導入方法を検討し円滑な導入に向けて準備を行います。また、新規入職者でもAmazonの標準作業に則った手順がスムーズに身につくためのトレーニング構築やマニュアルを作成します。\u003cbr/\u003e\u003cbr/\u003e④ イレギュラーへの対応\u003cbr/\u003e作業で発生する様々な課題の原因を追求し問題解決を行います。また、再発防止策案の検討、実施を行います。\u003cbr/\u003e※上記業務はマネージャーやチームのサポートのもと実施していただきます\u003cbr/\u003e※配送ステーション内での配送を通じて、物流の仕組みやマネジメントについて学ぶことができます\u003cbr/\u003e※社内公募により、マネージャーへのキャリアアップや他部署への異動機会もあります\u003cbr/\u003e※勤務は交代制（夜勤あり）です\u003cbr/\u003e※1日の流れ：以下ページをご参照ください。\u003cbr/\u003e\u003ca href=\"https://www.amazon.co.jp/-/en/b/?_encoding=UTF8\u0026node=23814528051\u0026ref_=cct_cg_OpsDIEI_2a1\u0026pf_rd_p=de3aa3fb-5313-4cee-b143-872e2d7992ed\u0026pf_rd_r=MY139Z47QWCPMJKY1R8A\"\u003e先輩社員インタビュー\u003c/a\u003e\u003cbr/\u003e\u003cbr/\u003e■福利厚生■\u003cbr/\u003e下記ページをご確認ください。\u003cbr/\u003e\u003ca href=\"https://www.amazon.co.jp/b/ref=s9_bw_cg_OpsDIEI_1d1_w?node=23814520051\u0026pf_rd_m=AN1VRQENFRJN5\u0026pf_rd_s=merchandised-search-5\u0026pf_rd_r=HEGED97B4ZPKY8E5ER3Q\u0026pf_rd_t=101\u0026pf_rd_p=82cfcf3a-98ae-451f-b8d5-e66ea79051b0\u0026pf_rd_i=23814520051#Welfare\"\u003e福利厚生 | アマゾンジャパンキャリアサイト\u003c/a\u003e\u003cbr/\u003e\u003cbr/\u003e■教育制度■\u003cbr/\u003e入社後、約1週間はAmazonのリーダーとして必要な会社のカルチャーや、配送拠点の基本的な業務を一通り学ぶことができる座学の機会を提供します。各部署へ配属後は、トレーナーのもと、OJTで工程知識やツールの使用方法など基礎知識を学んでいきます。トレーニング資料も完備しており、相互に進捗を確認しながら独り立ちまでしっかりとサポートしますので、未経験者も安心してスタートができる環境です。\u003cbr/\u003e最先端の物流システムを学ぶことはもちろん、年齢・性別・国籍問わず様々な仲間と日々の業務を通して、次のステップとなるピープルマネージメントやビジネススキルを学ぶことができます。\u003cbr/\u003e\u003cbr/\u003e■キャリアパス■\u003cbr/\u003eシフトアシスタントからキャリアをスタートし、チームマネージャー、統括マネージャー、そして配送拠点の拠点長となった実績も多数あります。また、Amazonでは社内公募制度があり、国内外問わず他部署や異なる職種への異動にチャレンジし、社内で多様なキャリアを築くチャンスもあります。Amazonではご自身で学び成長することを推奨し、キャリア開発できるようサポートを行っています。\u003cbr/\u003e\u003ca href=\"https://www.amazon.co.jp/b/ref=s9_bw_cg_OpsDIEI_4a1_w?node=23814527051\u0026pf_rd_m=AN1VRQENFRJN5\u0026pf_rd_s=merchandised-search-7\u0026pf_rd_r=T6NT9EG8V53FY2RMZ971\u0026pf_rd_t=101\u0026pf_rd_p=b1961efa-850d-46e0-baa6-69e36a4b7d6f\u0026pf_rd_i=7840790051#manga1\"\u003eキャリアアップストーリー \u003c/a\u003e\u003cbr/\u003e\u003cbr/\u003e■会社のカルチャー■\u003cbr/\u003eAmazonでは全員がリーダーです。個人の裁量に任される部分が多く、社員の個々の可能性を最大限に伸ばす事を重視しています。様々なバックグラウンドを持った社員が前職で培った多様な経験やスキルを活かして職位や役割に関わらず誰もがチャレンジできる環境です。\u003cbr/\u003eまた年次有給休暇の取得を積極的に推進しており「働く」、「プライベート」も充実できる環境です。\u003cbr/\u003e失敗に寛容な文化：まずは試してみることにこだわります。好奇心を持って学びます。時にはリスクを取り、計画通りいかなかったとしても、よりよい成果に繋げられることが私たちの強みだと信じています。\u003cbr/\u003e\u003cbr/\u003e最後に、募集しているポジションや組織、お仕事の詳細については以下のリンクよりご確認いただけます。\u003cbr/\u003e\u003cbr/\u003e・シフトアシスタントについて：\u003ca href=\"https://www.amazon.co.jp/career/pasa\"\u003eプロセスアシスタント/シフトアシスタント特設サイト\u003c/a\u003e\u003cbr/\u003e・配送拠点で働くリーダーのインタビュー：\u003ca href=\"https://www.amazon.co.jp/b/ref=s9_bw_cg_OpsDIEI_6a1_w?node=23814521051\u0026pf_rd_m=AN1VRQENFRJN5\u0026pf_rd_s=merchandised-search-7\u0026pf_rd_r=H14NXGV78H1ZWZFS7BF3\u0026pf_rd_t=101\u0026pf_rd_p=b1961efa-850d-46e0-baa6-69e36a4b7d6f\u0026pf_rd_i=7840790051\"\u003eインタビュー\u003c/a\u003eをご覧ください。\u003cbr/\u003e・部門のご紹介：\u003ca href=\"https://www.amazon.co.jp/b/ref=s9_bw_cg_OpsDIEI_3a1_w?node=23667623051\u0026pf_rd_m=AN1VRQENFRJN5\u0026pf_rd_s=merchandised-search-7\u0026pf_rd_r=JB0QJFA0VHNHG9NTHZYK\u0026pf_rd_t=101\u0026pf_rd_p=b1961efa-850d-46e0-baa6-69e36a4b7d6f\u0026pf_rd_i=7840790051\"\u003eフルフィルメントセンター (FC)/デリバリーステーション（DS）\u003c/a\u003e\u003cbr/\u003e・職種：\u003ca href=\"https://www.amazon.co.jp/b?node=5609898051\"\u003eオペレーション\u003c/a\u003e\u003cbr/\u003e\u003cbr/\u003e以下のリンクより、本ポジションに関連する部署等の詳細をご確認ください。 *アマゾンは多様性とインクルージョンのある職場づくりを目指しています。アマゾンは雇用機会均等法を遵守しています。人種、出身国、性別、性的指向、障がい、年齢、その他の属性による差別なく、平等な採用・選考の機会を提供しています。障がいをお持ちの方は、以下をご覧ください。\u003cbr/\u003e\u003ca href=\"https://www.amazon.jobs/disability/jp\"\u003ehttps://www.amazon.jobs/disability/jp\u003c/a\u003e\u003cbr/\u003e\u003cbr/\u003e\u003ca href=\"https://www.amazon.co.jp/career/DEI\"\u003eオペレーション部門のDEIの取り組み（Japanese Only）\u003c/a\u003e ","department_cost_center":null,"description_short":"このポジションの勤務地は兵庫県尼崎市を予定しています。私たちのグローバルオペレーションネットワークは、日々何百万もの荷物と笑顔をアマゾンのお客様にお届けしています。私たちは、シフトアシスタントとして私たちのチームに加わってほしいと考え、意欲的で顧客重視の人材を探しています。この役割では他業種・職種も含めこれまでの経験、スキルを活かし、改善点を模索しながら、より便利でお客様に満足いただける高い品質のサービスを提供できるビジネスをつくる事、安全・快適・楽しい職場環境の構築を行う、将来の組織のリーダーを目指していただける事を期待しています。また、お客様の注文が適切な時間に適切な場所へ確実に配送される","display_distance":null,"id":"18b089ca-cad1-4cc0-8a20-099ff1b853e2","id_icims":"3176590","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3176590/","job_schedule_type":"full-time","location":"JP, Amagasaki","locations":["{\"normalizedStateName\":\"Hyogo\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Amagasaki\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, Amagasaki\",\"coordinates\":\"34.73377,135.40636\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Amagasaki-shi, Hyogo, JPN\",\"location\":\"JP, Amagasaki\",\"region\":\"\",\"buildingCodeList\":[\"SHY3\"],\"normalizedCityName\":\"Amagasaki-shi\"}"],"normalized_location":"Amagasaki-shi, Hyogo, JPN","optional_search_labels":[],"posted_date":"February  9, 2026","preferred_qualifications":"- ピープルマネジメント経験（アルバイトでも可）\u003cbr/\u003e- 様々な世代とのコミュニケーション経験\u003cbr/\u003e- エクセル中級レベル以上（VLOOKUP、ピボット、マクロ等）\u003cbr/\u003e- チームワークを重視し、チームプレーのための気配りができる方 ・向上心があり、今よりも成長したいという熱意がある方\u003cbr/\u003e- 臨機応変に行動し、理論的に物事の判断ができる方\u003cbr/\u003e- インクルーシブなカルチャーへの貢献や多様性に富んだグループで働くことに対して前向きであること\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-amzl","source_system":"JobCreator","state":null,"title":"シフトアシスタント","university_job":null,"updated_time":"27 minutes","url_next_step":"https://account.amazon.com/jobs/3176590/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amzl","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Work a flexible schedule including weekends, nights, and holidays\u003cbr/\u003e- 18+ months of computer/server hardware troubleshooting or related IT experience\u003cbr/\u003e- 18+ months of computer layer 1/2 networking experience (including troubleshooting and repair)","business_category":"aws","city":"New Albany","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring seamless data center operations that power millions of businesses and services worldwide. \u003cbr/\u003eData Center Technician position involves in-depth hardware and network diagnostics followed by physical repair as well as participating in an on-call rotation. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e-Performing server rack installations, hardware break-fix on various components, troubleshooting network issues, responding to operational incidents that impact service availability, and carrying out routine network, server hardware, and operating system repairs to contribute to the overall availability of AWS services \u003cbr/\u003e-Serving as a primary contact point for both internal and external stakeholders, including engineers, software developers, vendors, and contractors \u003cbr/\u003e-Performing on-call duties and participating in scheduled maintenance and change management activities \u003cbr/\u003e-Contributing to documentation and process improvement initiatives based on your analysis of operational issues \u003cbr/\u003e-Helping to interview, train and onboard new team members \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e-Lifting and moving material up to 40 pounds each \u003cbr/\u003e-Working in cramped and/or elevated locations \u003cbr/\u003e-Bending, lifting, stretching, and reaching \u003cbr/\u003e-Standing and walking for up to 8+ hours a day \u003cbr/\u003e-Ascending and descending ladders, stairs, and gangways safely and without limitation \u003cbr/\u003eWork in an industrial environment \u003cbr/\u003e-Work shifts longer than 8 hours to support 24/7 operations (covering both night and day shifts). \u003cbr/\u003e-This role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e-Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e-Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e-Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eOur Data Center Technician professionals, who have industry-leading technical abilities and demonstrate a breadth of knowledge while they: \u003cbr/\u003e\u003cbr/\u003e-Take ownership of technical issues brought by their customer base, engaging other teams when needed to drive resolution \u003cbr/\u003e-Show a strong aptitude for troubleshooting and problem solving \u003cbr/\u003e-Solve problems at their root and step back to understand the broader context \u003cbr/\u003e-Maintain service level agreements through the implementation of proactive issue detection and reporting \u003cbr/\u003e-Are biased to act in the absence of direction or support \u003cbr/\u003e-Improve effectiveness through process innovation \u003cbr/\u003e\u003cbr/\u003e You will be required to work shift work that will include days/nights/weekends/holidays. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring","display_distance":null,"id":"6d3dc81a-27aa-4a4d-8fdd-37018ed04fa9","id_icims":"3189546","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3189546/data-center-technician-dcc-communities","job_schedule_type":"full-time","location":"US, OH, New Albany","locations":["{\"normalizedStateName\":\"Ohio\",\"normalizedCountryCode\":\"USA\",\"city\":\"New Albany\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OH, New Albany\",\"coordinates\":\"40.08131,-82.80885\",\"normalizedCountyName\":\"Franklin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New Albany, Ohio, USA\",\"location\":\"US, OH, New Albany\",\"region\":\"OH\",\"buildingCodeList\":[\"CMH139\",\"OSU70\",\"LCK065\",\"CMH142\",\"LCK50\",\"CMH141\",\"CMH79\",\"CMH50\",\"CMH65\",\"CMH137\",\"CMH7\",\"CMH83\",\"LCK062\",\"CMH84\",\"CMH130\",\"CMH136\",\"CMH143\",\"CMH140\",\"CMH146\",\"CMH124\",\"CMH801\",\"CMH149\",\"CMH150\",\"CMH73\",\"CMH148\",\"CMH147\",\"OSU63\",\"OSU60\",\"CMH70\",\"CMH131\",\"CMH122\",\"CMH59\",\"CMH145\",\"CMH100\",\"CMH76\",\"CMH144\",\"CMH85\",\"CMH135\",\"LCK53\",\"CMH116\",\"CMH138\",\"CMH82\"],\"normalizedCityName\":\"New Albany\"}","{\"normalizedStateName\":\"Ohio\",\"normalizedCountryCode\":\"USA\",\"city\":\"Jeffersonville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OH, Jeffersonville\",\"coordinates\":\"39.65383,-83.56342\",\"normalizedCountyName\":\"Fayette\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Jeffersonville, Ohio, USA\",\"location\":\"US, OH, Jeffersonville\",\"region\":\"OH\",\"buildingCodeList\":[\"CMH223\",\"CMH206\",\"CMH224\",\"CMH210\",\"CMH205\",\"CMH207\",\"CMH218\",\"CMH226\",\"CMH220\",\"CMH217\",\"CMH227\",\"CMH221\",\"CMH208\",\"CMH214\",\"CMH211\",\"CMH215\",\"CMH216\",\"CMH212\",\"CMH209\",\"CMH213\",\"CMH219\",\"CMH222\",\"CMH225\"],\"normalizedCityName\":\"Jeffersonville\"}","{\"normalizedStateName\":\"Ohio\",\"normalizedCountryCode\":\"USA\",\"city\":\"Hilliard\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OH, Hilliard\",\"coordinates\":\"40.0304,-83.15119\",\"normalizedCountyName\":\"Franklin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Hilliard, Ohio, USA\",\"location\":\"US, OH, Hilliard\",\"region\":\"OH\",\"buildingCodeList\":[\"CMH64\",\"OSU68\",\"CMH81\",\"LCK52\",\"CMH94\",\"CMH58\",\"CMH61\",\"CMH93\",\"CMH52\",\"CMH55\",\"CMH602\",\"LCKC\",\"CMH72\",\"CMH117\",\"OSU62\",\"CMH118\",\"LCK55\",\"CMH91\",\"CMH75\",\"CMH92\",\"OSU72\",\"LCK067\",\"OSU65\",\"CMH803\",\"LCK064\",\"CMH119\"],\"normalizedCityName\":\"Hilliard\"}","{\"normalizedStateName\":\"Ohio\",\"normalizedCountryCode\":\"USA\",\"city\":\"Plain City\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OH, Plain City\",\"coordinates\":\"40.10797,-83.26786\",\"normalizedCountyName\":\"Madison\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Plain City, Ohio, USA\",\"location\":\"US, OH, Plain City\",\"region\":\"OH\",\"buildingCodeList\":[\"CMH87\",\"CMH133\",\"CMH601\",\"CMH88\",\"CMH109\",\"CMH80\",\"LCK66\",\"LCK063\",\"CMH89\",\"CMH71\"],\"normalizedCityName\":\"Plain City\"}","{\"normalizedStateName\":\"Ohio\",\"normalizedCountryCode\":\"USA\",\"city\":\"Dublin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OH, Dublin\",\"coordinates\":\"40.10497,-83.13308\",\"normalizedCountyName\":\"Franklin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Dublin, Ohio, USA\",\"location\":\"US, OH, Dublin\",\"region\":\"OH\",\"buildingCodeList\":[\"CMH54\",\"CMH99\",\"LCK54\",\"OSU61\",\"CMH86\",\"OSU71\",\"ONM194\",\"CMH51\",\"CMH57\",\"CMH802\",\"CMH60\",\"CMH63\",\"DCM8\",\"OSU64\",\"OSU67\",\"WFM214\",\"LCK51\",\"CMH77\",\"CMH74\"],\"normalizedCityName\":\"Dublin\"}"],"normalized_location":"New Albany, Ohio, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"February 25, 2026","preferred_qualifications":"- Experience in a data center or other critical environment\u003cbr/\u003e- Bachelor's degree or equivalent professional or military experience in an IT-related field (e.g. computer science, network engineering, etc.)\u003cbr/\u003e- Industry standard certifications (CompTIA, CCENT, Network+)\u003cbr/\u003e- Understanding of Linux or similar operating systems\u003cbr/\u003e- Behavioral interviewing and hiring experience\u003cbr/\u003e- Experience training and onboarding of new team members\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, OH, Dublin - 30.00 - 54.00 USD hourly\u003cbr/\u003eUSA, OH, Hilliard - 30.00 - 54.00 USD hourly\u003cbr/\u003eUSA, OH, Jeffersonville - 30.00 - 54.00 USD hourly\u003cbr/\u003eUSA, OH, New Albany - 30.00 - 54.00 USD hourly\u003cbr/\u003eUSA, OH, Plain City - 30.00 - 54.00 USD hourly","primary_search_label":"aws.team-it-services","source_system":"JobCreator","state":"OH","title":"Data Center Technician , DCC Communities ","university_job":null,"updated_time":"35 minutes","url_next_step":"https://account.amazon.com/jobs/3189546/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-it-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}