{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 4+ years of Information Technology (IT) experience, or Bachelor's degree in computer science, engineering, mathematics or equivalent\u003cbr/\u003e- 2+ years experience in participating in on-call rotations, and providing after-hours support in an environment that operates 24/7, Networking and Computer Hardware.\u003cbr/\u003e- 2+ years of experience managing people in a technical environment.","business_category":"aws","city":"New Albany","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is a fast paced technology company and a leader in the world of data centers. The position will help ensure overall availability and reliability to meet or exceed defined service levels of data center operations. We are currently expanding our infrastructure management team and are looking for technology managers with experience in people management, strong technical understanding and the drive and vision to take AWS Data Center Operations to the next level. \u003cbr/\u003e\u003cbr/\u003eThe successful candidate will have experience creating/devising strategies, mentoring people in all levels, sponsoring projects and proposing technical solutions. This position involves leading teams in hardware and network diagnostics followed by physical repair and includes participation in an on-call rotation. All candidates should be willing to work both independently and managing their teams effectively. Work prioritization, organizational skills, effective communication, and the ability to react quickly are critical to being successful. In addition to strong knowledge in Data Centers, hardware and network repair, candidates will create documentation, innovate solutions, participate in site-level project work, and fix complex problems within the Data Center Space. This team works in an environment that operates 24/7.\u003cbr/\u003e\u003cbr/\u003eEffective May 15, 2017, logical access to the AWS GovCloud region will be restricted to Amazon employees who are U.S. Citizens. (GovCloud may NOT be accessed from outside of the United States) \u003cbr/\u003e\u003cbr/\u003eThis role will maintain a schedule of Monday through Friday, Day Shift (~8 AM to 5 PM) OR Night Shift (~8PM-5AM). This role will also periodically have on-call manager responsibilities that will exist outside of standard working hours.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe successful candidate will be operationally responsible for a Data Center. Some high-level responsibilities include:\u003cbr/\u003e- Prioritize and assign trouble tickets to data center technicians and operators\u003cbr/\u003e- Manage the performance of a diverse team(s) of data center operation professionals with varying skills across different locations\u003cbr/\u003e- Developing Career Paths for the employees and to make updates in our internal tools.\u003cbr/\u003e- Recruit and train data technicians to ensure appropriate staffing levels\u003cbr/\u003e- Ensure effective and efficient management of day to day data center operations including queue management, 7/24 shift arrangement and hardware logistics\u003cbr/\u003e- Fast learn or act as the subject matter expert across all aspects in data center operations\u003cbr/\u003e- Ensure all operational KPIs and metrics are being measured and met\u003cbr/\u003e- Inspire and guide improvement in team process, technology innovation and automation\u003cbr/\u003e- Manage Large Scale Events (outages) and act as the call leader\u003cbr/\u003e- Manage and improve the work-flows and through-put for data centers operations\u003cbr/\u003e- Recommend, document, and oversee policies and procedures to meet industry best practices and to meet required SLAs \u003cbr/\u003e - Maintain the on-call schedule coordinating absence and vacations\u003cbr/\u003e- Be passionate about the quality and quantity of services being provided, and continuously strive to improve our Customer Experience\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003e\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. \u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"40714bb8-f144-45c4-87b4-86c70d51769e","id_icims":"3165574","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3165574/data-center-manager-night-shift","job_schedule_type":"full-time","location":"US, OH, New Albany","locations":["{\"normalizedStateName\":\"Ohio\",\"normalizedCountryCode\":\"USA\",\"city\":\"New Albany\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OH, New Albany\",\"coordinates\":\"40.08131,-82.80885\",\"normalizedCountyName\":\"Franklin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New Albany, Ohio, USA\",\"location\":\"US, OH, New Albany\",\"region\":\"OH\",\"buildingCodeList\":[\"CMH100\"],\"normalizedCityName\":\"New Albany\"}"],"normalized_location":"New Albany, Ohio, USA","optional_search_labels":[],"posted_date":"January 23, 2026","preferred_qualifications":"- Experience in technical writing in a relevant field\u003cbr/\u003e- Experience with system management tools and client/server environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, OH, New Albany - 78,400.00 - 137,300.00 USD annually","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"OH","title":"Data Center Manager, Night Shift","university_job":null,"updated_time":"1 minute","url_next_step":"https://account.amazon.com/jobs/3165574/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- PhD and 8+ years of CS, CE, ML or related field experience\u003cbr/\u003e- 8+ years of building models for business application experience\u003cbr/\u003e- Experience in patents or publications at top-tier peer-reviewed conferences or journals in NLP and Applied Machine Learning.\u003cbr/\u003e- Experience programming in Java, C++, Python or related language\u003cbr/\u003e- Experience in any of the following areas: algorithms and data structures, parsing, numerical optimization, data mining, parallel and distributed computing, high-performance computing","business_category":"aws","city":"Santa Clara","company_name":"Amazon Development Center U.S., Inc.","country_code":"USA","description":"We are looking for passionate, talented, and inventive Principal Applied Scientist with a strong machine learning background to help build industry-leading Conversational AI Systems. Our mission is to provide a delightful experience to Amazon’s customers by pushing the envelope in Natural Language Understanding (NLU), Dialog Systems including Generative AI with Large Language Models (LLMs) and Applied Machine Learning (ML).\u003cbr/\u003e\u003cbr/\u003eAs part of our team, you will work alongside internationally recognized experts to develop novel algorithms and modeling techniques to advance the state-of-the-art in human language technology. Your work will directly impact millions of our customers in the form of products and services that make use language technology. You will gain hands on experience with Amazon’s heterogeneous text, structured data sources, and large-scale computing resources to accelerate advances in language understanding.\u003cbr/\u003e\u003cbr/\u003eWe are hiring in all areas of human language technology: NLU, Dialog Management, Conversational AI, LLMs and Generative AI.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThe team uses generative AI and foundation models to reimagine the experience of all customers on AWS. We explore new technologies and find creative solutions. Curiosity and an explorative mindset can find a place here to impact the life of engineers around the world.\u003cbr/\u003e\u003cbr/\u003eIf you are excited about this space and want to enlighten your peers with new capabilities, this is the team for you.\u003cbr/\u003e","department_cost_center":null,"description_short":"We are looking for passionate, talented, and inventive Principal Applied Scientist with a strong machine learning background to help build industry-leading Conversational AI Systems. Our mission is to","display_distance":null,"id":"fa22fa45-4c66-45c4-b145-a3be9fb8a410","id_icims":"3039349","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3039349/principal-applied-scientist-console-science","job_schedule_type":"full-time","location":"US, CA, Santa Clara","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Santa Clara\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Santa Clara\",\"coordinates\":\"37.3558,-121.95512\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Santa Clara, California, USA\",\"location\":\"US, CA, Santa Clara\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC25\"],\"normalizedCityName\":\"Santa Clara\"}"],"normalized_location":"Santa Clara, California, USA","optional_search_labels":["principal-scientist-recruiting"],"posted_date":"July 21, 2025","preferred_qualifications":"- PhD and 8+ years of CS, CE, ML or related field experience\u003cbr/\u003e- 8+ years of building models for business application experience\u003cbr/\u003e- Experience in patents or publications at top-tier peer-reviewed conferences or journals in NLP and Applied Machine Learning.\u003cbr/\u003e- Experience programming in Java, C++, Python or related language\u003cbr/\u003e- Experience in any of the following areas: algorithms and data structures, parsing, numerical optimization, data mining, parallel and distributed computing, high-performance computing\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Santa Clara - 228,700.00 - 309,400.00 USD annually","primary_search_label":"aws.team-machine-learning-primary","source_system":"JobCreator","state":"CA","title":"Principal Applied Scientist, Console Science","university_job":null,"updated_time":"1 minute","url_next_step":"https://account.amazon.com/jobs/3039349/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-machine-learning-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of finance experience\u003cbr/\u003e- 2+ years of applying key financial performance indicators (KPIs) to analyses experience\u003cbr/\u003e- Bachelor's degree in Finance, Accounting, Business, Economics or a highly analytical field (e.g., Engineering, Math, and Computer Science)\u003cbr/\u003e- Knowledge of standard software including Excel, Access, Oracle, Essbase, SQL and VBA skills\u003cbr/\u003e- Experience using data to influence business decisions\u003cbr/\u003e- Experience in corporate finance including budgeting/planning, forecasting and reporting","business_category":"finance","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon seeks a highly motivated finance professional with an AI-first mindset to support the Global Engineering Services (GES) Finance team. GES is a leader in program management, design, engineering, construction, and deployment of Amazon Operations assets and sustainability commitments. This is a great opportunity to support GES in a role with high impact and visibility to business-critical processes that will require interactions with Director and above leadership across Operations and Finance. Everyone on the team needs to be entrepreneurial, wear many hats, and work in a highly collaborative environment that’s more start-up than big company. Excellent verbal and written communication skills are critical in this role. The successful candidate has demonstrated the following abilities: they are a self-starter who proactively pursues AI-driven solutions, have a strong sense of ownership, collaborate with and influence business partners, support thoughtful decision-making in a rapidly-evolving and ambiguous environment, and think long-term.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tDevelop partnerships across Operations and use data to influence leadership decision-making\u003cbr/\u003e•\tDrive financing modeling and analysis for new initiatives - Lead long- and short-term financial planning, including financial reviews with senior business partners (including Director and above)\u003cbr/\u003e•\tManage competing priorities to complete both ad-hoc and strategic projects\u003cbr/\u003e•\tSeek opportunities to resolve defects and reduce cost\u003cbr/\u003e•\tImprove, scale, and simplify finance tools across teams and organizations\u003cbr/\u003e•\tCommunicate financial insights (both written and verbal) in a clear and concise manner. Adapt communication based on intended audience to clearly articulate complex financial considerations.\u003cbr/\u003e•\tPromote a positive and collaborative culture.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon operates an industry leading logistics network across the world. Global Engineering Services (GES) supports the greater Global Operations organization with end-to-end project lifecycle planning, design, execution, and integration. In support of GES, Finance is looking for individuals who enjoy tackling challenges and have a desire for professional growth opportunities. Experience in this team opens up several career opportunities across Amazon and within the broader Finance organization. Individuals in this role have advancement opportunities to support different businesses and multi-functional teams, to lead new programs and initiatives, and to manage larger teams within the company.","department_cost_center":null,"description_short":"Amazon seeks a highly motivated finance professional with an AI-first mindset to support the Global Engineering Services (GES) Finance team. GES is a leader in program management, design, engineering,","display_distance":null,"id":"2e220f5c-0c97-4f7b-aa82-c7bad96d26f9","id_icims":"3180046","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/Planning","job_function_id":null,"job_path":"/en/jobs/3180046/financial-analyst-ges-finance","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA104\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"February 12, 2026","preferred_qualifications":"- 2+ years of participating in continuous improvement projects in your team to scale and improve controllership with measurable results experience\u003cbr/\u003e- Experience in TM1, Data Warehouse and SQL\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Bellevue - 80,200.00 - 99,300.00 USD annually","primary_search_label":"finance.team-consumer","source_system":"JobCreator","state":"WA","title":"Financial Analyst, GES Finance","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3180046/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-consumer","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or above\u003cbr/\u003e- Experience in product or program management, product marketing, business development or technology in fast moving consumer goods, preferably food and beverage products\u003cbr/\u003e- Experience that includes strong analytical skills, attention to detail, and effective communication abilities, or experience using business tools: SQL Server/MySQL, Microsoft Office including PowerPoint, Excel, and Word\u003cbr/\u003e- Experience in written and verbal communication with the ability to present complex technical information, using data and metrics, in a clear and concise manner to executives and non-technical leaders\u003cbr/\u003e- Experience building process flows, SOPs, and RACIs for internal and external stakeholders.","business_category":"worldwide-grocery-stores","city":"Seattle","company_name":"Amazon.com LLC","country_code":"USA","description":"The Worldwide Grocery Private Brands team is looking for an entrepreneurial, experienced, and analytical Data Quality Systems Analyst. You will join a dynamic, fast-paced, fun and collaborative work environment where you will help build and scale our business within both physical stores and online channels.\u003cbr/\u003e\u003cbr/\u003eThis role ensures that Product Quality team is using meaningful data metrics to drive business decisions, build and optimize quality tools and dashboards (partnering with tech teams as needed), and manages our data quality system to ensure we have a robust, centralized, automated (where possible) mechanisms to organize, maintain, and control for change management for training, tools, documents, processes, and more. You will be expected to support the development and optimization of tools and mechanisms for the quality program, support building proposals on why proposed solutions are the best option for the team or business, and manage the roll-out and coordination of the program. You will work within the Product Quality team and across different stakeholders including Product Development, Product Management, Food Safety, Shared Services (process \u0026 tech teams), Marketing, Package Engineering, and Supply Chain to ensure the program ensures a robust end-to-end Data Quality Systems Program.  \u003cbr/\u003e\u003cbr/\u003eThis position will not only focus on ensuring the effectiveness of our Data Quality Systems Program but also support analysis of large data sets, building mechanisms and tools to continuously improve our data analysis and defect identification of customer feedback across multiple feedback mechanisms. The role will use and/or optimize quality dashboards that monitor launched product performance across WW Grocery products, manage trend analysis, monitor and correct defects in our Catalog, and manage escalation mechanisms with our Product Quality teams as applicable. The position will require resourcefulness and creativity to learn new tools and systems to identify opportunities to drive automation and simplification of data management. \u003cbr/\u003e\u003cbr/\u003eThe right person for this role must be customer obsessed and enjoy using data and mechanisms to drive improvements that maintain customer trust with our brands and products. The successful candidate will be self-motivated, enjoys working with data and identifying trends from large data sets, able to develop sound recommendations for product/process improvements, able to earn trust and influence teams, solution oriented, have solid problem solving skills, strong attention to detail, strong vision for quality standards and programs, strong interpersonal skills and ability to communicate clearly (verbal and written) with technical and non-technical teams alike, and be motivated by a fast-paced dynamic environment.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tSupport development and execution of Quality Data Systems Program across regions and teams. \u003cbr/\u003e•\tWork across multiple stakeholders to align priorities and gain support for proposed tools, corrective actions, or programs to enable the Quality Data Systems Program.  \u003cbr/\u003e•\tSupport development or optimization of data analysis tools to assess customer feedback, across multiple channels and data sources, to effectively identify defects, enable appropriate prioritization of corrective actions, drive effective metrics, and enable business decisions. \u003cbr/\u003e•\tIdentify, communicate, or escalate product quality risk areas using data and lead or support corrective actions.\u003cbr/\u003e•\tNavigate roadblocks and work with stakeholders and suppliers to drive solutions without compromising on product safety, compliance, or customer satisfaction. \u003cbr/\u003e•\tSupport quality KPI reporting to track and report quality performance metrics.\u003cbr/\u003e•\tBuild process flows, SOPs, and define and aligns RACI for quality activities across cross-functional teams.\u003cbr/\u003e•\tIdentify opportunities to improve or optimize our operations, mitigate repeat issues, develop guardrails to simplify decision making, utilize automation, and drive process efficiencies, including cost savings opportunities.","department_cost_center":null,"description_short":"The Worldwide Grocery Private Brands team is looking for an entrepreneurial, experienced, and analytical Data Quality Systems Analyst. You will join a dynamic, fast-paced, fun and collaborative work environment","display_distance":null,"id":"e0591599-59c0-468d-a28b-c6c4949dde64","id_icims":"3179004","is_intern":null,"is_manager":null,"job_category":"Investigation \u0026 Loss Prevention","job_family":"Risk Family","job_function_id":null,"job_path":"/en/jobs/3179004/quality-data-systems-analyst-worldwide-grocery-owned-brands-product-quality","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA54\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February 11, 2026","preferred_qualifications":"- Experience building and cultivating positive relationships with internal and external stakeholders\u003cbr/\u003e- Experience building measures and metrics, and developing reporting solutions\u003cbr/\u003e- Experience managing multiple projects, prioritizing, planning, and managing time\u003cbr/\u003e- Can work proactively and independently, meet deadlines, and deliver on projects and tasks\u003cbr/\u003e- Experience developing, deploying and managing AI products at scale\u003cbr/\u003e- Experience building process flows, SOPs, and RACIs for internal and external stakeholders.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 80,200.00 - 97,400.00 USD annually","primary_search_label":"worldwide-grocery-stores.no-team-listed","source_system":"JobCreator","state":"WA","title":"Quality Data Systems Analyst, Worldwide Grocery Owned Brands, Product Quality","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3179004/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience managing competing priorities and using metrics to drive business decisions\u003cbr/\u003e- 7+ years of experience in technology industry with focus on startups, ideally in combination with technical roles\u003cbr/\u003e- Strong understanding of cloud computing architectures, services, and best practices and familiarity with generative AI technologies\u003cbr/\u003e- Understanding of technical patterns and architectures for workloads relevant to startups\u003cbr/\u003e- Bachelor's degree in technical or technical management field or equivalent experience","business_category":"aws","city":"San Francisco","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Would you like to shape the future of cloud computing by identifying and working with the most promising early-stage startups and venture capital firms in [region]? Do you have the technical depth, business acumen, and investment insight to help establish AWS as the foundation for the next generation of technology companies?  \u003cbr/\u003e\u003cbr/\u003eTrusted by more startups around the world, AWS makes the power of cloud computing accessible to all. We give founders everywhere access to the same technology that powers the world's largest companies. With nearly 20 years of experience, gained from supporting hundreds of thousands of startups, the AWS Startups team helps founders prove that their world-changing ideas are possible, at any stage of growth, and any level of funding. This is why more startups, and over 80% of unicorns, choose to launch on AWS.  \u003cbr/\u003e\u003cbr/\u003eAs a Senior Startup Investor Manager within AWS, you will work with venture capital firms and angel investors to accelerate portfolio company success. You'll work with key investors to help unlock the potential of their portfolio companies on AWS, enabling faster innovation and scaling. Your role focuses on supporting meaningful initiatives between the investment community and AWS, helping startups leverage cloud to achieve breakthrough growth. You'll combine technical understanding of cloud and emerging technologies, such as generative AI, with business acumen to identify opportunities and ensure startups have access to the tools, expertise, and support needed to build world-changing products on AWS infrastructure. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Support and execute initiatives with venture and angel firms, contributing to investor-focused programs that accelerate portfolio company success   \u003cbr/\u003e\u003cbr/\u003e• Implement solutions that address specific startup and investor needs   \u003cbr/\u003e\u003cbr/\u003e• Collaborate on cross-functional initiatives involving AWS Startups, Sales, Marketing, and Product teams   \u003cbr/\u003e\u003cbr/\u003e• Monitor program effectiveness and provide feedback based on results   \u003cbr/\u003e\u003cbr/\u003e• Collect early-stage market signals from investors and founders to support AWS innovation and help meet the evolving needs of tomorrow's breakthrough companies \u003cbr/\u003e\u003cbr/\u003e• Evaluate technical and business potential of startups through understanding of their architecture, technology stack, and market opportunity   \u003cbr/\u003e\u003cbr/\u003e• Serve as technical advisor to portfolio companies, helping them optimize their cloud architecture and go-to-market approach \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e \u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e \u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e \u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e \u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e","department_cost_center":null,"description_short":"Would you like to shape the future of cloud computing by identifying and working with the most promising early-stage startups and venture capital firms in [region]? Do you have the technical depth, business","display_distance":null,"id":"4eaabdff-22cb-476d-8824-0ee96cc91dbc","id_icims":"3110003","is_intern":null,"is_manager":null,"job_category":"Business \u0026 Merchant Development","job_family":"Business/Merchant Development","job_function_id":null,"job_path":"/en/jobs/3110003/senior-startup-investor-manager-vc-or-angel-aws-worldwide-startups","job_schedule_type":"full-time","location":"US, CA, San Francisco","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"East Palo Alto\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, East Palo Alto\",\"coordinates\":\"37.4732,-122.13957\",\"normalizedCountyName\":\"San Mateo\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"East Palo Alto, California, USA\",\"location\":\"US, CA, East Palo Alto\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC18\"],\"normalizedCityName\":\"East Palo Alto\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Francisco\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Francisco\",\"coordinates\":\"37.77702,-122.41956\",\"normalizedCountyName\":\"San Francisco\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Francisco, California, USA\",\"location\":\"US, CA, San Francisco\",\"region\":\"CA\",\"buildingCodeList\":[\"SFO28\"],\"normalizedCityName\":\"San Francisco\"}"],"normalized_location":"San Francisco, California, USA","optional_search_labels":[],"posted_date":"October 16, 2025","preferred_qualifications":"- Advanced degree, or MBA\u003cbr/\u003e- Experience with analytical tools and ability to dive deep into metrics and reporting\u003cbr/\u003e- Experience at startups or venture capital/angel firms\u003cbr/\u003e- Experience building and scaling cloud-native applications from the ground up\u003cbr/\u003e- Experience with commercial aspects of fast-growing technical businesses\u003cbr/\u003e- Ability to understand and evaluate emerging technologies\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $133,200/year in our lowest geographic market up to $220,200/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-business-development-primary","source_system":"JobCreator","state":"CA","title":"Senior Startup Investor Manager, VC (or Angel) , AWS Worldwide Startups","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/3110003/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-business-development-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of Microsoft Office products and applications experience\u003cbr/\u003e- 3+ years of mission critical facilities (example: hospital, military facility, public safety facility, etc.) experience including industrial electrical and mechanical systems\u003cbr/\u003e- Experience with reading and writing procedures, technical documents, and engineering drawings","business_category":"aws","city":"Jeffersonville","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic Data Center Engineering Operations Team and become a critical architect of the infrastructure that powers global cloud computing. You'll play a pivotal role in maintaining the heartbeat of Amazon Web Services' physical infrastructure, ensuring seamless operations that support millions of customers worldwide. \u003cbr/\u003e\u003cbr/\u003eThe Data Center Chief Engineer (CE) is responsible for ensuring that all electrical, mechanical, and fire/life safety equipment within the data center is operating at peak efficiency. This involves planned preventative maintenance of equipment, daily corrective work, and emergency response. The CE serves as an expert technical resource interacting with onsite Engineering Operations Technicians (EOT) and any third-party vendors. They are expected to be a singular focal point for all facility operations within a given data center and to support AWS.  \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.  \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.  \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role.  \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Act as the primary escalation point for all facilities-related issues. Oversee operation and management of routine and emergency services on a variety of critical systems such as: switchgear, generators, UPS systems, power distribution equipment, chillers, cooling towers, computer room air handlers, building monitoring systems, etc.\u003cbr/\u003e- Perform root cause analysis of equipment failures, and troubleshooting of facility within internal Service Level Agreements (SLA).\u003cbr/\u003e- Provide training and guidance to Engineering Operations Technicians and responsible for working with Facility Manager (FM) to set team culture.\u003cbr/\u003e- Create and deploy new standard practices for Engineering Operations Technicians, Chief Engineers, and vendor support teams\u003cbr/\u003e- May assist in the build out of new facilities and assist in projects to increase current facility efficiency\u003cbr/\u003e- Working outside of normal business hours for routine maintenance as required, including responding to out-of-hours emergency calls.\u003cbr/\u003e- Communicate complex technical information to a non-technical audience.\u003cbr/\u003e- Work with IT managers and other business leaders to coordinate projects, manage capacity, and optimize plant safety, performance, reliability and efficiency\u003cbr/\u003e- Ensure all safety procedures are adhered to by vendor and Amazon staff\u003cbr/\u003e- Establish building performance benchmarks, conduct analyses, and prepare reports on all aspects of the critical facility operations and maintenance.\u003cbr/\u003e- Utilize Microsoft Excel, Word, Outlook and other basic administrative tools to perform day to day tasks\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e- Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodation: \u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently \u003cbr/\u003e- Participate in group lifts for 40+ pounds \u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder \u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position \u003cbr/\u003e- Work in an environment requiring provided ear protection \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They maintain, operate, and troubleshoot mission-critical data center facility equipment including electrical support equipment that supports servers that must maintain better than 99.999% uptime. Equipment will include but is not limited to stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment. \u003cbr/\u003e\u003cbr/\u003eThe CE directs, trains and supports technicians in their role of providing hands-on electrical and mechanical equipment troubleshooting and operations. Implementation and execution of site/equipment-specific training exercises is also expected. They manage projects from conception to completion. These projects involve independent work as well as collaboration with external support groups including engineering, automation, processing, and finance in both local and global settings. The CE will be tasked with creating and delivering on key milestones, obtaining and tracking quotes for all necessary costs, and documenting project results for future implementation at other facilities.\u003cbr/\u003e\u003cbr/\u003eGeneral Work schedule: Monday-Friday with on call.  Subject to change based on customer needs. ","department_cost_center":null,"description_short":"Join our dynamic Data Center Engineering Operations Team and become a critical architect of the infrastructure that powers global cloud computing. You'll play a pivotal role in maintaining the heartbeat","display_distance":null,"id":"b06e2775-6a5e-4460-8f0c-2cb015942f99","id_icims":"3188031","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3188031/data-center-chief-engineer-aws-dc-operations-engineering-dceo","job_schedule_type":"full-time","location":"US, OH, Jeffersonville","locations":["{\"normalizedStateName\":\"Ohio\",\"normalizedCountryCode\":\"USA\",\"city\":\"Jeffersonville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OH, Jeffersonville\",\"coordinates\":\"39.65383,-83.56342\",\"normalizedCountyName\":\"Fayette\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Jeffersonville, Ohio, USA\",\"location\":\"US, OH, Jeffersonville\",\"region\":\"OH\",\"buildingCodeList\":[\"CMH205\"],\"normalizedCityName\":\"Jeffersonville\"}"],"normalized_location":"Jeffersonville, Ohio, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"February 24, 2026","preferred_qualifications":"- Experience in data center engineering or operations\u003cbr/\u003e- Experience in construction or project management\u003cbr/\u003e- Experience leading technical teams through daily operations and maintenance evolutions\u003cbr/\u003e- Must be able to work in an environment that involves walking, stooping, bending, and climbing to access equipment.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, OH, Jeffersonville - 96,000.00 - 166,300.00 USD annually","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"OH","title":"Data Center Chief Engineer , AWS DC Operations Engineering (DCEO)","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/3188031/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- Can push and pull wheeled dollies loaded with products up to 100 pounds during shifts\u003cbr/\u003e- Speak, write, and read fluently in English","business_category":"fulfillment-ops","city":"Cuautitlan Izcalli","company_name":"Servicios Comerciales Amazon Mexico S. de R.L. de C.V.","country_code":"MEX","description":"Amazon is looking for high-potential leaders, who are ready to own their impact in Amazon Operations as an entry-level manager. We promise you will have your leadership capacity stretched to its full potential. As a front-line leader, you will have an opportunity to truly invest in others and develop a people-focused leadership style, while mastering the tools, processes, and operations that have created the most customer-centric company on Earth. If you want to be involved in continuing to define the future of online retail, and are dynamic and an organized self-starter, join our team in Amazon Operations as an Area Manager.\u003cbr/\u003e\u003cbr/\u003eWe offer flexible scheduling options and understand the importance of work-life balance for all our employees. You'll find clear career progression paths and leadership development opportunities through our structured mentoring and advancement programs.\u003cbr/\u003e\u003cbr/\u003eAs an Area Manager, you will have the opportunity to lead and develop your own team of Amazon Associates in a distribution warehouse environment. Your main focus will be motivating, mentoring and coaching your team. As a servant leader, the Area Manager will ensure that their team of Amazon Associates have all the tools needed to succeed for any task during a shift. Engaging with your team during a shift to ensure that the highest levels of safety, quality, attendance performance and engagement are maintained are core functions of the role. Come learn how the largest online retailer in the world runs its fulfillment and delivery networks!\u003cbr/\u003e\u003cbr/\u003eWhat is fulfillment you ask? Fulfillment is how we refer to completing or fulfilling a customer's Amazon.com order and the acts of picking, packing, shipping and delivering their order to meet or exceed their expectations!\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eJob Requirements:\u003cbr/\u003e· Ability to work weekends, holidays, and/or overnight shifts\u003cbr/\u003e· Ability to work overtime both in peak season and as needed\u003cbr/\u003e\u003cbr/\u003eLocations and Placement:\u003cbr/\u003e· The position is NOT a corporate role and will be located in a Fulfillment Center\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e· Lead, manage, and develop a team of 50 to 150 Amazon Associates\u003cbr/\u003e· Communicate policies to Associates and act as the primary information source for the team, maintaining compliance, consistency, and taking corrective action when needed\u003cbr/\u003e· Create, manage, and support recognition and communication programs\u003cbr/\u003e· Support all safety programs and OSHA compliance to ensure a safe work environment for all Associates\u003cbr/\u003e· Ensure procedures are followed for building security and product loss prevention\u003cbr/\u003e· Partner with the management team to establish and maintain quality control standards\u003cbr/\u003e· Develop performance goals and objectives to achieve customer demand and ensure accuracy and quality\u003cbr/\u003e· Lead continuous improvement projects and innovation initiatives to enhance operational efficiency\u003cbr/\u003e\u003cbr/\u003eJob Elements\u003cbr/\u003eMust be able to perform the following tasks, with or without reasonable accommodation:\u003cbr/\u003e· Stand/walk for up to 10-12 hours\u003cbr/\u003e· Walk in/and around the warehouse with great frequency; many facilities are over a quarter mile in length\u003cbr/\u003e· Access all areas of building (ascending and descending ladders, stairs, and gangways safely and without limitation)\u003cbr/\u003e· Regularly bend, lift, stretch and reach both below the waist and above the head\u003cbr/\u003e· Lift and move items up to 20 kg.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAt Amazon Operations, we are united by a single mission: delivering smiles to our customers' doorsteps. We combine the energy of a start-up with the experience of being the world's most customer-centric company. We're passionate about innovation and solving complex challenges at scale.\u003cbr/\u003e\u003cbr/\u003eWhat makes our team special is our collaborative spirit. We celebrate diversity of thought and believe the best ideas can come from anyone. In our fast-paced environment, we support each other's growth through mentorship and hands-on learning. We create an inclusive workspace where everyone feels empowered to contribute while delivering millions of smiles.\u003cbr/\u003e\u003cbr/\u003eInclusive team culture \u003cbr/\u003eAt Amazon we embrace our differences and we are committed to furthering our culture of inclusion. We host annual and ongoing learning experiences. Amazon’s culture of inclusion is reinforced within our 14 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.\u003cbr/\u003e \u003cbr/\u003eWork Life Balance \u003cbr/\u003eWe believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfillment. We offer flexibility in working hours and encourage you to find your own balance between your work and personal lives.\u003cbr/\u003e \u003cbr/\u003eMentorship \u0026 Career Growth \u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded professional.","department_cost_center":null,"description_short":"Amazon is looking for high-potential leaders, who are ready to own their impact in Amazon Operations as an entry-level manager. We promise you will have your leadership capacity stretched to its full potential.","display_distance":null,"id":"05829702-e9d7-4d9c-bb97-2eedc6b58d7a","id_icims":"3133359","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3133359/outbound-area-manager-mx-fc-field","job_schedule_type":"full-time","location":"MX, MEX, Cuautitlan Izcalli","locations":["{\"normalizedStateName\":\"Mexico\",\"normalizedCountryCode\":\"MEX\",\"city\":\"Cuautitlan Izcalli\",\"countryIso3a\":\"MEX\",\"countryIso2a\":\"MX\",\"locationNonStemming\":\"Mexico, MEX, Cuautitlan Izcalli\",\"coordinates\":\"19.658,-99.20918\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Mexico\",\"normalizedLocation\":\"Cuautitlán Izcalli, Mexico, MEX\",\"location\":\"MX, MEX, Cuautitlan Izcalli\",\"region\":\"MEX\",\"buildingCodeList\":[\"MEX2\"],\"normalizedCityName\":\"Cuautitlán Izcalli\"}"],"normalized_location":"Cuautitlán Izcalli, Mexico, MEX","optional_search_labels":["ops.lander-mexico"],"posted_date":"November 26, 2025","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"MEX","title":"Outbound Area Manager, MX FC Field","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3133359/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience reading, interpreting, and creating construction drawings, specifications, and submittal documents\u003cbr/\u003e- 3+ years of mission critical facilities (example: hospital, military facility, public safety facility, etc.) experience including industrial electrical and mechanical systems\u003cbr/\u003e- 3+ years of administrative experience including Microsoft Office products","business_category":"aws","city":"New Carlisle","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic Data Center Engineering Operations Team and become a critical architect of the infrastructure that powers global cloud computing. You'll play a pivotal role in maintaining the heartbeat of Amazon Web Services' physical infrastructure, ensuring seamless operations that support millions of customers worldwide.\u003cbr/\u003e\u003cbr/\u003eThe Data Center Chief Engineer (CE) is responsible for ensuring that all electrical, mechanical, and fire/life safety equipment within the data center is operating at peak efficiency. This involves planned preventative maintenance of equipment, daily corrective work, and emergency response. The CE serves as an expert technical resource interacting with onsite Engineering Operations Technicians (EOT) and any third-party vendors. They are expected to be a singular focal point for all facility operations within a given data center and to support AWS.\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role.\u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Act as the primary escalation point for all facilities-related issues. Oversee operation and management of routine and emergency services on a variety of critical systems such as switchgear, generators, UPS systems, power distribution equipment, chillers, cooling towers, computer room air handlers, building monitoring systems, etc. \u003cbr/\u003e- Perform root cause analysis of equipment failures and troubleshooting of facility within internal Service Level Agreements (SLA). \u003cbr/\u003e- Provide training and guidance to Engineering Operations Technicians and are responsible for working with Facility Manager (FM) to set team culture. \u003cbr/\u003e- Create and deploy new standard practices for Engineering Operations Technicians, Chief Engineers, and vendor support teams \u003cbr/\u003e- May assist in the building out of new facilities and assist in projects to increase current facility efficiency \u003cbr/\u003e- Working outside of normal business hours for routine maintenance as required, including responding to out-of-hours emergency calls. \u003cbr/\u003e- Communicate complex technical information to a non-technical audience. \u003cbr/\u003e- Work with IT managers and other business leaders to coordinate projects, manage capacity, and optimize plant safety, performance, reliability and efficiency \u003cbr/\u003e- Ensure all safety procedures are adhered to by vendor and Amazon staff \u003cbr/\u003e- Establish building performance benchmarks, conduct analyses, and prepare reports on all aspects of the critical facility operations and maintenance. \u003cbr/\u003e- Utilize Microsoft Excel, Word, Outlook and other basic administrative tools to perform day-to-day tasks \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e- Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodation: \u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently \u003cbr/\u003e- Participate in group lifts for 40+ pounds \u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder \u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position \u003cbr/\u003e- Work in an environment requiring provided ear protection \u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e- Candidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. ","department_cost_center":null,"description_short":"Join our dynamic Data Center Engineering Operations Team and become a critical architect of the infrastructure that powers global cloud computing. You'll play a pivotal role in maintaining the heartbeat","display_distance":null,"id":"a38e3a62-0d75-470b-9846-f8c9bc8b9044","id_icims":"3187033","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3187033/data-center-chief-engineer","job_schedule_type":"full-time","location":"US, IN, New Carlisle","locations":["{\"normalizedStateName\":\"Indiana\",\"normalizedCountryCode\":\"USA\",\"city\":\"New Carlisle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, IN, New Carlisle\",\"coordinates\":\"41.70584,-86.51309\",\"normalizedCountyName\":\"St Joseph\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New Carlisle, Indiana, USA\",\"location\":\"US, IN, New Carlisle\",\"region\":\"IN\",\"buildingCodeList\":[\"SBN202\"],\"normalizedCityName\":\"New Carlisle\"}"],"normalized_location":"New Carlisle, Indiana, USA","optional_search_labels":["aws.team-dc","military","aws.team-ais"],"posted_date":"February 23, 2026","preferred_qualifications":"- Experience in data center engineering or operations\u003cbr/\u003e- Experience in construction or project management\u003cbr/\u003e- Experience leading technical teams through daily operations and maintenance evolutions\u003cbr/\u003e- Must be able to work in an environment that involves walking, stooping, bending, and climbing to access equipment.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, IN, New Carlisle - 96,000.00 - 166,300.00 USD annually","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"IN","title":"Data Center Chief Engineer","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3187033/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team","business_category":"aws","city":"East Palo Alto","company_name":"Amazon Development Center U.S., Inc.","country_code":"USA","description":"Amazon Aurora DSQL is a serverless, distributed SQL database that combines the performance and scalability of cloud-native architecture with the familiarity and ecosystem of PostgreSQL. Aurora DSQL automatically scales compute and storage, delivers high availability across regions, and eliminates operational overhead—while remaining compatible with PostgreSQL applications and tooling.\u003cbr/\u003e\u003cbr/\u003eWe are seeking PostgreSQL internals experts to advance Aurora DSQL’s query processing capabilities. This is a deep systems engineering role focused on ensuring semantic, functional, and behavioral parity with PostgreSQL while extending its architecture to run efficiently in a distributed, elastic environment.\u003cbr/\u003e\u003cbr/\u003eAs part of the core database engine team, you will work across the PostgreSQL planner, executor, and other subsystems to evolve Aurora DSQL’s hybrid execution model. The ideal candidate understands PostgreSQL internals—from parser to executor—and thrives on solving hard problems at the intersection of distributed systems, concurrency control, and database correctness.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Analyze, adapt, and extend PostgreSQL internals (parser, planner, executor, catalog, and transaction manager) to operate correctly and efficiently in Aurora DSQL’s distributed runtime.\u003cbr/\u003e\u003cbr/\u003e- Build mechanisms that maintain PostgreSQL semantics (MVCC, snapshot isolation, error codes, data types, and function behavior) in a horizontally scalable environment.\u003cbr/\u003e\u003cbr/\u003e- Develop compatibility test frameworks to validate DSQL’s correctness against upstream PostgreSQL.\u003cbr/\u003e\u003cbr/\u003e- Collaborate with query processing, storage, and transaction teams to integrate distributed primitives into PostgreSQL-compatible interfaces.\u003cbr/\u003e\u003cbr/\u003e- Debug complex behaviors in areas like visibility, locks, and plan caching to ensure fidelity with PostgreSQL behavior under distributed execution.\u003cbr/\u003e\u003cbr/\u003e- Contribute to the long-term architecture enabling Aurora DSQL to support next-generation PostgreSQL features at virtually unlimited scale.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou’ll deep-dive into PostgreSQL internals—reasoning through planner/executor nodes, commit protocols, and system catalogs—while designing new abstractions that preserve correctness in distributed execution.\u003cbr/\u003eYou’ll profile query behavior, validate transaction semantics across regions, and partner with engineers across compute, storage, and transaction subsystems to ensure every PostgreSQL feature “just works” on Aurora DSQL.\u003cbr/\u003eYou’ll participate in design reviews, mentor engineers, and drive the compatibility roadmap for Aurora DSQL’s PostgreSQL layer.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe are the Aurora DSQL Query Processing team; this team is the execution engine behind every SQL executed statement in Aurora DSQL. We are responsible for bridging one of the world’s most advanced open-source databases with AWS’s distributed, serverless architecture.\u003cbr/\u003eOur engineers come from database internals backgrounds and large-scale distributed systems teams. We value curiosity, precision, and craftsmanship—and we work in an environment where deep systems problems meet high-scale real-world impact.\u003cbr/\u003e\u003cbr/\u003eWe are committed to mentorship, technical excellence, and shared ownership. You’ll work alongside engineers who have contributed to PostgreSQL’s planner, executor, and MVCC subsystems—and help define how Aurora DSQL evolves to support PostgreSQL workloads natively in the cloud.","department_cost_center":null,"description_short":"Amazon Aurora DSQL is a serverless, distributed SQL database that combines the performance and scalability of cloud-native architecture with the familiarity and ecosystem of PostgreSQL. Aurora DSQL automatically","display_distance":null,"id":"e1e4e10a-d15a-477a-ab99-aa14c0a8dee2","id_icims":"3121824","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3121824/senior-software-engineer-distributed-postgresql-engine-aurora-dsql-aurora-distributed-sql-query-processing","job_schedule_type":"full-time","location":"US, CA, East Palo Alto","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"East Palo Alto\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, East Palo Alto\",\"coordinates\":\"37.4732,-122.13957\",\"normalizedCountyName\":\"San Mateo\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"East Palo Alto, California, USA\",\"location\":\"US, CA, East Palo Alto\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC18\"],\"normalizedCityName\":\"East Palo Alto\"}"],"normalized_location":"East Palo Alto, California, USA","optional_search_labels":["aws.team-utility-computing","aws.team-database"],"posted_date":"November  6, 2025","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, East Palo Alto - 193,300.00 - 261,500.00 USD annually","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"CA","title":"Senior Software Engineer – Distributed PostgreSQL Engine, Aurora DSQL, Aurora Distributed SQL Query Processing","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3121824/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of tax, finance or a related analytical field experience\u003cbr/\u003e- 3+ years of building financial and operational reports/data sets that inform business decision-making experience\u003cbr/\u003e- Bachelor's degree in finance, accounting, business, economics, or a related analytical field (e.g., engineering, math, computer science)\u003cbr/\u003e- Experience with advanced use of SQL for data mining and business intelligence","business_category":"finance","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon seeks a highly motivated finance professional with an AI-first mindset to play a lead role in Operations Finance supporting the Global Engineering Services (GES) team. GES is a leader in program management, design, engineering, construction, and deployment of Amazon Ops assets and sustainability commitments. This is a great opportunity to support GES in a role with high impact and visibility to business-critical processes that will require interactions with Director and above leadership across Operations and Finance. Everyone on the team needs to be entrepreneurial, wear many hats, and work in a highly collaborative environment that’s more start-up than big company. Excellent verbal and written communication skills are critical in this role. The successful candidate has demonstrated the following abilities: they are a self-starter who proactively pursues AI-driven solutions, have a strong sense of ownership, collaborate with and influence business partners, support thoughtful decision-making in a rapidly-evolving and ambiguous environment, and think long-term.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tDevelop partnerships across Operations and use data to influence leadership decision-making\u003cbr/\u003e•\tDrive financing modeling and analysis for new initiatives - Lead long- and short-term financial planning, including financial reviews with senior business partners (including Director and above)\u003cbr/\u003e•\tManage competing priorities to complete both ad-hoc and strategic projects\u003cbr/\u003e•\tSeek opportunities to resolve defects and reduce cost\u003cbr/\u003e•\tImprove, scale, and simplify finance tools across teams and organizations\u003cbr/\u003e•\tCommunicate financial insights (both written and verbal) in a clear and concise manner. Adapt communication based on intended audience to clearly articulate complex financial considerations.\u003cbr/\u003e•\tPromote a positive and collaborative culture.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon operates an industry leading logistics network across the world. The Global Realty (GR) team is responsible for acquisition and management of real estate for the Amazon Operations Network. In support of GES, Finance is looking for individuals who enjoy tackling challenges and have a desire for professional growth opportunities. Experience in this team opens up several career opportunities across Amazon and within the broader Finance organization. Individuals in this role have advancement opportunities to support different businesses and multi-functional teams, to lead new programs and initiatives, and to manage larger teams within the company.","department_cost_center":null,"description_short":"Amazon seeks a highly motivated finance professional with an AI-first mindset to play a lead role in Operations Finance supporting the Global Engineering Services (GES) team. GES is a leader in program","display_distance":null,"id":"14c0a366-1b01-485b-8f12-56a109eec615","id_icims":"3177595","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/Planning","job_function_id":null,"job_path":"/en/jobs/3177595/senior-financial-analyst-ges-finance","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA104\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"February 10, 2026","preferred_qualifications":"- MBA, or CPA\u003cbr/\u003e- 4+ years of participating in continuous improvement projects in your team to scale and improve controllership with measurable results experience\u003cbr/\u003e- Experience working with large-scale data mining and reporting tools (examples: SQL, MS Access, Essbase, Cognos) and other financial systems (examples: Oracle, SAP, Lawson, JD Edwards)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Bellevue - 82,700.00 - 117,100.00 USD annually","primary_search_label":"finance.team-consumer","source_system":"JobCreator","state":"WA","title":"Senior Financial Analyst, GES Finance","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3177595/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-consumer","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}