{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Are 18 years of age or older\u003cbr/\u003e- Work 40 hours/week throughout the course of a 12-week summer internship between May through September\u003cbr/\u003e- Enrolled in Bachelor’s degree program with a graduation conferral date between December 2026 and September 2027","business_category":"studentprograms","city":"Austin","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Calling all early career talent interested in tech sales!\u003cbr/\u003e\u003cbr/\u003eJoin us for an exciting opportunity to join the AWS Cloud Sales Center (CSC) team and work with a diverse organization that focuses on driving greater AWS adoption and customer value. This role is part of the Customer Acquisition organization, which focuses on driving customer engagement through top-of-funnel sales activities.\u003cbr/\u003e\u003cbr/\u003eAs an Associate Customer Acquisition Rep (ACAR), you will initiate customer contact through cold calls, lead follow-up, and customer research to generate sales meetings and support early-stage sales pipeline building. Strong Associate CARs excel at building customer relationships, obsess over creating customer value, thrive in high-touch coaching environments, and are driven by daily and quarterly targets. At AWS, you will be immersed in the most innovative cloud computing technologies, including GenerativeAI capabilities.  \u003cbr/\u003e\u003cbr/\u003eThis role is available in Austin, TX, Arlington, VA. Relocation assistance provided, if eligible.\u003cbr/\u003e\u003cbr/\u003eIf this sounds exciting to you - come build the future with us!\u003cbr/\u003e\u003cbr/\u003eKey responsibilities:\u003cbr/\u003e•\tDevelop foundational sales and technology skills while generating early-stage demand for AWS through structured prospecting activities\u003cbr/\u003e•\tReach out to prospects through outbound activities to generate a minimum number of first sales meetings for sellers per week\u003cbr/\u003e•\tDocument and share comprehensive pre-qualification information to support effective initial sales conversations with potential customers\u003cbr/\u003e•\tConduct internal and external research to identify key customer contacts and potential customer pain points\u003cbr/\u003e•\tIncorporate AWS opportunity qualification methodology to support initial discovery conversations with customers both new and existing\u003cbr/\u003e•\tMaintain accurate customer data by investigating and updating account records in CRM and internal systems\u003cbr/\u003e•\tContinuously build knowledge around industry and AWS offerings\u003cbr/\u003e\u003cbr/\u003eAWS is the world’s most comprehensive and broadly adopted cloud platform, offering over 200 fully featured services from data centers globally. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. \u003cbr/\u003e","department_cost_center":null,"description_short":"Calling all early career talent interested in tech sales!Join us for an exciting opportunity to join the AWS Cloud Sales Center (CSC) team and work with a diverse organization that focuses on driving greater","display_distance":null,"id":"c59e9780-16d2-44dd-bb2d-c4e612ad1ee9","id_icims":"3157180","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Tech Sales","job_function_id":null,"job_path":"/en/jobs/3157180/2026-aws-associate-customer-acquisition-rep-intern","job_schedule_type":"full-time","location":"US, TX, Austin","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS11\"],\"normalizedCityName\":\"Austin\"}"],"normalized_location":"Austin, Texas, USA","optional_search_labels":[],"posted_date":"January 12, 2026","preferred_qualifications":"- Demonstrated Sales Experience: You have professional sales experience through internships, part-time roles, or full-time positions where you actively engaged in prospecting, cold calling, lead qualification, or pipeline management. You can speak to specific examples of meeting targets, building customer relationships, and driving results.\u003cbr/\u003e- Good Communicator: You are comfortable talking with all different kinds of people, interests, and walks of life. You write clearly, listen well, and use the right tone for the audience.\u003cbr/\u003e- Self-Starter: You actively look for opportunities to improve and add value to your team and customers. You show drive and resilience in pursuing goals.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Austin - 27.00 - 47.00 USD hourly","primary_search_label":"studentprograms.team-internships-for-students","source_system":"JobCreator","state":"TX","title":"2026 AWS Associate Customer Acquisition Rep Intern ","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3157180/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-internships-for-students","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 8+ years of professional software engineering experience.\u003cbr/\u003e- Bachelor’s degree in Computer Science or a related field, or equivalent practical experience.\u003cbr/\u003e- Experience building and operating backend services for fast-evolving, user-facing products.\u003cbr/\u003e- Experience designing and evolving APIs that prioritize ergonomics and maintainability.\u003cbr/\u003e- Demonstrated history of independently driving ambiguous, open-ended projects.","business_category":"amazon-artificial-general-intelligence","city":"San Francisco","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon AGI Autonomy develops foundational capabilities for useful AI agents. We are the research lab behind Amazon Nova Act, a state-of-the-art computer-use agent. Our work combines Large Language Models (LLMs) with Reinforcement Learning (RL) to solve reasoning, planning, and world modeling in the virtual world. We are a small, talent-dense lab with the autonomy to move fast and the long-term commitment to pursue high-risk, high-payoff research. Come be a part of our journey!\u003cbr/\u003e\u003cbr/\u003e--\u003cbr/\u003e\u003cbr/\u003eAbout the team:\u003cbr/\u003e\u003cbr/\u003eWe are a research engineering team responsible for data ingestion and research tooling that support model development across the lab. The lab’s ability to train state-of-the-art models depends on generating high-quality training data and having useful tools for understanding experimental outcomes. We accelerate research work across the lab while maintaining the operational reliability expected of critical infrastructure.\u003cbr/\u003e\u003cbr/\u003e-- \u003cbr/\u003e\u003cbr/\u003eAbout the role: \u003cbr/\u003e\u003cbr/\u003eAs a backend engineer on the team, you will build and operate core services that ingest, process, and distribute large-scale, multi-modal datasets to internal tools and data pipelines across the lab.\u003cbr/\u003e\u003cbr/\u003eThis is a hands-on technical leadership role. You will ship a lot of code while defining backend architecture and operational standards across the platform. The platform is built primarily in TypeScript today, with plans to introduce Python services in the future. We are looking for someone who can balance rapid experimentation with operational rigor to build reliable services in a fast-moving research environment.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Be highly productive in the codebase and drive the team’s engineering velocity.\u003cbr/\u003e- Design and evolve backend architecture and interfaces for core services. \u003cbr/\u003e- Define and own standards for production health, performance, and observability.\u003cbr/\u003e- Collaborate directly with Research, Human Feedback, Product Engineering, and other teams to understand workflows and define requirements.\u003cbr/\u003e- Write technical RFCs to communicate design decisions and tradeoffs across teams.\u003cbr/\u003e- Own projects end to end, from technical design through long-term maintenance.\u003cbr/\u003e- Raise the team’s technical bar through thoughtful code reviews, architectural guidance, and mentorship.","department_cost_center":null,"description_short":"Amazon AGI Autonomy develops foundational capabilities for useful AI agents. We are the research lab behind Amazon Nova Act, a state-of-the-art computer-use agent. Our work combines Large Language Models","display_distance":null,"id":"ccbfd56b-9d73-4f2a-b13a-aa1e3e147414","id_icims":"3184511","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Member of Technical Staff","job_function_id":null,"job_path":"/en/jobs/3184511/member-of-technical-staff-backend-agi","job_schedule_type":"full-time","location":"US, CA, San Francisco","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Francisco\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Francisco\",\"coordinates\":\"37.77702,-122.41956\",\"normalizedCountyName\":\"San Francisco\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Francisco, California, USA\",\"location\":\"US, CA, San Francisco\",\"region\":\"CA\",\"buildingCodeList\":[\"SFO19\"],\"normalizedCityName\":\"San Francisco\"}"],"normalized_location":"San Francisco, California, USA","optional_search_labels":["amazon.artificial-intelligence"],"posted_date":"February 19, 2026","preferred_qualifications":"- Experience operating at staff-level, or with significant cross-team technical influence.\u003cbr/\u003e- Experience building high-throughput services that support complex query patterns.\u003cbr/\u003e- Experience with TypeScript and/or Python backend development and toolchain.\u003cbr/\u003e- Experience designing and operating services on AWS.\u003cbr/\u003e- Experience working in startup or research environments with rapidly evolving requirements.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $150,000/year in our lowest geographic market up to $325,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":"CA","title":"Member of Technical Staff, Backend, AGI ","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3184511/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 8+ years of professional software engineering experience.\u003cbr/\u003e- Bachelor’s degree in Computer Science or a related field, or equivalent practical experience.\u003cbr/\u003e- Experience building and maintaining complex TypeScript applications.\u003cbr/\u003e- Experience designing and evolving APIs that prioritize ergonomics and maintainability.\u003cbr/\u003e- Demonstrated history of independently driving ambiguous, open-ended projects.","business_category":"amazon-artificial-general-intelligence","city":"San Francisco","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon AGI Autonomy develops foundational capabilities for useful AI agents. We are the research lab behind Amazon Nova Act, a state-of-the-art computer-use agent. Our work combines Large Language Models (LLMs) with Reinforcement Learning (RL) to solve reasoning, planning, and world modeling in the virtual world. We are a small, talent-dense lab with the autonomy to move fast and the long-term commitment to pursue high-risk, high-payoff research. Come be a part of our journey!\u003cbr/\u003e\u003cbr/\u003e--\u003cbr/\u003e\u003cbr/\u003eAbout the team:\u003cbr/\u003e\u003cbr/\u003eWe are a research engineering team responsible for data ingestion and research tooling that support model development across the lab. The lab’s ability to train state-of-the-art models depends on generating high-quality training data and having useful tools for understanding experimental outcomes. We accelerate research work across the lab while maintaining the operational reliability expected of critical infrastructure.\u003cbr/\u003e\u003cbr/\u003e--\u003cbr/\u003e\u003cbr/\u003eAbout the role: \u003cbr/\u003e\u003cbr/\u003eAs a frontend engineer on the team, you will build the platform and tooling that power data creation, evaluation, and experimentation across the lab. Your work will be used daily by annotators, engineers, and researchers.\u003cbr/\u003e\u003cbr/\u003eThis is a hands-on technical leadership role. You will ship a lot of code while defining frontend architecture, shared abstractions, and UI systems across the platform. We are looking for someone with strong engineering fundamentals, sound product judgment, and the ability to build polished UIs in a fast-moving research environment.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Be highly productive in the codebase and drive the team’s engineering velocity.\u003cbr/\u003e- Define and evolve architecture for a research tooling platform with multiple independently evolving tools.\u003cbr/\u003e- Design and implement reusable UI components, frontend infrastructure, and APIs.\u003cbr/\u003e- Collaborate directly with Research, Human -Feedback, Product Engineering, and other teams to understand workflows and define requirements.\u003cbr/\u003e- Write technical RFCs to communicate design decisions and tradeoffs across teams.\u003cbr/\u003e- Own projects end to end, from technical design through implementation, rollout, and long-term maintenance.\u003cbr/\u003e- Raise the team’s technical bar through thoughtful code reviews, architectural guidance, and mentorship.","department_cost_center":null,"description_short":"Amazon AGI Autonomy develops foundational capabilities for useful AI agents. We are the research lab behind Amazon Nova Act, a state-of-the-art computer-use agent. Our work combines Large Language Models","display_distance":null,"id":"98774a4d-fe46-4198-94b8-bc660b204e7b","id_icims":"3184510","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Member of Technical Staff","job_function_id":null,"job_path":"/en/jobs/3184510/member-of-technical-staff-frontend-agi","job_schedule_type":"full-time","location":"US, CA, San Francisco","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Francisco\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Francisco\",\"coordinates\":\"37.77702,-122.41956\",\"normalizedCountyName\":\"San Francisco\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Francisco, California, USA\",\"location\":\"US, CA, San Francisco\",\"region\":\"CA\",\"buildingCodeList\":[\"SFO19\"],\"normalizedCityName\":\"San Francisco\"}"],"normalized_location":"San Francisco, California, USA","optional_search_labels":["amazon.artificial-intelligence"],"posted_date":"February 19, 2026","preferred_qualifications":"- Experience operating at staff-level, or with significant cross-team technical influence.\u003cbr/\u003e- Experience building internal tooling, developer platforms, or data-intensive applications.\u003cbr/\u003e- Experience building responsive visualizations over large, complex datasets. Experience working in startup or research environments with rapidly evolving requirements.\u003cbr/\u003e- Proficient in Python and/or able to contribute across the stack as needed.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $150,000/year in our lowest geographic market up to $325,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":"CA","title":"Member of Technical Staff, Frontend, AGI ","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3184510/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team","business_category":"aws","city":"Denver","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Application deadline: Feb 19, 2026\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of technical infrastructure program managers, software engineers, data specialists, supply chain specialists, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for planning and execution while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eThe Data Center Controls Automation and Support team is looking for an innovative, self-directed Senior Software Development Engineer to drive the development and scaling of controls deployment services used across AWS Data Centers worldwide. Contribute to Amazon's vision of developing the safest and most secure, reliable, and efficient data centers on Earth.\u003cbr/\u003e\u003cbr/\u003eAs a Software Development Engineer III (SDE3) on this team, you will design new software solutions that power AWS Data Center controls deployment platform and management software products.\u003cbr/\u003e\u003cbr/\u003e- Leverage your expertise in areas such as systems automation, software and test automation, and mission-critical embedded systems at scale\u003cbr/\u003e- Implement Amazon's software development principles to increase the security, availability, and simplicity of industrial controls in our data centers\u003cbr/\u003e- Work alongside a talented, cross-functional team of hardware engineers, data center operations, and security specialists\u003cbr/\u003e- Contribute to the vision of developing the safest and most secure, reliable, and efficient data centers on Earth\u003cbr/\u003e\u003cbr/\u003eIf you're passionate about building innovative solutions that power the backbone of Amazon's world-class infrastructure, this is the role for you.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs a Software Development Engineer III (SDE3), you will be responsible for designing, developing, and maintaining complex software systems that power Amazon's products and services.\u003cbr/\u003e\u003cbr/\u003eYour primary duties will include:\u003cbr/\u003e- Architecting and implementing robust, scalable, and efficient software components embedded in equipment and in the cloud\u003cbr/\u003e- Collaborating with cross-functional teams, including product managers, designers, and other engineers, to deliver high-quality software.\u003cbr/\u003e- Continuously improving coding practices, testing methodologies, and development processes.\u003cbr/\u003e- Staying up-to-date with the latest industry trends, technologies, and best practices.\u003cbr/\u003e- Mentoring and providing guidance to more junior engineers.\u003cbr/\u003e- Participating in the overall direction and vision of the engineering team and organization.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate for this role will have a strong background in software development, with expertise in areas such as system design, data structures, algorithms, and software engineering principles. Strong problem-solving skills, attention to detail, and the ability to work effectively in a fast-paced, collaborative environment are also essential.\u003cbr/\u003e\u003cbr/\u003eThis is a critical role within Amazon's engineering organization, and successful SDE3s will have the opportunity to make a significant impact on the company's products and services.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Data Center Controls Automation and Support team develops tooling for data center controls device frameworks and device lifecycle management in AWS Data Centers. This includes both frontend and backend services use by internal development teams and on-site customers. Our tools power the industrial controls systems deployed in our data centers and make controls operations more effective and efficient.\u003cbr/\u003e\u003cbr/\u003eAbout AWS\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"10c06006-8e36-40ce-9e33-b50f5a131c13","id_icims":"3177253","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3177253/senior-software-development-engineer-data-center-controls-automation-and-support","job_schedule_type":"full-time","location":"US, CO, Denver","locations":["{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}"],"normalized_location":"Denver, Colorado, USA","optional_search_labels":["aws.team-sde-sdm","aws.team-ais"],"posted_date":"February  9, 2026","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- Experience leading the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems\u003cbr/\u003e- Knowledge of professional software engineering \u0026 best practices for full software development life cycle, including coding standards, software architectures, code reviews, source control management, continuous deployments, testing, and operational excellence\u003cbr/\u003e- Experience with Industrial control systems, both hardware and software\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Denver - 168,100.00 - 227,400.00 USD annually","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"CO","title":"Senior Software Development Engineer, Data Center Controls Automation and Support","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3177253/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience designing and developing IT or technical training materials and content","business_category":"aws","city":"London","company_name":"Amazon Data Services UK Limited","country_code":"GBR","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, and we’re looking for talented people who want to help. You’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eBased in London, UK and reporting to the Manager of Customer Success for APMEA and EURI, the Customer Success Engineer (CSE) will help deliver both internal and external education and training programs. The CSE will collaborate externally with local training institutions, third level educational institutions such as universities and community colleges, local and upper secondary education institutions and providers of vocational training with the goal of creating long term local talent pools. Internally the CSE will collaborate with global colleagues on the Data Center Learning team as well as cluster leadership, Public Policy, Public Relations and Community Engagement specialists, to help create the educational and training mechanisms required to deliver the required talent, training and skills at the right time, in the right location at the right level is to support the operational growth of the cluster.  \u003cbr/\u003e\u003cbr/\u003eAs a CSE you are the day-to-day voice of Data Center Learning to your internal and external customers, and also the voice of the customers and will represent their needs back into Data Center Learning. You will track key metrics for your clusters, ensure data accuracy, assist in the reporting of these metrics as required, and within Data Center Learning you are the owner of training metrics for your clusters. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Strategic Planning \u0026 Development. In conjunction with local AWS partners, you will develop and execute comprehensive education, pre-skilling and talent pipeline and training readiness strategies aligned with AWS business objectives. Forecast future skill requirements and design programs to meet emerging needs. Build scalable frameworks for program expansion across regions, to align training and development initiatives with AWS's growth trajectory. \u003cbr/\u003e\u003cbr/\u003e- Program Design \u0026 Implementation. Design innovative training programs that bridge identified skill gaps. Work with internal partners to create measurable learning pathways for data center operations careers. Implement blended learning solutions incorporating classroom, virtual, and hands-on training. Develop frameworks that support progressive career pathways for your cluster.\u003cbr/\u003e\u003cbr/\u003e- Stakeholder Management \u0026 Alliance Building. Build and maintain strategic relationships with key stakeholders across educational institutions, government agencies, and industry partners. Support expansion into new locations by engaging with cluster leadership early and helping them build their training program as the cluster prepares to launch and expand. Facilitate collaboration between multiple stakeholders to achieve program objectives. Manage complex partner relationships and expectations. Create governance structures for multi-stakeholder initiatives. Develop and maintain executive-level relationships with partner organizations. \u003cbr/\u003e\u003cbr/\u003e- Performance Measurement \u0026 Analytics: Establish KPI frameworks for DC Learning education and training programs. Implement data collection and analysis processes. Track program effectiveness and return on investment. Conduct regular program assessments and adjustments. Create reporting frameworks for various stakeholder groups. \u003cbr/\u003e- Innovation \u0026 Continuous Improvement: Research and implement best practices in workforce development. Leverage data analytics to drive program improvements. Identify and test new approaches to talent development. Scale successful initiatives across regions\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAbout AWS\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003e\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"47f76a77-a94c-4e3e-867b-b94bdeb88b5b","id_icims":"3145445","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Technical Training","job_function_id":null,"job_path":"/en/jobs/3145445/customer-success-engineer-data-center-learning","job_schedule_type":"full-time","location":"GB, London","locations":["{\"normalizedStateName\":\"England\",\"normalizedCountryCode\":\"GBR\",\"city\":\"London\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, London\",\"coordinates\":\"51.50643,-0.12719\",\"normalizedCountyName\":\"London\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"London, England, GBR\",\"location\":\"GB, London\",\"region\":\"\",\"buildingCodeList\":[\"LHR10\"],\"normalizedCityName\":\"London\"}"],"normalized_location":"London, England, GBR","optional_search_labels":[],"posted_date":"December 18, 2025","preferred_qualifications":"- Basic knowledge of the Data Center Learning’s learning management systems (LMS) \u0026 Learn.\u003cbr/\u003e- Experience with educational technology, learning platforms and developing talent pipelines and career pathways\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-administrative-support-primary","source_system":"JobCreator","state":null,"title":"Customer Success Engineer, Data Center Learning","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3145445/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-administrative-support-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of building models for business application experience\u003cbr/\u003e- Experience with any programming language such as Python, Java, C++\u003cbr/\u003e- Experience in any of the following areas: algorithms and data structures, parsing, numerical optimization, data mining, parallel and distributed computing, high-performance computing\u003cbr/\u003e- Experience with Machine Learning and Large Language Model fundamentals, including architecture, training/inference lifecycles, and optimization of model execution, or experience in developing and deploying LLMs in production on GPUs, Neuron, TPU or other AI acceleration hardware\u003cbr/\u003e- PhD, or Master's degree and 4+ years of CS, CE, ML or related field experience","business_category":"cx-and-business-trends","city":"Arlington","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Customer Experience and Business Trends (CXBT) is looking for an Applied Scientist to join its team. CXBT's mission is to create best-in-class AI agents that seamlessly integrate multimodal inputs, enabling natural, empathetic, and adaptive interactions. We leverage advanced architectures, cross-modal learning, interpretability, and responsible AI techniques to provide coherent, context-aware responses augmented by real-time knowledge retrieval.\u003cbr/\u003e\u003cbr/\u003eAs part of CXBT, we have a vision to revolutionize how we understand, test, and optimize customer experiences at scale. Where traditional testing approaches fall short, we create AI-powered solutions that enable rapid experimentation, de-risk product launches, and generate actionable insights, -all before a single real customer is impacted.\u003cbr/\u003e\u003cbr/\u003eBe a part of our agentic initiative and shape how Amazon leverages artificial intelligence to run tests at scale and improve customer experiences.\u003cbr/\u003eAs an Applied Scientist, you will research state-of-the-art techniques in agent-based modeling, and lead scientific innovation by building foundational agentic simulation capabilities. \u003cbr/\u003e\u003cbr/\u003eIf you are passionate about the intersection of AI and human behavior modeling, and want to fundamentally influence how Amazon tests and improves customer experiences, this role offers a great opportunity to make your mark.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Design and implement frameworks for creating representative, diverse agents that faithfully capture real-world characteristics\u003cbr/\u003e- Use state-of-the-art techniques  in user modeling and behavioral simulation to build robust agentic frameworks\u003cbr/\u003e- Develop data simulation approaches that mimic real-world speech interactions.\u003cbr/\u003e- Research and implement novel algorithms and modeling techniques.\u003cbr/\u003e- Acquire and curate diverse datasets while ensuring user privacy.\u003cbr/\u003e- Create robust evaluation metrics and test sets to assess language model performance.\u003cbr/\u003e- Innovate in data representation and model training techniques.\u003cbr/\u003e- Apply responsible AI practices throughout the development process.\u003cbr/\u003e- Write clear, scientific documentation describing methodologies, solutions, and design choices.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eOur team is dedicated to improving Amazon's products and services through evaluation of the end-to-end customer experience using both internal and external processes and technology. Our mission is to deeply understand our customers' experiences, challenge the status quo, and provide insights that drive innovation to improve that experience. Through our analysis and insights, we inform business decisions that directly impact customer experience as customers of new GenAI and LLM technologies.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eCustomer Experience and Business Trends (CXBT) is an organization made up of a diverse suite of functions dedicated to deeply understanding and improving customer experience, globally. We are a team of builders that develop products, services, ideas, and various ways of leveraging data to influence product and service offerings – for almost every business at Amazon – for every customer (e.g., consumers, developers, sellers/brands, employees, investors, streamers, gamers).","department_cost_center":null,"description_short":"Customer Experience and Business Trends (CXBT) is looking for an Applied Scientist to join its team. CXBT's mission is to create best-in-class AI agents that seamlessly integrate multimodal inputs, enabling","display_distance":null,"id":"2b2dcab7-63a1-451f-947f-5e006e9b9614","id_icims":"3170930","is_intern":null,"is_manager":null,"job_category":"Research Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3170930/applied-scientist-i-customer-experience-and-business-trends","job_schedule_type":"full-time","location":"US, VA, Arlington","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA41\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS17\"],\"normalizedCityName\":\"Arlington\"}"],"normalized_location":"Arlington, Virginia, USA","optional_search_labels":[],"posted_date":"January 30, 2026","preferred_qualifications":"- Experience in professional software development\u003cbr/\u003e- Experience building machine learning models or developing algorithms for business application\u003cbr/\u003e- Have publications on top-tier conferences, such as CVPR, ICCV, ECCV or NeurIPS\u003cbr/\u003e- Experience with large scale distributed systems such as Hadoop, Spark etc.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Arlington - 136,000.00 - 184,000.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 136,000.00 - 184,000.00 USD annually","primary_search_label":"cx-and-business-trends.team-cxbt","source_system":"JobCreator","state":"VA","title":"Applied Scientist I, Customer Experience and Business Trends","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3170930/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-cxbt","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 10+ years of technical product or program management experience\u003cbr/\u003e- Bachelor's degree in engineering, physical sciences, or related technical field\u003cbr/\u003e- Experience owning/driving roadmap strategy and definition for portfolios with 3-5 year horizons\u003cbr/\u003e- Experience with staged technology readiness models (Technology Readiness Level (TRL)-style gating) and\u003cbr/\u003e- designing/executing pilot programs\u003cbr/\u003e- Experience contributing to scientific and engineering discussions around technology decisions and strategy\u003cbr/\u003e- Experience in representing and advocating for critical stakeholders during executive-level prioritization and planning","business_category":"fulfillment-ops","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join us at the forefront of Amazon's sustainability initiatives to work on environmental and social advancements to support Amazon's long term worldwide sustainability strategy. At Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people.\u003cbr/\u003e\u003cbr/\u003eThe Worldwide Sustainability (WWS) organization capitalizes on Amazon’s scale and speed to build a more resilient and sustainable company. We manage our social and environmental impacts globally, and drive solutions that enable our customers, businesses, and the world to become more sustainable.\u003cbr/\u003e\u003cbr/\u003eYou'll operate with a startup mindset—moving fast, taking calculated risks, and building from first principles in an environment where ambiguity is the norm and invention is the expectation. You'll thrive in uncertain, evolving environments where experimentation and learning from failures are essential to breakthrough innovation. \u003cbr/\u003e\u003cbr/\u003eYou'll dive deep into varied technical domains, build strategic partnerships to accelerate discovery-to deployment, and set technical standards that define how Amazon approaches sustainability science product development. \u003cbr/\u003e\u003cbr/\u003eYou'll invent mechanisms that translate breakthrough science into scalable pilots and Amazon workflows, establishing best practices that compound impact across the organization.\u003cbr/\u003e\u003cbr/\u003eThis is a high-visibility role requiring the ability to influence technical direction across Amazon, drive alignment with senior leadership on multi-year investments, and serve as a thought leader bridging science, product, and business strategy.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eYou are the single-threaded owner for product strategy and business outcomes, defining where Amazon invests, why investments matter, and how products scale over 3–5 years. You'll work backwards from internal customers and business goals, partner with science, engineering, applied science, finance, and operations teams, and drive senior leadership alignment on priorities and tradeoffs.\u003cbr/\u003e\u003cbr/\u003eYou'll own product roadmaps delivering breakthrough sustainability solutions across energy systems, thermal management, chemical processes, and materials innovation—from early-stage validation through operational pilots to full-scale adoption by partner business units. You'll define clear customer value propositions and business cases articulating how products drive adoption, operational efficiency, risk reduction, or sustainability outcomes.\u003cbr/\u003e\u003cbr/\u003eYou'll lead portfolio prioritization and tradeoff decisions, distinguishing one-way vs. two-way doors and reallocating resources to maximize business and customer impact. You'll partner with science, engineering, and AI/ML leaders to shape product direction, assess feasibility and scalability, and ensure technical solutions align with customer needs—without owning scientific research or acting as a domain authority.\u003cbr/\u003e\u003cbr/\u003eYou'll drive executive alignment through high-quality narratives enabling senior leadership decisions on multi-year investments. You'll define and inspect mechanisms tracking product adoption, business impact, and sustainability outcomes, using data to course-correct strategy and roadmap. You'll influence across organizations without authority, aligning senior leaders and stakeholders around coherent product strategies.\u003cbr/\u003e\u003cbr/\u003eYou'll invent and standardize product mechanisms (intake and prioritization models, pilot-to-scale decision criteria, adoption playbooks) enabling repeatable success. You'll mentor and develop senior PMs, raising the bar for business judgment, working-backwards discipline, and strategic product thinking organization-wide.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThis Principal PM-T role demands operating at the intersection of technical capabilities and customer needs across materials science, chemical engineering, thermal systems, AI/ML, pilot design, and partnerships. \u003cbr/\u003e\u003cbr/\u003eYou'll own a portfolio of solutions with company-wide impact, working with scientists and engineers across diverse domains, AI/ML teams, TPMs, and business unit stakeholders to orchestrate pilots and drive adoption at scale.\u003cbr/\u003e","department_cost_center":null,"description_short":"Join us at the forefront of Amazon's sustainability initiatives to work on environmental and social advancements to support Amazon's long term worldwide sustainability strategy. At Amazon, we're working","display_distance":null,"id":"0f570a07-2bf4-4a2c-8099-8fcd66a4ac0e","id_icims":"3176441","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Product Management - Technical","job_function_id":null,"job_path":"/en/jobs/3176441/principal-product-manager-technical-ww-sustainability","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA41\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK14\"],\"normalizedCityName\":\"New York\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Francisco\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Francisco\",\"coordinates\":\"37.77702,-122.41956\",\"normalizedCountyName\":\"San Francisco\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Francisco, California, USA\",\"location\":\"US, CA, San Francisco\",\"region\":\"CA\",\"buildingCodeList\":[\"SFO13\"],\"normalizedCityName\":\"San Francisco\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February  7, 2026","preferred_qualifications":"- MS/PhD in materials science, chemistry, chemical engineering, mechanical engineering, product development, or\u003cbr/\u003e- related technical field\u003cbr/\u003e- Principal Product Manager – Tech (PMT),\u003cbr/\u003e- Experience with AI/ML systems, data strategy, and model-driven product development\u003cbr/\u003e- Experience managing strategic partnerships with research institutions, vendors, and testing facilities\u003cbr/\u003e- Experience influencing senior leadership through data-driven insights and setting technical direction across multiple\u003cbr/\u003e- organizations\u003cbr/\u003e- Experience working with and influencing scientists and engineers across matrixed organizations\u003cbr/\u003e- Demonstrated ability to thrive in ambiguous, fast-paced environments with willingness to experiment and learn from\u003cbr/\u003e- failures\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, San Francisco - 206,900.00 - 279,900.00 USD annually\u003cbr/\u003eUSA, NY, New York - 197,900.00 - 267,800.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 179,900.00 - 243,400.00 USD annually","primary_search_label":"fulfillment-ops.team-sustainability","source_system":"JobCreator","state":"WA","title":"Principal Product Manager, Technical, WW Sustainability","university_job":null,"updated_time":"22 minutes","url_next_step":"https://account.amazon.com/jobs/3176441/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sustainability","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 8+ years of specific technology domain areas (e.g. software development, cloud computing, systems engineering, infrastructure, security, networking, data \u0026 analytics) experience\u003cbr/\u003e- 8+ years of design, implementation, or consulting in applications and infrastructures experience\u003cbr/\u003e- 10+ years of IT development or implementation/consulting in the software or Internet industries experience\u003cbr/\u003e- Experience implementing cloud services including migrations and modernization projects or equivalent\u003cbr/\u003e- Experience delivering results for large, cross-functional initiatives/projects, or experience communicating results to senior leadership\u003cbr/\u003e- Experience in hands-on technical roles (e.g., Solutions Architect, Software Engineer, Cloud Engineer, Database Engineer, Technical Lead, Technology Consultant) with a broad foundation spanning application development, databases, and infrastructure/systems\u003cbr/\u003e- Demonstrated experience building solutions—creating proofs of concept, demos, and working prototypes—not just advising","business_category":"aws","city":"Singapore","company_name":"Amazon Web Services Singapore Private Limited","country_code":"SGP","description":"Are you an Architect at heart who also thinks like an engineer? Do you get energized helping customers solve complex problems—not just on a whiteboard, but by building alongside them? \u003cbr/\u003e\u003cbr/\u003eWe're looking for a Senior Solutions Architect to join our Singapore team, working with diverse customers across the full breadth of their cloud journey. You'll help customers migrate to the cloud, modernize legacy applications and databases, build cloud-native solutions, and explore how GenAI \u0026 Agentic AI can drive their business forward. \u003cbr/\u003e\u003cbr/\u003eWe value practitioners—people whose judgment is grounded in real-world experience building and shipping solutions. You'll partner hands-on with customers, turning ideas into working prototypes and production-ready architectures. Whether the challenge is a complex migration, a legacy modernization, a greenfield application, or helping a customer understand how AI can transform their business—you'll bring curiosity, technical depth, and a bias for action. \u003cbr/\u003e\u003cbr/\u003eIf you thrive in ambiguity, adapt quickly when priorities shift, and measure your success by the outcomes you help customers achieve—we'd love to hear from you. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Partner with diverse customers to design, build, and implement solutions across cloud adoption, migration, modernization, and new workloads \u003cbr/\u003e\u003cbr/\u003e- Work hands-on with customer teams—building prototypes, proofs of concept, and production-ready architectures together \u003cbr/\u003e\u003cbr/\u003e- Assess legacy applications and databases, and co-create practical modernization roadmaps that reduce technical debt and enable innovation \u003cbr/\u003e\u003cbr/\u003e- Guide customers through cloud migrations—helping them move workloads efficiently and securely \u003cbr/\u003e\u003cbr/\u003e- Help customers explore how AI and emerging technologies can enhance their applications, operations, and customer experiences \u003cbr/\u003e\u003cbr/\u003e- Apply practitioner-level judgment to identify the right opportunities and focus effort where it creates the greatest customer and business impact \u003cbr/\u003e\u003cbr/\u003e- Navigate shifting priorities with agility—realigning quickly as customer and business needs evolve \u003cbr/\u003e\u003cbr/\u003e- Share knowledge broadly through workshops, technical content, and community engagement \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour morning might start with whiteboarding a migration strategy for a customer moving their first workloads to the cloud. By afternoon, you're hands-on—pairing with their engineers to build a proof of concept for modernizing a legacy database. The next day could be completely different: helping a customer design a cloud-native application, or exploring how AI could solve a long-standing business challenge. Your recommendations carry weight because they're informed by your own experience building. When priorities shift, you adapt. You're always learning—and bringing that knowledge back to customers.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eYou'll be part of the AWS Singapore Solutions Architecture team, based in our Singapore office. We work with diverse customers across industries—helping them adopt cloud, migrate and modernize their technology landscape, adopt AI, and build for the future. Our team values builders who are curious, collaborative, and customer-obsessed. We learn from each other, support each other's growth, and celebrate diverse perspectives. Whether you're presenting to executives or coding alongside engineers, you'll find a team that values both technical depth and human connection. ","department_cost_center":null,"description_short":"Are you an Architect at heart who also thinks like an engineer? Do you get energized helping customers solve complex problems—not just on a whiteboard, but by building alongside them? We're looking for","display_distance":null,"id":"546144c7-4e98-415d-8004-af8896e91255","id_icims":"3170299","is_intern":null,"is_manager":null,"job_category":"Solutions Architect","job_family":"Solution Architect","job_function_id":null,"job_path":"/en/jobs/3170299/senior-solutions-architect-aws-sgp","job_schedule_type":"full-time","location":"SG, Singapore","locations":["{\"normalizedCountryCode\":\"SGP\",\"city\":\"Singapore\",\"countryIso3a\":\"SGP\",\"countryIso2a\":\"SG\",\"locationNonStemming\":\"Singapore, Singapore\",\"coordinates\":\"1.29087,103.85238\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Singapore\",\"normalizedLocation\":\"SGP\",\"location\":\"SG, Singapore\",\"region\":\"\",\"buildingCodeList\":[\"SIN18\"]}"],"normalized_location":"SGP","optional_search_labels":[],"posted_date":"January 30, 2026","preferred_qualifications":"- Experience working with end user or developer communities\u003cbr/\u003e- AWS certification, such as, AWS Solutions Architect, or a similar cloud certification\u003cbr/\u003e- Experience across multiple domains: application development, databases, infrastructure, networking, and/or security\u003cbr/\u003e- Familiarity with modernization patterns (e.g., re-platforming, refactoring, containerization) and database migration strategies\u003cbr/\u003e- Curious \u0026 have experimented with AI and emerging technologies-and how they can augment human builders and drive business outcomes-with experience helping customers evaluate or implement AI/ML solutions\u003cbr/\u003e- Comfort operating in ambiguous, fast-changing environments with the ability to pivot and reprioritize, and strong judgment in identifying high-impact opportunities\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-solutions-architect-primary","source_system":"JobCreator","state":null,"title":"Senior Solutions Architect, AWS SGP","university_job":null,"updated_time":"22 minutes","url_next_step":"https://account.amazon.com/jobs/3170299/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-solutions-architect-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of building machine learning models for business application experience\u003cbr/\u003e- PhD, or Master's degree and 6+ years of applied research experience\u003cbr/\u003e- Experience programming in Java, C++, Python or related language\u003cbr/\u003e- Experience with neural deep learning methods and machine learning","business_category":"cx-and-business-trends","city":"Arlington","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Customer Experience and Business Trends (CXBT) is looking for an Applied Scientist to join their team. CXBT's mission is to create best-in-class AI agents that seamlessly integrate multimodal inputs like speech, images, and video, enabling natural, empathetic, and adaptive interactions. We leverage advanced architectures, cross-modal learning, interpretability, and responsible AI techniques to provide coherent, context-aware responses augmented by real-time knowledge retrieval.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will have expertise in Large Language Models (LLMs), speech, audio, Natural Language processing (NLP) or multimodal learning to pioneer innovations in data simulation, representation, generation, reasoning, retrieval, and evaluation.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Build scalable solutions for real-time conversational experiences, including multilingual support, customizable personalities, and conversational turn-taking.\u003cbr/\u003e- Develop data simulation approaches that mimic real-world speech interactions.\u003cbr/\u003e- Research and implement novel algorithms and modeling techniques.\u003cbr/\u003e- Acquire and curate diverse datasets while ensuring user privacy.\u003cbr/\u003e- Create robust evaluation metrics and test sets to assess language model performance.\u003cbr/\u003e- Integrate human feedback to improve data selection and model performance.\u003cbr/\u003e- Innovate in data representation and model training techniques.\u003cbr/\u003e- Apply responsible AI practices throughout the development process.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eOur team is dedicated to improving Amazon's products and services through evaluation of the end-to-end customer experience using both internal and external processes and technology. Our mission is to deeply understand our customers' experiences, challenge the status quo, and provide insights that drive innovation to improve that experience. Through our analysis and insights, we inform business decisions that directly impact customer experience as customers of new GenAI and LLM technologies.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eCustomer Experience and Business Trends (CXBT) is an organization made up of a diverse suite of functions dedicated to deeply understanding and improving customer experience, globally. We are a team of builders that develop products, services, ideas, and various ways of leveraging data to influence product and service offerings – for almost every business at Amazon – for every customer (e.g., consumers, developers, sellers/brands, employees, investors, streamers, gamers).\u003cbr/\u003e\u003cbr/\u003eOur approach is based on determining the customer need, along with problem solving, and we work backwards from there. We use technical and non-technical approaches and stay aware of industry and business trends. We are a global team, made up of a diverse set of profiles, skills, and backgrounds – including: Product Managers, Software Developers, Computer Vision experts, Solutions Architects, Data Scientists, Business Intelligence Engineers, Business Analysts, Risk Managers, and more.","department_cost_center":null,"description_short":"Customer Experience and Business Trends (CXBT) is looking for an Applied Scientist to join their team. CXBT's mission is to create best-in-class AI agents that seamlessly integrate multimodal inputs like","display_distance":null,"id":"4e0c3185-23e3-4208-bba8-f916567fb1bb","id_icims":"3178338","is_intern":null,"is_manager":null,"job_category":"Research Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3178338/senior-applied-scientist-customer-experience-and-business-trends","job_schedule_type":"full-time","location":"US, VA, Arlington","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA41\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS17\"],\"normalizedCityName\":\"Arlington\"}"],"normalized_location":"Arlington, Virginia, USA","optional_search_labels":[],"posted_date":"February 10, 2026","preferred_qualifications":"- Experience with modeling tools such as R, scikit-learn, Spark MLLib, MxNet, Tensorflow, numpy, scipy etc.\u003cbr/\u003e- Experience with large scale distributed systems such as Hadoop, Spark etc.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Arlington - 167,100.00 - 226,100.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 167,100.00 - 226,100.00 USD annually","primary_search_label":"cx-and-business-trends.team-cxbt","source_system":"JobCreator","state":"VA","title":"Senior Applied Scientist, Customer Experience and Business Trends ","university_job":null,"updated_time":"27 minutes","url_next_step":"https://account.amazon.com/jobs/3178338/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-cxbt","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience driving process excellence and productivity improvement initiatives, including Kaizen methodologies","business_category":"transportation-and-logistics","city":"Aomori","company_name":"Amazon Japan G.K.","country_code":"JPN","description":"※こちらのポジションは青森県青森市浪岡の物流拠点での勤務となります。\u003cbr/\u003e\u003cbr/\u003e私たちは数億という膨大な商品を取り扱っており、多くのサプライヤーから入荷したアイテムはフルフィルメントセンターという物流拠点に集約され、各地のデリバリーステーション（配送拠点）を経てお客様先に届けられます。\u003cbr/\u003e\u003cbr/\u003e現在、私たちは物流網を拡大すべくデリバリーステーションの全国展開に注力中。\u003cbr/\u003e様々な業界出身（小売・飲食、営業、製造業など）のメンバーが多く活躍しており、メンバー一丸となってミッション達成の為取り組んでいます。\u003cbr/\u003eAmazonの重要拠点で物流を進化させる新規ビジネスに携わる。\u003cbr/\u003eそんな挑みがいのあるミッションに、あなたの経験を活かしてみませんか。\u003cbr/\u003e\u003cbr/\u003e【業務内容】\u003cbr/\u003e作成された日々の計画に沿って、作業工程が計画通りに円滑に進むようサポートを行います。\u003cbr/\u003e･社内ツールを使った生産管理業務\u003cbr/\u003e･チームメンバーと一緒に現場の課題に対し改善プランの策定、実行\u003cbr/\u003e･DSP (運送業務委託先) と協力して配送状況の把握\u003cbr/\u003e･安全・品質・作業効率の向上に向けたプロジェクトの立案および推進\u003cbr/\u003e･標準作業手順書（SOP）の作成や業務標準化の推進\u003cbr/\u003e\u003cbr/\u003e*マネージャーやチームのサポートのもと上記業務を行っていただきます\u003cbr/\u003e*デリバリーステーション内での配送を通して、物流の仕組みやマネージメントを学べます。\u003cbr/\u003e*マネージャーへのキャリアアップや社内公募による他部署への異動のチャンスもあります。\u003cbr/\u003e*勤務はシフト制となります（夜勤有）\u003cbr/\u003e\u003cbr/\u003e本ポジションの所属部門等に関する詳細は、下記リンク先をご参照ください。 \u003cbr/\u003e\u003cbr/\u003e======================\u003cbr/\u003e関連情報\u003cbr/\u003e・所属部門:\u003ca href=\"https://www.amazon.co.jp/b?node=5637343051\"\u003eラストマイル(AMZL)\u003c/a\u003e\u003cbr/\u003e・職種:\u003ca href=\"https://www.amazon.co.jp/b?node=5609898051\"\u003eオペレーション\u003c/a\u003e\u003cbr/\u003e・勤務地:\u003ca href=\"https://www.amazon.co.jp/b?node=8521081051\"\u003e北海道・東北エリアDS\u003c/a\u003e\u003cbr/\u003e・シフトアシスタント職についてもっと知りたい場合はこちら→　https://www.amazon.co.jp/career/pasa\u003cbr/\u003e\u003cbr/\u003e======================\u003cbr/\u003e※Amazon は多様かつインクルーシブな職場づくりを目指しています。Amazonは男女雇用機会均等法を順守しています。人種、 出身国、性別、性的指向、障がい、年齢、その他の属性によって差別することなく、平等に採用選考の機会を提供しています。障がいをお持ちの方は、以下をご覧ください。https://www.amazon.jobs/disability/jp \u003cbr/\u003e\u003cbr/\u003e\u003ca href=\"https://www.amazon.co.jp/career/DEI\"\u003eオペレーション部門のDEIの取り組み（Japanese Only）\u003c/a\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"※こちらのポジションは青森県青森市浪岡の物流拠点での勤務となります。私たちは数億という膨大な商品を取り扱っており、多くのサプライヤーから入荷したアイテムはフルフィルメントセンターという物流拠点に集約され、各地のデリバリーステーション（配送拠点）を経てお客様先に届けられます。現在、私たちは物流網を拡大すべくデリバリーステーションの全国展開に注力中。様々な業界出身（小売・飲食、営業、製造業など）のメンバーが多く活躍しており、メンバー一丸となってミッション達成の為取り組んでいます。Amazonの重要拠点で物流を進化させる新規ビジネスに携わる。そんな挑みがいのあるミッションに、あなたの経験を活かしてみ","display_distance":null,"id":"3edc290f-4312-40b7-b896-ed39d6d3fcd6","id_icims":"3184508","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3184508/amzl-mmg2-deliverystation","job_schedule_type":"full-time","location":"JP, 22, Aomori","locations":["{\"normalizedStateName\":\"Aomori\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Aomori\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, 22, Aomori\",\"coordinates\":\"40.82431,140.74009\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Aomori, JPN\",\"location\":\"JP, 22, Aomori\",\"region\":\"22\",\"buildingCodeList\":[\"MMG2\"]}"],"normalized_location":"Aomori, JPN","optional_search_labels":[],"posted_date":"February 19, 2026","preferred_qualifications":"- Experience in creating process improvement procedures\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-amzl","source_system":"JobCreator","state":"22","title":"シフトアシスタント, AMZL, MMG2-DeliveryStation","university_job":null,"updated_time":"28 minutes","url_next_step":"https://account.amazon.com/jobs/3184508/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amzl","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}