{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Experience in professional non-internship marketing\u003cbr/\u003e- Experience with Excel or Tableau (data manipulation, macros, charts and pivot tables)\u003cbr/\u003e- Experience in a marketing role","business_category":"entertainment","city":"Madrid","company_name":"Amazon Digital Spain S.L.U. - N22","country_code":"ESP","description":"This is a fixed term contract (6 months).\u003cbr/\u003e\u003cbr/\u003eAmazon Music is an immersive audio entertainment service that deepens connections between fans, artists, and creators. From personalized music playlists to exclusive podcasts, concert livestreams to artist merch, Amazon Music is innovating at some of the most exciting intersections of music and culture. We offer experiences that serve all listeners with our different tiers of service: Prime members get access to all the music in shuffle mode, and top ad-free podcasts, included with their membership; customers can upgrade to Amazon Music Unlimited for unlimited, on-demand access to 100 million songs, including millions in HD, Ultra HD, and spatial audio; and anyone can listen for free by downloading the Amazon Music app or via Alexa-enabled devices. Join us for the opportunity to influence how Amazon Music engages fans, artists, and creators on a global scale. Learn more at https://www.amazon.com/music\u003cbr/\u003e\u003cbr/\u003eThe Amazon Music EU Brand \u0026 Strategic team is looking for a marketing professional to manage cross-organizational and cross-functional campaigns that drive customer acquisition and interest for Amazon Music. You will own the strategic planning, management, oversight, and tracking of cross-channel marketing campaigns for Amazon Music, including Partnerships, with internal and external partners. As the Music business grows, the Brand \u0026 Strategic Partnerships team is looking to establish strong relationships with Amazon partner teams to deliver against the vision of a unified entertainment offer, placing Amazon Music at the heart of meaningful collaborations with teams such as Prime Video, Audible, Amazon Fashion, Amazon Stores, etc. You will develop an acute understanding of our brand positioning as the team is also responsible for ensuring our tenets and best practices are applied to the variety of campaigns delivered throughout the year. You will work with a cross-functional team and a wide range of internal stakeholders, including our EU Head of Brand, Industry Relations, Go-to-Market, Product, PR, Media, Creative Studio, International, Regional and Executive leadership as well as external creative, social and media agencies. This is an individual contributor parental leave cover role (duration: 6 months).\u003cbr/\u003e\u003cbr/\u003eWe are looking for a cross-functional marketing manager who is customer obsessed, organized and detail-oriented. You will collaborate with cross-functional partners across local, regional and global Amazon Music teams and are comfortable generating cross-team support for new campaigns. We are looking for relevant marketing experience, demonstrated strengths in using data to inform business strategy and experience making the appropriate recommendations to leadership based on customer insights. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tYou will work with internal partner teams within Amazon (Prime Video, Amazon Fashion, Audible, Amazon Stores… etc.) to deliver cross-functional integrations on priority projects\u003cbr/\u003e•\tYou will manage campaigns and programs from end-to-end across EU/ANZ including strategy, briefing, budgeting, development of media plans, content planning, creative assets, marketing plans (including organic social media and own and operated channels), production, distribution, tracking, and measurement\u003cbr/\u003e•\tYou will oversee the execution and implementation of Brand Partnerships deliverables among internal stakeholder groups and external agencies, including creative RFPs, project tracking, development of marketing assets, and reporting\u003cbr/\u003e•\tYou will create documentation for campaigns and make these available to all teams (timelines, integrated marketing plans, creative concepts, messaging plans, etc.) and work with Global teams to scale campaigns beyond EU/ANZ\u003cbr/\u003e•\tYou will work with the Measurement, Analytics and Insights team to deepen tracking, evaluate \u0026 report on the performance of campaigns\u003cbr/\u003e•\tYou will lead project presentations to Director-level individuals, retrospectives, and status meetings to ensure stakeholders are working towards the same deadlines and goals for marketing campaigns\u003cbr/\u003e•\tYou will work closely with internal and external creative production partners to set and safeguard production delivery timelines\u003cbr/\u003e•\tCommunicate with the global integrated marketing team on shared priorities and attend relevant global meetings\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe EUANZ Brand \u0026 Strategic Partnerships team operates as a full-funnel marketing team, driving both upper funnel awareness and brand perceptions as well as lower funnel impact through Music HVAs for Amazon Music. The team works in partnership with the Global Brand, Integrated Marketing \u0026 Social team, local Marketing, Industry, GCO, Podcast and Merch teams as well as Amazon partners (Prime, Alexa, Prime Video).","department_cost_center":null,"description_short":"This is a fixed term contract (6 months).Amazon Music is an immersive audio entertainment service that deepens connections between fans, artists, and creators. From personalized music playlists to exclusive","display_distance":null,"id":"07f1102b-e841-4bbb-99ae-10c508fd9467","id_icims":"3179903","is_intern":null,"is_manager":null,"job_category":"Marketing \u0026 PR","job_family":"Marketing","job_function_id":null,"job_path":"/en/jobs/3179903/marketing-manager-6-month-ftc-amazon-music-eu-brand-strategic-partnerships","job_schedule_type":"full-time","location":"ES, M, Madrid","locations":["{\"normalizedStateName\":\"Community of Madrid\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Madrid\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, M, Madrid\",\"coordinates\":\"40.42024,-3.68755\",\"normalizedCountyName\":\"Madrid\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Madrid, Community of Madrid, ESP\",\"location\":\"ES, M, Madrid\",\"region\":\"M\",\"buildingCodeList\":[\"MAD15\"],\"normalizedCityName\":\"Madrid\"}"],"normalized_location":"Madrid, Community of Madrid, ESP","optional_search_labels":[],"posted_date":"February 12, 2026","preferred_qualifications":"- Experience working with a Content Management System (e.g. Wordpress, Drupla, Joomla, etc.)\u003cbr/\u003e- Experience using integrated campaigns to solve brand/business challenges\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"entertainment.team-music","source_system":"JobCreator","state":"M","title":"Marketing Manager (6 month FTC), Amazon Music EU Brand \u0026 Strategic Partnerships","university_job":null,"updated_time":"3 minutes","url_next_step":"https://account.amazon.com/jobs/3179903/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-music","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- An Associate’s Degree or related work experience \u003cbr/\u003e- CEFR C1+ or equivalent fluency in German language\u003cbr/\u003e- Written and spoken knowledge of English is essential (CEFR B2+)\u003cbr/\u003e- Strong business writing skills with ability to create reports, proposals, and professional correspondence\u003cbr/\u003e- Advanced reading comprehension with ability to analyze complex business documents\u003cbr/\u003e- Developed analytical thinking and structured problem-solving capabilities\u003cbr/\u003e- Strong ability to interpret and implement detailed instructions across various projects\u003cbr/\u003e- Proficient research skills with experience gathering and synthesizing information from multiple sources\u003cbr/\u003e- Proven attention to detail in managing complex tasks and documents","business_category":"amazon-artificial-general-intelligence","city":"Den Haag","company_name":"Amazon Development Center (Netherlands) B.V.","country_code":"NLD","description":"AI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment of large language models (LLMs) across all of our businesses. Come build the future of human-technology interaction with us.\u003cbr/\u003e\u003cbr/\u003eWe are looking for those candidates who just don’t think out of the box, but make the box they are in ‘Bigger’. The future is now, do you want to be a part of it? Then read on! \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Maintain and follow strict confidentiality as customer privacy is our most important tenet\u003cbr/\u003e- Work with a range of different types of data including, but not limited to: text, speech, audio, image, and video\u003cbr/\u003e- Deliver high-quality labelled data, using guidelines provided to meet our KPIs and using in-house tools and software, as part of Amazon's commitment to developing and deploying AI responsibly.\u003cbr/\u003e- Demonstrate proficiency in generating high quality human insight data across a range of modalities, inclusive of text, image video and audio. \u003cbr/\u003e- Capable of making sound judgments and logical decisions when faced with ambiguous or incomplete information while performing tasks.\u003cbr/\u003e- Eye for detail and ability to pivot from one category of requirement to another instantaneously.\u003cbr/\u003e- Demonstrate support on daily operational deliverables for multiple task types assigned to you and the team\u003cbr/\u003e- Analyze root causes, identify error patterns, and propose solutions to enhance the quality of labeling tasks and their outputs.\u003cbr/\u003e- Responsible for identifying day-to-day process and operational issues in Standard Operating Procedure, tools and suggest changes to unblock operations\u003cbr/\u003e- Demonstrate ownership in floor support to clarify internal queries during execution on need basis\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are looking for a ML Data Associate (MLDA) to undertake the task of foundational labeling functions, such as dialogue evaluation on speech, text, audio, video data.\u003cbr/\u003e\u003cbr/\u003eYour ability to concentrate, multi-task and your high attention to detail helps you deliver high-quality work as well as maintaining strict confidentiality and follow all applicable Amazon policies for securing confidential information. You will be a part of a diverse team with the shared vision of improving customers’ lives with practical, useful generative AI innovations. An inner drive, individuality, and a creative mind are extremely beneficial.","department_cost_center":null,"description_short":"AI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment","display_distance":null,"id":"9acb6038-dd1c-47ae-b1af-835cf5d68081","id_icims":"3042663","is_intern":null,"is_manager":null,"job_category":"Editorial, Writing, \u0026 Content Management","job_family":"Machine Learning Data Operatio","job_function_id":null,"job_path":"/en/jobs/3042663/senior-data-associate-with-german-agi-data-services","job_schedule_type":"full-time","location":"NL, Den Haag","locations":["{\"normalizedStateName\":\"South Holland\",\"normalizedCountryCode\":\"NLD\",\"city\":\"Den Haag\",\"countryIso3a\":\"NLD\",\"countryIso2a\":\"NL\",\"locationNonStemming\":\"Netherlands, Den Haag\",\"coordinates\":\"52.08408,4.31732\",\"normalizedCountyName\":\"The Hague\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Netherlands\",\"normalizedLocation\":\"The Hague, South Holland, NLD\",\"location\":\"NL, Den Haag\",\"region\":\"\",\"buildingCodeList\":[\"AMS10\"],\"normalizedCityName\":\"The Hague\"}"],"normalized_location":"The Hague, South Holland, NLD","optional_search_labels":["alexa-and-amazon-devices.team-operations-job-family","alexa-and-amazon-devices.team-administrative-support-job-family","amazon.artificial-intelligence"],"posted_date":"July 24, 2025","preferred_qualifications":"- Bachelor’s degree in a relevant field\u003cbr/\u003e- 2+ years of professional work experience with demonstrated task execution ability\u003cbr/\u003e- Proven capacity to leverage open-source resources effectively for comprehensive research purposes\u003cbr/\u003e- Ability to adapt well to fast-paced environments with changing circumstances, direction, and strategy\u003cbr/\u003e- 2-3 years project coordination or management experience (for support functions teams)\u003cbr/\u003e- Experience managing stakeholder relationships across departments\u003cbr/\u003e- Advanced proficiency in Microsoft Office Suite and common business applications.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":null,"title":"Senior Data Associate with German, AGI-Data Services","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3042663/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Relevant experience in HR, Employee Relations or Payroll\u003cbr/\u003e- Advanced proficiency in both written and verbal English.\u003cbr/\u003e- Relevant experience of communicating with a wide range of stakeholders, including your peers and leadership\u003cbr/\u003e- Experience working with the MS Office suite (Word, Excel, Outlook) in a professional environment","business_category":"global-corporate","city":"Istanbul","company_name":"Amazon Turkey Operasyon Hizmetleri Limited Sirketi","country_code":"TUR","description":"One of the many reasons Amazon raises the bar on customer experience is because HR makes sure we have the best team behind us. We need an agile workforce, so that we have the right talent in the right numbers to meet our customers’ needs. As an HR assistant, you will aim to motivate our people and keep them engaged with a fulfilling employee experience. Working as part of a team means you’ll get to share ideas and learn from others to grow your career. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Work closely with HR leaders and management on people-related projects to create an engaging workplace environment \u003cbr/\u003e- Handle day-to-day HR-related questions and admin, such as new-starter processes, self-service tools, and time and attendance reviews \u003cbr/\u003e- Use internal dashboards to create reports for leadership at your site \u003cbr/\u003e- Plan initiatives designed to foster employee wellbeing and experience on site \u003cbr/\u003e- Run audits to ensure compliance with company processes, data protection, local employment law and HR best practices\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis is not a traditional office role, as you'll be working on-site and have direct contact with our warehouse teams. Depending on where you're based, you may work on rotation with your HR assistant colleagues. This means there is always someone from our HR team on hand to talk to employees and support with any queries.   \u003cbr/\u003e\u003cbr/\u003eThe HR Assistant role is varied. As well as helping us stay on top of key HR processes, you’ll support leaders in your team on different projects to engage people. This may involve collecting feedback from people and running activities to get them on board with new plans. This may involve collecting feedback from people, running activities to engage them with new plans or helping to create an inclusive environment where employees feel they can bring any HR related queries. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eCustomer Fulfilment, or CF, is where it all started for Amazon. CF has scaled up from a humble team of booksellers to a sophisticated global team which handles more than 1.5 million orders every day. The team is the foundation of our business and its efforts have helped us diversify across new regions and services. With the help of emerging technology, we’re always looking for ways to offer a bigger, better product range – delivered quickly and affordably.\u003cbr/\u003e\u003cbr/\u003eThe CF team are the first people in the chain that helps customers get products at the speed we’re known for. We’re based in Fulfilment Centres, which are at the heart of Amazon’s fast-paced Operations network. Our centres are sometimes referred to as the ‘First Mile’ because it’s where most Amazon packages start their journey. We help to manage dynamic inventory and facilitate speedy deliveries round the clock.\u003cbr/\u003e\u003cbr/\u003eLots of different people work in our Fulfilment Centres, so there are plenty of opportunities for every skillset. Some of us work with physical products, while others analyse data to help everyone across the business make smart decisions.","department_cost_center":null,"description_short":"One of the many reasons Amazon raises the bar on customer experience is because HR makes sure we have the best team behind us. We need an agile workforce, so that we have the right talent in the right","display_distance":null,"id":"12a0554a-e3a1-4aab-9922-ebda3f094433","id_icims":"3164392","is_intern":null,"is_manager":null,"job_category":"Human Resources","job_family":"Human Resources","job_function_id":null,"job_path":"/en/jobs/3164392/hr-associate-partner","job_schedule_type":"full-time","location":"TR, Istanbul","locations":["{\"normalizedCountryCode\":\"TUR\",\"city\":\"Istanbul\",\"countryIso3a\":\"TUR\",\"countryIso2a\":\"TR\",\"locationNonStemming\":\"Turkey, Istanbul\",\"coordinates\":\"41.06201,28.98877\",\"normalizedCountyName\":\"Istanbul\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Türkiye\",\"normalizedLocation\":\"Istanbul, TUR\",\"location\":\"TR, Istanbul\",\"region\":\"\",\"buildingCodeList\":[\"IST2\"],\"normalizedCityName\":\"Istanbul\"}"],"normalized_location":"Istanbul, TUR","optional_search_labels":[],"posted_date":"January 22, 2026","preferred_qualifications":"- Experience in handling new-starter processes and related admin\u003cbr/\u003e- Basic experience working with basic employment law and HR/payroll practices\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"global-corporate.team-hr-for-hr","source_system":"JobCreator","state":null,"title":"HR Associate Partner","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3164392/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-hr-for-hr","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Electrical Engineering or similar field\u003cbr/\u003e- 8+ years of professional experience in software development\u003cbr/\u003e- 8+ years of experience coding in low-level C\u003cbr/\u003e- 8+ years of experience with DDR memory subsystems, including DDR training algorithms, timing optimization, and ECC\u003cbr/\u003e- Experience with HW/SW interfaces at the board and chip level (e.g., I2C, SPI, DRAM, PCIe)\u003cbr/\u003e- Knowledge and strong understanding of hardware, software, and complete system architecture","business_category":"aws","city":"Tel Aviv","company_name":"Annapurna Labs Ltd.","country_code":"ISR","description":"The AWS Graviton Software team is seeking a senior software engineer who will take ownership on DDR technology to join us in building our next-generation platforms.\u003cbr/\u003eYou'll have the opportunity to work on cutting-edge technologies that power the AWS cloud in a dynamic, open, and fast-paced environment.\u003cbr/\u003eAmazon Web Services provides a highly reliable, scalable, low-cost infrastructure cloud platform that powers hundreds of thousands of businesses in 190 countries around the world.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eIn this role, you will have the opportunity to influence our software architecture and tackle the challenge of developing features for complex systems. You will become an expert in cutting-edge technologies involving high-end CPUs, reliable high-speed memory, high-speed I/O, and networking. You will lead integration efforts across various departments (hardware and software) within AWS and have the opportunity to shape our next-generation platforms.\u003cbr/\u003e\u003cbr/\u003e* Although we highly appreciate DDR experience , this is not a must.","department_cost_center":null,"description_short":"The AWS Graviton Software team is seeking a senior software engineer who will take ownership on DDR technology to join us in building our next-generation platforms.You'll have the opportunity to work on","display_distance":null,"id":"6a70ca3f-a095-4677-aaf4-64ecee2ca4c1","id_icims":"3122030","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3122030/sr-embedded-software-engineer-graviton","job_schedule_type":"full-time","location":"IL, Tel Aviv","locations":["{\"normalizedStateName\":\"Tel Aviv\",\"normalizedCountryCode\":\"ISR\",\"city\":\"Tel Aviv\",\"countryIso3a\":\"ISR\",\"countryIso2a\":\"IL\",\"locationNonStemming\":\"Israel, Tel Aviv\",\"coordinates\":\"32.08556,34.78953\",\"normalizedCountyName\":\"Tel Aviv\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Israel\",\"normalizedLocation\":\"Tel Aviv-Yafo, Tel Aviv, ISR\",\"location\":\"IL, Tel Aviv\",\"region\":\"\",\"buildingCodeList\":[\"TLV14A\"],\"normalizedCityName\":\"Tel Aviv-Yafo\"}"],"normalized_location":"Tel Aviv-Yafo, Tel Aviv, ISR","optional_search_labels":["aws.team-annapurna-labs"],"posted_date":"November  6, 2025","preferred_qualifications":"- Experience with SoC development lifecycle\u003cbr/\u003e- Deep understanding of computer architecture\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":null,"title":"Sr Embedded Software Engineer  , Graviton","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3122030/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- A degree\u003cbr/\u003e- Relevant experience in people management\u003cbr/\u003e- Relevant experience of communicating with a wide range of stakeholders, including your peers and leadership\u003cbr/\u003e- Relevant experience in using data or anecdotal evidence to influence business decisions\u003cbr/\u003e- Advanced proficiency in verbal and written English and local language","business_category":"fulfillment-ops","city":"Horn-bad Meinberg","company_name":"Amazon Horn-Bad Meinberg GmbH","country_code":"DEU","description":"Operations is the beating heart of Amazon. This key part of our business makes sure we fulfil and dispatch orders efficiently so that our customers get their items on time. As an Area Manager, you’ll make sure your site is running as smoothly as it should so that we can meet customer demand. You will be leading a team that helps keep our operations safe, efficient, and of a high quality and taking on a number of projects across our network to drive productivity.  \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Create, oversee, and drive a culture of safety and wellbeing \u003cbr/\u003e- Analyse and implement changes to keep quality and productivity at a consistently high level \u003cbr/\u003e- Oversee projects to streamline processes, optimise productivity and increase quality of service for customers within your area of responsibility \u003cbr/\u003e- Analyse shift performance against relevant business objectives, and put in place actions to improve our operational excellence \u003cbr/\u003e- Work collaboratively with management-level colleagues to standardise shift practices\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou’ll work on a shift pattern at one of our sites, making sure it is as productive as it can be. Your main focus will be to own and drive a culture of safety and uphold quality and shift performance standards. You’ll also oversee process improvements within your area and drive implementation. A typical day is varied, including everything from routine team management and daily operational responsibilities to process improvement and wide-scale operational contingency tasks. You’ll also be a role model and mentor to new managers.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eCustomer Fulfilment, or CF, is where it all started for Amazon. CF has scaled up from a humble team of booksellers to a sophisticated global team which handles more than 1.5 million orders every day. The team is the foundation of our business and its efforts have helped us diversify across new regions and services. With the help of emerging technology, we’re always looking for ways to offer a bigger, better product range – delivered quickly and affordably.\u003cbr/\u003e\u003cbr/\u003eThe CF team are the first people in the chain that helps customers get products at the speed we’re known for. We’re based in Fulfilment Centres, which are at the heart of Amazon’s fast-paced Operations network. Our centres are sometimes referred to as the ‘First Mile’ because it’s where most Amazon packages start their journey. We help to manage dynamic inventory and facilitate speedy deliveries round the clock.\u003cbr/\u003e\u003cbr/\u003eLots of different people work in our Fulfilment Centres, so there are plenty of opportunities for every skillset. Some of us work with physical products, while others analyse data to help everyone across the business make smart decisions.\u003cbr/\u003eDie CF-Teammitglieder sorgen als allererste dafür, dass unsere Kund:innen ihre Bestellungen mit der Geschwindigkeit erhalten, für die wir bekannt sind. Wir arbeiten in Fulfillment-Centern, die das Herzstück von Amazons dynamischem Betriebsnetz bilden. Unsere Fullfilment-Center werden manchmal auch als die „erste Meile“ (First Mile) bezeichnet – hier starten die meisten Amazon-Pakete ihren Versandweg. Wir unterstützen die Verwaltung eines dynamischen Bestands und ermöglichen schnelle Zustellungen rund um die Uhr.\u003cbr/\u003e\u003cbr/\u003eIn unseren Fulfillment-Centern sind vielfältige Mitarbeitergruppen beschäftigt. Es gibt zahlreiche Möglichkeiten für Menschen mit den verschiedensten Fähigkeiten. Einige von uns arbeiten mit physischen Produkten. Andere analysieren Daten und helfen unternehmensweit dabei, intelligente Entscheidungen zu treffen. ","department_cost_center":null,"description_short":"Operations is the beating heart of Amazon. This key part of our business makes sure we fulfil and dispatch orders efficiently so that our customers get their items on time. As an Area Manager, you’ll make","display_distance":null,"id":"bc3e41b1-b96b-4809-90fb-e9d74b1a3e89","id_icims":"3184711","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3184711/logistics-manager-horn-bad-meinberg-fulfillment-center","job_schedule_type":"full-time","location":"DE, NW, Horn-bad Meinberg","locations":["{\"normalizedStateName\":\"North-Rhine-Westphalia\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Horn-bad Meinberg\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, NW, Horn-bad Meinberg\",\"coordinates\":\"51.87319,8.94522\",\"normalizedCountyName\":\"Lippe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Horn-Bad Meinberg, North-Rhine-Westphalia, DEU\",\"location\":\"DE, NW, Horn-bad Meinberg\",\"region\":\"NW\",\"buildingCodeList\":[\"PAD2\"],\"normalizedCityName\":\"Horn-Bad Meinberg\"}"],"normalized_location":"Horn-Bad Meinberg, North-Rhine-Westphalia, DEU","optional_search_labels":["fulfillment-and-operations.fulfillment-center-mgmt-emea"],"posted_date":"February 19, 2026","preferred_qualifications":"- Experience working with Lean, Six Sigma and Kaizen techniques\u003cbr/\u003e- Experience working in another logistics environment\u003cbr/\u003e- Relevant experience working with the MS Office suite (Word, Excel, Outlook) in a professional environment\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"NW","title":"Logistics Manager - Horn-Bad Meinberg, Fulfillment Center","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3184711/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Diplôme d'ingénieur, d'école de commerce ou d'université\u003cbr/\u003e- Expérience en management d'équipes importantes\u003cbr/\u003e- Expérience en analyse de données\u003cbr/\u003e- Capacité à communiquer en français et en anglais (oral et écrit)","business_category":"fulfillment-ops","city":"Beauvais","company_name":"Amazon France Logistique SAS","country_code":"FRA","description":"Les opérations représentent la force motrice d’Amazon. Ce service clé de notre activité nous permet d’exécuter et d’expédier les commandes de manière efficace afin que nos clients reçoivent leurs articles en temps et en heure. En tant que responsable de secteur, vous veillerez à ce que votre site fonctionne parfaitement afin de répondre à la demande de nos clients. Vous serez à la tête d’une équipe qui contribue à la sécurité, à l’efficacité et à la qualité de nos opérations et vous prendrez en charge un certain nombre de projets sur l’ensemble de notre réseau afin de stimuler la productivité. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eCréer, superviser et encourager une culture de la sécurité et du bien-être\u003cbr/\u003eAnalyser et mettre en œuvre des changements pour maintenir la qualité et la productivité à un niveau élevé et constant\u003cbr/\u003eSuperviser les projets visant à rationaliser les processus, à optimiser la productivité et à améliorer la qualité du service pour les clients dans votre périmètre de responsabilité\u003cbr/\u003eAnalyser les performances de l’équipe par rapport aux objectifs de l’entreprise et mettre en place des actions pour améliorer notre excellence opérationnelle\u003cbr/\u003eTravailler en collaboration avec des collègues de la direction pour normaliser les pratiques des équipes\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eVous travaillerez en équipe sur l’un de nos sites, en veillant à ce qu’il soit aussi productif que possible. Vous aurez pour tâche principale d’instaurer une culture de la sécurité et de faire respecter les normes de qualité et de performance de l’équipe. Vous superviserez également les améliorations apportées aux processus dans votre secteur et en assurerez la mise en œuvre. Vos missions seront variées au cours d’une journée type : gestion de l’équipe, pilotage des opérations quotidiennes, amélioration des processus, missions d’urgence à grande échelle, etc. Vous servirez également d’exemple et de mentor aux nouveaux managers.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eNotre centre de traitement des commandes (Customer Fulfilment, ou CF), est l’endroit où tout a commencé pour Amazon. D’une modeste équipe de libraires, le CF est devenu une équipe mondiale spécialisée qui traite plus de 1,5 million de commandes chaque jour. L’équipe CF est le moteur de notre entreprise et ses efforts nous ont permis de nous tourner vers de nouvelles régions et de proposer de nouveaux services. Avec l’aide des technologies émergentes, nous sommes en permanence à la recherche de solutions nouvelles pour proposer une gamme de produits plus large et de meilleure qualité, livrée rapidement et à un prix abordable.\u003cbr/\u003eL’équipe CF est le premier maillon de la chaîne qui permet aux clients d’obtenir les produits à la vitesse qui fait notre réputation. Nous sommes basés dans les centres de traitement des commandes, qui sont au cœur du réseau des opérations d’Amazon. Nos centres sont parfois appelés le « premier kilomètre », car c’est là que la plupart des colis Amazon commencent leur voyage. Nous aidons à gérer les stocks dynamiques et à faciliter les livraisons rapides, 24 heures sur 24, 7 jours sur 7.\u003cbr/\u003eNos centres de traitement des commandes regroupent des profils variés et les opportunités y sont nombreuses. Certains membres de l’équipe travaillent avec des produits physiques, tandis que d’autres analysent des données. Ensemble, nous travaillons pour que chacun puisse prendre des décisions éclairées dans toute l’entreprise.","department_cost_center":null,"description_short":"Les opérations représentent la force motrice d’Amazon. Ce service clé de notre activité nous permet d’exécuter et d’expédier les commandes de manière efficace afin que nos clients reçoivent leurs articles","display_distance":null,"id":"6b820a15-7535-485e-b0a9-1ea9195f9774","id_icims":"3182741","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3182741/responsable-d-equipe-logistique-h-f","job_schedule_type":"full-time","location":"FR, Beauvais","locations":["{\"normalizedStateName\":\"Hauts-de-France\",\"normalizedCountryCode\":\"FRA\",\"city\":\"Beauvais\",\"countryIso3a\":\"FRA\",\"countryIso2a\":\"FR\",\"locationNonStemming\":\"France, Beauvais\",\"coordinates\":\"49.42964,2.0831\",\"normalizedCountyName\":\"Oise\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"France\",\"normalizedLocation\":\"Beauvais, Hauts-de-France, FRA\",\"location\":\"FR, Beauvais\",\"region\":\"\",\"buildingCodeList\":[\"BVA3\"],\"normalizedCityName\":\"Beauvais\"}"],"normalized_location":"Beauvais, Hauts-de-France, FRA","optional_search_labels":[],"posted_date":"February 17, 2026","preferred_qualifications":"- Certification Lean ou Six Sigma\u003cbr/\u003e- Expérience dans un environnement industriel, logistique ou de transport\u003cbr/\u003e\u003cbr/\u003eAmazon est un employeur engagé pour l'égalité des chances. Nous sommes convaincus qu'une main d'oeuvre diversifée est essentielle à notre réussite. Nous prenons nos décisions de recrutement en fonction de votre expérience et de vos compétences. Nous apprécions votre envie de découvrir, d'inventer, de simplifier et de construire. La protection de votre vie privée et la sécurité de vos données constituent depuis longtemps une priorité absolue pour Amazon. Veuillez consulter notre Politique de Confidentialité pour en savoir plus sur la façon dont nous collectons, utilisons et traitons les données personnelles de nos candidats.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":null,"title":"Responsable d'équipe logistique (H/F) ","university_job":null,"updated_time":"21 minutes","url_next_step":"https://account.amazon.com/jobs/3182741/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Diplôme d'ingénieur, d'école de commerce ou d'université\u003cbr/\u003e- Expériences en management de cadres aux profils variés\u003cbr/\u003e- Expérience en analyse de données\u003cbr/\u003e- Capacité à communiquer en français et en anglais (oral et écrit)","business_category":"fulfillment-ops","city":"Beauvais","company_name":"Amazon France Logistique SAS","country_code":"FRA","description":"Devenez Responsable des Opérations chez Amazon et mettez votre expérience au service de notre mission : orchestrer les opérations d'un centre de distribution ultramoderne pour garantir la satisfaction de millions de clients. Dans ce rôle stimulant où chaque décision compte, vous vivrez l'excitation quotidienne de piloter des opérations à grande échelle tout en gérant des technologies de pointe. Vous serez un véritable moteur de transformation, contribuant à repousser toujours plus loin les limites de notre performance opérationnelle au sein du réseau européen.l’excellence opérationnelle pour créer la société Amazon de demain. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Promouvoir une culture de sécurité exemplaire, en faisant de la santé et la sécurité des équipes notre priorité absolue\u003cbr/\u003e• Fédérer et faire grandir une équipe composée de responsables d'équipe (cadres expérimentés et en début de carrière), en créant un environnement où l'innovation et le développement des talents sont au cœur de votre management \u003cbr/\u003e• Piloter la performance de votre périmètre avec une vision stratégique, en optimisant les processus de réception, stockage, préparation et expédition des commandes \u003cbr/\u003e• Concevoir et déployer des initiatives d'amélioration continue à grande échelle, en vous appuyant sur votre expertise et l'analyse approfondie des données \u003cbr/\u003e• Être moteur de l'innovation dans les processus logistiques et contribuer activement au partage des meilleures pratiques au sein du réseau de centres de distribution Amazon\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eRejoindre Amazon aujourd'hui, c'est donner un véritable coup d'accélérateur à votre carrière. Dès votre arrivée, vous bénéficierez d'un parcours d'intégration complet, en France et à l'international, et serez accompagné(e) par des mentors expérimentés. Nos programmes de développement et l'exposition à des défis complexes dans un environnement en forte croissance vous permettront d'acquérir rapidement de nouvelles compétences.\u003cbr/\u003e\u003cbr/\u003eCe rôle est un véritable tremplin au sein d'Amazon. Selon vos aspirations, vous pourrez évoluer vers des responsabilités plus importantes dans nos opérations, saisir des opportunités dans d'autres pays de notre réseau international, ou encore vous orienter vers des fonctions transverses - voire combiner ces différentes possibilités. Cette liberté de construire votre parcours, couplée à notre vitesse d'apprentissage et notre échelle d'impact, sont particulièrement valorisées, tant pour progresser au sein d'Amazon que pour saisir à l'avenir des opportunités prestigieuses en externe.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003e Les centres de distribution (Fulfillment Centers) sont au cœur de notre promesse client. Grâce à des technologies de pointe et des processus innovants, nos équipes assurent la réception, le stockage, la préparation et l'expédition de millions de produits chaque jour. Nous développons un réseau logistique à la pointe de l'innovation, alliant automatisation, algorithmes et expertise humaine pour garantir une efficacité maximale. \u003cbr/\u003e\u003cbr/\u003ehttps://www.youtube.com/embed/Ei13SAKEDUY\u003cbr/\u003e","department_cost_center":null,"description_short":"Devenez Responsable des Opérations chez Amazon et mettez votre expérience au service de notre mission : orchestrer les opérations d'un centre de distribution ultramoderne pour garantir la satisfaction","display_distance":null,"id":"de8fcedd-eee8-4d4a-b2c7-630accdd5b6e","id_icims":"3182750","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3182750/responsable-des-operations-h-f","job_schedule_type":"full-time","location":"FR, Beauvais","locations":["{\"normalizedStateName\":\"Hauts-de-France\",\"normalizedCountryCode\":\"FRA\",\"city\":\"Beauvais\",\"countryIso3a\":\"FRA\",\"countryIso2a\":\"FR\",\"locationNonStemming\":\"France, Beauvais\",\"coordinates\":\"49.42964,2.0831\",\"normalizedCountyName\":\"Oise\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"France\",\"normalizedLocation\":\"Beauvais, Hauts-de-France, FRA\",\"location\":\"FR, Beauvais\",\"region\":\"\",\"buildingCodeList\":[\"BVA3\"],\"normalizedCityName\":\"Beauvais\"}"],"normalized_location":"Beauvais, Hauts-de-France, FRA","optional_search_labels":["ops.lander-ops-management-fr"],"posted_date":"February 17, 2026","preferred_qualifications":"- Certification Lean ou Six Sigma\u003cbr/\u003e- Expérience dans un environnement industriel, logistique ou de transport\u003cbr/\u003e\u003cbr/\u003eAmazon est un employeur engagé pour l'égalité des chances. Nous sommes convaincus qu'une main d'oeuvre diversifée est essentielle à notre réussite. Nous prenons nos décisions de recrutement en fonction de votre expérience et de vos compétences. Nous apprécions votre envie de découvrir, d'inventer, de simplifier et de construire. La protection de votre vie privée et la sécurité de vos données constituent depuis longtemps une priorité absolue pour Amazon. Veuillez consulter notre Politique de Confidentialité pour en savoir plus sur la façon dont nous collectons, utilisons et traitons les données personnelles de nos candidats.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":null,"title":"Responsable des Opérations (H/F)","university_job":null,"updated_time":"22 minutes","url_next_step":"https://account.amazon.com/jobs/3182750/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent in a related field\u003cbr/\u003e- Demonstrated experience in effectively defining optimal data creation strategies and executing them\u003cbr/\u003e- 2+ years of experience in ML data operations, with a strong understanding of data annotation/ML workflows and concepts\u003cbr/\u003e- Outstanding customer communication and management skills, especially in technical consultation\u003cbr/\u003e- Ability to translate complex technical concepts into tactical applications","business_category":"amazon-artificial-general-intelligence","city":"Amman","company_name":"Nuqtat Al Taknalojia","country_code":"JOR","description":"As a Data Solutions Lead, you'll be the trusted advisor for our AGI-DS scientists, providing expert consultation on ML/Gen AI data collections and managing customer relationships. You'll drive business value through technical advisory and partnership building, creating and managing workstreams that delight our customers and deliver meaningful change for the models that back them.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eDrive and document effective ML/GenAI solutions for customer requests, transforming complex research objectives into clear, actionable data collection requirements\u003cbr/\u003eCoordinate across teams to ensure seamless delivery and stakeholder alignment\u003cbr/\u003eOwn relationships with customer scientists, becoming their go-to partner for ML data solutions\u003cbr/\u003eProvide consultation on ML workflow capabilities, helping customers maximize value\u003cbr/\u003eMonitor and optimize collection health metrics to ensure customer success\u003cbr/\u003eDrive customer adoption through providing technical value and the provision of an exemplary customer experience.\u003cbr/\u003e\u003cbr/\u003eYou'll also:\u003cbr/\u003eGuide customers on workflow feasibility and data collection best practices\u003cbr/\u003eCollaborate with implementation teams to define and validate technical requirements\u003cbr/\u003eEvaluate scalability of annotation scenarios and provide strategic recommendations\u003cbr/\u003eInfluence technical documentation and guidelines","department_cost_center":null,"description_short":"As a Data Solutions Lead, you'll be the trusted advisor for our AGI-DS scientists, providing expert consultation on ML/Gen AI data collections and managing customer relationships. You'll drive business","display_distance":null,"id":"e2b91b78-b6b1-43d8-a221-d45c12c32407","id_icims":"3168015","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Technical Account Management","job_function_id":null,"job_path":"/en/jobs/3168015/data-solutions-lead-data-collection-excellence","job_schedule_type":"full-time","location":"JO, Amman","locations":["{\"normalizedCountryCode\":\"JOR\",\"city\":\"Amman\",\"countryIso3a\":\"JOR\",\"countryIso2a\":\"JO\",\"locationNonStemming\":\"Jordan, Amman\",\"coordinates\":\"31.9518,35.94042\",\"normalizedCountyName\":\"Amman Governorate\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Jordan\",\"normalizedLocation\":\"Amman, JOR\",\"location\":\"JO, Amman\",\"region\":\"\",\"buildingCodeList\":[\"AMM15\"],\"normalizedCityName\":\"Amman\"}"],"normalized_location":"Amman, JOR","optional_search_labels":[],"posted_date":"January 27, 2026","preferred_qualifications":"- Bachelor's degree in Computer Science, Business or a related field\u003cbr/\u003e- Experience with project management\u003cbr/\u003e- Working knowledge of JSON, Command Line, and Python\u003cbr/\u003e- Technical account management experience\u003cbr/\u003e- Background in customer success or solution consulting\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":null,"title":"Data Solutions Lead, Data Collection Excellence","university_job":null,"updated_time":"22 minutes","url_next_step":"https://account.amazon.com/jobs/3168015/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- An Associate’s Degree or related work experience \u003cbr/\u003e- CEFR C1+ or equivalent fluency in German language\u003cbr/\u003e- Written and spoken knowledge of English is essential (CEFR B2+)\u003cbr/\u003e- Strong business writing skills with ability to create reports, proposals, and professional correspondence\u003cbr/\u003e- Advanced reading comprehension with ability to analyze complex business documents\u003cbr/\u003e- Developed analytical thinking and structured problem-solving capabilities\u003cbr/\u003e- Strong ability to interpret and implement detailed instructions across various projects\u003cbr/\u003e- Proficient research skills with experience gathering and synthesizing information from multiple sources\u003cbr/\u003e- Proven attention to detail in managing complex tasks and documents","business_category":"amazon-artificial-general-intelligence","city":"Den Haag","company_name":"Amazon Development Center (Netherlands) B.V.","country_code":"NLD","description":"AI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment of large language models (LLMs) across all of our businesses. Come build the future of human-technology interaction with us.\u003cbr/\u003e\u003cbr/\u003eWe are looking for those candidates who just don’t think out of the box, but make the box they are in ‘Bigger’. The future is now, do you want to be a part of it? Then read on! \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Maintain and follow strict confidentiality as customer privacy is our most important tenet\u003cbr/\u003e- Work with a range of different types of data including, but not limited to: text, speech, audio, image, and video\u003cbr/\u003e- Deliver high-quality labelled data, using guidelines provided to meet our KPIs and using in-house tools and software, as part of Amazon's commitment to developing and deploying AI responsibly.\u003cbr/\u003e- Demonstrate proficiency in generating high quality human insight data across a range of modalities, inclusive of text, image video and audio. \u003cbr/\u003e- Capable of making sound judgments and logical decisions when faced with ambiguous or incomplete information while performing tasks.\u003cbr/\u003e- Eye for detail and ability to pivot from one category of requirement to another instantaneously.\u003cbr/\u003e- Demonstrate support on daily operational deliverables for multiple task types assigned to you and the team\u003cbr/\u003e- Analyze root causes, identify error patterns, and propose solutions to enhance the quality of labeling tasks and their outputs.\u003cbr/\u003e- Responsible for identifying day-to-day process and operational issues in Standard Operating Procedure, tools and suggest changes to unblock operations\u003cbr/\u003e- Demonstrate ownership in floor support to clarify internal queries during execution on need basis\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are looking for a ML Data Associate (MLDA) to undertake the task of foundational labeling functions, such as dialogue evaluation on speech, text, audio, video data.\u003cbr/\u003e\u003cbr/\u003eYour ability to concentrate, multi-task and your high attention to detail helps you deliver high-quality work as well as maintaining strict confidentiality and follow all applicable Amazon policies for securing confidential information. You will be a part of a diverse team with the shared vision of improving customers’ lives with practical, useful generative AI innovations. An inner drive, individuality, and a creative mind are extremely beneficial.","department_cost_center":null,"description_short":"AI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment","display_distance":null,"id":"6b4bd37c-abf2-449a-9e69-daead2e52e72","id_icims":"2914582","is_intern":null,"is_manager":null,"job_category":"Editorial, Writing, \u0026 Content Management","job_family":"Machine Learning Data Operatio","job_function_id":null,"job_path":"/en/jobs/2914582/senior-data-associate-with-german-agi-data-services","job_schedule_type":"full-time","location":"NL, Den Haag","locations":["{\"normalizedStateName\":\"South Holland\",\"normalizedCountryCode\":\"NLD\",\"city\":\"Den Haag\",\"countryIso3a\":\"NLD\",\"countryIso2a\":\"NL\",\"locationNonStemming\":\"Netherlands, Den Haag\",\"coordinates\":\"52.08408,4.31732\",\"normalizedCountyName\":\"The Hague\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Netherlands\",\"normalizedLocation\":\"The Hague, South Holland, NLD\",\"location\":\"NL, Den Haag\",\"region\":\"\",\"buildingCodeList\":[\"AMS10\"],\"normalizedCityName\":\"The Hague\"}"],"normalized_location":"The Hague, South Holland, NLD","optional_search_labels":["alexa-and-amazon-devices.team-operations-job-family","alexa-and-amazon-devices.team-administrative-support-job-family","amazon.artificial-intelligence"],"posted_date":"February 28, 2025","preferred_qualifications":"- Bachelor’s degree in a relevant field\u003cbr/\u003e- 2+ years of professional work experience with demonstrated task execution ability\u003cbr/\u003e- Proven capacity to leverage open-source resources effectively for comprehensive research purposes\u003cbr/\u003e- Ability to adapt well to fast-paced environments with changing circumstances, direction, and strategy\u003cbr/\u003e- 2-3 years project coordination or management experience (for support functions teams)\u003cbr/\u003e- Experience managing stakeholder relationships across departments\u003cbr/\u003e- Advanced proficiency in Microsoft Office Suite and common business applications.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":null,"title":"Senior Data Associate with German, AGI-Data Services","university_job":null,"updated_time":"25 minutes","url_next_step":"https://account.amazon.com/jobs/2914582/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Fortgeschrittene Deutschkenntnisse in Wort und Schrift\u003cbr/\u003e- Erfahrung in der Arbeit mit Datenanalytik und deren Anwendung zur Problemerkennung\u003cbr/\u003e- Erfahrung mit MS Office (Word, Excel, Outlook) im beruflichen Umfeld","business_category":"operations-team","city":"Dahlewitz","company_name":"Amazon Deutschland S18 Transport GmbH - K87","country_code":"DEU","description":"Der operative Geschäftsbereich ist das Herz von Amazon. Ein effektiv ablaufender Betrieb trägt dazu bei, dass Artikel bearbeitet und rechtzeitig an unsere Kund:innen versendet werden. Als Operations Supervisor erlebst Du, wie alle unterschiedlichen Teile des Betriebs funktionieren und trägst zu einem reibungslosen Ablauf bei.\u003cbr/\u003eDu fungierst als erste:r Ansprechpartner:in für Teammitglieder während ihrer Schicht und hilfst ihnen beim Befolgen der Prozesse, die Deine Manager:innen eingeführt haben. Du sammelst praktische Erfahrung und benutzt analytische Systeme, die zum Erfolg unseres Unternehmens beitragen. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Messung und Überwachung von Arbeitsflüssen, Verfolgen der Leistung am Standort und Bereitstellung wichtiger Schichtinformationen an die Schicht-/Bereichsleiter:innen im Betrieb, um für schichtübergreifende Operational Excellence zu sorgen\u003cbr/\u003e- Unterstützung und Schulung von Mitarbeitenden, damit diese großartige Leistungen erbringen können, und Beaufsichtigung ihrer täglichen Aufgaben\u003cbr/\u003e- Unterstützung des/der Schicht-/Bereichsleiter:in bei Projekten zur Prozessverbesserung, Förderung eines sicheren Arbeitsumfelds und Erhöhung des Mitarbeiterengagements \u003cbr/\u003e- Zusammenarbeit mit anderen Abteilungen, um Lösungen für häufige Probleme zu finden oder Bedürfnisse in wichtigen Leistungsbereichen zu erfüllen\u003cbr/\u003e- Nutzung von Datenanalysen, um Möglichkeiten zur Optimierung von Sicherheit, Qualität und Produktivität zu finden \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAls Operations Supervisor arbeitest Du an einem unserer Betriebsstandorte. Du unterstützt Deine:n Schicht-/Bereichsleiter:in bei der Durchführung des Schichtplans. Du hilft bei der Vorbereitung von Schichtbesprechungen mit Deinem Team und überwachst Verfahren und Abläufe. Damit stellst du sicher, dass Sicherheitsregeln, Qualitätssicherungsprozesse und die Prioritäten für den Tag befolgt werden.\u003cbr/\u003eProbleme, die Du bemerkst, eskalierst Du an Deine:n Manager:in. Gelegentlich agierst Du auch selbst als Schichtleiter:in und bietest Deinen Mitarbeitenden die notwendige Anleitung, um ihre Aufgaben zu erledigen. Bei Bedarf unterstützt Du Deine:n Schicht-/Bereichsleiter:in bei der Schichtplanung und sorgst dafür, dass zu Stoßzeiten genügend Teammitglieder eingeteilt sind. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Logistik (AMZL) ist für die Auslieferung von Millionen von Produkten unserer Kunden und Kundinnen direkt an die Haustür verantwortlich. Die „Last-Mile-Logistik“ liefert unsere Pakete in Partnerschaft mit Drittanbietern und realisiert zahlreiche Initiativen zur kontinuierlichen Verbesserung, um Millionen von Kunden zufrieden zu stellen.\u003cbr/\u003eUnser Ziel ist es, das Liefererlebnis für unsere Kund:innen so reibungslos wie möglich zu machen und globale Lieferlösungen für unsere neuesten Angebote einzuführen, darunter Amazon Fresh, Prime Now und Amazon Restaurants.\u003cbr/\u003eUnsere Arbeit lässt sich in zwei Sparten unterteilen. „Under the Roof“ betrifft alles was innerhalb unserer Logistikstandorte passiert und „On the Road“ alles was in den Liefergebieten auf der Straße stattfindet. Unsere Mitarbeitenden bereiten die Pakete in entsprechenden Schichten (Nacht, Früh, Spät) auf den täglichen Versand an unsere Lieferteams vor und kümmern sich um Retouren, die nicht ausgeliefert werden konnten.\u003cbr/\u003eJedes Jahr setzen wir neue Maßstäbe in puncto Kundenerlebnis und bieten neue, innovative Lieferdienste an. Wir suchen nach neuen Möglichkeiten, um branchenweite Logistikherausforderungen zu überwinden, sowie nach neuen Ideen, um unseren CO2-Fußabdruck zu reduzieren. Ein Fuhrpark innovativer Fahrzeuge (einschließlich E-Fahrzeugen) und modernste Technologie unterstützen uns dabei.","department_cost_center":null,"description_short":"Der operative Geschäftsbereich ist das Herz von Amazon. Ein effektiv ablaufender Betrieb trägt dazu bei, dass Artikel bearbeitet und rechtzeitig an unsere Kund:innen versendet werden. Als Operations Supervisor","display_distance":null,"id":"ba62679e-1050-471d-a126-794862ac742d","id_icims":"3184710","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3184710/operations-supervisor","job_schedule_type":"full-time","location":"DE, BB, Dahlewitz","locations":["{\"normalizedStateName\":\"Brandenburg\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Dahlewitz\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, BB, Dahlewitz\",\"coordinates\":\"52.32078,13.44174\",\"normalizedCountyName\":\"Teltow-Fläming\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Blankenfelde-Mahlow, Brandenburg, DEU\",\"location\":\"DE, BB, Dahlewitz\",\"region\":\"BB\",\"buildingCodeList\":[\"DBE8\"],\"normalizedCityName\":\"Blankenfelde-Mahlow\"}"],"normalized_location":"Blankenfelde-Mahlow, Brandenburg, DEU","optional_search_labels":["ops.lander.teamlead-emea"],"posted_date":"February 19, 2026","preferred_qualifications":"- Erfahrung im Stakeholdermanagement, einschließlich Aufbau und Pflege professioneller Beziehungen\u003cbr/\u003e- Erfahrung in der Arbeit in einem Betriebsumfeld, beispielsweise in Logistik, Einzelhandel, Gastgewerbe oder im Kundenservice\u003cbr/\u003e- Fortgeschrittene Englischkenntnisse\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"operations-team.transportation-operations-management","source_system":"JobCreator","state":"BB","title":"Operations Supervisor","university_job":null,"updated_time":"25 minutes","url_next_step":"https://account.amazon.com/jobs/3184710/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"transportation-operations-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}