{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Vasta esperienza nella gestione delle domande e richieste dei clienti, telefonicamente e tramite e-mail.\u003cbr/\u003e- Vasta esperienza in un ruolo di supporto amministrativo che preveda la collaborazione con team interni o esterni.\u003cbr/\u003e- Vasta esperienza nella risoluzione di problemi inerenti a domande e richieste dei clienti o problematiche con i processi interni.\u003cbr/\u003e- Piena padronanza della lingua italiana.","business_category":"amazon-customer-service","city":"Pisa","company_name":"Amazon Italia Customer Services Srl","country_code":"ITA","description":"*Questa posizione non prevede lavoro da remoto ed è basata nel sito Amazon, contratto determinato 6 mesi*\u003cbr/\u003e\u003cbr/\u003eGli imprevisti possono capitare anche nei processi più efficienti e bisogna essere pronti a correre ai ripari. Ogni Delivery Station Liaison Agent di Amazon opera a stretto contatto con i clienti, per far sì che le consegne non andate a buon fine giungano a destinazione e che eventuali domande dei clienti siano gestite al meglio. La tua capacità di intervenire prontamente e mettere in campo soluzioni efficaci per andare incontro a qualsiasi esigenza della clientela consentirà a questo ramo fondamentale delle attività operative di Amazon di funzionare in modo ottimale. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Effettuare chiamate in uscita ai clienti.\u003cbr/\u003e  -  Investigare e risolvere le problematiche nelle consegne, all’occorrenza in collaborazione con i partner Amazon nei settori logistica e consegne.\u003cbr/\u003e   - Tenere traccia dello stato di avanzamento delle domande e richieste dei clienti su base quotidiana, settimanale e mensile.\u003cbr/\u003e   - Seguire le procedure operative standard e assicurare la sicurezza dei dati dei clienti.\u003cbr/\u003e   - Assistere con le comunicazioni interne, anche facendo presentazioni e contribuendo ai programmi di miglioramento continuo e coinvolgimento all’interno dell’azienda.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eIl tuo lavoro si svolgerà in uno dei nostri magazzini per le consegne last-mile, o dell’ultimo miglio, sede del principale sistema logistico di Amazon. Man mano che gli ordini verranno spediti e consegnati, sarai in contatto con magazzini, associate, partner per le consegne e clienti ogni volta che avranno bisogno di assistenza o informazioni. Se un cliente dovrà riprogrammare una consegna, starà a te informare i nostri partner per le consegne. Se noterai problematiche con le consegne, opererai per risolverle, così da assicurare sempre ai nostri clienti un’esperienza impeccabile senza dover contattare Amazon.\u003cbr/\u003eOpererai nel cuore pulsante della logistica di Amazon e avrai modo di sviluppare esperienza in ambito logistico e nel servizio clienti: due degli ambiti in cui Amazon non ha rivali. Sarai in contatto con i clienti quotidianamente, facendo tesoro della tua profonda comprensione della nostra supply chain e conoscenza dei partner per le consegne e dei magazzini nel mercato locale. ","department_cost_center":null,"description_short":"*Questa posizione non prevede lavoro da remoto ed è basata nel sito Amazon, contratto determinato 6 mesi*Gli imprevisti possono capitare anche nei processi più efficienti e bisogna essere pronti a correre","display_distance":null,"id":"ebfaf626-dec7-4e06-bdc8-6367762ac0eb","id_icims":"3168476","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Customer Service","job_function_id":null,"job_path":"/en/jobs/3168476/delivery-station-customer-service-associate-contratto-tempo-determinato-6-mesi","job_schedule_type":"full-time","location":"IT, PI, Pisa","locations":["{\"normalizedStateName\":\"Tuscany\",\"normalizedCountryCode\":\"ITA\",\"city\":\"Pisa\",\"countryIso3a\":\"ITA\",\"countryIso2a\":\"IT\",\"locationNonStemming\":\"Italy, PI, Pisa\",\"coordinates\":\"43.70996,10.39945\",\"normalizedCountyName\":\"Pisa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Italy\",\"normalizedLocation\":\"Pisa, Tuscany, ITA\",\"location\":\"IT, PI, Pisa\",\"region\":\"PI\",\"buildingCodeList\":[\"DTC2\"],\"normalizedCityName\":\"Pisa\"}"],"normalized_location":"Pisa, Tuscany, ITA","optional_search_labels":[],"posted_date":"January 28, 2026","preferred_qualifications":"- Esperienza nella comunicazione con colleghi di alto livello.\u003cbr/\u003e- Esperienza di lavoro in contesti altamente dinamici.\u003cbr/\u003e- Conoscenza intermedia della lingua inglese B2 ( CEFR Common European Framework of Reference for Languages )\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-customer-service.team-associates","source_system":"JobCreator","state":"PI","title":"Delivery Station Customer Service Associate - Contratto tempo determinato 6 mesi","university_job":null,"updated_time":"1 minute","url_next_step":"https://account.amazon.com/jobs/3168476/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-associates","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Essere in possesso di qualifica ASPP\u003cbr/\u003e- Laurea nel settore Sicurezza, Ingegneria o altri campi specifici, oppure diploma di scuola superiore con esperienza ASPP/RSPP in ambito produttivo/produzione/magazzino\u003cbr/\u003e- Dimostrare le norme/gli standard di sicurezza essenziali\u003cbr/\u003e- Livello minimo di inglese A2","business_category":"fulfillment-ops","city":"Udine","company_name":"Amazon Italia Transport Srl","country_code":"ITA","description":"Garantire la sicurezza e il benessere dei nostri dipendenti sul luogo di lavoro è una priorità assoluta in Amazon. I nostri Safety Technician svolgono un ruolo fondamentale per renderlo possibile. Questo ruolo rappresenta un’opportunità per avviare la tua carriera nel settore della sicurezza sul lavoro e per crescere in un’azienda globale. Collaborerai a stretto contatto con i nostri esperti per monitorare l’ambiente di lavoro e in tal modo potrai verificare direttamente il tuo contributo al benessere delle persone. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Eseguire valutazioni del rischio e controlli\u003cbr/\u003e- Monitorare il sito per assicurarsi che i processi siano conformi alle procedure di sicurezza di Amazon\u003cbr/\u003e- Creare e aggiornare i report sulle metriche di sicurezza da sottoporre ai colleghi \u003cbr/\u003e- Collaborare con i colleghi del reparto Operations e di tutta l’azienda su compiti relativi alla sicurezza e offrire indicazioni sulle procedure\u003cbr/\u003e- Assistere nell’applicazione di nuove misure di sicurezza \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eIl tuo lavoro si svolgerà in uno dei nostri siti logistici. Potrai dunque seguire da vicino ciò che accade e sarai a disposizione dei colleghi per rispondere alle loro domande durante il turno. Questo ruolo consiste nell’individuare potenziali problemi prima che si verifichino. Dedicherai molto tempo a controllare il sito e a osservare il modo in cui le persone utilizzano le apparecchiature. Conoscendo bene lo svolgimento di ogni attività e il funzionamento di ogni macchinario, sarai in grado di elaborare le migliori strategie per assicurare la sicurezza dei processi.\u003cbr/\u003eInoltre, sarai uno dei responsabili dell’attuazione dei cambiamenti in materia di sicurezza, per cui lavorerai a stretto contatto con molte persone. Oltre a svolgere le tue mansioni quotidiane e settimanali, offrirai supporto al nostro team Operations per compiti ad hoc relativi alla sicurezza.\u003cbr/\u003eLa sicurezza è fondamentale per Amazon e nel tuo ruolo ci aiuterai a raccogliere i dati essenziali che ci permettono di tenere sotto controllo i nostri processi e di prevenire qualsiasi problema. Condividerai inoltre questi dati con altre persone all’interno dell’azienda e interagirai con gli altri team per assicurarti che lavorino nel rispetto degli standard di sicurezza. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eIl team Workplace Health and Safety (WHS) svolge un ruolo cruciale nell’assicurare la salute fisica e mentale del personale sul lavoro. Collabora con manager, colleghi ed enti locali nelle varie sedi per assicurare il rispetto delle normative di Amazon e dei requisiti di legge, e che i luoghi di lavoro siano sicuri.\u003cbr/\u003eIl team offre un’ampia gamma di opportunità, dal ruolo di Health and Safety Technician a quello di Programme Manager. A prescindere dal ruolo svolto, contribuirai a sviluppare, implementare e far rispettare i nostri elevati standard di sicurezza e benessere. Potrai affiancare colleghi dell’intera azienda in tutta una serie di progetti, dalle ispezioni sui macchinari e sui processi alla valutazione di questi ultimi e della progettazione di edifici e macchinari.","department_cost_center":null,"description_short":"Garantire la sicurezza e il benessere dei nostri dipendenti sul luogo di lavoro è una priorità assoluta in Amazon. I nostri Safety Technician svolgono un ruolo fondamentale per renderlo possibile. Questo","display_distance":null,"id":"40a2d11f-5656-4d52-b3bc-36fef18e6294","id_icims":"3184776","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3184776/addetto-servizio-di-prevenzione-e-protezione","job_schedule_type":"full-time","location":"IT, UD, Udine","locations":["{\"normalizedStateName\":\"Friuli-Venezia Giulia\",\"normalizedCountryCode\":\"ITA\",\"city\":\"Udine\",\"countryIso3a\":\"ITA\",\"countryIso2a\":\"IT\",\"locationNonStemming\":\"Italy, UD, Udine\",\"coordinates\":\"46.06452,13.23807\",\"normalizedCountyName\":\"Udine\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Italy\",\"normalizedLocation\":\"Udine, Friuli-Venezia Giulia, ITA\",\"location\":\"IT, UD, Udine\",\"region\":\"UD\",\"buildingCodeList\":[\"DFV2\"],\"normalizedCityName\":\"Udine\"}"],"normalized_location":"Udine, Friuli-Venezia Giulia, ITA","optional_search_labels":["ops.lander.teamlead-emea"],"posted_date":"February 19, 2026","preferred_qualifications":"- Esperienza nella comunicazione efficace con un’ampia gamma di stakeholder, per iscritto o tramite presentazioni\u003cbr/\u003e- Esperienza di lavoro sia in modo indipendente che all’interno di un team\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-whs-emea","source_system":"JobCreator","state":"UD","title":"Addetto Servizio di Prevenzione e Protezione","university_job":null,"updated_time":"2 minutes","url_next_step":"https://account.amazon.com/jobs/3184776/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-whs-emea","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or above in graphic design, interactive design, or equivalent\u003cbr/\u003e- Have an online portfolio or samples of work on resume, demonstrating experience creating great end-to-end, user-centered design solutions and patterns, across desktop and mobile devices\u003cbr/\u003e- Knowledge of and proficiency in a variety of design tools such as Photoshop, Illustrator, Fireworks, and InDesign\u003cbr/\u003e- Knowledge of typography, design principles, trends and best practices across digital and print\u003cbr/\u003e- Experience managing multiple projects and priorities across teams in a fast-paced, deadline-driven environment\u003cbr/\u003e- Experience communicating clearly and concisely with leadership, stakeholders, and cross-functional teams\u003cbr/\u003e- Speak, write, and read fluently in English\u003cbr/\u003e- 6+ years’ experience as a visual designer in a creative agency or similar creative production environment.\u003cbr/\u003e- Proactive self-starter, who is a customer-obsessed, detail-oriented, and enthusiastic team player.","business_category":"advertising","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"Amazon Advertising Services is looking for a talented and passionate Sr. Visual Designer to join the Creative Services team based in Bangalore, India. At Amazon we always put the customer first, you need to have demonstrated success in translating business goals to an inspiring creative direction. You will start with the customer in your rationale, understanding that what you do is critical to creating a successful, consistent shopping experience.\u2028\u2028Your primary focus will be to design complex visually compelling and effective advertising creatives for internal and external stakeholders.\u003cbr/\u003e\u003cbr/\u003eSr. Visual Designer is responsible of the design process of medium, high-visibility, and complex design executions including (reference provided, and high-complexity creative conceptualization). They have strong knowledge in the digital design domain, and have a strong understanding of how design principles work together (typography, composition, scale, color theory, etc.). They are subject matter experts in a business area of focus. They manage their own design queue, are able to deal with ambiguity, and are learning to be strategic by proposing alternative solutions when the traditional approach does not solve the needs of the business. They own medium-complexity projects and work with limited-guidance. They are starting to mentor and they share their knowledge with the team. They follow Art Directors design guidance and feedback when working on high complexity executions for their level, they work across and influence partner teams across multiple disciplines which includes roles such as marketing, creative campaign managers, business leads, visual designers, new design hires and program or product management. They contribute to team goals and program metrics, understanding the impact, and the impact of their tactics, on the customer experience. They provide tactical and strategic recommendations that streamline existing creative processes.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003e• Responsible of their own design queue and the design process of medium, high-visibility, and complex design executions (Reference provided, and high-complexity creative conceptualization assignments).\u003cbr/\u003e• Strong knowledge on design principles, user experience, visual accessibility, and design thinking. Is able to use these skills to generate visual concepts and propose innovative solutions.\u003cbr/\u003e• Ability to think and respond quickly and to multi-task and work efficiently with careful attention to detail.\u003cbr/\u003e• Accountable for end-to-end creative development and Quality on advertising campaigns.\u003cbr/\u003e• Creates original concepts and designs with guidance from Art Directors and Creative Directors.\u003cbr/\u003e• Responsible of being a subject matter expert on impactful areas for the business, to provide and coordinate training, share updates with the team, and internal review.\u003cbr/\u003e• Leads medium-complexity project initiatives from end-to-end with limited guidance.\u003cbr/\u003e• Participates in global initiatives to improve creative standards and internal processes.\u003cbr/\u003e• Address the strategy and client needs, as defined in the creative brief, through creative ideation and campaign development.\u003cbr/\u003e• Provides and manages design documentation and specifications such as style guides and training material.\u003cbr/\u003e• Ensures design accuracy, adherence to brand tone and guidelines, Amazon templates and style guides on all deliverables.\u003cbr/\u003e• Implements Insights to increase performance and effectiveness of ads.\u003cbr/\u003e• Collaborates across disciplines with team members at all levels.\u003cbr/\u003e• Proactively build partnerships with internal Amazon teams.\u003cbr/\u003e• Provides mentoring to junior designers.\u003cbr/\u003e• Mitigates immediate risks. Decides if they can handle or need to escalate.","department_cost_center":null,"description_short":"Amazon Advertising Services is looking for a talented and passionate Sr. Visual Designer to join the Creative Services team based in Bangalore, India. At Amazon we always put the customer first, you need","display_distance":null,"id":"f557f6e6-3d5d-4305-9eb0-b8857bda3583","id_icims":"3186533","is_intern":null,"is_manager":null,"job_category":"Editorial, Writing, \u0026 Content Management","job_family":"Marketing","job_function_id":null,"job_path":"/en/jobs/3186533/sr-visual-designer-creative-services-creative-services","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR22\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"February 22, 2026","preferred_qualifications":"- Experience with design \u0026 innovation and research \u0026 development\u003cbr/\u003e- Experience in visual design expertise demonstrated through mockups and style guides\u003cbr/\u003e- Experience that includes strong analytical skills, attention to detail, and effective communication abilities, or experience working with customers with a passion for delivering exceptional service\u003cbr/\u003e- Experience working cross-team and synthesizing feedback and input from marketing and product management\u003cbr/\u003e- Knowledge of UX and Visual Design concepts and best practices\u003cbr/\u003e- Experience creating visual assets for digital, mobile, and social\u003cbr/\u003e- Knowledge of Photoshop, video editing, and related tools\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"advertising.team-campaign-and-creative","source_system":"JobCreator","state":"KA","title":"Sr. Visual Designer, Creative Services, Creative Services ","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3186533/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-campaign-and-creative","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 7+ years of project management, real estate development, architecture/design experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- 7+ years experience in solar or renewable energy planning, design, and construction","business_category":"operations","city":"Tempe","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon is looking for a Construction Manager to lead design, construction, and activation of rooftop photovoltaic (PV) systems, micro grid energy resiliency solutions, and other innovative programs to support Amazon sustainability and our progress toward Climate Pledge goals. The Construction Manager will be responsible for project management of new builds, retrofits, expansion, and program initiatives from site selection through contract execution and operational turnover. Construction Managers are required to perform detailed deep dive reviews of job budgets and schedules to identify and resolve any discrepancies, including information in contractor bid packages. Construction Managers will partner with internal customers and external stakeholders to earn their trust and engage as a team to deliver results. The Construction Manager will serve as Amazon's representative and direct point of interface with Developers, General Contractors, Utility Providers, regulatory bodies, and all other stakeholders required for successful delivery of PV and other sustainability projects. as well as the primary integrator between construction and other Amazon stakeholders responsible for equipping, furnishing, and operating our FCs. This opportunity combines construction engineering, planning, project management, facilities management, and contract management.\u003cbr/\u003eThis role requires 60% regional travel and availability to work from a corporate office when not traveling. Candidates should either live near or be willing to relocate within a reasonable commuting distance of the office. Relocation assistance may be provided.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Responsible for construction project management of new rooftop PV systems (or other renewable energy/sustainability projects), as well as their activation and integration into local grids and Amazon operations.\u003cbr/\u003e• Advise on the impact of changes in schedule, costs, and permitting.\u003cbr/\u003e• Support construction scope review and development with internal technical teams and operational customers to facilitate engineering and design efforts on new and remodel projects.\u003cbr/\u003e• Responsible for managing multiple projects simultaneously, from relatively small renovations to large-sized ($100M+) new facilities.\u003cbr/\u003e• Work independently in the assigned regional area with minimal direction from leadership.\u003cbr/\u003e• Prepare reports, specifications, technical analysis to fully define the design requirements, equipment and services required on capacity expansion and remodel projects.\u003cbr/\u003e• Provide technical direction concerning engineering design / AutoCAD, building design, layouts, build details, schedules and materials in accordance with North American Customer Fulfillment (NACF) design parameters.\u003cbr/\u003e• Survey facilities, develop and document procedures to audit the facility, provide evaluations and analysis, and recommend solutions to facility infrastructure, safety and security problems involving facilities and people.\u003cbr/\u003e• Negotiate contracts and contract changes with developers and General Contractors, and present formal documentation for approval when required.\u003cbr/\u003e• Ensure that contracts are fit for purpose, cost effective, and incorporate appropriate Service Level Agreements.\u003cbr/\u003e• Provide overall site management, coordination, planning, specification of business proposals, and coordination of subcontractors.\u003cbr/\u003e• Facilitate and team with others on due diligence evaluation of new opportunities.\u003cbr/\u003e• Assess project performance through Key Performance Indicators for safety, quality, cost, schedule, and sustainability.\u003cbr/\u003e• Partner with teams tasked with transition of base building management and oversight of all turnover documentation.\u003cbr/\u003e• Coach and guide all project teams (developers, design engineers, general contractors, sub-contractors, internal stakeholders) throughout the full project lifecycle.\u003cbr/\u003e• Ensure that contracted resources deliver work to meet duration and quality targets, addressing and ensuring the correction of under-performance issues.\u003cbr/\u003e• Audit contractors to check that the skills and competencies of contract labor are appropriate to need and they are fit to undertake the work on which they will be deployed.\u003cbr/\u003e• Inform developers and contractors of projected changes in resource or work demand so that they can take appropriate action.\u003cbr/\u003e• Identify and resolve clashes, design misses, and schedule conflicts with other Amazon execution teams.\u003cbr/\u003e• Establish and operate the information systems necessary for effective scheduling and recording of contract work.\u003cbr/\u003e• Review of designs and ongoing construction for conformance to current building specifications.\u003cbr/\u003e• Provide critical review of current design standards to identify value engineering and design enhancement opportunities to be considered by internal engineering and schematic design partners.\u003cbr/\u003e• Comprehensive budget tracking, forecasting, and management of assigned expansion, remodel, and new build projects.\u003cbr/\u003e• Receipt, review, and analysis of all proposed cost and time change requests as presented by external project teams.\u003cbr/\u003e• Review and guide internally requested changes for validity, impact, and ensure timely and cost sensitive incorporation once approved.\u003cbr/\u003e• Lead or assist in negotiations with appropriate regulatory bodies and Authority Having Jurisdiction (AHJ) entities as required.\u003cbr/\u003e• Positive, clear, concise, and transparent cross team communication for all aspects of project delivery.\u003cbr/\u003e• The role is remote and will include upwards of 60% travel regionally, with the potential of traveling to all North America locations based on the business needs.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eIf you are not sure that every qualification on the list above describes you exactly, we'd still love to hear from you! At Amazon, we value people with unique backgrounds, experiences, and skillsets. If you’re passionate about this role and want to make an impact on a global scale, please apply! \u003cbr/\u003eAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include:\u003cbr/\u003e1. Medical, Dental, and Vision Coverage\u003cbr/\u003e2. Maternity and Parental Leave Options\u003cbr/\u003e3. Paid Time Off (PTO)\u003cbr/\u003e4. 401(k) Plan","department_cost_center":null,"description_short":"Amazon is looking for a Construction Manager to lead design, construction, and activation of rooftop photovoltaic (PV) systems, micro grid energy resiliency solutions, and other innovative programs to","display_distance":null,"id":"4876ea90-1b9b-414d-9745-62c5f1d7cac4","id_icims":"3108113","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3108113/solar-construction-manager-north-america-construction-portfolios","job_schedule_type":"full-time","location":"US, AZ, Tempe","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Boston\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Boston\",\"coordinates\":\"42.35866,-71.05674\",\"normalizedCountyName\":\"Suffolk\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Boston, Massachusetts, USA\",\"location\":\"US, MA, Boston\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS21\"],\"normalizedCityName\":\"Boston\"}","{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Tempe\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Tempe\",\"coordinates\":\"33.42554,-111.93722\",\"normalizedCountyName\":\"Maricopa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Tempe, Arizona, USA\",\"location\":\"US, AZ, Tempe\",\"region\":\"AZ\",\"buildingCodeList\":[\"PHX12\"],\"normalizedCityName\":\"Tempe\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS20\"],\"normalizedCityName\":\"Austin\"}","{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Nashville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Nashville\",\"coordinates\":\"36.16792,-86.77798\",\"normalizedCountyName\":\"Davidson\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Nashville, Tennessee, USA\",\"location\":\"US, TN, Nashville\",\"region\":\"TN\",\"buildingCodeList\":[\"BNA12\"],\"normalizedCityName\":\"Nashville\"}","{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York City\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York City\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York City\",\"region\":\"NY\",\"buildingCodeList\":[\"LUWS\"],\"normalizedCityName\":\"New York\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA104\"],\"normalizedCityName\":\"Bellevue\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS16\"],\"normalizedCityName\":\"Arlington\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Antonio\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, San Antonio\",\"coordinates\":\"29.42458,-98.49461\",\"normalizedCountyName\":\"Bexar\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Antonio, Texas, USA\",\"location\":\"US, TX, San Antonio\",\"region\":\"TX\",\"buildingCodeList\":[\"SAT4\"],\"normalizedCityName\":\"San Antonio\"}"],"normalized_location":"Tempe, Arizona, USA","optional_search_labels":[],"posted_date":"October 14, 2025","preferred_qualifications":"- 3+ years experience in development or management of commercial power purchase agreements\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, AZ, Tempe - 90,300.00 - 158,000.00 USD annually\u003cbr/\u003eUSA, MA, Boston - 90,300.00 - 158,000.00 USD annually\u003cbr/\u003eUSA, NY, New York City - 103,800.00 - 181,600.00 USD annually\u003cbr/\u003eUSA, TN, Nashville - 81,200.00 - 142,200.00 USD annually\u003cbr/\u003eUSA, TX, Austin - 90,300.00 - 158,000.00 USD annually\u003cbr/\u003eUSA, TX, San Antonio - 90,300.00 - 158,000.00 USD annually\u003cbr/\u003eUSA, VA, Arlington - 90,300.00 - 158,000.00 USD annually\u003cbr/\u003eUSA, WA, Bellevue - 90,300.00 - 158,000.00 USD annually","primary_search_label":"operations.team-construction","source_system":"JobCreator","state":"AZ","title":"Solar Construction Manager, North America Construction Portfolios","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3108113/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-construction","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of software development, or 2+ years of technical support experience\u003cbr/\u003e- Experience scripting in modern program languages\u003cbr/\u003e- Experience troubleshooting and debugging technical systems","business_category":"aws","city":"Hyderabad","company_name":"Amazon Dev Center India - Hyderabad","country_code":"IND","description":"As part of the AWS Applied AI Solutions organization, we have a vision to provide business applications, leveraging Amazon’s unique experience and expertise, that are used by millions of companies worldwide to manage day-to-day operations. We will accomplish this by accelerating our customers’ businesses through delivery of intuitive and differentiated technology solutions that solve enduring business challenges. We blend vision with curiosity and Amazon’s real-world experience to build opinionated, turnkey solutions. Where customers prefer to buy over build, we become their trusted partner with solutions that are no-brainers to buy and easy to use. \u003cbr/\u003e\u003cbr/\u003eJoin us on our mission to revolutionize the way the world shops. We are the Amazon Physical Stores Technical Operations team, responsible for launching and operating the commerce software services which run stores with its “Just Walk Out” technology.\u003cbr/\u003e\u003cbr/\u003eOur approach to problems is entrepreneurial. You will be challenged to invent, create and solve challenging problems as well as wear many hats and collaborate in an environment that’s more startup than big company. You will need a strong ability to troubleshoot hardware, software, and network issues.\u003cbr/\u003e\u003cbr/\u003eAs a Support Engineer (Technical Operations Center Engineer), you seek resolution to problems and mitigate risk, always ensuring a Customer Obsessed experience has occurred. You will be working on services with a direct impact on the customer experience. If you are excited about the opportunity to learn and work on distributed systems, enjoy trouble shooting and solving complex problems, consider the opportunities to work with Amazon Physical Stores.\u003cbr/\u003e\u003cbr/\u003eYou will help solve a variety of challenges and offer your expertise in growing the knowledge of your peers via team collaboration. You will be counted on to identify areas of improvement and drive projects to implement them. We consistently whiteboard so be comfortable writing and supporting your ideas on the team board. You will play an active role in defining the support processes for technologies in partnership with other technology leaders within and possibly outside the team. You should be comfortable with a level of ambiguity that’s higher than most projects and relish the idea of solving big challenges. You will also mentor other engineers in your area of expertise. Along the way, we guarantee that you’ll work hard, have fun and impact many customers!\u003cbr/\u003e\u003cbr/\u003eThis role requires the flexibility to work 5 days a week (occasionally on weekends) on a rotational basis. AWS Support is 24x7x365 operations and work timings for this role is in India night time i.e. 10 PM to 6 AM IST or 1 PM to 10 PM IST. You are expected to work in night shifts hours based on business requirements.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. \u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. ","department_cost_center":null,"description_short":"As part of the AWS Applied AI Solutions organization, we have a vision to provide business applications, leveraging Amazon’s unique experience and expertise, that are used by millions of companies worldwide","display_distance":null,"id":"62fb6dc4-537a-4047-9c01-a88440986798","id_icims":"3160217","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Support Engineering","job_function_id":null,"job_path":"/en/jobs/3160217/support-engineer-iii-just-walk-out-tech","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD11\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":[],"posted_date":"January 15, 2026","preferred_qualifications":"- Knowledge of web services, distributed systems, and web application development\u003cbr/\u003e- Experience troubleshooting \u0026 maintaining hardware \u0026 software RAID\u003cbr/\u003e- Experience with REST web services, XML, JSON\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"TS","title":"Support Engineer III, Just Walk Out Tech","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3160217/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of using a computer maintenance management system in planning, scheduling and auditing overall facilities/maintenance activities experience\u003cbr/\u003e- 1+ years of Microsoft Office products and applications experience\u003cbr/\u003e- 1+ years of working with computers and Microsoft Office products and applications experience\u003cbr/\u003e- High school or equivalent diploma\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- Travel up to 15% of the time","business_category":"fulfillment-ops","city":"Riyadh","company_name":"Afaq - Warehouse Branch","country_code":"SAU","description":"The Facilities Coordinator will have a significant impact on customer experience. The Facilities Coordinator will have the ability to lead and manage outside contractors, be on call for emergencies, to handle multiple projects and daily activities, and meet time lines. The Facilities Coordinator will develop plans on how to accomplish engineering departmental goals.\u003cbr/\u003e\u003cbr/\u003eThe Facilities Coordinator will be responsible for the leadership/development and coaching of the team. Performance Management will be carried out by the Facilities Coordinator – Maintenance. This role also leads the technical team in providing both a reactive and pro-active maintenance service on all operational equipment and facilities infrastructure within the Delivery Stations (DS). The role has a direct impact on the site, its productivity and operational success. If equipment is not available or performs badly it minimizes the capacity and throughput of the site. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eTo provide supervision and leadership to Facility Supervisors\u003cbr/\u003eTo develop Preventive and predictive maintenance of DSs assets including material handling and automation systems\u003cbr/\u003eTo be experienced in installing, maintaining, and troubleshooting any of all site's assets.\u003cbr/\u003eTo act as an ambassador for safety within the team and to promote safe working across the site\u003cbr/\u003eManage day to day engineering and soft services including housekeeping and upkeep of premises\u003cbr/\u003eTo Manage EHS and statuary compliances of DSs including waste management and hazardous waste management as per bylaws, timely renewal of licenses\u003cbr/\u003eTo develop and maintain a good working relationship across all levels in the organization\u003cbr/\u003eAbility to provide enriched feedback to enhance individual performance\u003cbr/\u003eAbility to prioritize and manage resources under high pressure","department_cost_center":null,"description_short":"The Facilities Coordinator will have a significant impact on customer experience. The Facilities Coordinator will have the ability to lead and manage outside contractors, be on call for emergencies, to","display_distance":null,"id":"add35e85-767d-4430-96f5-c4dab636aa32","id_icims":"3186761","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3186761/facilities-coordinator-reliability-maintenance-engineering","job_schedule_type":"full-time","location":"SA, 01, Riyadh","locations":["{\"normalizedCountryCode\":\"SAU\",\"city\":\"Riyadh\",\"countryIso3a\":\"SAU\",\"countryIso2a\":\"SA\",\"locationNonStemming\":\"Saudi Arabia, 01, Riyadh\",\"coordinates\":\"24.68208,46.68723\",\"normalizedCountyName\":\"Riyadh\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Saudi Arabia\",\"normalizedLocation\":\"Riyadh, SAU\",\"location\":\"SA, 01, Riyadh\",\"region\":\"01\",\"buildingCodeList\":[\"DRY3\"],\"normalizedCityName\":\"Riyadh\"}"],"normalized_location":"Riyadh, SAU","optional_search_labels":[],"posted_date":"February 23, 2026","preferred_qualifications":"- 6+ years of maintenance planner/scheduler working within an industrial maintenance complex, manufacturing/distribution industries, or equivalent experience\u003cbr/\u003e- Experience in material handling systems (MHS) installation, operation and maintenance\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":"01","title":"Facilities Coordinator, Reliability Maintenance Engineering","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3186761/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language\u003cbr/\u003e- Bachelor's degree in computer science or equivalent","business_category":"ecp","city":"Bengaluru","company_name":"ADCI - BLR 14 SEZ","country_code":"IND","description":"The Amazon Checkout Experience team is seeking a full stack software development engineer with a passion for engineering excellence. We offer you the opportunity to deliver and lead high visibility \u0026 high-impact innovation for customers across the Address \u0026 Checkout application services in Amazon. We extend to you the opportunity to develop upon multi-tiered, low-latency, highly resilient distributed systems on a grand scale. You will play a pivotal role in crafting solutions that profoundly enhance the shopping experience, handling vast data volumes, delivering lightning-fast response times, and simplifying the checkout process to a remarkable degree.  You must understand the importance of quality and testability in regards to the long term health and operational excellence of the Amazon eco system and you will be expected to drive improvements to current and future systems in these areas. You will contribute to non-functional aspects of the application in the form of latency, performance, and business investigations. You will learn and grow by working closely with senior engineers across our organisation.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will have excellent technical design, problem solving, Computer Science fundamentals, and communication skills. The candidate should be comfortable interacting with technical and non-technical stakeholders at all levels. The ability to work backwards and think from a customer perspective is crucial as the ideal candidate is expected to contribute to the product vision in addition to the technical design and implementation.\u003cbr/\u003e","department_cost_center":null,"description_short":"The Amazon Checkout Experience team is seeking a full stack software development engineer with a passion for engineering excellence. We offer you the opportunity to deliver and lead high visibility \u0026 high-impact","display_distance":null,"id":"e2cec3ae-55cd-4160-8b43-f137772c9cc5","id_icims":"3144527","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3144527/software-development-engineer-checkout-purchase-experience","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR14\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"December 17, 2025","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"ecp.team-ecommerce-services","source_system":"JobCreator","state":"KA","title":"Software Development Engineer, Checkout Purchase Experience","university_job":null,"updated_time":"21 minutes","url_next_step":"https://account.amazon.com/jobs/3144527/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-ecommerce-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Work a flexible schedule including weekends, nights, and holidays\u003cbr/\u003e- 18+ months of computer/server hardware troubleshooting or related IT experience\u003cbr/\u003e- 18+ months of computer layer 1/2 networking experience (including troubleshooting and repair)","business_category":"aws","city":"Hilliard","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring seamless data center operations that power millions of businesses and services worldwide. \u003cbr/\u003eData Center Technician position involves in-depth hardware and network diagnostics followed by physical repair as well as participating in an on-call rotation. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Performing server rack installations, hardware break-fix on various components, troubleshooting network issues, responding to operational incidents that impact service availability, and carrying out routine network, server hardware, and operating system repairs to contribute to the overall availability of AWS services \u003cbr/\u003e- Serving as a primary contact point for both internal and external stakeholders, including engineers, software developers, vendors, and contractors \u003cbr/\u003e- Performing on-call duties and participating in scheduled maintenance and change management activities \u003cbr/\u003e- Contributing to documentation and process improvement initiatives based on your analysis of operational issues \u003cbr/\u003e- Helping to interview, train and onboard new team members \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e- Lifting and moving material up to 40 pounds each \u003cbr/\u003e- Working in cramped and/or elevated locations \u003cbr/\u003e- Bending, lifting, stretching, and reaching \u003cbr/\u003e- Standing and walking for up to 8+ hours a day \u003cbr/\u003e- Ascending and descending ladders, stairs, and gangways safely and without limitation \u003cbr/\u003e- Work in an industrial environment \u003cbr/\u003e- Work shifts longer than 8 hours to support 24/7 operations (covering both night and day shifts). \u003cbr/\u003e- This role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e- Candidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eOur Data Center Technician professionals, who have industry-leading technical abilities and demonstrate a breadth of knowledge while they:\u003cbr/\u003e\u003cbr/\u003e* Take  ownership of technical issues brought by their customer base, engaging  other teams when needed to drive resolution\u003cbr/\u003e* Show a  strong aptitude for troubleshooting and problem solving\u003cbr/\u003e* Solve  problems at their root and step back to understand the broader context\u003cbr/\u003e* Maintain  service level agreements through the implementation of proactive issue  detection and reporting\u003cbr/\u003e* Are  biased to act in the absence of direction or support\u003cbr/\u003e* Improve  effectiveness through process innovation\u003cbr/\u003e\u003cbr/\u003eYou will be required to work shift work that will include days/nights/weekends/holidays.\u003cbr/\u003e","department_cost_center":null,"description_short":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring","display_distance":null,"id":"22fa04f2-79c6-41d9-a1ff-df744b690283","id_icims":"3186164","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3186164/data-center-technician-data-center-operations","job_schedule_type":"full-time","location":"US, OH, Hilliard","locations":["{\"normalizedStateName\":\"Ohio\",\"normalizedCountryCode\":\"USA\",\"city\":\"Hilliard\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OH, Hilliard\",\"coordinates\":\"40.0304,-83.15119\",\"normalizedCountyName\":\"Franklin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Hilliard, Ohio, USA\",\"location\":\"US, OH, Hilliard\",\"region\":\"OH\",\"buildingCodeList\":[\"CMH64\"],\"normalizedCityName\":\"Hilliard\"}"],"normalized_location":"Hilliard, Ohio, USA","optional_search_labels":["military","aws.team-ais","aws.team-dc","hourly"],"posted_date":"February 20, 2026","preferred_qualifications":"- Experience in a data center or other critical environment\u003cbr/\u003e- Bachelor's degree or equivalent professional or military experience in an IT-related field (e.g. computer science, network engineering, etc.)\u003cbr/\u003e- Industry standard certifications (CompTIA, CCENT, Network+)\u003cbr/\u003e- Understanding of Linux or similar operating systems\u003cbr/\u003e- Behavioral interviewing and hiring experience\u003cbr/\u003e- Experience training and onboarding of new team members\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, OH, Hilliard - 30.00 - 54.00 USD hourly","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"OH","title":"Data Center Technician, Data Center Operations","university_job":null,"updated_time":"23 minutes","url_next_step":"https://account.amazon.com/jobs/3186164/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of sales or account management experience\u003cbr/\u003e- 2+ years of digital advertising and client facing roles experience\u003cbr/\u003e- Experience with Excel\u003cbr/\u003e- Experience analyzing data and best practices to assess performance drivers","business_category":"retail","city":"Bengaluru","company_name":"ADCI - Karnataka - A66","country_code":"IND","description":"More than 300 million customers shop in Amazon’s store, and every day, customers browse, purchase, and review products sold by third-party sellers right alongside products sold by Amazon. Since 2000, Amazon has offered this remote shelf space to individuals and companies of all sizes, helping them reach hundreds of millions of customers, build their brands, and grow their business. Fast-forward to the present day, and these third-party seller products account for more than half of all units sold in our store.\u003cbr/\u003e\u003cbr/\u003eAs a Customer Success Manager (CSM) you would be a part of Strategic Account Services (SAS) Team of Retail Business Services, you will have the exciting opportunity to help shape and deliver on a strategy for managing Amazon Seller Partners.\u003cbr/\u003e\u003cbr/\u003eThe SAS Program helps small and medium-sized businesses on Amazon. Our team of consultants provides strategic advice with a data-driven, collaborative and customer-focused approach. Our consultants focus on topics like Portfolio Optimization, Product Presentation, Advertising Strategy, Promotions, Fulfillment Strategy, and Brand Building. As a strategic business consultant, you will advise a portfolio of businesses and help them grow fast by mastering the fundamentals of selling on Amazon. Your objective is to support Selling Partners to drive their business growth and program satisfaction by working backwards from their individual targets and developing a roadmap together with your Selling Partners. In addition, you use your analytical know-how to proactively identify untapped potential of each Selling Partner.\u003cbr/\u003e\u003cbr/\u003eGiven the early stage of this program, you will have the opportunity to take ownership in various projects, help evolve the program and develop expertise in a focused topic area. You will also closely collaborate with Amazon colleagues based in USA.\u003cbr/\u003e\u003cbr/\u003eRegular shift timing for this role would be 4 PM to 1 AM IST.\u003cbr/\u003e\u003cbr/\u003eAbout Amazon\u003cbr/\u003eAmazon strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online. By giving customers more of what they want - low prices, vast selection, and convenience – Amazon continues to grow and evolve as a world-class e-commerce platform. Amazon's evolution from website to e-commerce partner to development platform is driven by the spirit of innovation that is part of the company's DNA.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Manage a portfolio of Sellers to drive sustainable revenue growth, based on a solid understanding of marketplace programs, tools and processes.\u003cbr/\u003e\u003cbr/\u003e• Analyze customer data on the efficiency of listings, selection, supply chain, advertising, and deals and provide strategic recommendations to maximize the sellers’ potential.\u003cbr/\u003e\u003cbr/\u003e• Implement and track metrics for recording the success and quality of the sellers in your Seller portfolio. Use key metrics to guide your work and uncover hidden areas of opportunity.\u003cbr/\u003e\u003cbr/\u003e• Build and execute on a joint business plan that delivers on key business opportunities and relevant KPIs for the sellers and Amazon.\u003cbr/\u003e\u003cbr/\u003e• Conduct deep dive analysis on seller issues and publish recommendations and action plans based on data to improve seller experience.\u003cbr/\u003e\u003cbr/\u003e• Success will be measured by the performance of your sellers on input metrics and impact on creating a great customer \u0026 seller experience.\u003cbr/\u003e\u003cbr/\u003e• Develop a thorough understanding of the Amazon Marketplace ecosystem. Manage additional projects around our newly launched Paid Service, which includes process improvements, tool and content development, competitive analysis, and sales analysis.\u003cbr/\u003e\u003cbr/\u003e• Conduct regular WBRs, MBRs with the sellers, highlight business metric performance and building action plans.\u003cbr/\u003e\u003cbr/\u003eRegular shift timing for this role would be 4 PM to 1 AM IST.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e• We fill the gap for sellers by providing consultative services as Amazon experts. Internally, we collaborate with a fabulous team across USA to develop our SAS program as we deliver it.\u003cbr/\u003e\u003cbr/\u003e• As a Customer Success Manager we work with smaller, younger, and more innovative businesses that sell on Amazon. We provide sellers with consulting on various aspects that contribute to faster growth on Amazon, including support with their supply chain, merchandising, selection \u0026 conversion and analytics.\u003cbr/\u003e\u003cbr/\u003e• As a Customer Success Manager, you will have the opportunity to work with small and medium enterprises within the Amazon Marketplace and work closely with them to support them in their strategic growth.","department_cost_center":null,"description_short":"More than 300 million customers shop in Amazon’s store, and every day, customers browse, purchase, and review products sold by third-party sellers right alongside products sold by Amazon. Since 2000, Amazon","display_distance":null,"id":"1bfe4f9e-1d0d-4457-bc86-a92d2df490e0","id_icims":"3183581","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Account Management","job_function_id":null,"job_path":"/en/jobs/3183581/customer-success-manager-us-rbs-strategic-account-services","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"PNNT\",\"TBL5\",\"BLR23\",\"TBI4\",\"BLR37\",\"BLR2\",\"TBA5\",\"UBL94\",\"KSZ6\",\"TBC4\",\"TBK1\",\"UBEB\",\"UBLH\",\"PNB8\",\"KSRF\",\"PBLC\",\"PMMZ\",\"TBI6\",\"TBQ1\",\"TBA7\",\"TBL3\",\"BLR264\",\"BLR21\",\"PMYH\",\"TBU8\",\"PBLL\",\"UBL4\",\"TBT4\",\"HBB93\",\"TBF3\",\"UBL92\",\"UBRH\",\"HKR5\",\"TBH2\",\"TBA9\",\"PBLJ\",\"TBH9\",\"TBQ5\",\"PMOJ\",\"BLR56\",\"UBLF\",\"KSRH\",\"HBRA\",\"TBI2\",\"TBF7\",\"SBLY\",\"PMQG\",\"TBF1\",\"TBI8\",\"BLX6\",\"PKHU\",\"HKR3\",\"UMYH\",\"IRDS\",\"PMYL\",\"TBN6\",\"IPCU\",\"TBU6\",\"PMYF\",\"HBL8\",\"PNB6\",\"TBC2\",\"BLR18\",\"TBL1\",\"PNBE\",\"TBJ8\",\"BLR252\",\"TBL7\",\"TBA3\",\"TBU1\",\"IRDF\",\"TBK7\",\"BLT5\",\"TBH6\",\"TBM4\",\"PNB3\",\"LBL1\",\"PNJ1\",\"UMYI\",\"PMQC\",\"IRXG\",\"TBH7\",\"BLR14\",\"IRDE\",\"TBT9\",\"TBJ1\",\"LKA2\",\"PNSJ\",\"PMMW\",\"PISK\",\"TBK5\",\"BLR13\",\"PMYK\",\"TBH8\",\"TBU2\",\"PMQA\",\"PBL2\",\"TBF9\",\"TBC9\",\"UMYJ\",\"KERO\",\"IPCV\",\"TBI7\",\"UBRN\",\"TBI1\",\"TBN4\",\"HKR4\",\"HBL9\",\"BLR39\",\"TBA4\",\"TBJ6\",\"UBRM\",\"TBN5\",\"PICL\",\"TBS8\",\"PMYJ\",\"PNBG\",\"BLR1\",\"TBF8\",\"PMQB\",\"PNBS\",\"PBA2\",\"TBH1\",\"UBL91\",\"TBV1\",\"TBF2\",\"TBQ3\",\"KSRG\",\"PMOI\",\"TBK6\",\"TBT8\",\"PNBY\",\"BLR260\",\"TBA6\",\"TBC3\",\"PMTV\",\"BLR22\",\"TBF4\",\"TBJ9\",\"PMYG\",\"TBQ2\",\"TBI5\",\"UBEC\",\"TBU7\",\"BLR253\",\"PNBD\",\"TBC1\",\"TBI3\",\"TBQ4\",\"TBL6\",\"TBK2\",\"PMOK\",\"TBJ7\",\"KSZ5\",\"UBL1\",\"TBU5\",\"TBF6\",\"BLR38\",\"TBH3\",\"BLR34\",\"PBLD\",\"PMQL\",\"TBM1\",\"WBLA\",\"BNG91\",\"PMMR\",\"TBV2\",\"TBK4\",\"KSRI\",\"MBL1\",\"IPCI\",\"UBRO\",\"PNNU\",\"PMYI\",\"TBU3\",\"PNB9\",\"BLR255\",\"TBC5\",\"TBJ5\",\"TBU9\",\"BLR12\",\"TBL4\",\"BLR31\",\"TBM3\",\"TBN7\",\"LKA1\",\"TBJ2\",\"UBO8\",\"UBL40\",\"SBLU\",\"HNR1\",\"HKR1\",\"TBC8\",\"PNBK\",\"PMNZ\",\"HKA2\",\"TBA1\",\"TBJ3\",\"TBJ4\",\"TBK8\",\"BLR27\",\"PMML\",\"KJM45\",\"TBA2\",\"TBI9\",\"TBH5\",\"HKR2\",\"PNO2\",\"UMYG\",\"QRRA\",\"TBL2\",\"TBP1\",\"YAM91\",\"BLR254\",\"BLR26\",\"TBC6\",\"BLRS\",\"IRDN\",\"TBL8\",\"UMYF\",\"HBE4\",\"BLR11\",\"UMYL\",\"TBH4\",\"TBL9\",\"PNB7\",\"TBA8\",\"TBU4\",\"BLR55\",\"TBF5\",\"TBQ6\",\"PBLB\",\"PBLH\",\"TBK3\",\"PMSD\",\"TBM2\",\"TBK9\",\"BNG92\",\"UBLG\",\"HKA3\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"February 18, 2026","preferred_qualifications":"- Experience analyzing key open issues and resolution metrics for each of the managed accounts\u003cbr/\u003e- Experience in relationship management within technology, start-ups, or SaaS Platforms\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"retail.team-avs","source_system":"JobCreator","state":"KA","title":"Customer Success Manager, US, RBS - Strategic Account Services","university_job":null,"updated_time":"35 minutes","url_next_step":"https://account.amazon.com/jobs/3183581/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-avs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of sales or account management experience\u003cbr/\u003e- 2+ years of digital advertising and client facing roles experience\u003cbr/\u003e- Experience with Excel\u003cbr/\u003e- Experience analyzing data and best practices to assess performance drivers","business_category":"retail","city":"Bengaluru","company_name":"ADCI - BLR 14 SEZ - F07","country_code":"IND","description":"More than 300 million customers shop in Amazon’s store, and every day, customers browse, purchase, and review products sold by third-party sellers right alongside products sold by Amazon. Since 2000, Amazon has offered this remote shelf space to individuals and companies of all sizes, helping them reach hundreds of millions of customers, build their brands, and grow their business. Fast-forward to the present day, and these third-party seller products account for more than half of all units sold in our store.\u003cbr/\u003e\u003cbr/\u003eAs a Customer Success Manager (CSM) you would be a part of Strategic Account Services (SAS) Team of Retail Business Services, you will have the exciting opportunity to help shape and deliver on a strategy for managing Amazon Seller Partners.\u003cbr/\u003e\u003cbr/\u003eThe SAS Program helps small and medium-sized businesses on Amazon. Our team of consultants provides strategic advice with a data-driven, collaborative and customer-focused approach. Our consultants focus on topics like Portfolio Optimization, Product Presentation, Advertising Strategy, Promotions, Fulfillment Strategy, and Brand Building. As a strategic business consultant, you will advise a portfolio of businesses and help them grow fast by mastering the fundamentals of selling on Amazon. Your objective is to support Selling Partners to drive their business growth and program satisfaction by working backwards from their individual targets and developing a roadmap together with your Selling Partners. In addition, you use your analytical know-how to proactively identify untapped potential of each Selling Partner.\u003cbr/\u003e\u003cbr/\u003eGiven the early stage of this program, you will have the opportunity to take ownership in various projects, help evolve the program and develop expertise in a focused topic area. You will also closely collaborate with Amazon colleagues based in USA.\u003cbr/\u003e\u003cbr/\u003eRegular shift timing for this role would be 4 PM to 1 AM IST.\u003cbr/\u003e\u003cbr/\u003eAbout Amazon\u003cbr/\u003eAmazon strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online. By giving customers more of what they want - low prices, vast selection, and convenience – Amazon continues to grow and evolve as a world-class e-commerce platform. Amazon's evolution from website to e-commerce partner to development platform is driven by the spirit of innovation that is part of the company's DNA.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Manage a portfolio of Sellers to drive sustainable revenue growth, based on a solid understanding of marketplace programs, tools and processes.\u003cbr/\u003e\u003cbr/\u003e• Analyze customer data on the efficiency of listings, selection, supply chain, advertising, and deals and provide strategic recommendations to maximize the sellers’ potential.\u003cbr/\u003e\u003cbr/\u003e• Implement and track metrics for recording the success and quality of the sellers in your Seller portfolio. Use key metrics to guide your work and uncover hidden areas of opportunity.\u003cbr/\u003e\u003cbr/\u003e• Build and execute on a joint business plan that delivers on key business opportunities and relevant KPIs for the sellers and Amazon.\u003cbr/\u003e\u003cbr/\u003e• Conduct deep dive analysis on seller issues and publish recommendations and action plans based on data to improve seller experience.\u003cbr/\u003e\u003cbr/\u003e• Success will be measured by the performance of your sellers on input metrics and impact on creating a great customer \u0026 seller experience.\u003cbr/\u003e\u003cbr/\u003e• Develop a thorough understanding of the Amazon Marketplace ecosystem. Manage additional projects around our newly launched Paid Service, which includes process improvements, tool and content development, competitive analysis, and sales analysis.\u003cbr/\u003e\u003cbr/\u003e• Conduct regular WBRs, MBRs with the sellers, highlight business metric performance and building action plans.\u003cbr/\u003e\u003cbr/\u003eRegular shift timing for this role would be 4 PM to 1 AM IST.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e• We fill the gap for sellers by providing consultative services as Amazon experts. Internally, we collaborate with a fabulous team across USA to develop our SAS program as we deliver it.\u003cbr/\u003e\u003cbr/\u003e• As a Customer Success Manager we work with smaller, younger, and more innovative businesses that sell on Amazon. We provide sellers with consulting on various aspects that contribute to faster growth on Amazon, including support with their supply chain, merchandising, selection \u0026 conversion and analytics.\u003cbr/\u003e\u003cbr/\u003e• As a Customer Success Manager, you will have the opportunity to work with small and medium enterprises within the Amazon Marketplace and work closely with them to support them in their strategic growth.","department_cost_center":null,"description_short":"More than 300 million customers shop in Amazon’s store, and every day, customers browse, purchase, and review products sold by third-party sellers right alongside products sold by Amazon. Since 2000, Amazon","display_distance":null,"id":"f270f28f-44b8-45f0-9c94-8e40bded2990","id_icims":"3183722","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Account Management","job_function_id":null,"job_path":"/en/jobs/3183722/customer-success-manager-us-rbs-strategic-account-services","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR14\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"February 18, 2026","preferred_qualifications":"- Experience analyzing key open issues and resolution metrics for each of the managed accounts\u003cbr/\u003e- Experience in relationship management within technology, start-ups, or SaaS Platforms\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"retail.team-avs","source_system":"JobCreator","state":"KA","title":"Customer Success Manager, US, RBS - Strategic Account Services","university_job":null,"updated_time":"36 minutes","url_next_step":"https://account.amazon.com/jobs/3183722/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-avs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}