{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 3+ years of non-internship professional software development testing experience\u003cbr/\u003e- 3+ years of test automation frameworks and tools building experience\u003cbr/\u003e- Experience programming with at least one modern language such as Java, C++, or C# including object-oriented design\u003cbr/\u003e- Experience in penetration testing and exploitability-focused vulnerability assessment\u003cbr/\u003e- Experience in platform-level security mitigations and hardening for Linux and Windows","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"We are looking for SDET II engineers with experience in supporting mission-critical applications, who are excited about building solutions that enhance automation, stability, and release processes across multiple systems. You will work closely with engineering teams to identify and address common issues, drive solutions, and improve overall release quality and reliability. This role requires hands-on engagement, troubleshooting, and automation development. You will work within the Leo Software Release Management team, managing release processes and automation to maintain a seamless and efficient pipeline. The team operates an on-call support rotation, and you will be responsible for maintaining release quality and pipeline health. Your work will directly impact Leo's ability to deliver high-quality, reliable releases efficiently.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThis role sits at the intersection of test automation, CI/CD, release engineering, and operational reliability. \u003cbr/\u003e\u003cbr/\u003e1. CI/CD Pipeline Ownership \u0026 Stability\u003cbr/\u003e- Own the daily build, test, and release pipelines end to end\u003cbr/\u003e- Monitor pipeline health, stability, and performance\u003cbr/\u003e- Diagnose and resolve pipeline failures (build, test, infra, dependency issues)\u003cbr/\u003e- Reduce flaky tests and nondeterministic failures\u003cbr/\u003e- Improve pipeline speed, reliability, and signal-to-noise ratio\u003cbr/\u003e\u003cbr/\u003e2. Release Engineering \u0026 Software Delivery\u003cbr/\u003e- Manage software build and release activities across environments\u003cbr/\u003e- Track releases, validate readiness, and enforce quality gates\u003cbr/\u003e- Support complex, multi-stage release processes\u003cbr/\u003e- Ensure releases meet quality, compliance, and reliability standards\u003cbr/\u003e- Partner with Dev, QA, and Ops during releases and hotfixes\u003cbr/\u003e\u003cbr/\u003e3. Test Automation at Scale\u003cbr/\u003e- Design, implement, and maintain automated test frameworks (API, integration, system, end-to-end)\u003cbr/\u003e- Integrate automated tests seamlessly into CI/CD pipelines\u003cbr/\u003e- Ensure test coverage aligns with risk, not just code coverage\u003cbr/\u003e- Build tooling to improve test execution efficiency and observability\u003cbr/\u003e\u003cbr/\u003e4. Operational Support \u0026 Incident Response\u003cbr/\u003e- Respond to pipeline, release, and production-impacting issues\u003cbr/\u003e- Participate in triage, on-call rotations, and incident resolution\u003cbr/\u003e- Debug high-complexity failures across code, infrastructure, and environments\u003cbr/\u003e- Drive root cause analysis (RCA) and preventative fixes\u003cbr/\u003e\u003cbr/\u003e5. Reliability \u0026 Continuous Improvement\u003cbr/\u003e- Create automated solutions to improve reliability, scalability, and efficiency\u003cbr/\u003e- Identify systemic issues and eliminate manual processes\u003cbr/\u003e- Introduce metrics, dashboards, and alerts for build/test/release health\u003cbr/\u003e- Champion best practices in testing, automation, and release management\u003cbr/\u003e\u003cbr/\u003e6. Technical Leadership \u0026 Collaboration (Senior-Level Expectation)\u003cbr/\u003e- Influence architecture and design for testability and reliability\u003cbr/\u003e- Mentor junior engineers on automation and CI/CD practices\u003cbr/\u003e- Partner closely with DevOps, Platform, and Infrastructure teams\u003cbr/\u003e- Drive standards and long-term quality strategy\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAn SDET II works closely with development, QA, and DevOps teams to ensure the reliability and quality of daily builds, automated tests, and release pipelines. They spend much of their time monitoring CI/CD pipelines, troubleshooting build and test failures, supporting software releases, and improving test automation and operational tooling. This role is hands-on and execution-focused, with opportunities to grow toward technical ownership and leadership.\u003cbr/\u003e\u003cbr/\u003eOn a typical day, you will:\u003cbr/\u003e- Monitor daily builds, automated test runs, and CI/CD pipeline health\u003cbr/\u003e- Investigate and resolve build, test, and pipeline failures\u003cbr/\u003e- Support software build and release activities across environments\u003cbr/\u003e- Participate in issue triage and help resolve operational or release-blocking issues\u003cbr/\u003e- Analyze failures, identify root causes, and implement fixes to prevent recurrence\u003cbr/\u003e- Develop, maintain, and improve automated test solutions integrated into pipelines\u003cbr/\u003e- Work with developers and DevOps engineers to improve testability, reliability, and release efficiency\u003cbr/\u003e- Contribute to documentation, dashboards, and metrics for build and release tracking\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe ANCHOR team (Automated Navigation and Control of Releases) is focused on streamlining and standardizing the release process. This team manages releases for all Payload LRUs, including Ground LRUs, ensuring consistent release quality, pipeline health, and process efficiency. The team’s charter includes creating release automation, documenting changes, tracking versioned releases, and supporting the transition to a common versionset structure as a long-term strategy. ANCHOR operates autonomously, focused on improving time-to-release, automation reliability, and release transparency.","department_cost_center":null,"description_short":"We are looking for SDET II engineers with experience in supporting mission-critical applications, who are excited about building solutions that enhance automation, stability, and release processes across","display_distance":null,"id":"b81de674-6a63-44d1-abc6-607b080e1792","id_icims":"3151418","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3151418/software-dev-engineer-in-test-ii-leo-anchor","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA114\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":[],"posted_date":"January  3, 2026","preferred_qualifications":"- Knowledge of software development lifecycle, including design, development, test, build, deployment processes and timelines\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Redmond - 143,700.00 - 194,400.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Software Dev Engineer in Test II, Leo Anchor","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3151418/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- Knowledge of Excel at an intermediate level (e.g., pivot tables \u0026 charts, multiple criteria lookups, nested logical/IF formulas, data cleansing, array formulas, etc.)\u003cbr/\u003e- Experience managing large data sets and utilizing to drive performance and process improvements","business_category":"transportation-and-logistics","city":"Nashville","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Transportation Services is pioneering new products, services, and technologies within our transportation network. We are building a platform and capability to ensure that our carrier partners are successful and our customer’s freight, no matter how large or small, is delivered as quickly, accurately, and cost effectively as possible. To meet this goal, we are continually striving to innovate and provide best in class service levels.\u003cbr/\u003e  \u003cbr/\u003eMiddle Mile Partner Manager team is seeking a Carrier Execution Specialist to help develop a world class logistics process that delivers goods on time at the best cost. The person in this role will work on high-level strategy and design, as well as implementation. This job will require problem solving, basic mathematics, communication, and customer service skills. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tCollaborate on the development and delivery of key programs, metrics, reports, analyses, and dashboards to drive key business decisions across customer-facing programs.\u003cbr/\u003e•\tIdentify, coach, and track Middle Mile carrier performance for Amazon’s Transportation Services (ATS) network carrier base.\u003cbr/\u003e•\tPartner with teams to identify and drive process improvements that improve carrier performance, on time, acceptance, and other key KPIs.\u003cbr/\u003e•\tPull data from numerous databases (using Excel, Access, SQL and/or other data management systems).\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Transportation Services is pioneering new products, services, and technologies within our transportation network. We are building a platform and capability to ensure that our carrier partners are","display_distance":null,"id":"162b04b7-6ca9-44f4-a3ed-dd8e9b0c93e2","id_icims":"3151292","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3151292/carrier-execution-specialist-middle-mile-partner-management-mmpm","job_schedule_type":"full-time","location":"US, TN, Nashville","locations":["{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Nashville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Nashville\",\"coordinates\":\"36.16792,-86.77798\",\"normalizedCountyName\":\"Davidson\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Nashville, Tennessee, USA\",\"location\":\"US, TN, Nashville\",\"region\":\"TN\",\"buildingCodeList\":[\"BNA12\"],\"normalizedCityName\":\"Nashville\"}"],"normalized_location":"Nashville, Tennessee, USA","optional_search_labels":["hourly"],"posted_date":"January  2, 2026","preferred_qualifications":"- 1+ years of program management, logistics, operations, supply chain, transportation, or equivalent experience\u003cbr/\u003e- 1+ years of management experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Experience with SQL\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TN, Nashville - 22.00 - 29.00 USD hourly","primary_search_label":"transportation-and-logistics.team-na-operations","source_system":"JobCreator","state":"TN","title":"Carrier Execution Specialist, Middle Mile Partner Management (MMPM)","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3151292/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-na-operations","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- University student studying Electrical Engineering / Computer Engineering / Computer Science / or similar (BSc)\u003cbr/\u003e- Available to work 2-3 days weekly\u003cbr/\u003e- Proficiency in at least 1 software programming language","business_category":"aws","city":"Haifa","company_name":"Annapurna Labs Ltd.","country_code":"ISR","description":"AWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS. Within AWS UC, Amazon Dedicated Cloud (ADC) roles engage with AWS customers who require specialized security solutions for their cloud services.\u003cbr/\u003e\u003cbr/\u003eAnnapurna Labs as part of AWS, is looking for talented Students to help us develop the semiconductor platform which is based on revolutionary architecture.\u003cbr/\u003e\u003cbr/\u003eFor further information we invite you to watch these re:Invent keynotes:\u003cbr/\u003e2021 \u003ca href=\"https://youtu.be/9NEQbFLtDmg?t=2234\"\u003ehttps://youtu.be/9NEQbFLtDmg?t=2234\u003c/a\u003e\u003cbr/\u003e2022 \u003ca href=\"https://www.youtube.com/watch?v=R11YgBEZzqE\"\u003ehttps://www.youtube.com/watch?v=R11YgBEZzqE\u003c/a\u003e\u003cbr/\u003e\u003cbr/\u003e*To apply: please submit your CV \u0026 grades sheet combined into 1 PDF*\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003eEarly Career Talent\u003cbr/\u003eWhen you join Amazon Web Services as a student or recent graduate, you’ll have the chance for your voice to be heard and amplified. That’s because our teams are looking to learn as much from you as you’ll learn from them. Whether you’re graduating with a high school or equivalent diploma, associate degree, bachelor’s degree, MBA, or PhD, we offer a range of early career opportunities across the globe.","department_cost_center":null,"description_short":"AWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product","display_distance":null,"id":"a8825665-554d-424a-b989-35bda72f9664","id_icims":"3113281","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3113281/software-embedded-student","job_schedule_type":"part-time","location":"IL, Haifa","locations":["{\"normalizedStateName\":\"Haifa\",\"normalizedCountryCode\":\"ISR\",\"city\":\"Haifa\",\"countryIso3a\":\"ISR\",\"countryIso2a\":\"IL\",\"locationNonStemming\":\"Israel, Haifa\",\"coordinates\":\"32.80123,35.00326\",\"normalizedCountyName\":\"Haifa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Israel\",\"normalizedLocation\":\"Haifa, Haifa, ISR\",\"location\":\"IL, Haifa\",\"region\":\"\",\"buildingCodeList\":[\"HFA18A\"],\"normalizedCityName\":\"Haifa\"}"],"normalized_location":"Haifa, Haifa, ISR","optional_search_labels":["aws.team-israel-optional","aws.team-aws-region-israel-optional","aws.team-se-israel-optional","aws.team-annapurna-labs","aws.team-sde-sdm"],"posted_date":"October 22, 2025","preferred_qualifications":"- Speak, write, and read fluently in English\u003cbr/\u003e- 1.5 years remaining until graduation\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":null,"title":"Software Embedded Student ","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3113281/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- * Bachelor's Degree in Mechanical Engineering\u003cbr/\u003e- * 5+ years of hands-on experience with ATE testers and ATC handlers\u003cbr/\u003e- * Demonstrated expertise in complex problem solving across thermal, electrical, and mechanical domains\u003cbr/\u003e- * Strong project management and stakeholder communication skills\u003cbr/\u003e- Leadership Competencies:\u003cbr/\u003e- * Demonstrated ability to influence without direct authority\u003cbr/\u003e- * Strong track record of delivering results in complex technical environments\u003cbr/\u003e- * Excellence in cross-functional collaboration and stakeholder management\u003cbr/\u003e- * Proven ability to develop and mentor team members","business_category":"aws","city":"Taipei","company_name":"Amazon Web Services Taiwan Limited - C71","country_code":"TWN","description":"We are seeking an experienced Senior Equipment Engineer to join our team in Taiwan. This role will provide technical leadership for automated test equipment (ATE) operations at our OSAT partners, driving excellence in test cell qualification and problem resolution.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Lead and execute new test cell qualification and bring-up activities at OSAT partners\u003cbr/\u003e* Serve as the primary technical escalation point for complex issues at OSAT facilities\u003cbr/\u003e* Drive resolution of sophisticated setup challenges involving thermal, electrical, and mechanical systems\u003cbr/\u003e* Conduct comprehensive technical audits at OSAT partners to ensure compliance with quality standards\u003cbr/\u003e* Develop and deliver technical training programs for new team members and OSAT partners\u003cbr/\u003e* Review and approve test cell configurations for production release\u003cbr/\u003e* Partner with cross-functional teams to optimize test cell performance and reliability\u003cbr/\u003e* Lead continuous improvement initiatives for test cell efficiency and yield\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003e\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.","department_cost_center":null,"description_short":"We are seeking an experienced Senior Equipment Engineer to join our team in Taiwan. This role will provide technical leadership for automated test equipment (ATE) operations at our OSAT partners, driving","display_distance":null,"id":"278e744d-73f5-47aa-95be-46234b28ddfe","id_icims":"3069847","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/3069847/senior-equipment-engineer-annapurna-labs","job_schedule_type":"full-time","location":"TW, TPE, Taipei","locations":["{\"normalizedCountryCode\":\"TWN\",\"city\":\"Taipei\",\"countryIso3a\":\"TWN\",\"countryIso2a\":\"TW\",\"locationNonStemming\":\"Taiwan, TPE, Taipei\",\"coordinates\":\"25.03737,121.56355\",\"normalizedCountyName\":\"Taipei City\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Taiwan\",\"normalizedLocation\":\"Taipei City, TWN\",\"location\":\"TW, TPE, Taipei\",\"region\":\"TPE\",\"buildingCodeList\":[\"TPE12\",\"TPE15\",\"TPE11\",\"TPE16\",\"TPE14\",\"TPE13\",\"TPE17\",\"TPE70\"],\"normalizedCityName\":\"Taipei City\"}","{\"normalizedCountryCode\":\"TWN\",\"city\":\"Hsinchu City\",\"countryIso3a\":\"TWN\",\"countryIso2a\":\"TW\",\"locationNonStemming\":\"Taiwan, TPE, Hsinchu City\",\"coordinates\":\"24.80619,120.96893\",\"normalizedCountyName\":\"Hsinchu City\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Taiwan\",\"normalizedLocation\":\"Hsinchu City, TWN\",\"location\":\"TW, TPE, Hsinchu City\",\"region\":\"TPE\",\"buildingCodeList\":[\"HSZ1\"],\"normalizedCityName\":\"Hsinchu City\"}"],"normalized_location":"Taipei City, TWN","optional_search_labels":[],"posted_date":"August 31, 2025","preferred_qualifications":"- * Knowledge in electrical engineering at practical engineer level is a significant advantage\u003cbr/\u003e- * Experience with semiconductor test and handling equipment\u003cbr/\u003e- * Track record of leading technical teams or mentoring junior engineers\u003cbr/\u003e- * Strong analytical and data-driven decision-making skills\u003cbr/\u003e- * Excellent communication skills in English; Mandarin proficiency highly desired\u003cbr/\u003e- * Experience working with OSAT partners in Asia\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-hardware-development-primary","source_system":"JobCreator","state":"TPE","title":"Senior Equipment Engineer, Annapurna Labs","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3069847/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-hardware-development-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of technical infrastructure management experience\u003cbr/\u003e- Knowledge of best practices and emerging technologies, related to infrastructure (i.e. network, data center, hardware, software)\u003cbr/\u003e- Experience with varying scenarios of infrastructure builds\u003cbr/\u003e- 3+ years of project management disciplines including scope, schedule, budget, quality, along with risk and critical path management experience","business_category":"aws","city":"Atlanta","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Application deadline: Feb 28, 2026\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services is looking for an Infrastructure Technical Program Manager to support and deploy one of the world’s largest and most complex telecommunication networks. The role is responsible for the execution of a strategic plan to improve the business processes and deployment of hyper-scaled cloud infrastructure, , pre/post-inspections for design validation, creation of quality control system and piloting stakeholder communication for delivery schedules. This opportunity is within the Global Connectivity Infrastructure Delivery - Fiber Deployment organization, which is responsible for program management, quality and delivery of fiber capacity for the physical network solutions that drive Amazon’s internal infrastructure and connect our services to the world. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eProgram management skills to monitor vendor delivery of physical infrastructure projects. Technical skills of either fiber optic outside plant, process engineering, construction \u0026 engineer vendor management or quality control systems are required. \u003cbr/\u003e\u003cbr/\u003eKey Responsibilities Include:\u003cbr/\u003e· Reports to the GCID-FD Deployment Manager, and updates regularly with Global Senior management. \u003cbr/\u003e· Serve as a key member of the GCID-FD team helping to drive overall Network Infrastructure strategy.\u003cbr/\u003e· Vendor management to deploy on time, measure progress, and rate through quality Key performance Indicators.\u003cbr/\u003e· Develop a focused quality management program that tracks defects, mitigates risks, standardizes root cause analysis, and implements key performance measures to rate vendor success. \u003cbr/\u003e· Establish and utilize reporting mechanisms and provide regular progress updates on program deployment to management and stakeholders.\u003cbr/\u003e· Periodically report on the overall network development program status across the assigned region.\u003cbr/\u003e· Manage and track approved network plans with internal customers and stakeholders such as technical business developers or construction vendors until the infrastructure is in service.\u003cbr/\u003e· Manage multiple competing cross-functional projects/programs simultaneously, some on a global scale.\u003cbr/\u003e· Interact with engineers, technicians, vendors and senior management on a daily basis\u003cbr/\u003e· Audit completed construction work, review fiber test results, and hand-off completed delivery to internal customers\u003cbr/\u003e· Run meetings, create and maintain timelines, and keep large, diverse groups informed of progress and obstacles.\u003cbr/\u003e· Anticipate bottlenecks, manage risk and escalations, and balance the business needs versus technical constraints. \u003cbr/\u003e· Coordinate access and approvals to security-regulated sites\u003cbr/\u003e25-40% Travel\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, to inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"1ba293a2-c767-4f68-bff8-eef265acdeda","id_icims":"3172499","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Tech Infrastructure Prgrm Mgmt","job_function_id":null,"job_path":"/en/jobs/3172499/infrastructure-technical-program-manager-global-connectivity-infrastructure-delivery-long-haul-fiber-deployment-gcid-fd","job_schedule_type":"full-time","location":"US, GA, Atlanta","locations":["{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Atlanta\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Atlanta\",\"coordinates\":\"33.74831,-84.39111\",\"normalizedCountyName\":\"Fulton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Atlanta, Georgia, USA\",\"location\":\"US, GA, Atlanta\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL11\"],\"normalizedCityName\":\"Atlanta\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}"],"normalized_location":"Atlanta, Georgia, USA","optional_search_labels":["aws.team-ais","aws.team-neteng"],"posted_date":"February  3, 2026","preferred_qualifications":"- Experience with AutoCAD and/or Building Information Modeling (BIM), as well as scheduling software (Primavera, MS Project, or similar)\u003cbr/\u003e- Experience with reporting and Data Visualization tools such as Quick Sight / Tableau / Power BI or other BI packages\u003cbr/\u003e- Experience in scripting for automation (e.g. Python) and advanced SQL skills.\u003cbr/\u003e- Has led multiple large greenfield network construction programs preferably backbone/longhaul.\u003cbr/\u003e- Has an understanding of OSP and ISP construction standards in multiple regions.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Denver - 127,100.00 - 171,900.00 USD annually\u003cbr/\u003eUSA, GA, Atlanta - 127,100.00 - 171,900.00 USD annually","primary_search_label":"aws.team-program-management-primary","source_system":"JobCreator","state":"GA","title":"Infrastructure Technical Program Manager, Global Connectivity Infrastructure Delivery - Long Haul Fiber Deployment, GCID-FD","university_job":null,"updated_time":"about 3 hours","url_next_step":"https://account.amazon.com/jobs/3172499/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-program-management-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 7+ years of consulting, design and implementation of serverless distributed solutions experience\u003cbr/\u003e- Bachelor's degree in business administration, finance, economics, computer science, data science, engineering, or other related field, or 7+ years of professional or military experience\u003cbr/\u003e- 3+ years of software development experience\u003cbr/\u003e- Experience leading the design, development and deployment of business software at scale or recent hands-on technology infrastructure, network, compute, storage, and virtualization experience\u003cbr/\u003e- Current, active US Government Security Clearance of Top Secret or above","business_category":"aws","city":"Arlington","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Application deadline: Feb 27, 2026\u003cbr/\u003e\u003cbr/\u003eThis position requires that the candidate selected be a US Citizen and obtain and maintain an active TS/SCI security clearance.\u003cbr/\u003e\u003cbr/\u003eThe Amazon Web Services Professional Services (ProServe) team is seeking a skilled Delivery Consultant to join our team at Amazon Web Services (AWS). In this role, you'll work closely with customers to design, implement, and manage AWS solutions that meet their technical requirements and business objectives. You'll be a key player in driving customer success through their cloud journey, providing technical expertise and best practices throughout the project lifecycle. Possessing a deep understanding of AWS products and services, as a Delivery Consultant you will be proficient in architecting complex, scalable, and secure solutions tailored to meet the specific needs of each customer. You’ll work closely with stakeholders to gather requirements, assess current infrastructure, and propose effective migration strategies to AWS. As trusted advisors to our customers, providing guidance on industry trends, emerging technologies, and innovative solutions, you will be responsible for leading the implementation process, ensuring adherence to best practices, optimizing performance, and managing risks throughout the project. \u003cbr/\u003e \u003cbr/\u003eThe AWS Professional Services organization is a global team of experts that help customers realize their desired business outcomes when using the AWS Cloud. We work together with customer teams and the AWS Partner Network (APN) to execute enterprise cloud computing initiatives. Our team provides assistance through a collection of offerings which help customers achieve specific outcomes related to enterprise cloud adoption. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries.\u003cbr/\u003e\u003cbr/\u003eIt is expected to work from one of the above locations (or customer sites) at least 1+ days in a week. This is not a remote position. You are expected to be in the office or with customers as needed.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs an experienced technology professional, you will be responsible for: \u003cbr/\u003e-Designing and implementing complex, scalable, and secure AWS solutions tailored to customer needs\u003cbr/\u003e-Providing technical guidance and troubleshooting support throughout project delivery\u003cbr/\u003e-Collaborating with stakeholders to gather requirements and propose effective migration strategies\u003cbr/\u003e-Acting as a trusted advisor to customers on industry trends and emerging technologies\u003cbr/\u003e-Sharing knowledge within the organization through mentoring, training, and creating reusable artifacts\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences - AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job below, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS? - Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture - Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth - We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance - We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e","department_cost_center":null,"description_short":"This position requires that the candidate selected be a US Citizen and obtain and maintain an active TS/SCI security clearance.The Amazon Web Services Professional Services (ProServe) team is seeking a","display_distance":null,"id":"08712e66-fa3c-4346-a3b2-ad6a9a29565b","id_icims":"3171976","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Professional Services","job_function_id":null,"job_path":"/en/jobs/3171976/sr-delivery-consultant-wwps-professional-services","job_schedule_type":"full-time","location":"US, VA, Arlington","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS17\"],\"normalizedCityName\":\"Arlington\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA33\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD21\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Arlington, Virginia, USA","optional_search_labels":[],"posted_date":"February  2, 2026","preferred_qualifications":"- 7+ years experience in infrastructure architecture, database architecture and networking\u003cbr/\u003e- Experience in technology/software sales consulting or equivalent skills\u003cbr/\u003e- Professional experience architecting/deploying/operating solutions built on AWS\u003cbr/\u003e- Experience working within software development or internet-related industries\u003cbr/\u003e- Experience migrating or transforming legacy customer solutions to the cloud\u003cbr/\u003e- Experience managing highly available data center operations with responsibility for infrastructure robustness, including networking, server hardware and storage\u003cbr/\u003e- Understanding of Federal Government application, server, and network security requirements such as ICD 503, FISMA and FedRAMP\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Denver - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, VA, Arlington - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, VA, Herndon - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 153,600.00 - 207,800.00 USD annually","primary_search_label":"aws.team-us-security-clearance-jobs-primary","source_system":"JobCreator","state":"VA","title":"Sr. Delivery Consultant, WWPS Professional Services","university_job":null,"updated_time":"about 3 hours","url_next_step":"https://account.amazon.com/jobs/3171976/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-us-security-clearance-jobs-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience defining, refining and implementing sales processes, procedures and policies or equivalent\u003cbr/\u003e- Experience conducting sophisticated and creative analysis of complex data and translate the results into actionable deliverables, messages, and presentations\u003cbr/\u003e- 5+ years of sales operations or equivalent experience","business_category":"aws","city":"Seattle","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Application deadline: Feb 27, 2026\u003cbr/\u003e\u003cbr/\u003eThe WW AGS Account Planning Lead leads the development and execution of AWS's global account and territory planning processes. This role operates with full ownership of strategic direction, establishing standardized planning processes that maintain global consistency while adapting to diverse sales organizations across geographies and business units. The position requires independent judgment in creating frameworks and solutions in undefined spaces, implementing emerging technologies including Generative AI, and translating customer planning insights into actionable strategies that drive business decisions and resource investments across AWS's global sales organization.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tEvergreen Account Planning Transformation: Lead the VP-level initiative to transform account planning from an annual artifact into a continuously updated orchestration hub \u003cbr/\u003e•\tTechnology Integration: Evaluate and implement emerging technologies, including Generative AI and automated workflows, to enhance planning processes while maintaining data security and quality standards\u003cbr/\u003e•\tCross-Functional Collaboration: Maintain deep collaboration with Strategy, Finance, Partner, Specialist, Services, and GTM teams to translate customer planning insights into actionable solution strategies and enablement plans\u003cbr/\u003e•\tProcess Standardization: Create and maintain organizational standards for planning processes used by thousands of sales professionals globally, ensuring continuity of sales execution\u003cbr/\u003e•\tAnalytics and Insights: Collaborate with the IDEAS team to create analytical tools (such as Plan Pulse) that enable business teams, central operations, and support overlay teams to identify high-value opportunities and strategically deploy resources\u003cbr/\u003e•\tLeadership Influence: Directly influence OL4/OL5 leadership decisions through data-driven insights and strategic recommendations\u003cbr/\u003e•\tQuality Benchmarking: Develop planning quality benchmarks affecting AWS top-billers and highly strategic customers\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Amazon Web Services (AWS) Global Sales Operations (GSO) team is building the future of sales. We operate with a startup mentality, build mechanisms that scale, and innovate solutions on behalf of our global AWS customers. Our team is responsible for supporting the rapidly growing business, serving Sales Leaders to Solution Architects and everything in between. We are obsessed with delivering results for AWS customers and supporting our sales organization to shape the direction of the business and allow our sales organization to reach customers efficiently. We are a diverse, innovative team that loves translating data, insights, and anecdotes into action.\u003cbr/\u003e\u003cbr/\u003eAbout AWS\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e \u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e \u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e \u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e \u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. ","department_cost_center":null,"description_short":"The WW AGS Account Planning Lead leads the development and execution of AWS's global account and territory planning processes. This role operates with full ownership of strategic direction, establishing","display_distance":null,"id":"fa731723-3f50-40b9-9aef-816025aadbca","id_icims":"3172105","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Sales Operations Job Family","job_function_id":null,"job_path":"/en/jobs/3172105/ww-ags-account-planning-lead-aws-global-sales-planning-team","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS11\"],\"normalizedCityName\":\"Austin\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA44\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK27\"],\"normalizedCityName\":\"New York\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"Illinois\",\"normalizedCountryCode\":\"USA\",\"city\":\"Chicago\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, IL, Chicago\",\"coordinates\":\"41.88425,-87.63245\",\"normalizedCountyName\":\"Cook\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Chicago, Illinois, USA\",\"location\":\"US, IL, Chicago\",\"region\":\"IL\",\"buildingCodeList\":[\"ORD11\"],\"normalizedCityName\":\"Chicago\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Dallas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Dallas\",\"coordinates\":\"32.77823,-96.7951\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Dallas, Texas, USA\",\"location\":\"US, TX, Dallas\",\"region\":\"TX\",\"buildingCodeList\":[\"DFW11\"],\"normalizedCityName\":\"Dallas\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February  2, 2026","preferred_qualifications":"- Experience presenting to senior leadership\u003cbr/\u003e- Experience developing and implementing systems/tools utilized for CRM, variable compensation, revenue reporting, forecasting, Salesforce automation, etc.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Denver - 133,900.00 - 181,200.00 USD annually\u003cbr/\u003eUSA, IL, Chicago - 133,900.00 - 181,200.00 USD annually\u003cbr/\u003eUSA, NY, New York - 147,300.00 - 199,300.00 USD annually\u003cbr/\u003eUSA, TX, Austin - 133,900.00 - 181,200.00 USD annually\u003cbr/\u003eUSA, TX, Dallas - 133,900.00 - 181,200.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 133,900.00 - 181,200.00 USD annually","primary_search_label":"aws.team-sales-primary","source_system":"JobCreator","state":"WA","title":"WW AGS Account Planning Lead, AWS Global Sales Planning Team","university_job":null,"updated_time":"about 3 hours","url_next_step":"https://account.amazon.com/jobs/3172105/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sales-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 8+ years of specific technology domain areas (e.g. software development, cloud computing, systems engineering, infrastructure, security, networking, data \u0026 analytics) experience\u003cbr/\u003e- 3+ years of design, implementation, or consulting in applications and infrastructures experience\u003cbr/\u003e- 10+ years of IT development or implementation/consulting in the software or Internet industries experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- 5+ years of computer networking experience","business_category":"aws","city":"New York","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Application deadline: Feb 27, 2026\u003cbr/\u003e\u003cbr/\u003eAWS Global Sales drives adoption of the AWS cloud worldwide, enabling customers of all sizes to innovate and expand in the cloud. Our team empowers every customer to grow by providing tailored service, unmatched technology, and unwavering support. We dive deep to understand each customer's unique challenges, then craft innovative solutions that accelerate their success. This customer-first approach is how we built the world's most adopted cloud. Join us and help us grow.\u003cbr/\u003e\u003cbr/\u003eDo you want to accelerate enterprise transformation through architecting high performant, highly available networking solutions on AWS? As a Senior Networking SA specializing in Enterprise, Core, and Cloud Networking, you'll work on the most challenging cloud networking solutions for our customers.\u003cbr/\u003e\u003cbr/\u003eYou'll connect directly with AWS product teams and experts around the globe to scale best practices and invent the future of cloud network architecture. In this role, you'll leverage your deep technical expertise to guide customers through complex network architectures, share best practices publicly through blog posts and speaking opportunities, and advocate for customers with product teams to shape the future of cloud networking. As AI, high performance computing, and mission critical workloads increase, you'll design the future of performant, reliable connectivity across regions, offices, and devices.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Design end-to-end networking solutions for customers, focusing on high performance, scalability, and reliability while applying your deep knowledge of enterprise, core, and cloud networking principles.\u003cbr/\u003e- Partner with AWS product teams to advocate for customer needs, influence future product roadmaps, and ensure networking services meet evolving enterprise requirements.\u003cbr/\u003e- Create technical content including reference architectures, blog posts, and whitepapers that demonstrate networking best practices and are easily adopted by others.\u003cbr/\u003e- Lead complex technical projects requiring participation from multiple teams, providing architectural guidance throughout the implementation lifecycle.\u003cbr/\u003e- Proactively identify gaps in current networking products and services, translating customer feedback into clear business and technical requirements for product teams.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs the subject matter expert in networking, you'll start your day reviewing complex customer architectures and preparing for deep-dive technical discussions. You might spend the morning guiding customers through network design considerations for a multi-region deployment, then collaborate with product teams in the afternoon to address specific customer needs. You'll share best practices through blog posts and speaking opportunities, becoming a trusted voice in cloud networking. Throughout the day, you'll advocate for customers with product teams, helping shape the future of AWS networking capabilities.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.","department_cost_center":null,"description_short":"AWS Global Sales drives adoption of the AWS cloud worldwide, enabling customers of all sizes to innovate and expand in the cloud. Our team empowers every customer to grow by providing tailored service,","display_distance":null,"id":"0b9ba1cd-b9ba-454e-a34b-1ec5d52b8937","id_icims":"3165976","is_intern":null,"is_manager":null,"job_category":"Solutions Architect","job_family":"Solution Architect","job_function_id":null,"job_path":"/en/jobs/3165976/senior-networking-sa-aws-security-networking-north-america","job_schedule_type":"full-time","location":"US, NY, New York","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA44\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Atlanta\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Atlanta\",\"coordinates\":\"33.74831,-84.39111\",\"normalizedCountyName\":\"Fulton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Atlanta, Georgia, USA\",\"location\":\"US, GA, Atlanta\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL11\"],\"normalizedCityName\":\"Atlanta\"}","{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK27\"],\"normalizedCityName\":\"New York\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Francisco\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Francisco\",\"coordinates\":\"37.77702,-122.41956\",\"normalizedCountyName\":\"San Francisco\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Francisco, California, USA\",\"location\":\"US, CA, San Francisco\",\"region\":\"CA\",\"buildingCodeList\":[\"SFO28\"],\"normalizedCityName\":\"San Francisco\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Dallas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Dallas\",\"coordinates\":\"32.77823,-96.7951\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Dallas, Texas, USA\",\"location\":\"US, TX, Dallas\",\"region\":\"TX\",\"buildingCodeList\":[\"DFW15\"],\"normalizedCityName\":\"Dallas\"}"],"normalized_location":"New York, New York, USA","optional_search_labels":[],"posted_date":"January 23, 2026","preferred_qualifications":"- 5+ years of infrastructure architecture, database architecture and networking experience\u003cbr/\u003e- Knowledge of AWS services, market segments, customer base and industry verticals\u003cbr/\u003e- Knowledge of cloud architecture\u003cbr/\u003e- Experience in written and verbal communication with the ability to present complex technical information in a clear and concise manner to executives and non-technical leaders\u003cbr/\u003e- Hands-on technical expertise in building scripts, tools, or methodologies that enhance customers' solutions\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, San Francisco - 176,600.00 - 239,000.00 USD annually\u003cbr/\u003eUSA, CO, Denver - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, GA, Atlanta - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, NY, New York - 169,000.00 - 228,600.00 USD annually\u003cbr/\u003eUSA, TX, Dallas - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 153,600.00 - 207,800.00 USD annually","primary_search_label":"aws.team-solutions-architect-primary","source_system":"JobCreator","state":"NY","title":"Senior Networking SA, AWS Security \u0026 Networking - North America","university_job":null,"updated_time":"about 3 hours","url_next_step":"https://account.amazon.com/jobs/3165976/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-solutions-architect-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in project/program management, Inventory Control, Quality Assurance, or Lean Six Sigma\u003cbr/\u003e- Experience building strategic relationships with stakeholders, including communicating and collaborating across teams and functions\u003cbr/\u003e- Experience creating reports, interpreting metrics and driving overall insights or analysis\u003cbr/\u003e- Bachelor's degree in Construction Management, Electrical, Mechanical, Civil Engineering, or a similar technical discipline\u003cbr/\u003e- Knowledge of Microsoft Office Suite (Excel, Word, SharePoint, and PowerPoint)","business_category":"aws","city":"Denver","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Application deadline: Feb 27, 2026\u003cbr/\u003e\u003cbr/\u003eThe Global Quality Tech Manager plays an essential role in AWS Data Center Capacity Delivery's (DCCD) Global Build Quality (GBQ) Program. This position is responsible for overseeing quality assurance and control (QAQC) processes through governance and programmatic control throughout the lifecycle of data center design, development, construction and retrofit, ensuring that all work meets AWS's high standards for quality, safety, and performance.\u003cbr/\u003eAs part of the GBQ Program, this role supports the drive toward global standardization, unified measurement frameworks, and systematic quality improvements across the Data Center Capacity Delivery ecosystem. The Global Quality Tech Manager will help address critical challenges including construction rework and commissioning delays by implementing consistent quality control mechanisms and leveraging collective learnings and best practices at scale. This position provides comprehensive quality oversight and governance from design through operations handoff, with initial focus on construction and commissioning phases and planned expansion through post-completion support periods.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eDevelop, publish, and maintain global quality assurance and control standards, policies, frameworks, and procedures that govern data center construction projects across all AWS regions.\u003cbr/\u003eEstablish and enforce global quality control plan templates, inspection checklists for manufacturing and on-site work, acceptance criteria, and standardized documentation requirements.\u003cbr/\u003eDefine global quality metrics and Key Performance Indicators (KPIs) to measure and benchmark quality performance across all regions and projects.\u003cbr/\u003eCreate and maintain a global quality management system (QMS) that ensures consistency and compliance across all project phases—from design through operations handoff and post-completion support periods.\u003cbr/\u003eDevelop standardized design review criteria focused on ease of construction, long-term maintenance, and quality assurance measures applicable to all global projects.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.","department_cost_center":null,"description_short":"The Global Quality Tech Manager plays an essential role in AWS Data Center Capacity Delivery's (DCCD) Global Build Quality (GBQ) Program. This position is responsible for overseeing quality assurance and","display_distance":null,"id":"bca4ef5c-5d72-4e87-8807-d9d79dedc9c3","id_icims":"3179896","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Infrastructure Eng","job_function_id":null,"job_path":"/en/jobs/3179896/global-quality-tech-manager-global-build-quality-program","job_schedule_type":"full-time","location":"US, CO, Denver","locations":["{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Dallas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Dallas\",\"coordinates\":\"32.77823,-96.7951\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Dallas, Texas, USA\",\"location\":\"US, TX, Dallas\",\"region\":\"TX\",\"buildingCodeList\":[\"DFW11\"],\"normalizedCityName\":\"Dallas\"}"],"normalized_location":"Denver, Colorado, USA","optional_search_labels":["aws.team-ais"],"posted_date":"February 12, 2026","preferred_qualifications":"- Knowledge of databases (querying and analyzing) such as SQL, MYSQL, and ETL Manager and working with large data sets\u003cbr/\u003e- Experience in auditing, risk management, compliance, program management, or quality management systems\u003cbr/\u003e- Six Sigma Green Belt, or Six Sigma Black Belt certification\u003cbr/\u003e- Project Management Professional (PMP) or equivalent certification\u003cbr/\u003e- Experience in project management in data centers or comparable critical infrastructure\u003cbr/\u003e- ASQ certification (Certified Quality Manager or Certified Quality Engineer).\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Denver - 116,800.00 - 160,000.00 USD annually\u003cbr/\u003eUSA, TX, Dallas - 116,800.00 - 160,000.00 USD annually","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"CO","title":"Global Quality Tech Manager, Global Build Quality Program","university_job":null,"updated_time":"about 3 hours","url_next_step":"https://account.amazon.com/jobs/3179896/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Knowledge of best practices and emerging technologies, related to infrastructure (i.e. network, data center, hardware, software)\u003cbr/\u003e- 3+ years of technical infrastructure management experience, 5+ years telecommunications industry experience in procurement and negotiations\u003cbr/\u003e- Experience with varying scenarios of infrastructure builds","business_category":"aws","city":"Herndon","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Application deadline: Feb 28, 2026\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support AWS data centers to ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services is looking for a Technical Business Developer to support and deploy one of the world’s largest and most complex telecommunication networks. The role is responsible for the planning and execution of strategic initiatives to support Amazon Dedicated Cloud infrastructure and to improve the business processes and deployment of hyperscaled cloud infrastructure, creation of a quality control system for our Global Dedicated Cloud, pre/post-inspections for design validation, and stakeholder communication for delivery schedules. This opportunity is within the Global Connectivity Infrastructure Delivery - Fiber Deployment organization, which is responsible for project management, quality and delivery of fiber capacity for the physical network solutions that drive Amazon’s internal infrastructure and connect our services to the world.\u003cbr/\u003e\u003cbr/\u003eThis individual will actively drive commercial vendor strategy, working with existing vendors, new vendors, as well as the AWS service teams and internal customers to build and design a portfolio of network infrastructure solutions.  This role requires collaboration, driving strategic initiatives and executing commercial deals across our network geography. By applying a unique blend of business and technology experience, you will work closely with both internal teams and external suppliers to find creative, cost effective, and often innovative solutions to meet Amazon's ongoing growth and expansion needs worldwide.\u003cbr/\u003e\u003cbr/\u003eYou will be responsible for managing the cost, supply and strategic development of Amazon’s physical network infrastructure. You are experienced in network development (network expansion and network investment programs), financial investment analysis and business cases, legal/contracting for telecoms services and have regulatory awareness. Additionally, you will have knowledge of optical transport technologies, backbone network engineering design principles, and you will have expert knowledge of network infrastructure providers. This role requires extensive collaboration, driving strategic market facing initiatives, creating long-term supply plans to meet our demand, and delivering year-on-year cost savings. You will actively drive infrastructure solutions, working with Backbone Network Planners, suppliers, technology partners, and networking teams to meet our customers’ demands.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eStrategic Leadership \u0026 Program Management\u003cbr/\u003e•\tProvide regular updates to Senior management\u003cbr/\u003e•\tServe as a key member of the team driving overall Network Infrastructure strategy\u003cbr/\u003e•\tManage multiple competing cross-functional projects/programs simultaneously, some on a global scale\u003cbr/\u003e•\tPeriodical reports on overall network development program status\u003cbr/\u003e\u003cbr/\u003eVendor \u0026 Supplier Management\u003cbr/\u003e•\tManage vendors to ensure on-time deployment, measure progress, and evaluate performance through quality Key Performance Indicators\u003cbr/\u003e•\tIdentify vendors and develop commercial solutions for wavelengths, dark fiber, and other network infrastructure capacity\u003cbr/\u003e•\tNegotiate key vendor contracts from business and technical perspectives in partnership with AWS legal teams\u003cbr/\u003e•\tOwn all elements of supplier management including pricing, billing, and service level availability compliance\u003cbr/\u003e•\tWork with suppliers to verify and gain supply in response to forecast demand and network topology plans\u003cbr/\u003e\u003cbr/\u003eNetwork Planning \u0026 Development\u003cbr/\u003e•\tWork closely with service owners and internal customers to understand product roadmaps and devise programs to meet capacity requirements\u003cbr/\u003e•\tDevelop strategic backbone and metro supply plans for short, medium, and long-term needs (leased capacity, fiber pairs, new cable builds)\u003cbr/\u003e•\tCollaboratively develop network infrastructure execution plans involving leased wavelengths, dark fiber, and submarine cable capacity/builds\u003cbr/\u003e•\tParticipate in strategic network topology planning for global backbone and metro networks\u003cbr/\u003e\u003cbr/\u003eFinancial \u0026 Compliance Management\u003cbr/\u003e•\tWork closely with finance partners on budget creation, business case development, deal analysis, and supplier invoicing\u003cbr/\u003e•\tCreate and standardize reporting mechanisms and provide regular progress updates\u003cbr/\u003e•\tTrack and maintain information on telecom market trends, vendor technologies, coverage, cost, and deal structures\u003cbr/\u003e•\tWork with Amazon Legal and Public Policy teams to ensure compliance with local telecom regulations and identify opportunities to improve operating models\u003cbr/\u003e•\tManage costs and provide financial updates\u003cbr/\u003e\u003cbr/\u003eOperational Excellence\u003cbr/\u003e•\tRun meetings, create and maintain timelines, and keep large, diverse groups informed of progress and obstacles\u003cbr/\u003e•\tAnticipate bottlenecks, manage risk and escalations, and balance business needs versus technical constraints\u003cbr/\u003e•\tInteract with engineers, technicians, vendors, and senior management daily\u003cbr/\u003e\u003cbr/\u003eThis role oversees deployment of infrastructure, and iterative procedural changes. This includes travel to the field, generation of weekly reports, and updating standards and specifications for a global deployment team. This position requires onsite visits to physical locations and is not a full-time remote job. Physical inspections and learning the technical standards for outside and inside fiber plant is required.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Global Infrastructure Fiber Deployment team is the premier cloud infrastructure delivery organization, drawing on a wide variety of skills and backgrounds from telecommunications, civil engineering, fiber characterization and network planning backgrounds. The team constructs and delivers bleeding edge hyperscale networks across the North and South American regions.\u003cbr/\u003e\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empowers us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support AWS data centers","display_distance":null,"id":"5288df9a-3e44-4b4e-95dc-8939b32a5eed","id_icims":"3127929","is_intern":null,"is_manager":null,"job_category":"Business \u0026 Merchant Development","job_family":"Infra Business Dev - Tech","job_function_id":null,"job_path":"/en/jobs/3127929/technical-business-developer-adc-network-development","job_schedule_type":"full-time","location":"US, VA, Herndon","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA29\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD28\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Herndon, Virginia, USA","optional_search_labels":["aws.team-ais","aws.team-neteng"],"posted_date":"November 18, 2025","preferred_qualifications":"- Experience working in a network planning, network construction/implementation, or commercial implementation role at an ISP, telecoms operator, or Hyperscaler\u003cbr/\u003e- Experience in regularly interacting with senior management on matters concerning several areas, divisions, and/or customers\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eThe base salary range for this position is listed below. For salaried roles, your Amazon package will include listed sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003ca href=\"https://amazon.jobs/en/benefits/us-benefits-and-stock\"\u003ehttps://amazon.jobs/en/benefits/us-benefits-and-stock\u003c/a\u003e.\u003cbr\u003e\u003cbr\u003eColorado $92,400 - $160,000 annually\u003cbr\u003eNational $83,100 - $177,800 annually","primary_search_label":"aws.team-business-development-primary","source_system":"JobCreator","state":"VA","title":"Technical Business Developer, ADC Network Development","university_job":null,"updated_time":"about 3 hours","url_next_step":"https://account.amazon.com/jobs/3127929/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-business-development-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}