{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Bachelor's degree in computer science, electrical engineering, automation engineering, or equivalent, or 4+ years of PLC programming or automation engineering experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- 2+ years of process or production environment related PLC-controlled automation and issue diagnosis experience\u003cbr/\u003e- 2+ years of robotics work cells and control systems experience\u003cbr/\u003e- 2+ years of Siemens, Allen-Bradley or Codesys Ladder Logic and structure programming experience\u003cbr/\u003e- 2+ years of electrical theory, robotics, controls components, and automated equipment experience\u003cbr/\u003e- Experience with a Computerized Maintenance Management System (CMMS)","business_category":"operations","city":"Lebanon","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Operations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every day. The Reliability \u0026 Maintenance Engineering (RME) team are the business partners that work tirelessly behind the scenes to make it happen. We drive continuous improvement, and maintain all of the robotics and material handling equipment (MHE) to ensure our customers are met with the Amazon smile. Come join us on our journey! \u003cbr/\u003e \u003cbr/\u003eAbout the Role: \u003cbr/\u003eAs a Senior Automation Engineer, you will play a crucial role in maximizing equipment reliability and operational performance in our fulfillment centers by providing proactive controls automation and technical support. Your expertise will be essential in troubleshooting complex control systems, analyzing performance metrics, and driving continuous improvement initiatives. You'll mentor junior engineers and lead cross-functional teams to optimize material handling equipment (MHE) systems, implement innovative projects, and develop system design improvements to enhance site throughput. You'll work with state-of-the-art technology, including conveyors, sortation systems, scanners, cameras, print and apply systems, and SCADA devices and programs. Through your technical leadership and design optimization efforts, you'll directly contribute to ensuring our customers receive their orders with Amazon's signature speed and accuracy while building team capabilities and driving operational excellence. \u003cbr/\u003e \u003cbr/\u003eWhat Do We Offer? \u003cbr/\u003eAmazon offers competitive compensation packages including comprehensive healthcare benefits starting on Day 1, matching 401(k) program, and up to 20 weeks of paid parental leave. But wait, there’s more: We provide lightweight fire-resistant daily wear and composite toe safety shoes for your safety! \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities include, but are not limited to: \u003cbr/\u003e- Apply Subject Matter Expertise (SME) on troubleshooting and dive deeps for engineering issues, supporting automation engineers to investigate the root cause and planning actions to eliminate/mitigate the downtime of critical assets  \u003cbr/\u003e- Collaborate with building Operations, Operations Engineering teams, FC Start-up Team, AFT Software teams, ACES team, and Safety to support MHE systems optimization and project implementation \u003cbr/\u003e- Understand, maintain and troubleshoot material handling control systems, including PLC/PC controllers and industrial networks such as Ethernet, ControlNet, DeviceNet, Profibus, motor control systems, servo drives, frequency drives, and electrical distribution systems \u003cbr/\u003e- Monitor MHE metrics and partner with maintenance/operations to address system performance issues and provide analysis across all operations \u003cbr/\u003e- Provide escalation support to automation engineers, during and after business hours, troubleshooting locally and remotely, to ensure that all hardware or controls software within the building is repaired on time \u003cbr/\u003e- Appropriately escalate downtime situations to vendors or leadership for support to restore equipment operation. \u003cbr/\u003e- Facilitate Failure Analysis and Incident Review processes to drive continuous improvement  \u003cbr/\u003e- Perform and analyze building System Assessments to enhance material handling system performance  \u003cbr/\u003e- Communicate technical issues and project timelines clearly to senior leadership, operations staff and maintenance teams\u003cbr/\u003e- Move up to 49lbs as well as stand and walk during shifts lasting up to 12 hours, with or without reasonable accommodation  \u003cbr/\u003e- Climb ladders and gangways safely and without limitation \u003cbr/\u003e- Regular bending, lifting, stretching, and reaching both below the waist and above the head  \u003cbr/\u003e- Engage in full manual dexterity in both hands and wrists ","department_cost_center":null,"description_short":"Operations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every","display_distance":null,"id":"2f62673c-326a-4cee-b027-11421ba60ee5","id_icims":"3136805","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3136805/senior-automation-engineer-rme","job_schedule_type":"full-time","location":"US, TN, Lebanon","locations":["{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Lebanon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Lebanon\",\"coordinates\":\"36.20786,-86.28952\",\"normalizedCountyName\":\"Wilson\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Lebanon, Tennessee, USA\",\"location\":\"US, TN, Lebanon\",\"region\":\"TN\",\"buildingCodeList\":[\"DTN8\",\"BNA1\",\"BNA2\",\"BNA8\",\"MQY9\",\"MQY2\"],\"normalizedCityName\":\"Lebanon\"}"],"normalized_location":"Lebanon, Tennessee, USA","optional_search_labels":[],"posted_date":"December  3, 2025","preferred_qualifications":"- Experience acting in a team lead capacity, supporting, training, and mentoring less experienced automation engineering professionals\u003cbr/\u003e- Experience identifying, maintaining, troubleshooting, and modifying Motor Controls including motor starters, Variable Frequency Drives, DC drives, and standard electrical components\u003cbr/\u003e- Hands-on industrial electrical experience, including 480V 3-phase, 110 VAC, and 24VDC systems\u003cbr/\u003e- Experience interpreting, modifying, and developing mechanical and electrical drawings\u003cbr/\u003e- Experience identifying, maintaining, and utilizing SCADA systems and KPIs\u003cbr/\u003e- Experience with programming software such as RSLogix5000, Studio 5000, FT View, and other controls software platforms\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TN, LEBANON - 114,000.00 - 148,200.00 USD annually\u003cbr/\u003eUSA, TN, Lebanon - 102,600.00 - 133,400.00 USD annually","primary_search_label":"operations.team-reliability-maintenance-engineering","source_system":"JobCreator","state":"TN","title":"Senior Automation Engineer, RME","university_job":null,"updated_time":"23 minutes","url_next_step":"https://account.amazon.com/jobs/3136805/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-reliability-maintenance-engineering","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience with programming languages such as Python, Java, C++\u003cbr/\u003e- Experience with machine learning (ML) tools and methods\u003cbr/\u003e- Experience with one of the following areas: machine learning technologies, Reinforcement Learning, Deep Learning, Computer Vision, Natural Language Processing (NLP) or related applications\u003cbr/\u003e- 5+ years of practical machine learning experience\u003cbr/\u003e- Experience in development or technical support, or experience with training and deploying machine learning systems to solve large-scale optimizations\u003cbr/\u003e- Experience driving collaborative projects from conception to delivery\u003cbr/\u003e- MS or PhD in Computer Science, Engineering, Machine Learning, Statistics, Biostatistics, or related quantitative field","business_category":"no-business-category","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Innovators wanted! Are you an entrepreneur? A builder? A dreamer? This role is part of an Amazon Special Projects team that takes the company’s Think Big leadership principle to the limits. If you’re interested in innovating at scale to address big challenges in the world, this is the team for you.\u003cbr/\u003e\u003cbr/\u003eAs a Senior Applied Scientist on our team, you will focus on building state-of-the-art ML models for healthcare. Our team rewards curiosity while maintaining a laser-focus in bringing products to market. Competitive candidates are responsive, flexible, and able to succeed within an open, collaborative, entrepreneurial, startup-like environment. At the forefront of both academic and applied research in this product area, you have the opportunity to work together with a diverse and talented team of scientists, engineers, and product managers and collaborate with other teams. This role offers a unique opportunity to work on projects that could fundamentally transform healthcare outcomes.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eIn this role, you will:\u003cbr/\u003e• Design and implement novel AI/ML solutions for complex healthcare challenges \u003cbr/\u003e• Drive advancements in machine learning and data science\u003cbr/\u003e• Balance theoretical knowledge with practical implementation\u003cbr/\u003e• Work closely with customers and partners to understand their requirements\u003cbr/\u003e• Navigate ambiguity and create clarity in early-stage product development \u003cbr/\u003e• Collaborate with cross-functional teams while fostering innovation in a collaborative work environment to deliver impactful solutions \u003cbr/\u003e• Establish best practices for ML experimentation, evaluation, development and deployment \u003cbr/\u003e• Partner with leadership to define roadmap and strategic initiatives\u003cbr/\u003e\u003cbr/\u003eYou’ll need a strong background in AI/ML, proven leadership skills, and the ability to translate complex concepts into actionable plans. You’ll also need to effectively translate research findings into practical solutions. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou will solve real-world problems by getting and analyzing large amounts of data, generate insights and opportunities, design simulations and experiments, and develop statistical and ML models. The team is driven by business needs, which requires collaboration with other Scientists, Engineers, and Product Managers across the Special Projects organization. You will prepare written and verbal presentations to share insights to audiences of varying levels of technical sophistication.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe represent Amazon's ambitious vision to solve the world's most pressing challenges. We are exploring new approaches to enhance research practices in the healthcare space, leveraging Amazon's scale and technological expertise. We operate with the agility of a startup while backed by Amazon's resources and operational excellence. We're looking for builders who are excited about working on ambitious, undefined problems and are comfortable with ambiguity.","department_cost_center":null,"description_short":"Innovators wanted! Are you an entrepreneur? A builder? A dreamer? This role is part of an Amazon Special Projects team that takes the company’s Think Big leadership principle to the limits. If you’re interested","display_distance":null,"id":"8e2c644f-5967-41df-884a-b5779301a483","id_icims":"3131181","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3131181/senior-applied-scientist-special-projects","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA77\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["amazon.artificial-intelligence","amazon-entertainment.prime-video-applied-science","operations.team-data-science","alexa-and-amazon-devices.team-machine-learning-and-science-job-family","advertising.team-applied-science","ats.team-science"],"posted_date":"November 22, 2025","preferred_qualifications":"- Experience using English communication skills, both written and verbal, to foster seamless interaction with stakeholders at all levels\u003cbr/\u003e- Experience communicating complex ideas to technical and non-technical audiences\u003cbr/\u003e- Experience collaborating with cross-functional teams including Marketing, Product Management, Customer Service, Operations, Legal, Finance, and Senior Leadership\u003cbr/\u003e- Experience in deep learning models for healthcare\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 167,100.00 - 226,100.00 USD annually","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"WA","title":"Senior Applied Scientist, Special Projects","university_job":null,"updated_time":"35 minutes","url_next_step":"https://account.amazon.com/jobs/3131181/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of data querying languages (e.g. SQL), scripting languages (e.g. Python) or statistical/mathematical software (e.g. R, SAS, Matlab, etc.) experience\u003cbr/\u003e- 3+ years of data scientist experience\u003cbr/\u003e- 3+ years of machine learning/statistical modeling data analysis tools and techniques, and parameters that affect their performance experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Experience applying theoretical models in an applied environment","business_category":"operations","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Are you seeking an environment where you can drive innovation? Do you want to apply inference, advanced statistical modeling and techniques to solve world's most challenging problems in? Do you want to play a crucial role in the future of Amazon's Retail business? Do you want to be a part of a journey that develops a new technology from scratch for answering critical business question in Amazon Retail?\u003cbr/\u003e\u003cbr/\u003eEvery time an Amazon customer makes a purchase, a number of systems are involved: these systems help optimize  acquisition, enable a number of purchase options, ensure great , store products so they are available for fast delivery, and minimize package frustration. The Technology (SCOT) Group develops and manages these systems. We are central to Amazon customers' ability to find what they want and get it when they want it.\u003cbr/\u003e\u003cbr/\u003eThe Consumer Instock Value (CIV) team within Amazon's Supply Chain Optimization Technology (SCOT) Group develops and manages systems that estimate the long-term impact of inventory availability and delivery speed changes at the product level. Our estimates are crucial inputs for multiple production systems across Amazon's supply chain planning, helping teams make critical decisions about inventory management, selection, and placement. \u003cbr/\u003e\u003cbr/\u003eKey responsibilities of a Data Scientist in CIV Team include:\u003cbr/\u003e - Developing new statistical, causal, and machine learning techniques and develop solution prototypes to drive innovation\u003cbr/\u003e - Working with technical and non-technical customers to design model improvements and communicate results\u003cbr/\u003e - Collaborating with our dedicated software team to create production implementations for large-scale data analysis\u003cbr/\u003e - Developing an understanding of key business metrics / KPIs and providing clear, compelling analysis that shapes the direction of our business\u003cbr/\u003e - Presenting research results to our internal research community\u003cbr/\u003e - Leading training and informational sessions on our science and capabilities\u003cbr/\u003e - Your contributions will be seen and recognized broadly within Amazon, contributing to the Amazon research corpus and patent portfolio.","department_cost_center":null,"description_short":"Are you seeking an environment where you can drive innovation? Do you want to apply inference, advanced statistical modeling and techniques to solve world's most challenging problems in? Do you want to","display_distance":null,"id":"975d8cfc-7147-4fe4-9900-6bc93aed1854","id_icims":"3039609","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Science","job_function_id":null,"job_path":"/en/jobs/3039609/data-scientist-scot-forecasting-and-labs-civ-team","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA104\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"July 21, 2025","preferred_qualifications":"- Experience in Python, Perl, or another scripting language\u003cbr/\u003e- Experience in a ML or data scientist role with a large technology company\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $125,500/year in our lowest geographic market up to $212,800/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"operations.team-supply-chain-optimization","source_system":"JobCreator","state":"WA","title":"Data Scientist, SCOT Forecasting and Labs - CIV Team","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3039609/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-supply-chain-optimization","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"retail","city":"Vancouver","company_name":"Amazon.com.ca, ULC","country_code":"CAN","description":"Join our Amazon Private Brands Selection Guidance organization in building science and tech solutions at scale to delight our customers with products across our leading private brands such as Amazon Basics, Amazon Essentials, and by Amazon.\u003cbr/\u003e\u003cbr/\u003eThe Selection Guidance team applies Generative AI, Machine Learning, Statistics, and Economics solutions to drive our private brands product assortment, strategic business decisions, and product inputs such as title, price, merchandising and ordering. We are an interdisciplinary team of Software Engineers, Scientists, Economists, and Product Managers incubating and building day one solutions using novel technology, to solve some of the toughest business problems at Amazon.\u003cbr/\u003e\u003cbr/\u003eAs a Software Development Engineer on the team, you will drive improvements to our technology, collaborating with economists and scientists and highly-engaged users to ship code continuously. We’re truly an agile shop: we work closely with users, deliver features with high frequency, can pivot on a dime when needed, and are passionate about test coverage, refactoring, and paying off technical debt. We are looking for software development leaders who share our vision for continuously improving the customer experience, who are motivated by challenging problems in distributed systems, algorithms and who love writing great code. \u003cbr/\u003e\u003cbr/\u003eThis is a unique, high visibility opportunity for someone who wants to develop at the intersection of AI and software with direct business and customer impact. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* You will solve a breadth of technical problems at global scale\u003cbr/\u003e* You will contribute to technical strategies, vision, and architecture\u003cbr/\u003e* You will have the opportunity to influence quantitative algorithms used (e.g. machine learning, reinforcement learning, large language models) to make recommendations\u003cbr/\u003e* You will design and build software to train models in collaboration with applied science\u003cbr/\u003e* You will design and build software that serves model output to other services and user interfaces to review and interact with model suggestions\u003cbr/\u003e* You will be heavily involved with design and product teams to understand needs, propose features, create early prototypes and transform them into exciting end consumer features\u003cbr/\u003e* Write clean, maintainable code and perform peer code-reviews\u003cbr/\u003e* Deep-dive into client or server systems to optimize for performance, maintainability, scalability, extensibility as needed\u003cbr/\u003e* Propose innovative tools, frameworks, automations and processes that are used by the entire team for development\u003cbr/\u003e* Mentor team members to promote engineering excellence","department_cost_center":null,"description_short":"Join our Amazon Private Brands Selection Guidance organization in building science and tech solutions at scale to delight our customers with products across our leading private brands such as Amazon Basics,","display_distance":null,"id":"9664a008-9217-4260-bfca-3e5d9050dbbf","id_icims":"3159731","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3159731/software-development-engineer-amazon-private-brands","job_schedule_type":"full-time","location":"CA, BC, Vancouver","locations":["{\"normalizedStateName\":\"British Columbia\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Vancouver\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, BC, Vancouver\",\"coordinates\":\"49.26038,-123.11336\",\"normalizedCountyName\":\"Metro Vancouver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Vancouver, British Columbia, CAN\",\"location\":\"CA, BC, Vancouver\",\"region\":\"BC\",\"buildingCodeList\":[\"YVR14\"],\"normalizedCityName\":\"Vancouver\"}"],"normalized_location":"Vancouver, British Columbia, CAN","optional_search_labels":[],"posted_date":"January 15, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- Experience with Machine Learning and Large Language Model fundamentals, including architecture, training/inference lifecycles, and optimization of model execution\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(34, 34, 34)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. As a total compensation company, Amazon's package may include other elements such as sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon offers comprehensive benefits including health insurance (medical, dental, vision, prescription, basic life \u0026amp; AD\u0026amp;D insurance), Registered Retirement Savings Plan (RRSP), Deferred Profit Sharing Plan (DPSP), paid time off, and other resources to improve health and well-being. We thank all applicants for their interest, however only those interviewed will be advised as to hiring status.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eCAN, BC, Vancouver - 114,800.00 - 191,800.00 CAD annually","primary_search_label":"retail.team-private-brands","source_system":"JobCreator","state":"BC","title":"Software Development Engineer, Amazon Private Brands","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3159731/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-private-brands","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of account management, project or program management or buying experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Knowledge of Microsoft Access or SQL\u003cbr/\u003e- Experience driving internal cross-team collaboration\u003cbr/\u003e- Experience using data to influence business decisions\u003cbr/\u003e- Experience with business analysis and P\u0026L management","business_category":"north-america-stores","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Be part of the exciting, growing space of Pets at Amazon! Amazon Baby is looking for an entrepreneurial Vendor Manager who will play a critical role managing vendors and categories for the fast-paced Baby category. The Vendor Manager is responsible for managing the full scope of their category and vendor portfolio, driving the topline performance and profitability for their business.\u003cbr/\u003eThey own the end-to-end vendor relationship, from signing new vendors, leading negotiations, managing promotional activities and resolving operational or logistics issues that impact our customer. They will leverage key metrics to develop customer insights to drive innovation, and will leverage these insights to drive vendor participation in marketing, merchandising and promotional activities in order to drive overall business growth. Successful candidates will be highly adept at Earning Trust and demonstrate an ability to influence some of Amazon’s most important partners and vendors, as well as internal cross-functional teams.\u003cbr/\u003eThey are passionate about building relationships, finding creative solutions to challenging blockers presented in the industry, and launching new brands from scratch. They must be excellent problem solvers, great at identifying potential obstacles, implementing quick work-around solutions, and simplifying tasks to scale. The ideal candidate will be an autonomous self-starter, have strong ownership, be comfortable navigating ambiguity with a bias for action, to Deliver Results in a fast paced business environment where prioritizing and multi-tasking are essential.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eCUSTOMER NEEDS\u003cbr/\u003e· Evaluates products and services to continually drive quality of customer experience\u003cbr/\u003e· Aggregates and escalates industry trends, identifies opportunities to differentiate our customer experience from the competition\u003cbr/\u003eSTRATEGY\u003cbr/\u003e· Develops long-term strategies and provides recommendation on business opportunities for multiple sub-categories\u003cbr/\u003e· Develops and implements action plans based on deep-dive analysis of product line metrics\u003cbr/\u003eVENDOR MANAGEMENT\u003cbr/\u003e· Expands current vendor selection and secures new brand selection for multiple subcategories\u003cbr/\u003e· Drives strategic negotiations to deliver top- and bottom-line category growth\u003cbr/\u003e· Builds long-term relationships by creating value, opportunities for growth, customer acquisition, and brand-building for multiple vendors\u003cbr/\u003e· Increases vendor participation through deep knowledge of program opportunities\u003cbr/\u003eBUSINESS OPERATIONS\u003cbr/\u003e· Dives deep into inputs and understands the downstream impact of changes to pricing, selection, and convenience for multiple subcategories.\u003cbr/\u003e· Owns the Retail P\u0026L for multiple subcategories; develops plans that drive revenue and margin improvement for the business\u003cbr/\u003e· Creates strategic and prioritized vendor marketing plan that maximizes margin dollars and customer experience\u003cbr/\u003e· Identifies areas that need vendor attention and directs team to address issues; acts as escalation point, helping team and vendor(s) resolve conflicts","department_cost_center":null,"description_short":"Be part of the exciting, growing space of Pets at Amazon! Amazon Baby is looking for an entrepreneurial Vendor Manager who will play a critical role managing vendors and categories for the fast-paced Baby","display_distance":null,"id":"2500b9cd-d5df-4825-81f3-bf1ad27a55a5","id_icims":"3134984","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Buying/Planning","job_function_id":null,"job_path":"/en/jobs/3134984/sr-vendor-manager-amazon-baby","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS19\"],\"normalizedCityName\":\"Arlington\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA71\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK27\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"December  2, 2025","preferred_qualifications":"- Experience driving direction and alignment with cross-functional teams\u003cbr/\u003e- MBA\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, New York - 133,300.00 - 185,000.00 USD annually\u003cbr/\u003eUSA, VA, Arlington - 121,200.00 - 163,900.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 121,200.00 - 163,900.00 USD annually","primary_search_label":"north-america-stores.consumables","source_system":"JobCreator","state":"WA","title":"Sr. Vendor Manager, Amazon Baby","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3134984/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"consumables","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"retail","city":"Vancouver","company_name":"Amazon Canada Fulfillment Services, ULC","country_code":"CAN","description":"Become a key member of the PBI Supply Chain Tech team that is helping Amazon Private Brands optimize the Amazon supply chain network to drive profitability through data science and code. \u003cbr/\u003eJoin our Private Brand Intelligence (PBI) organization in building Machine Learning solutions at scale. PBI applies Machine Learning, Statistics, and Economics to derive actionable insights about the complex economy of Amazon’s retail business. We also develop statistical models and algorithms to drive strategic business decisions and improve operations. We are an interdisciplinary team of Economists, Engineers, and Scientists incubating and building day one solutions using AI technology, to solve some of the toughest business problems at Amazon.\u003cbr/\u003e\u003cbr/\u003eYou will work with business leaders, scientists, and economists to translate business and functional requirements into concrete deliverables, including the design, development, testing, and deployment of highly scalable distributed services. You will invent and implement scalable ML and econometric models while building tools to help our customers gain and apply insights. This is a unique, high visibility opportunity for someone who wants to have business impact, dive deep into large-scale economic problems, enable measurable actions on the Consumer economy, and work closely with scientists and economists. If you are interested in Machine Learning, large-scale, low-latency distributed systems and can build the software that use these models, this is the role you have been looking for.\u003cbr/\u003e\u003cbr/\u003eWe are a Day 1 team, with a charter to be disruptive through the use of Machine Learning and bridge the Science and Engineering gaps that exist for engineers today. You will start on green field projects working with scientists to bring our models to life as well as the necessary infrastructure that other teams can benefit from. We are an inclusive team, and are looking for Software Development Engineers that aren't averse to learning and building and or optimizing ML models alongside our scientists.\u003cbr/\u003e\u003cbr/\u003eAs a Software Development Engineer on the team, you will drive improvements to our technology, collaborating with economists and scientists and highly-engaged users to ship code continuously. We’re truly an agile shop: we work closely with users, deliver features with high frequency, can pivot on a dime when needed, and are passionate about test coverage, refactoring and paying off technical debt. We are looking for software development leaders who share our vision for continuously improving the customer experience, who are motivated by challenging problems in distributed systems, algorithms and who love writing great code.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* You will solve a breadth of technical problems at global scale\u003cbr/\u003e* You will own systems end-to-end and influence the direction of technology that impacts hundreds of millions customers around the world\u003cbr/\u003e* You will contribute to technical strategies, vision, and architecture\u003cbr/\u003e* You will have the opportunity to influence quantitative algorithms used (e.g. machine learning, reinforcement learning, computer vision) to make recommendations\u003cbr/\u003e* You will design and build software to train models in collaboration with applied science\u003cbr/\u003e* You will be heavily involved with design and product teams to understand needs, propose features, create early prototypes and transform them into exciting end consumer features\u003cbr/\u003e* Write clean, maintainable code and perform peer code-reviews\u003cbr/\u003e* Deep-dive into client or server systems to optimize for performance, maintainability, scalability, extensibility as needed\u003cbr/\u003e* Propose innovative tools, frameworks, automations and processes that are used by the entire team for development\u003cbr/\u003e* Mentor team members to promote engineering excellenc","department_cost_center":null,"description_short":"Become a key member of the PBI Supply Chain Tech team that is helping Amazon Private Brands optimize the Amazon supply chain network to drive profitability through data science and code. Join our Private","display_distance":null,"id":"27cd9b8d-bfa0-4527-bbc6-7f854ee0e3cd","id_icims":"3139914","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3139914/software-development-engineer-pbi-supply-chain-innovation","job_schedule_type":"full-time","location":"CA, BC, Vancouver","locations":["{\"normalizedStateName\":\"British Columbia\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Vancouver\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, BC, Vancouver\",\"coordinates\":\"49.26038,-123.11336\",\"normalizedCountyName\":\"Metro Vancouver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Vancouver, British Columbia, CAN\",\"location\":\"CA, BC, Vancouver\",\"region\":\"BC\",\"buildingCodeList\":[\"YVR14\"],\"normalizedCityName\":\"Vancouver\"}"],"normalized_location":"Vancouver, British Columbia, CAN","optional_search_labels":[],"posted_date":"December  9, 2025","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(34, 34, 34)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. As a total compensation company, Amazon's package may include other elements such as sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon offers comprehensive benefits including health insurance (medical, dental, vision, prescription, basic life \u0026amp; AD\u0026amp;D insurance), Registered Retirement Savings Plan (RRSP), Deferred Profit Sharing Plan (DPSP), paid time off, and other resources to improve health and well-being. We thank all applicants for their interest, however only those interviewed will be advised as to hiring status.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eCAN, BC, Vancouver - 114,800.00 - 191,800.00 CAD annually","primary_search_label":"retail.team-private-brands","source_system":"JobCreator","state":"BC","title":"Software Development Engineer, PBI Supply Chain Innovation","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3139914/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-private-brands","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- Experience owning/driving roadmap strategy and definition\u003cbr/\u003e- Experience with feature delivery and tradeoffs of a product\u003cbr/\u003e- Experience contributing to engineering discussions around technology decisions and strategy related to a product\u003cbr/\u003e- Experience managing technical products or online services\u003cbr/\u003e- Experience in representing and advocating for a variety of critical customers and stakeholders during executive-level prioritization and planning","business_category":"subsidiaries","city":"Madison","company_name":"Zappos.com LLC","country_code":"USA","description":"FaST:P\u0026P (Fashion Subsidiaries Tech: Purchase \u0026 Post) owns the customer experience from cart \u0026 checkout through fulfillment and customer service across Amazon's F2 (Fashion \u0026 Fitness) subsidiaries. To capitalize for our customers, we’re looking for a highly experienced Principal Product Manager with strong customer obsession and business acumen, who will focus on the Cart, Checkout, and Purchase experience. The successful candidate will demonstrate strong analytical capabilities to extract and apply customer insights, think strategically while embracing experimentation, communicate effectively across teams to influence key stakeholders, and consistently deliver results through operational excellence.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Oversee the complete product lifecycle from strategic planning through tactical execution\u003cbr/\u003e• Craft executive communications and present regularly to cross-functional leaders\u003cbr/\u003e• Establish and align on the vision, product strategy, and roadmap that builds upon our current shopping experiences and supporting tools \u003cbr/\u003e• Cultivate and leverage partnerships across Amazon's technology community\u003cbr/\u003e• Define clear, measurable product goals with regular assessment cadence \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur team is intentional about attracting, developing, and retaining amazing talent from diverse backgrounds. Yes we do get to work on really cool services, but we also think a big reason for that is the inclusive and welcoming culture we try to cultivate every day. We’re looking for a new teammate who is enthusiastic, empathetic, curious, motivated, reliable, and able to work effectively with a diverse team of peers; someone who will help us amplify the positive \u0026 inclusive team culture we’ve been building.","department_cost_center":null,"description_short":"FaST:P\u0026P (Fashion Subsidiaries Tech: Purchase \u0026 Post) owns the customer experience from cart \u0026 checkout through fulfillment and customer service across Amazon's F2 (Fashion \u0026 Fitness) subsidiaries. To","display_distance":null,"id":"5d6afd9e-6c5b-4b42-a5d2-e9cda76a98ea","id_icims":"3144382","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Product Management - Technical","job_function_id":null,"job_path":"/en/jobs/3144382/sr-product-manager-tech-fast-fashion-subsidiary-tech","job_schedule_type":"full-time","location":"US, WI, Madison","locations":["{\"normalizedStateName\":\"Wisconsin\",\"normalizedCountryCode\":\"USA\",\"city\":\"Madison\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WI, Madison\",\"coordinates\":\"43.07313,-89.38644\",\"normalizedCountyName\":\"Dane\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Madison, Wisconsin, USA\",\"location\":\"US, WI, Madison\",\"region\":\"WI\",\"buildingCodeList\":[\"MSN4\"],\"normalizedCityName\":\"Madison\"}","{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK94\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"Madison, Wisconsin, USA","optional_search_labels":[],"posted_date":"December 16, 2025","preferred_qualifications":"- Experience in using analytical tools, such as Tableau, Qlikview, QuickSight\u003cbr/\u003e- Experience in building and driving adoption of new tools\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, New York - 166,300.00 - 225,000.00 USD annually\u003cbr/\u003eUSA, WI, Madison - 151,200.00 - 204,600.00 USD annually","primary_search_label":"subsidiaries.team-zappos","source_system":"JobCreator","state":"WI","title":"Sr Product Manager - Tech, FaST (Fashion Subsidiary Tech)","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3144382/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-zappos","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- PhD, or Master's degree and 4+ years of CS, CE, ML or related field experience\u003cbr/\u003e- 3+ years of building models for business application experience\u003cbr/\u003e- Experience programming in Java, C++, Python or related language\u003cbr/\u003e- Experience in any of the following areas: algorithms and data structures, parsing, numerical optimization, data mining, parallel and distributed computing, high-performance computing","business_category":"entertainment","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Prime Video is a first-stop entertainment destination offering customers a vast collection of premium programming in one app available across thousands of devices. Prime members can customize their viewing experience and find their favorite movies, series, documentaries, and live sports – including Amazon MGM Studios-produced series and movies; licensed fan favorites; and programming from Prime Video add-on subscriptions such as Apple TV+, Max, Crunchyroll and MGM+. All customers, regardless of whether they have a Prime membership or not, can rent or buy titles via the Prime Video Store, and can enjoy even more content for free with ads.\u003cbr/\u003e\u003cbr/\u003eAre you interested in shaping the future of entertainment? Prime Video's technology teams are creating best-in-class digital video experience. \u003cbr/\u003e\u003cbr/\u003eAs a Prime Video technologist, you’ll have end-to-end ownership of the product, user experience, design, and technology required to deliver state-of-the-art experiences for our customers. You’ll get to work on projects that are fast-paced, challenging, and varied. You’ll also be able to experiment with new possibilities, take risks, and collaborate with remarkable people. \u003cbr/\u003e\u003cbr/\u003eWe’ll look for you to bring your diverse perspectives, ideas, and skill-sets to make Prime Video even better for our customers. With global opportunities for talented technologists, you can decide where a career Prime Video Tech takes you! \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Develop ML models for various recommendation \u0026 search systems using deep learning, online learning, and optimization methods\u003cbr/\u003e- Work closely with other scientists, engineers and product managers to expand the depth of our product insights with data, create a variety of experiments to determine the high impact projects to include in planning roadmaps\u003cbr/\u003e- Stay up-to-date with advancements and the latest modeling techniques in the field\u003cbr/\u003e- Publish your research findings in top conferences and journals\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe're using advanced approaches such as foundation models to connect information about our videos and customers from a variety of information sources, acquiring and processing data sets on a scale that only a few companies in the world can match. This will enable us to recommend titles effectively, even when we don't have a large behavioral signal (to tackle the cold-start title problem). It will also allow us to find our customer's niche interests, helping them discover groups of titles that they didn't even know existed. We are looking for creative \u0026 customer obsessed machine learning scientists who can apply the latest research, state of the art algorithms and ML to build highly scalable page personalization solutions. You'll be a research leader in the space and a hands-on ML practitioner, guiding and collaborating with talented teams of engineers and scientists and senior leaders in the Prime Video organization. You will also have the opportunity to publish your research at internal and external conferences. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003ePrime Video Recommendation Science team owns science solution to power recommendation and personalization experience on various Prime Video surfaces and devices. We work closely with the engineering teams to launch our solutions in production.","department_cost_center":null,"description_short":"Prime Video is a first-stop entertainment destination offering customers a vast collection of premium programming in one app available across thousands of devices. Prime members can customize their viewing","display_distance":null,"id":"3dd02055-61da-4acf-9047-38bd3bf2d778","id_icims":"3166852","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3166852/applied-scientist-ii-prime-video-personalization-and-discovery-science","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sunnyvale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Sunnyvale\",\"coordinates\":\"37.37188,-122.03751\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sunnyvale, California, USA\",\"location\":\"US, CA, Sunnyvale\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC13\"],\"normalizedCityName\":\"Sunnyvale\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA40\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK24\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"January 26, 2026","preferred_qualifications":"- Experience in professional software development\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Sunnyvale - 171,600.00 - 222,200.00 USD annually\u003cbr/\u003eUSA, NY, New York - 172,400.00 - 223,400.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 142,800.00 - 193,200.00 USD annually","primary_search_label":"entertainment.team-primevideo","source_system":"JobCreator","state":"WA","title":"Applied Scientist II, Prime Video Personalization and Discovery Science","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3166852/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-primevideo","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development testing experience\u003cbr/\u003e- 3+ years of test automation frameworks and tools building experience\u003cbr/\u003e- Experience programming with at least one modern language such as Java, C++, or C# including object-oriented design\u003cbr/\u003e- Experience in penetration testing and exploitability-focused vulnerability assessment\u003cbr/\u003e- Experience in platform-level security mitigations and hardening for Linux and Windows","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"We are looking for SDET II engineers with experience in supporting mission-critical applications, who are excited about building solutions that enhance automation, stability, and release processes across multiple systems. You will work closely with engineering teams to identify and address common issues, drive solutions, and improve overall release quality and reliability. This role requires hands-on engagement, troubleshooting, and automation development. You will work within the Leo Software Release Management team, managing release processes and automation to maintain a seamless and efficient pipeline. The team operates an on-call support rotation, and you will be responsible for maintaining release quality and pipeline health. Your work will directly impact Leo's ability to deliver high-quality, reliable releases efficiently.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThis role sits at the intersection of test automation, CI/CD, release engineering, and operational reliability. \u003cbr/\u003e\u003cbr/\u003e1. CI/CD Pipeline Ownership \u0026 Stability\u003cbr/\u003e- Own the daily build, test, and release pipelines end to end\u003cbr/\u003e- Monitor pipeline health, stability, and performance\u003cbr/\u003e- Diagnose and resolve pipeline failures (build, test, infra, dependency issues)\u003cbr/\u003e- Reduce flaky tests and nondeterministic failures\u003cbr/\u003e- Improve pipeline speed, reliability, and signal-to-noise ratio\u003cbr/\u003e\u003cbr/\u003e2. Release Engineering \u0026 Software Delivery\u003cbr/\u003e- Manage software build and release activities across environments\u003cbr/\u003e- Track releases, validate readiness, and enforce quality gates\u003cbr/\u003e- Support complex, multi-stage release processes\u003cbr/\u003e- Ensure releases meet quality, compliance, and reliability standards\u003cbr/\u003e- Partner with Dev, QA, and Ops during releases and hotfixes\u003cbr/\u003e\u003cbr/\u003e3. Test Automation at Scale\u003cbr/\u003e- Design, implement, and maintain automated test frameworks (API, integration, system, end-to-end)\u003cbr/\u003e- Integrate automated tests seamlessly into CI/CD pipelines\u003cbr/\u003e- Ensure test coverage aligns with risk, not just code coverage\u003cbr/\u003e- Build tooling to improve test execution efficiency and observability\u003cbr/\u003e\u003cbr/\u003e4. Operational Support \u0026 Incident Response\u003cbr/\u003e- Respond to pipeline, release, and production-impacting issues\u003cbr/\u003e- Participate in triage, on-call rotations, and incident resolution\u003cbr/\u003e- Debug high-complexity failures across code, infrastructure, and environments\u003cbr/\u003e- Drive root cause analysis (RCA) and preventative fixes\u003cbr/\u003e\u003cbr/\u003e5. Reliability \u0026 Continuous Improvement\u003cbr/\u003e- Create automated solutions to improve reliability, scalability, and efficiency\u003cbr/\u003e- Identify systemic issues and eliminate manual processes\u003cbr/\u003e- Introduce metrics, dashboards, and alerts for build/test/release health\u003cbr/\u003e- Champion best practices in testing, automation, and release management\u003cbr/\u003e\u003cbr/\u003e6. Technical Leadership \u0026 Collaboration (Senior-Level Expectation)\u003cbr/\u003e- Influence architecture and design for testability and reliability\u003cbr/\u003e- Mentor junior engineers on automation and CI/CD practices\u003cbr/\u003e- Partner closely with DevOps, Platform, and Infrastructure teams\u003cbr/\u003e- Drive standards and long-term quality strategy\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAn SDET II works closely with development, QA, and DevOps teams to ensure the reliability and quality of daily builds, automated tests, and release pipelines. They spend much of their time monitoring CI/CD pipelines, troubleshooting build and test failures, supporting software releases, and improving test automation and operational tooling. This role is hands-on and execution-focused, with opportunities to grow toward technical ownership and leadership.\u003cbr/\u003e\u003cbr/\u003eOn a typical day, you will:\u003cbr/\u003e- Monitor daily builds, automated test runs, and CI/CD pipeline health\u003cbr/\u003e- Investigate and resolve build, test, and pipeline failures\u003cbr/\u003e- Support software build and release activities across environments\u003cbr/\u003e- Participate in issue triage and help resolve operational or release-blocking issues\u003cbr/\u003e- Analyze failures, identify root causes, and implement fixes to prevent recurrence\u003cbr/\u003e- Develop, maintain, and improve automated test solutions integrated into pipelines\u003cbr/\u003e- Work with developers and DevOps engineers to improve testability, reliability, and release efficiency\u003cbr/\u003e- Contribute to documentation, dashboards, and metrics for build and release tracking\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe ANCHOR team (Automated Navigation and Control of Releases) is focused on streamlining and standardizing the release process. This team manages releases for all Payload LRUs, including Ground LRUs, ensuring consistent release quality, pipeline health, and process efficiency. The team’s charter includes creating release automation, documenting changes, tracking versioned releases, and supporting the transition to a common versionset structure as a long-term strategy. ANCHOR operates autonomously, focused on improving time-to-release, automation reliability, and release transparency.","department_cost_center":null,"description_short":"We are looking for SDET II engineers with experience in supporting mission-critical applications, who are excited about building solutions that enhance automation, stability, and release processes across","display_distance":null,"id":"b81de674-6a63-44d1-abc6-607b080e1792","id_icims":"3151418","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3151418/software-dev-engineer-in-test-ii-leo-anchor","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA114\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":[],"posted_date":"January  3, 2026","preferred_qualifications":"- Knowledge of software development lifecycle, including design, development, test, build, deployment processes and timelines\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $129,300/year in our lowest geographic market up to $223,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Software Dev Engineer in Test II, Leo Anchor","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3151418/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 施設、電気、機械、防火、制御システム、その他の関連する機器等の業務経験（1年以上）または、基本的な理解をお持ちの方\u003cbr/\u003e- 12時間のシフト勤務 (うち2時間休憩)など、標準外の時間帯勤務が可能な方（4勤3休のシフトで働ける方。標準勤務時間は 8:00 ～ 20:00、20:00 ～ 8:00、または 9:00 ～ 21:00、21:00 ～ 9:00 です）\u003cbr/\u003e- 補助機器を使用して18 kg程度の機器を安全に持ち上げて移動できること","business_category":"no-business-category","city":"Tokyo","company_name":"Amazon Data Services Japan G.K.","country_code":"JPN","description":"◆ Job Summary　\u003cbr/\u003eDCEO (データセンターエンジニアリング・オペレーションズ) 部門では、ファシリティエンジニア・技術者を広く募集しています。本ポジションは、アマゾンウェブサービス（AWS）のデータセンターを支える、施設内の電力設備や冷却設備などを安定稼働させることが責務です。DCEO部門の一員としてサーバーやネットワークなどのIT機器を収容する施設を運用し、お客様のアプリケーションやWebサイトなどを24時間365日安定稼働することで、社会インフラに貢献できる業務です。\u003cbr/\u003e\u003cbr/\u003e弊社は 2006 年の設立以来、クラウドコンピューティングのパイオニアとして、ITインフラの世界に変革をもたらしました。現在は世界中で何百ものデータセンターを運営しており、急成長中の新興企業、大企業、主要な政府機関など、何百万ものお客様をサポートしています。データセンターがあることで、日本だけでなく世界中でクラウドコンピューティングサービスが利用できるようになり、お客様に信頼していただいている弊社の革新的な技術にいつでもアクセスできるようになっているのです。\u003cbr/\u003e\u003cbr/\u003e本ポジションでは、世界最大級のITインフラの維持管理業務に関わる事ができます。入社者にはデータセンターのキャリア形成に必要なトレーニングやスキルを提供します。データセンターでのキャリアにご興味ある方は是非ご応募ください！\u003cbr/\u003e\u003cbr/\u003e◆ Key job responsibilities \u003cbr/\u003e•\tデータセンター施設内の機械及び電気設備の保守管理\u003cbr/\u003e•\tお客様のダウンタイムを最小限に抑えるための設備障害対応\u003cbr/\u003e•\t設備の故障や保守、拡張等に伴う技術的な問題の調査、解決\u003cbr/\u003e•\tデータセンターで使われている機器の設置や撤去\u003cbr/\u003e\u003cbr/\u003e◆ A day in the life \u003cbr/\u003e•\tデータセンター内のオフィス、サーバー室、空調機械室、電気室等様々な場所を移動しながら、他のメンバーと一緒にお客様のためにクラウドコンピューティングを24時間365日稼働が継続できるよう取り組みます。\u003cbr/\u003e•\tデータセンター内の機械及び電気設備の監視および制御を行います。\u003cbr/\u003e•\tメンテナンス作業を安全かつスムーズに行うために、計画を立案して万全の準備を行います。\u003cbr/\u003e•\t機器のメンテナンスサービスを提供するベンダーを管理します。\u003cbr/\u003e•\tデータセンターで使用されるサーバーやハードウェア機器の設置や取り外し、及びその他の部品や消耗品の配送などを行うチームと協力して作業します。\u003cbr/\u003e•\t施設のオペレーションコストの削減に取り組みながら、イノベーションを推進します。\u003cbr/\u003e\u003cbr/\u003e◆ About the team　\u003cbr/\u003eデータセンターエンジニアリング・オペレーションズでは、日々安全とセキュリティ、そしてお客様に最高のクラウド体験を提供することに取り組んでいます。私たちはお客様のニーズとビジネス上の要求を満たすために、施設と設備の運用及び保守を担当しています。\u003cbr/\u003e\u003cbr/\u003e◆ Inclusive Team Culture\u003cbr/\u003e私たちのインクルーシブな文化は、あなたがお客様に最高の結果をもたらすことを可能にします。私たちは従業員の多様性を称えるだけでなく、多様な働き方を称賛しています。\u003cbr/\u003e\u003cbr/\u003e◆ Mentorship and Career growth\u003cbr/\u003eあなたのこれまでのご経験にかかわらず、ご活躍いただけるキャリアパスを用意しています。先輩社員からの知識の共有、メンターシップ、その他のキャリアアップに役立つリソースが準備されており、より総合的なプロフェッショナルへの成長を支援します。またアマゾンでは社員がトレーニングや認定を受けるための支援や、英語学習のサポートを提供しています。\u003cbr/\u003e\u003cbr/\u003e◆ Location\u003cbr/\u003e千葉県に所在するデータセンター \u003cbr/\u003e（採用担当者より最寄り駅からのおおまかな通勤所要時間などを面接前にお伝えします。）\u003cbr/\u003e","department_cost_center":null,"description_short":"◆ Job Summary　DCEO (データセンターエンジニアリング・オペレーションズ) 部門では、ファシリティエンジニア・技術者を広く募集しています。本ポジションは、アマゾンウェブサービス（AWS）のデータセンターを支える、施設内の電力設備や冷却設備などを安定稼働させることが責務です。DCEO部門の一員としてサーバーやネットワークなどのIT機器を収容する施設を運用し、お客様のアプリケーションやWebサイトなどを24時間365日安定稼働することで、社会インフラに貢献できる業務です。弊社は","display_distance":null,"id":"77ee4dee-fbc7-4307-89ee-926ca75f868f","id_icims":"3147061","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3147061/dceo","job_schedule_type":"full-time","location":"JP, 12, Tokyo","locations":["{\"normalizedStateName\":\"Tokyo\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Tokyo\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, 12, Tokyo\",\"coordinates\":\"35.68946,139.69172\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Tokyo, JPN\",\"location\":\"JP, 12, Tokyo\",\"region\":\"12\",\"buildingCodeList\":[\"NRT105\"]}"],"normalized_location":"Tokyo, JPN","optional_search_labels":["aws.team-ais"],"posted_date":"December 22, 2025","preferred_qualifications":"- 電気・機械工学、製造、海洋産業、石油・ガス、代替エネルギー、原子力、電気通信事業者のいずれかでの実務経験\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"12","title":"ファシリティエンジニア - DCEO（データセンターファシリティエンジニアリング・オペレーションズ）","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3147061/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}