{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 1+ years of electrical or mechanical, or 1+ years of data center or mission critical facilities (example: hospital, military facility, public safety facility, etc.) experience\u003cbr/\u003e- High school or equivalent diploma","business_category":"aws","city":"Canton","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"770d5b2e-8051-4025-bc13-c5d1baa7934c","id_icims":"3161476","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3161476/engineering-operations-technician-dcc-communities","job_schedule_type":"full-time","location":"US, MS, Canton","locations":["{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Canton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Canton\",\"coordinates\":\"32.61258,-90.03472\",\"normalizedCountyName\":\"Madison\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Canton, Mississippi, USA\",\"location\":\"US, MS, Canton\",\"region\":\"MS\",\"buildingCodeList\":[\"JAN312\",\"JAN300\",\"JAN200\",\"JAN301\",\"JAN100\",\"VCB3\",\"JAN304\",\"JAN1\",\"JAN310\",\"JAN311\"],\"normalizedCityName\":\"Canton\"}"],"normalized_location":"Canton, Mississippi, USA","optional_search_labels":["aws.team-ais","aws.team-dc","hourly","military"],"posted_date":"January 17, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MS, Canton - 28.00 - 50.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"MS","title":"Engineering Operations Technician, DCC Communities ","university_job":null,"updated_time":"2 minutes","url_next_step":"https://account.amazon.com/jobs/3161476/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- •\t1-3 years in research operations, UX production, program management, or related field\u003cbr/\u003e- •\tStrong organizational and project management skills with an attention to detail\u003cbr/\u003e- •\tExcellent communication and stakeholder management skills\u003cbr/\u003e- •\tPassion for improving customer experience by operationalizing and supporting research at scale","business_category":"entertainment","city":"Mexico City","company_name":"Servicios Comerciales Amazon Mexico S. de R.L. de C.V.","country_code":"MEX","description":"Are you passionate about giving customers a voice in the products they use? Are you driven by helping build project management pipelines to streamline workstreams and unlock efficiencies? Do you want to grow your skills of enabling and improving process alongside a global team of designers and product managers? If so, the Amazon Music Research \u0026 Beta (R\u0026B) team is looking for a talented, passionate Program Manager with a track record of delivery, ownership and process improvement that is excited to help us operationalize Research and Beta Program processes. You will help champion how we connect with customers around the world via our various research and beta testing programs, including our Amazon Music Backstage communities of customers.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eResearch Operations\u003cbr/\u003e- Manage logistics and workflows for user research studies (scheduling, consent, data handling)\u003cbr/\u003e- Build and maintain participant panels, recruitment pipelines, and vendor relationships\u003cbr/\u003e- Ensure ethical standards and privacy compliance are met across all research activities\u003cbr/\u003e- Maintain tools and systems (e.g., research repositories, scheduling tools, survey platforms)\u003cbr/\u003e- Create reporting dashboards for research impact and resource utilization\u003cbr/\u003e- Develop and document best practices, playbooks, and templates for research activities\u003cbr/\u003eResearch Production\u003cbr/\u003e- Managing logistics for cross-functional research efforts\u003cbr/\u003e- Define research timelines, deliverables, and roles in collaboration with researchers and stakeholders\u003cbr/\u003e- Coordinate between teams to ensure alignment and timely execution\u003cbr/\u003e- Maintain research calendar and coordinate cross-team meeting schedules\u003cbr/\u003e- Manage budgets, contracts, and external research vendor relationships or partnerships\u003cbr/\u003e- Track and report on research project progress, impact, and resource needs\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe’re growing quickly and hiring the best; this is day one. This Program Manager will support Research Operations which includes managing and learning to strategically grow our research communities, vendor partnerships, and process optimization efforts. The role requires the need to be adept at both managing project pipelines and building mechanisms, connecting global stakeholders, understanding intricacies of data privacy, while also strategically planning means of scaling research capacity. In order to build these mechanisms, they will work across global internal partners and external vendor resources, leveraging both process and technology to achieve our goals. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout the Team \u003cbr/\u003eThis program management position within the Design organization's Operations department supports the Research and Beta team. The Design Operations team focuses on operational excellence across Amazon Music by establishing workflows, managing customer feedback systems, vendors, and research pipelines. We maintain high process standards, build trust with partners, take action within constraints, and navigate ambiguous situations. We collaborate with product, design, and broader Amazon teams to deliver exceptional results.\u003cbr/\u003e\u003cbr/\u003eWork/Life Harmony\u003cbr/\u003eOur team is focused on balancing life with our work, and we do this via work autonomy and by putting focus on prioritizing solutions and processes that enable us to scale. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eOne of the most exciting aspects of being on the Amazon Music Design \u0026 Creative Team is the opportunity to partner closely with professionals across the full organization. The fast-paced, collaborative environment means you’ll be working alongside music industry, product design, marketing, and creative rock stars who can help you accelerate your career, stretch your skills, and bring new ideas to market.\u003cbr/\u003e","department_cost_center":null,"description_short":"Are you passionate about giving customers a voice in the products they use? Are you driven by helping build project management pipelines to streamline workstreams and unlock efficiencies? Do you want to","display_distance":null,"id":"ef08aaf3-2597-4995-9b17-fc9a12f4b594","id_icims":"3140726","is_intern":null,"is_manager":null,"job_category":"Design","job_family":"Design","job_function_id":null,"job_path":"/en/jobs/3140726/r-b-program-manager-amazon-music-design-operations","job_schedule_type":"full-time","location":"MX, DIF, Mexico City","locations":["{\"normalizedStateName\":\"Mexico City\",\"normalizedCountryCode\":\"MEX\",\"city\":\"Mexico City\",\"countryIso3a\":\"MEX\",\"countryIso2a\":\"MX\",\"locationNonStemming\":\"Mexico, DIF, Mexico City\",\"coordinates\":\"19.43195,-99.13315\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Mexico\",\"normalizedLocation\":\"Mexico City, Mexico City, MEX\",\"location\":\"MX, DIF, Mexico City\",\"region\":\"DIF\",\"buildingCodeList\":[\"MEX16\"],\"normalizedCityName\":\"Mexico City\"}"],"normalized_location":"Mexico City, Mexico City, MEX","optional_search_labels":[],"posted_date":"December 10, 2025","preferred_qualifications":"- •\tFamiliarity with research methodologies, tools (e.g., UserTesting, dscout, Lookback, Airtable), and platforms\u003cbr/\u003e- •\tExperience with procurement processes and vendor security reviews\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"entertainment.team-music","source_system":"JobCreator","state":"DIF","title":"R\u0026B Program Manager, Amazon Music Design Operations","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3140726/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-music","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Etna","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Job summary\u003cbr/\u003eOur WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Operations Manager. In this role, you will lead and develop a team of salaried and hourly talent. You will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. To achieve this, managers are expected to provide their team with the tools needed for success while driving improvements in productivity and efficiency through data-driven decisions and analytical problem-solving. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e   \u003cbr/\u003e  Our Operation’s workflow has three major components:  First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer.\u003cbr/\u003e \u003cbr/\u003e Key Responsibilities and Job Elements:\u003cbr/\u003e - Support, mentor, and motivate your salaried and hourly workforce\u003cbr/\u003e - Lead large-scope projects with site and regional impact\u003cbr/\u003e - Build and execute productivity plans through forecast reviews, determining productivity requirements, and partnering with other Leaders to load balance \u003cbr/\u003e - Manage safety, quality, productivity, and customer delivery promises \u003cbr/\u003e - Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e - Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e - Stand/walk for up to 12 hours during shifts \u003cbr/\u003e - Work in an environment where the noise level varies and can be loud\u003cbr/\u003e - Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e - Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e   Our fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Operations Managers based on location preference and the business’ current openings.  ","department_cost_center":null,"description_short":"Job summaryOur WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Operations","display_distance":null,"id":"4023d991-b7cd-40dc-8712-d5c5d0fc16c0","id_icims":"3170417","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3170417/operations-manager","job_schedule_type":"full-time","location":"US, OH, Etna","locations":["{\"normalizedStateName\":\"Ohio\",\"normalizedCountryCode\":\"USA\",\"city\":\"Etna\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OH, Etna\",\"coordinates\":\"39.95731,-82.68293\",\"normalizedCountyName\":\"Licking\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Etna, Ohio, USA\",\"location\":\"US, OH, Etna\",\"region\":\"OH\",\"buildingCodeList\":[\"CMH1\"],\"normalizedCityName\":\"Etna\"}"],"normalized_location":"Etna, Ohio, USA","optional_search_labels":[],"posted_date":"January 30, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 2+ salaried employees and 70+ indirect employees\u003cbr/\u003e- Experience scoping, leading, and implementing process improvements through: Lean process, Kaizen, and/or Six Sigma.\u003cbr/\u003e- Demonstrated problem solving skills and analytical skills\u003cbr/\u003e- Excellent customer service skills, communication skills and interpersonal skills\u003cbr/\u003e- Track record of meeting or exceeding department performance goals\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Experience in: military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production, or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, OH, Etna - 91,000.00 - 136,500.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"OH","title":"Operations Manager","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3170417/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- PhD, or Master's degree and 4+ years of CS, CE, ML or related field experience\u003cbr/\u003e- Experience programming in Java, C++, Python or related language\u003cbr/\u003e- Experience in patents or publications at top-tier peer-reviewed conferences or journals\u003cbr/\u003e- Experience applying theoretical models in an applied environment\u003cbr/\u003e- Experience building machine learning models or developing algorithms for business application\u003cbr/\u003e- Experience developing and implementing deep learning models\u003cbr/\u003e- Track record of solving complex technical problems","business_category":"fulfillment-technology-and-robotics","city":"San Francisco","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join the next revolution in robotics at Amazon's Frontier AI \u0026 Robotics team, where you'll work alongside world-renowned AI pioneers to push the boundaries of what's possible in robotic intelligence. As an Applied Scientist, you'll be at the forefront of developing breakthrough foundation models that enable robots to perceive, understand, and interact with the world in unprecedented ways. You'll drive independent research initiatives in areas such as perception, manipulation, science understanding, locomotion, manipulation, sim2real transfer, multi-modal foundation models and multi-task robot learning, designing novel frameworks that bridge the gap between state-of-the-art research and real-world deployment at Amazon scale.\u003cbr/\u003e\u003cbr/\u003eIn this role, you'll balance innovative technical exploration with practical implementation, collaborating with platform teams to ensure your models and algorithms perform robustly in dynamic real-world environments. You'll have access to Amazon's vast computational resources, enabling you to tackle ambitious problems in areas like very large multi-modal robotic foundation models and efficient, promptable model architectures that can scale across diverse robotic applications.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Drive independent research initiatives across the robotics stack, including robotics foundation models, focusing on breakthrough approaches in perception, and manipulation, for example open-vocabulary panoptic scene understanding, scaling up multi-modal LLMs, sim2real/real2sim techniques, end-to-end vision-language-action models, efficient model inference, video tokenization\u003cbr/\u003e- Design and implement novel deep learning architectures that push the boundaries of what robots can understand and accomplish\u003cbr/\u003e- Lead full-stack robotics projects from conceptualization through deployment, taking a system-level approach that integrates hardware considerations with algorithmic development, ensuring robust performance in production environments\u003cbr/\u003e- Collaborate with platform and hardware teams to ensure seamless integration across the entire robotics stack, optimizing and scaling models for real-world applications\u003cbr/\u003e- Contribute to the team's technical strategy and help shape our approach to next-generation robotics challenges\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e- Design and implement novel foundation model architectures and innovative systems and algorithms, leveraging our extensive infrastructure to prototype and evaluate at scale\u003cbr/\u003e- Collaborate with our world-class research team to solve complex technical challenges \u003cbr/\u003e- Lead technical initiatives from conception to deployment, working closely with robotics engineers to integrate your solutions into production systems\u003cbr/\u003e- Participate in technical discussions and brainstorming sessions with team leaders and fellow scientists\u003cbr/\u003e- Leverage our massive compute cluster and extensive robotics infrastructure to rapidly prototype and validate new ideas\u003cbr/\u003e- Transform theoretical insights into practical solutions that can handle the complexities of real-world robotics applications \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAt Frontier AI \u0026 Robotics, we're not just advancing robotics – we're reimagining it from the ground up. Our team is building the future of intelligent robotics through innovative foundation models and end-to-end learned systems. We tackle some of the most challenging problems in AI and robotics, from developing sophisticated perception systems to creating adaptive manipulation strategies that work in complex, real-world scenarios.\u003cbr/\u003e\u003cbr/\u003eWhat sets us apart is our unique combination of ambitious research vision and practical impact. We leverage Amazon's massive computational infrastructure and rich real-world datasets to train and deploy state-of-the-art foundation models. Our work spans the full spectrum of robotics intelligence – from multimodal perception using images, videos, and sensor data, to sophisticated manipulation strategies that can handle diverse real-world scenarios. We're building systems that don't just work in the lab, but scale to meet the demands of Amazon's global operations.\u003cbr/\u003e\u003cbr/\u003eJoin us if you're excited about pushing the boundaries of what's possible in robotics, working with world-class researchers, and seeing your innovations deployed at unprecedented scale.\u003cbr/\u003e","department_cost_center":null,"description_short":"Join the next revolution in robotics at Amazon's Frontier AI \u0026 Robotics team, where you'll work alongside world-renowned AI pioneers to push the boundaries of what's possible in robotic intelligence. As","display_distance":null,"id":"a8c39efa-b5b7-4ff1-bb84-aef4fccf70fc","id_icims":"3181373","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3181373/applied-scientist-far-frontier-ai-robotics","job_schedule_type":"full-time","location":"US, CA, San Francisco","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Francisco\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Francisco\",\"coordinates\":\"37.77702,-122.41956\",\"normalizedCountyName\":\"San Francisco\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Francisco, California, USA\",\"location\":\"US, CA, San Francisco\",\"region\":\"CA\",\"buildingCodeList\":[\"UCA1\"],\"normalizedCityName\":\"San Francisco\"}"],"normalized_location":"San Francisco, California, USA","optional_search_labels":[],"posted_date":"February 14, 2026","preferred_qualifications":"- Experience using Unix/Linux\u003cbr/\u003e- First-author publications at major or top-tier ML/Robotics/AI conferences\u003cbr/\u003e- Experience with foundation models or large language models\u003cbr/\u003e- Background in Robotics, computer vision, or related fields\u003cbr/\u003e- Experience with sim2real transfer or multi-task learning\u003cbr/\u003e- Familiarity with distributed training systems\u003cbr/\u003e- Track record of deploying ML models in production environments\u003cbr/\u003e- Experience with large-scale robotic systems\u003cbr/\u003e- Extensive programming skills in Python and PyTorch/JAX\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, San Francisco - 171,600.00 - 222,200.00 USD annually","primary_search_label":"fulfillment-technology-and-robotics.team-frontier-ai-robotics","source_system":"JobCreator","state":"CA","title":"Applied Scientist, FAR (Frontier AI \u0026 Robotics)","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3181373/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-frontier-ai-robotics","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent\u003cbr/\u003e- Experience in compliance program management, legal, governance, audit, risk/loss prevention, or equivalent\u003cbr/\u003e- Experience handling confidential information\u003cbr/\u003e- Master's degree in Health and Safety or a related field","business_category":"aws","city":"Zaragoza","company_name":"Amazon Data Services Spain, S.L.","country_code":"ESP","description":"Job summary\u003cbr/\u003eJoin the world class safety culture at Amazon Web Services (AWS) and be part of supporting the largest cloud computing infrastructure team as a Regional Safety Engineer. As the Regional Safety Engineer you will own the Health and Safety function of your respective area. You will be responsible for improving the health and safety of our data centers, advancing safety culture, and protecting our employees. Each day you will work with our data center engineers, the people who make the cloud go. They are working with electrical switching equipment, large scale air handling mechanical systems, and critical IT gear.\u003cbr/\u003e\u003cbr/\u003eYou will work closely with experts in security, construction, operations, logistics, compliance, corporate counsel, and human resources to further the global health safety program. You will partner with employees as well as contractors to achieve health and safety goals and improve our already strong safety culture. As AWS increases data capacity you will partner with construction managers to ensure risks are identified and mitigated prior to live operations. You will work in a fast-paced environment where our operations are rapidly changing, advocating safe changes in the face of new infrastructure, new tools, and new products/processes.\u003cbr/\u003e\u003cbr/\u003eThis role is for an experienced Safety Specialist or Safety Engineer. The role's prime responsibility will be to support live space construction and retrofits for Data Centers.\u003cbr/\u003eYou will be part of a regional and global team that works with internal and external partners to maintain and enhance the safety of operations. Close collaboration with onsite physical security, vendors, compliance officers, risk management, and fire/life safety systems is required. Additionally, you will work with employees and contractors to achieve specific safety objectives.\u003cbr/\u003e\u003cbr/\u003eYou must be an effective communicator, sending clear, concise and consistent messages verbally, in written form, and/or public speaking forums. You will advise, instruct and train company personnel on safety policies and procedures, as well as assist the teams in incorporating and improving our safety standards at their sites.\u003cbr/\u003e\u003cbr/\u003eYou will report to the Regional Safety Manager – CPI and be responsible for continuing to enhance the safety of operations and construction. Some domestic and international travel is required.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e   - Support implementation of health and safety standards, policies and practices including but not limited to; safety management systems, training, risk assessments, assist with industrial hygiene assessments, and applicable safety regulations.\u003cbr/\u003e    - Conduct health and safety audits of all Data Centers to ensure compliance with health and safety requirements as well as life safety requirements.\u003cbr/\u003e    - Ensure compliance and implementation of global health and safety programs that exceed regulatory requirements.\u003cbr/\u003e    - Develop health and safety plans for on-site emergencies, business continuity, and other unique events.\u003cbr/\u003e    - Maintain safety record keeping and data integrity.\u003cbr/\u003e    - Perform data trend reviews to present to cluster leadership to support business and safety initiatives.\u003cbr/\u003e    - Consult and partner with the AWS H\u0026S Program team and legal teams for interpretations and guidance.\u003cbr/\u003e    - Identify risks and partner with CPI teams to mitigate them\u003cbr/\u003e    - Daily interactions with our customers delivering health and safety guidance.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAbout AWS\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e","department_cost_center":null,"description_short":"Job summaryJoin the world class safety culture at Amazon Web Services (AWS) and be part of supporting the largest cloud computing infrastructure team as a Regional Safety Engineer. As the Regional Safety","display_distance":null,"id":"996b351c-1c49-441c-8d70-01b5810a3478","id_icims":"3177638","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Risk Family","job_function_id":null,"job_path":"/en/jobs/3177638/construction-safety-manager-dcpd-health-and-safety","job_schedule_type":"full-time","location":"ES, Zaragoza","locations":["{\"normalizedStateName\":\"Aragon\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Zaragoza\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, Zaragoza\",\"coordinates\":\"41.65184,-0.8811\",\"normalizedCountyName\":\"Zaragoza\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Zaragoza, Aragon, ESP\",\"location\":\"ES, Zaragoza\",\"region\":\"\",\"buildingCodeList\":[\"ZAZ60\"],\"normalizedCityName\":\"Zaragoza\"}"],"normalized_location":"Zaragoza, Aragon, ESP","optional_search_labels":[],"posted_date":"February 10, 2026","preferred_qualifications":"- Professional auditing qualification, or similar risk or compliance credentials\u003cbr/\u003e- Experience with SQL and Excel\u003cbr/\u003e- Experience in program requirements definition, together with data and metrics leveraging to drive improvements\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-security-engineer-primary","source_system":"JobCreator","state":null,"title":"Construction Safety Manager, DCPD Health and Safety","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3177638/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-security-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- B.S. or M.S. in computer science or related field\u003cbr/\u003e- Proficiency with 1 or more of the following programming languages: C++ (preferred), Python\u003cbr/\u003e- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 3+ years of experience developing compiler optimization, graph-theory, hardware bring-up, FPGA placement and routing algorithms, or hardware resource management","business_category":"aws","city":"Tel Aviv","company_name":"Annapurna Labs Ltd.","country_code":"ISR","description":"Our team is responsible for the AWS Neuron Compiler, a cutting-edge deep learning compiler stack that powers Generative AI and other advanced ML workloads on AWS’s custom-built ML accelerators — Inferentia and Trainium. These accelerators deliver best-in-class performance and cost-efficiency for ML inference and training in the cloud.\u003cbr/\u003e\u003cbr/\u003eWe’re building a new core group of engineers in TLV to drive innovation in compiler technology and systems-level ML software. As a Machine Learning Compiler Engineer, you’ll help shape the direction of the team from the ground up and work on:\u003cbr/\u003e\u003cbr/\u003eDesigning and optimizing compiler features for high-performance ML workloads\u003cbr/\u003e\u003cbr/\u003eSolving complex challenges in areas like graph optimization, code generation, and hardware-software co-design\u003cbr/\u003e\u003cbr/\u003eCollaborating across Runtime, Frameworks, and Hardware teams to maximize end-to-end performance\u003cbr/\u003e\u003cbr/\u003eAs part of the Backend Compiler Team, you’ll contribute to projects involving instruction scheduling, memory management, parallelism, graph partitioning, ISA design, and new hardware bring-up.\u003cbr/\u003e\u003cbr/\u003eThis is a unique opportunity to be at the intersection of ML and systems within AWS, helping to build the future of AI infrastructure — right here in Tel Aviv.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eOur engineers collaborate across diverse teams, projects, and environments to have a firsthand impact on our global customer base. You will:\u003cbr/\u003e\u003cbr/\u003eSolve challenging technical problems, often ones not solved before, at every layer of the stack.\u003cbr/\u003eDesign, implement, test, deploy and maintain innovative software solutions to transform service performance, durability, cost, and security.\u003cbr/\u003eResearch implementations that deliver the best possible experiences for customers.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs you design and code solutions to help our team drive efficiencies in software architecture, you’ll create metrics, implement automation and other improvements, and resolve the root cause of software defects. You’ll also:\u003cbr/\u003e\u003cbr/\u003eBuild high-impact solutions to deliver to our large customer base.\u003cbr/\u003eParticipate in design discussions, code review, and communicate with internal and external stakeholders.\u003cbr/\u003eWork cross-functionally to help drive business decisions with your technical input.\u003cbr/\u003eWork in a startup-like development environment, where you’re always working on the most important stuff.\u003cbr/\u003e\u003cbr/\u003eConsidering the technical requirements of this role, and to ensure fair and equal candidate consideration, we are conducting full interview loops. If you meet the basic qualifications, and the team is interested in moving forward, we will be in touch to coordinate your interviews.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003e\u003cbr/\u003e*Diverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003e*Why AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003e*Work/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003e*Inclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003e*Mentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"Our team is responsible for the AWS Neuron Compiler, a cutting-edge deep learning compiler stack that powers Generative AI and other advanced ML workloads on AWS’s custom-built ML accelerators — Inferentia","display_distance":null,"id":"a57ba052-58f4-4e82-b431-873969cd1bff","id_icims":"3034494","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3034494/machine-learning-compiler-engineer-annapurna-labs","job_schedule_type":"full-time","location":"IL, Tel Aviv","locations":["{\"normalizedStateName\":\"Tel Aviv\",\"normalizedCountryCode\":\"ISR\",\"city\":\"Tel Aviv\",\"countryIso3a\":\"ISR\",\"countryIso2a\":\"IL\",\"locationNonStemming\":\"Israel, Tel Aviv\",\"coordinates\":\"32.08556,34.78953\",\"normalizedCountyName\":\"Tel Aviv\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Israel\",\"normalizedLocation\":\"Tel Aviv-Yafo, Tel Aviv, ISR\",\"location\":\"IL, Tel Aviv\",\"region\":\"\",\"buildingCodeList\":[\"TLV14A\"],\"normalizedCityName\":\"Tel Aviv-Yafo\"}"],"normalized_location":"Tel Aviv-Yafo, Tel Aviv, ISR","optional_search_labels":["aws.team-generative-ai","aws.team-annapurna-labs"],"posted_date":"July 15, 2025","preferred_qualifications":"- M.S. or Ph.D. in computer science or related field\u003cbr/\u003e- Strong knowledge in one or more of the areas of: compiler design, instruction scheduling, memory allocation, data transfer optimization, graph partitioning, parallel programing, code generation, Instruction Set Architectures, new hardware bring-up, and hardware-software co-design\u003cbr/\u003e- Experience with LLVM and/or MLIR\u003cbr/\u003e- Experience with developing algorithms for simulation tools\u003cbr/\u003e- Experience is TensorFlow, PyTorch, and/or JAX\u003cbr/\u003e- Experience in LLM, Vision or other deep-learning models\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":null,"title":"Machine Learning Compiler Engineer, Annapurna Labs ","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3034494/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in at least one modern scripting or programming language, such as Python, Java, Scala, or NodeJS\u003cbr/\u003e- Experience with big data technologies such as: Hadoop, Hive, Spark, EMR\u003cbr/\u003e- Experience building/operating highly available, distributed systems of data extraction, ingestion, and processing of large data sets\u003cbr/\u003e- Experience with data modeling, warehousing and building ETL pipelines\u003cbr/\u003e- Knowledge of distributed systems as it pertains to data storage and computing\u003cbr/\u003e- Knowledge of professional software engineering \u0026 best practices for full software development life cycle, including coding standards, software architectures, code reviews, source control management, continuous deployments, testing, and operational excellence\u003cbr/\u003e- Experience as a Data Engineer or in a similar role\u003cbr/\u003e- Experience with SQL","business_category":"entertainment","city":"London","company_name":"Amazon Digital UK Limited","country_code":"GBR","description":"Come build the future of entertainment with us. Are you interested in shaping the future of movies and television? Do you want to define the next generation of how and what Amazon customers are watching?\u003cbr/\u003e\u003cbr/\u003ePrime Video is a premium streaming service that offers customers a vast collection of TV shows and movies - all with the ease of finding what they love to watch in one place. We offer customers thousands of popular movies and TV shows from Originals and Exclusive content to exciting live sports events. We also offer our members the opportunity to subscribe to add-on channels which they can cancel at anytime and to rent or buy new release movies and TV box sets on the Prime Video Store. Prime Video is a fast-paced, growth business - available in over 240 countries and territories worldwide. The team works in a dynamic environment where innovating on behalf of our customers is at the heart of everything we do. If this sounds exciting to you, please read on.\u003cbr/\u003e  \u003cbr/\u003eThe team owns a global data platform that powers analytics and data science within Prime Video. Building on AWS cloud technology and processing some eye-watering volumes of relational data, our team is passionate about the security, latency and usability of our products. Abstracting complexity from the analytics community, so they can more rapidly innovate on behalf of our customers.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eYou'll solve data warehousing problems on a massive scale and apply cloud-based AWS services to solve challenging problems around: big data processing, data warehouse design, self-service data access, automated data quality detection and building infrastructure as a code. You'll be part of the team that focuses on automation and optimization for all areas of DW/ETL maintenance and deployment.\u003cbr/\u003e\u003cbr/\u003eYou'll work closely with global business partners and technical teams on many non-standard and unique business problems and use creative problem solving to deliver data products that underpin Prime Video strategic decision making, from content selection to on-platform customer experience. You'll develop efficient systems and tools to process data, using technologies than can scale to seasonal spikes and easily accommodate future growth. Your work will have a direct impact on the day-to-day decision making across Prime Video.\u003cbr/\u003e","department_cost_center":null,"description_short":"Come build the future of entertainment with us. Are you interested in shaping the future of movies and television? Do you want to define the next generation of how and what Amazon customers are watching?Prime","display_distance":null,"id":"e532c949-f443-468a-a6ec-4f5f9ae6b406","id_icims":"3139902","is_intern":null,"is_manager":null,"job_category":"Business Intelligence","job_family":"Data Engineering","job_function_id":null,"job_path":"/en/jobs/3139902/data-engineer-prime-video-core-analytics-and-tooling","job_schedule_type":"full-time","location":"GB, London","locations":["{\"normalizedStateName\":\"England\",\"normalizedCountryCode\":\"GBR\",\"city\":\"London\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, London\",\"coordinates\":\"51.50643,-0.12719\",\"normalizedCountyName\":\"London\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"London, England, GBR\",\"location\":\"GB, London\",\"region\":\"\",\"buildingCodeList\":[\"LHR16\"],\"normalizedCityName\":\"London\"}"],"normalized_location":"London, England, GBR","optional_search_labels":["primevideo.team-london","primevideo.team-tech"],"posted_date":"December  9, 2025","preferred_qualifications":"- Experience with AWS technologies like Redshift, S3, AWS Glue, EMR, Kinesis, FireHose, Lambda, and IAM roles and permissions\u003cbr/\u003e- Experience working on and delivering end to end projects independently\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"entertainment.team-primevideo","source_system":"JobCreator","state":null,"title":"Data Engineer, Prime Video Core Analytics and Tooling","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3139902/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-primevideo","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- B.S. Electrical Engineering , Computer Engineering or a related field\u003cbr/\u003e- 8+ years of experience with hardware and software integration for embedded systems or hardware development\u003cbr/\u003e- 5+ years of experience with managing ODM\u003cbr/\u003e- 5+ years of experience as the lead technologist/architect/engineer in the power space for a major technology, component, product, or product line\u003cbr/\u003e- Demonstrated expertise in driving power reliability and efficiency through design enhancement and failure mode analysis\u003cbr/\u003e- Experience with statistical analysis and modeling for reliability, performance, and/or cost","business_category":"aws","city":"Austin","company_name":"Annapurna Labs (U.S.) Inc.","country_code":"USA","description":"AWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for customers who require specialized security solutions for their cloud services.\u003cbr/\u003e\u003cbr/\u003eAnnapurna Labs (our organization within AWS UC) designs silicon and software that accelerates innovation. Customers choose us to create cloud solutions that solve challenges that were unimaginable a short time ago—even yesterday. Our custom chips, accelerators, and software stacks enable us to take on technical challenges that have never been seen before, and deliver results that help our customers change the world.\u003cbr/\u003e\u003cbr/\u003eWe are looking for a Hardware Design Engineer with strong skills in both hardware and software. In this role you will be responsible for architecting, designing, simulating and validating power delivery multi-source solutions on machine learning products and support those designs in AWS fleet through their entire life cycle. You will work cross functionally with AWS monitoring teams, members of the Hardware Design team, supply chain team, vendors, ODMs and additional teams across AWS to improve quality and reliability of products operating in the fleet.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eIn this position, you’ll have the opportunity to: \u003cbr/\u003e- Drive improvements in availability, and efficiency as they relate to power for AWS servers. These improvements should include enhanced designs, enhanced testing, and improved manufacturing at the suppliers themselves.\u003cbr/\u003e- Identify and drive process improvements and automation in power design, validation, manufacturing and both pre-production and field testability.\u003cbr/\u003e- Develop comprehensive AWS reliability models for server power, taking advantage of our copious production telemetry and deep knowledge of component internals.\u003cbr/\u003e- Serve as power technical lead on some of our most demanding machine learning rack scale projects, including the launch of new services and features that will be deployed and used at massive scale\u003cbr/\u003e- Work with technology leaders to define and drive critical features and architectural advancements into our rack scale systems\u003cbr/\u003e- Help drive a power technology roadmap and guide our suppliers to meet Amazon’s server power needs for future generation products.\u003cbr/\u003e- Collaborate with other principal engineers to find simple solutions to brain-contorting problems\u003cbr/\u003e- Ensure the quality \u0026 reliability of architecture of our end-to-end system design\u003cbr/\u003e- Collaborate with our supply chain team to define the sourcing strategy for power commodities\u003cbr/\u003e- Engage deeply in the operations of our systems, including identifying and rectifying root causes of critical issues\u003cbr/\u003e- Assist in the career development of others, actively mentoring individuals and the community on advanced technical issues, and helping managers guide the career growth of their team members\u003cbr/\u003e- Provide technical guidance to multiple teams, increasing their productivity and effectiveness by sharing your deep knowledge and experience\u003cbr/\u003e-  Advocate for the customer and ensure we are building the best possible experience\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge-sharing and mentorship. Our senior members enjoy one-on-one mentoring and thorough, but kind, code reviews. We care about your career growth and strive to assign projects that help our team members develop your engineering expertise so you feel empowered to take on more complex tasks in the future.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eAbout AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product","display_distance":null,"id":"2ab6c880-da44-4c42-80fa-1096fe30fc8d","id_icims":"3153621","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"Cloud Hardware Development","job_function_id":null,"job_path":"/en/jobs/3153621/sr-power-engineer-annapurna-labs-machine-learning-hardware","job_schedule_type":"full-time","location":"US, TX, Austin","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS16\"],\"normalizedCityName\":\"Austin\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Cupertino\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Cupertino\",\"coordinates\":\"37.31913,-122.02929\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Cupertino, California, USA\",\"location\":\"US, CA, Cupertino\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC29\"],\"normalizedCityName\":\"Cupertino\"}"],"normalized_location":"Austin, Texas, USA","optional_search_labels":["aws.team-annapurna-labs","aws.team-utility-computing"],"posted_date":"January  6, 2026","preferred_qualifications":"- M.S. Computer Science or a related field\u003cbr/\u003e- Experience with ML accelerators\u003cbr/\u003e- Experience with data center deployments of compute-related infrastructure\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Cupertino - 183,000.00 - 247,600.00 USD annually\u003cbr/\u003eUSA, TX, Austin - 159,200.00 - 215,300.00 USD annually","primary_search_label":"aws.team-hardware-development-primary","source_system":"JobCreator","state":"TX","title":"Sr. Power Engineer, Annapurna Labs, Machine Learning Hardware","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3153621/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-hardware-development-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Computer Science, Engineering, or a related field\u003cbr/\u003e- 5+ years of work with software development lifecycle from conception to delivery experience\u003cbr/\u003e- Experience in designing, planning and implementing applications and/or database migrations to the cloud\u003cbr/\u003e- 5+ years of external or internal customer facing, complex and large scale project management\u003cbr/\u003e- experience\u003cbr/\u003e- Current, active US Government Security Clearance of TS/SCI with Polygraph","business_category":"aws","city":"Herndon","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Application deadline: Applications will be accepted on an ongoing basis\u003cbr/\u003e\u003cbr/\u003eThis position requires that the candidate selected be a US Citizen and obtain and maintain an active TS/SCI security clearance with polygraph.\u003cbr/\u003e\u003cbr/\u003eThe Amazon Web Services Professional Services (ProServe) team is seeking a skilled Delivery Consultant to join our team at Amazon Web Services (AWS). In this role, you'll work closely with customers to design, implement, and manage AWS solutions that meet their technical requirements and business objectives. You'll be a key player in driving customer success through their cloud journey, providing technical expertise and best practices throughout the project lifecycle. Possessing a deep understanding of AWS products and services, as a Delivery Consultant you will be proficient in architecting complex, scalable, and secure solutions tailored to meet the specific needs of each customer. You’ll work closely with stakeholders to gather requirements, assess current infrastructure, and propose effective migration strategies to AWS. As trusted advisors to our customers, providing guidance on industry trends, emerging technologies, and innovative solutions, you will be responsible for leading the implementation process, ensuring adherence to best practices, optimizing performance, and managing risks throughout the project. \u003cbr/\u003e \u003cbr/\u003eThe AWS Professional Services organization is a global team of experts that help customers realize their desired business outcomes when using the AWS Cloud. We work together with customer teams and the AWS Partner Network (APN) to execute enterprise cloud computing initiatives. Our team provides assistance through a collection of offerings which help customers achieve specific outcomes related to enterprise cloud adoption. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs an experienced technology professional, you will be responsible for: \u003cbr/\u003e- Designing and implementing complex, scalable, and secure AWS solutions tailored to customer needs\u003cbr/\u003e- Providing technical guidance and troubleshooting support throughout project delivery\u003cbr/\u003e- Collaborating with stakeholders to gather requirements and propose effective migration strategies\u003cbr/\u003e- Acting as a trusted advisor to customers on industry trends and emerging technologies\u003cbr/\u003e- Sharing knowledge within the organization through mentoring, training, and creating reusable artifacts\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS \u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon  conferences, inspire us to never stop embracing our uniqueness. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.","department_cost_center":null,"description_short":"This position requires that the candidate selected be a US Citizen and obtain and maintain an active TS/SCI security clearance with polygraph.The Amazon Web Services Professional Services (ProServe) team","display_distance":null,"id":"62394d79-fe5a-4fe0-a5f0-5178d14a6007","id_icims":"3178975","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Professional Services","job_function_id":null,"job_path":"/en/jobs/3178975/senior-delivery-consultant-wwps-proserve","job_schedule_type":"full-time","location":"US, VA, Herndon","locations":["{\"normalizedStateName\":\"Missouri\",\"normalizedCountryCode\":\"USA\",\"city\":\"St. Louis\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MO, St. Louis\",\"coordinates\":\"38.62775,-90.19956\",\"normalizedCountyName\":\"St Louis (City)\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"St Louis, Missouri, USA\",\"location\":\"US, MO, St. Louis\",\"region\":\"MO\",\"buildingCodeList\":[\"STL10\"],\"normalizedCityName\":\"St Louis\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD21\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Herndon, Virginia, USA","optional_search_labels":["aws-team-global-services-optional","amazon-cleared-jobs"],"posted_date":"February 11, 2026","preferred_qualifications":"- Experience presenting technical solutions to diverse audiences in pre-sales environments\u003cbr/\u003e- Knowledge of AWS services including compute, storage, networking, security, databases, machine learning, and serverless technologies\u003cbr/\u003e- Experience in performance optimization and cost management for cloud environments\u003cbr/\u003e- Database experience (e.g. SQL, NoSQL, Hadoop, Spark, Kafka, Kinesis)\u003cbr/\u003e- Experience with automation and scripting (e.g., Terraform, Python)\u003cbr/\u003e- Knowledge of security and compliance standards (e.g., HIPAA, GDPR)\u003cbr/\u003e- Experience with AWS data/file transfer solutions including AWS Application Migration Service (MGN), AWS Database Migration Service (DMS), and/or AWS DataSync\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Denver - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, MO, St. Louis - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, VA, Herndon - 153,600.00 - 207,800.00 USD annually","primary_search_label":"aws.team-us-security-clearance-jobs-primary","source_system":"JobCreator","state":"VA","title":"Senior Delivery Consultant, WWPS ProServe","university_job":null,"updated_time":"24 minutes","url_next_step":"https://account.amazon.com/jobs/3178975/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-us-security-clearance-jobs-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Monee","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Job summary\u003cbr/\u003eOur WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Operations Manager. In this role, you will lead and develop a team of salaried and hourly talent. You will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. To achieve this, managers are expected to provide their team with the tools needed for success while driving improvements in productivity and efficiency through data-driven decisions and analytical problem-solving. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e   \u003cbr/\u003e  Our Operation’s workflow has three major components:  First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer.\u003cbr/\u003e \u003cbr/\u003e Key Responsibilities and Job Elements:\u003cbr/\u003e - Support, mentor, and motivate your salaried and hourly workforce\u003cbr/\u003e - Lead large-scope projects with site and regional impact\u003cbr/\u003e - Build and execute productivity plans through forecast reviews, determining productivity requirements, and partnering with other Leaders to load balance \u003cbr/\u003e - Manage safety, quality, productivity, and customer delivery promises \u003cbr/\u003e - Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e - Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e - Stand/walk for up to 12 hours during shifts \u003cbr/\u003e - Work in an environment where the noise level varies and can be loud\u003cbr/\u003e - Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e - Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e   Our fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Operations Managers based on location preference and the business’ current openings.  ","department_cost_center":null,"description_short":"Job summaryOur WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Operations","display_distance":null,"id":"43cdd6a9-e684-490f-9471-0aac0226b211","id_icims":"3173231","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3173231/operations-manager","job_schedule_type":"full-time","location":"US, IL, Monee","locations":["{\"normalizedStateName\":\"Illinois\",\"normalizedCountryCode\":\"USA\",\"city\":\"Monee\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, IL, Monee\",\"coordinates\":\"41.41998,-87.73335\",\"normalizedCountyName\":\"Will\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Monee, Illinois, USA\",\"location\":\"US, IL, Monee\",\"region\":\"IL\",\"buildingCodeList\":[\"MDW7\"],\"normalizedCityName\":\"Monee\"}"],"normalized_location":"Monee, Illinois, USA","optional_search_labels":[],"posted_date":"February  3, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 2+ salaried employees and 70+ indirect employees\u003cbr/\u003e- Experience scoping, leading, and implementing process improvements through: Lean process, Kaizen, and/or Six Sigma.\u003cbr/\u003e- Demonstrated problem solving skills and analytical skills\u003cbr/\u003e- Excellent customer service skills, communication skills and interpersonal skills\u003cbr/\u003e- Track record of meeting or exceeding department performance goals\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Experience in: military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production, or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, IL, Monee - 91,000.00 - 136,500.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"IL","title":"Operations Manager","university_job":null,"updated_time":"29 minutes","url_next_step":"https://account.amazon.com/jobs/3173231/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}