{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Bachelor's degree in mechanical engineering or equivalent\u003cbr/\u003e- Experience communicating technical concepts and processes using clear, simple language and visuals\u003cbr/\u003e- Experience defining system architectures and exploring technical feasibility tradeoffs\u003cbr/\u003e- Experience building prototypes to advance design thinking and the final product experience\u003cbr/\u003e- SolidWorks or similar CAD experience, understanding of best practices for part design, advanced assemblies and complex configuration management\u003cbr/\u003e- Thorough understanding of principals, theories and concepts in mechanical engineering and ability to apply them to product design\u003cbr/\u003e- Experience with full lifecycle and proficiency at completing tasks to meet milestones","business_category":"subsidiaries","city":"North Reading","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Are you inspired by invention? Is problem solving through teamwork in your DNA? Do you like the idea of seeing how your work impacts the bigger picture? Answer yes to any of these and you’ll fit right in here at Amazon Robotics. We are a smart team of collaborative doers that work passionately to apply innovative advances in robotics and software to solve real-world challenges that will transform our customers’ experiences in ways we can’t even image yet. We invent new improvements every day. We are Amazon Robotics and we will give you the tools and guidance that you need to invent with us in ways that are rewarding, fulfilling and fun.\u003cbr/\u003e\u003cbr/\u003eJob Overview – As a an Amazon Robotics Senior Mechanical Engineer you will develop innovative hardware designs for our emerging robotic systems and improve existing hardware to optimize performance and enhance customer experience. The ideal candidate is has experience designing and analyzing robotic systems, enjoys analytical problem solving and possesses practical knowledge of robotic design, fabrication, assembly and rapid prototyping.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Working with an interdisciplinary team to execute product designs from concept to production including specification, design, prototyping, validation and testing\u003cbr/\u003e- Working with the Operations, Manufacturing, Supply Chain and Quality organizations as well as vendors to ensure a smooth product launch and sustaining\u003cbr/\u003e- Writing requirements, functional specifications, design verification plans, and functional test procedures\u003cbr/\u003e- Exhibit role model behaviors of thorough engineering analysis and cradle to grave ownership\u003cbr/\u003e-  Design and adaptation of holistic hardware solutions for ambiguous problems with fluid requirements.\u003cbr/\u003e-  Partner with cross-functional teams, vendors and integrators to deliver an automation solution\u003cbr/\u003e-  Creating design of experiments and leading cross-functional automation of experiments\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. \u003cbr/\u003e\u003cbr/\u003eThe benefits that generally apply to regular, full-time employees include: \u003cbr/\u003e- Medical, Dental, and Vision Coverage \u003cbr/\u003e- Maternity and Parental Leave Options \u003cbr/\u003e- Paid Time Off (PTO) \u003cbr/\u003e- 401(k) Plan   \u003cbr/\u003e\u003cbr/\u003eIf you are not sure that every qualification on the list above describes you exactly, we'd still love to hear from you! \u003cbr/\u003e\u003cbr/\u003eAt Amazon, we value people with unique backgrounds, experiences, and skillsets. If you’re passionate about this role and want to make an impact on a global scale, please apply!\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAre you inspired by invention? Is problem solving through teamwork in your DNA? Do you like the idea of seeing how your work impacts the bigger picture? Answer yes to any of these and you’ll fit right in here at Amazon Robotics. We are a smart, collaborative team of enthusiastic doers that work passionately to apply innovative advances in robotics and software to solve real-world challenges that will transform our customers’ experiences in ways we can’t even image yet. We invent new improvements every day. We are Amazon Robotics and we will give you the tools and support you need to invent with us in ways that are rewarding, fulfilling and fun","department_cost_center":null,"description_short":"Are you inspired by invention? Is problem solving through teamwork in your DNA? Do you like the idea of seeing how your work impacts the bigger picture? Answer yes to any of these and you’ll fit right","display_distance":null,"id":"aca0bfa5-d4eb-4fea-8407-3d1c5b45a7e9","id_icims":"3185585","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/3185585/sr-mechanical-engineer-mobile-robotics","job_schedule_type":"full-time","location":"US, MA, North Reading","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"North Reading\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, North Reading\",\"coordinates\":\"42.57455,-71.07888\",\"normalizedCountyName\":\"Middlesex\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"North Reading, Massachusetts, USA\",\"location\":\"US, MA, North Reading\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS12\"],\"normalizedCityName\":\"North Reading\"}"],"normalized_location":"North Reading, Massachusetts, USA","optional_search_labels":[],"posted_date":"February 20, 2026","preferred_qualifications":"- Master's degree in mechanical engineering or equivalent\u003cbr/\u003e- Experience in the design of complex mechanical products and equipment at volume\u003cbr/\u003e- Experience working effectively across cross-functional teams and partnering well with people at all levels within an organization\u003cbr/\u003e- Experience in a highly agile environment\u003cbr/\u003e- Knowledge of SolidWorks simulation or Ansys Finite Element analysis tools\u003cbr/\u003e- Proficiency documenting designs in accordance with ANSI Y-14.5\u003cbr/\u003e- Experience in electronics packaging including PCBA mechanical design, incorporation of sensors and plastic PCBA enclosures that comply with IEC IP54\u003cbr/\u003e- Proficiency with Product Lifecycle Management PLM software and ECO’s\u003cbr/\u003e- Experience with DFX (designing for excellence)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MA, North Reading - 137,300.00 - 185,700.00 USD annually","primary_search_label":"subsidiaries.team-amazon-robotics","source_system":"JobCreator","state":"MA","title":"Sr. Mechanical Engineer, Mobile Robotics","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3185585/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-robotics","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 4+ years of working in mechanical engineering or equivalent experience\u003cbr/\u003e- Bachelor's degree in mechanical engineering or equivalent\u003cbr/\u003e- Experience with prototyping and implementation\u003cbr/\u003e- Experience using English communication skills, both written and verbal, to foster seamless interaction with stakeholders at all levels\u003cbr/\u003e- Experience with lab safety, security and quality practices\u003cbr/\u003e- 5+ years manufacturing machinery design or test fixture design experience\u003cbr/\u003e- Experience working in new technology or product development","business_category":"operations","city":"Westboro","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Robotics Delivery and Packaging Innovation (RDPI) Global Engineering Hardware team is seeking a motivated and hands-on Hardware Test Engineer to join our Test Engineering team. This team operates in a multi-disciplinary environment of hardware engineers, controls engineers, and test engineers dedicated to advancing sustainable packaging automation and robotics technologies that fulfill millions of customer orders every day.\u003cbr/\u003e\u003cbr/\u003eThe Hardware Test Engineer works closely with cross-functional teams to evaluate, characterize, test, diagnose, and integrate component-level and system-level processes throughout the product development process (PDP) and product lifecycle. You will be responsible for creating and executing test programs, plans, and methods for both subsystem verification tests and complete system verification and validation tests to support new technology and product development programs. This includes developing and executing: design verification test (DVT) plans, factory and site acceptance testing (FAT/SAT), scaled verification tests, test fixtures, and designing experiments (DOE) to support design validation and verification, design down-selection, conducting reliability testing, and driving continuous improvement initiatives.\u003cbr/\u003e\u003cbr/\u003eThese component and system-level processes integrate sensors, actuators, mechanisms, controls, computer, electrical, and human interactions to deliver systems that meet and exceed customer, safety, regulatory, and business requirements. This is done through the analysis of often ambiguous problems, developing and executing test plans, creation of test rigs and fixtures, automation of data collection and analysis, and presenting results, feedback, and recommendations to cross-functional teams and stakeholders.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Collaborate with cross-functional engineers (hardware, software, controls, reliability, operations) and technical program managers to design and execute packaging machinery, automation and robotics projects through the product development process and product lifecycle\u003cbr/\u003e- Develop and execute comprehensive test plans for both functional system-level verification and component/subsystem-level verification\u003cbr/\u003e- Design and build test rigs and fixtures to support component-level testing, design experiments (DOE), and reliability validation\u003cbr/\u003e- Collaborate in design work-streams, including driving modeling, testing, performance and statistical calculations, and 3D/2D design\u003cbr/\u003e- Ensure documentation and support is complete, scalable, and data-driven\u003cbr/\u003e- Support safety certification of projects/platforms\u003cbr/\u003e- Participate in meetings to optimize for customer experience, supply chain, and sustainability\u003cbr/\u003e- Design and execute preliminary and exploratory tests that influence the direction of new and upcoming projects\u003cbr/\u003e- Automate collection and analysis of test data, presenting results and recommendations to stakeholders\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Hardware Test Engineer on the RDPI team, you'll spend your days working hands-on in lab environments and at fulfillment centers across North America, validating leading-edge packaging, automation, and robotics technologies. You might start your morning reviewing test results from overnight automated data collection, then collaborate with hardware engineers to refine a test fixture design for a new sensor configuration. In the afternoon, you could be executing a design of experiments study to down-select between material options, or working with controls engineers to diagnose an electro-mechanical issue affecting machine reliability. You’ll travel to Amazon sites across North America to execute tests and collect data, collaborating closely with program and site stakeholders. You'll document your findings in detailed test reports, present recommendations to senior leadership, and help shape the direction of programs that will deploy to hundreds of sites across Amazon's fulfillment network.\u003cbr/\u003e\u003cbr/\u003eWe are open to hiring candidates to work out of: Boston, MA with up to 75% travel required.\u003cbr/\u003e\u003cbr/\u003eAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. \u003cbr/\u003e\u003cbr/\u003eThe benefits that generally apply to regular, full-time employees include: \u003cbr/\u003e- Medical, Dental, and Vision Coverage \u003cbr/\u003e- Maternity and Parental Leave Options \u003cbr/\u003e- Paid Time Off (PTO) \u003cbr/\u003e- 401(k) Plan   \u003cbr/\u003e\u003cbr/\u003eIf you are not sure that every qualification on the list above describes you exactly, we'd still love to hear from you! \u003cbr/\u003e\u003cbr/\u003eAt Amazon, we value people with unique backgrounds, experiences, and skillsets. If you’re passionate about this role and want to make an impact on a global scale, please apply!\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur Hardware Test Engineering team operates in a highly collaborative, multi-disciplinary environment working alongside hardware engineers, software engineers, controls engineers, data scientists, reliability engineers, and operations teams. We focus on rigorous verification and validation of packaging automation systems—from individual components to complete integrated systems—ensuring they meet customer experience, safety, regulatory, and business requirements before deployment.\u003cbr/\u003e\u003cbr/\u003eOur work spans the entire product development lifecycle—from early concept validation and design down-selection through continuous improvement of deployed systems across hundreds of fulfillment centers in North America and Europe.\u003cbr/\u003e\u003cbr/\u003eWhat sets our team apart is our hands-on approach to solving complex technical challenges. We design and build custom test rigs, develop innovative data collection systems, create standardized testing methodologies, and work directly in lab environments and fulfillment centers to ensure our automation solutions deliver exceptional performance, reliability, and quality at scale. Our contributions directly impact Amazon's sustainability goals, operational efficiency, and the customer experience for millions of packages shipped daily.","department_cost_center":null,"description_short":"Amazon Robotics Delivery and Packaging Innovation (RDPI) Global Engineering Hardware team is seeking a motivated and hands-on Hardware Test Engineer to join our Test Engineering team. This team operates","display_distance":null,"id":"928ff80d-4d88-4116-a429-101a43c50a74","id_icims":"3185599","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/3185599/hardware-test-engineer-rdpi-global-engineering-hardware","job_schedule_type":"full-time","location":"US, MA, Westboro","locations":["{\"normalizedStateName\":\"Wisconsin\",\"normalizedCountryCode\":\"USA\",\"city\":\"Westboro\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Westboro\",\"coordinates\":\"45.35424,-90.29663\",\"normalizedCountyName\":\"Taylor\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Westboro, Wisconsin, USA\",\"location\":\"US, MA, Westboro\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS27\"],\"normalizedCityName\":\"Westboro\"}"],"normalized_location":"Westboro, Wisconsin, USA","optional_search_labels":[],"posted_date":"February 20, 2026","preferred_qualifications":"- Knowledge of SolidWorks simulation or Ansys Finite Element analysis tools\u003cbr/\u003e- Experience in the design of complex mechanical products and equipment at volume\u003cbr/\u003e- Deep hands-on technical expertise in testing of electro-mechanical systems at component and system levels\u003cbr/\u003e- Experience designing and executing Design of Experiments (DOE) for design down-selection and reliability testing\u003cbr/\u003e- PLM, GD\u0026T, and manufacturing process knowledge\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MA, WESTBORO - 117,300.00 - 160,000.00 USD annually","primary_search_label":"operations.team-packaging-innovation","source_system":"JobCreator","state":"MA","title":"Hardware Test Engineer, RDPI Global Engineering Hardware","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3185599/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-packaging-innovation","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Electrical / Computer Engineering or related field\u003cbr/\u003e- 5+ years experience in digital verification, preferably in image processor, SoC/Interfaces\u003cbr/\u003e- 3+ years experience in C/C++ and scripting (Python or TCL)\u003cbr/\u003e- 5+ years experience in System Verilog or UVM\u003cbr/\u003e","business_category":"alexa-and-amazon-devices","city":"North Reading","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join the team which delivers highly differentiated silicon into Blink and Ring battery powered devices. Our verification team works on state-of-the art SoCs in a vertically integrated team environment to deliver products our customers love. Our verification team is involved in early architectural and micro-architectural trade-offs to reduce time-to-revenue by shortening the DV cycle. Innovators will be delighted with our integrated verification/validation environment that is used to perform architectural modeling to post-silicon validation. The team works backwards from customer requirements to build super-low power, energy efficient designs that include the latest in AI, video processing, low power communications and CMOS fabrication technology. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Use and/or build bit accurate C models\u003cbr/\u003e- Evaluate block and sub-systems for testability/verifiability \u003cbr/\u003e- Write comprehensive block and system level testplans\u003cbr/\u003e- Build assertions, traffic generators and scoreboards in SystemVerilog and UVM\u003cbr/\u003e- Execute testplans and perform rigorous debug","department_cost_center":null,"description_short":"Join the team which delivers highly differentiated silicon into Blink and Ring battery powered devices. Our verification team works on state-of-the art SoCs in a vertically integrated team environment","display_distance":null,"id":"d84344cc-2635-4c2e-9106-e576dde399a1","id_icims":"3088655","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"ASIC","job_function_id":null,"job_path":"/en/jobs/3088655/asic-verification-engineer-ring-blink-asic-team","job_schedule_type":"full-time","location":"US, MA, North Reading","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"North Reading\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, North Reading\",\"coordinates\":\"42.57455,-71.07888\",\"normalizedCountyName\":\"Middlesex\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"North Reading, Massachusetts, USA\",\"location\":\"US, MA, North Reading\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS23\"],\"normalizedCityName\":\"North Reading\"}"],"normalized_location":"North Reading, Massachusetts, USA","optional_search_labels":["alexa-and-amazon-devices.team-hardware-development-job-family","military-spouse","military-na","military"],"posted_date":"September 19, 2025","preferred_qualifications":"- Master's or PH.D in Computer Engineering\u003cbr/\u003e- 8+ years experience in digital verification, preferably in areas of image processing. \u003cbr/\u003e- Familiarity with formal verification techniques\u003cbr/\u003e- Lab debug experience and/or FPGA debug\u003cbr/\u003e- Strong written and verbal skills\u003cbr/\u003e- Familiarity and experience with gate level simulations\u003cbr/\u003e- Familiarity  and experience with UPF low power simulations\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $129,800/year in our lowest geographic market up to $212,800/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"alexa-and-amazon-devices.team-ring-key-blink","source_system":"JobCreator","state":"MA","title":"ASIC Verification Engineer, Ring/Blink ASIC Team","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3088655/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-ring-key-blink","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in automating, deploying, and supporting large-scale infrastructure\u003cbr/\u003e- Experience programming with at least one modern language such as Python, Ruby, Golang, Java, C++, C#, Rust\u003cbr/\u003e- Experience with Linux/Unix\u003cbr/\u003e- Experience with CI/CD pipelines build processes","business_category":"alexa-and-amazon-devices","city":"Bellevue","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the capacity, flexibility, and performance to serve a wide range of customers, from individual households to schools, hospitals, businesses, government agencies, and other organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eAs a Sr. System Development Engineer, you will build tools and processes for monitoring, operating, and scaling ground infrastructure to millions of users around the globe. Use and enhance the tools you and the team develop. Using metrics, scalability in design, and continuous improvement, you will automate repetitive processes to eliminate outages and enable high availability of the ground infrastructure. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e - Continuously strive for operational excellence by seeking to automate away manual processes\u003cbr/\u003e - Ensure that all systems are designed to be robust, scalable, maintainable and adaptable as the service scales and evolves over time\u003cbr/\u003e - Build and maintain critical infrastructure, tools and operating procedures to report on the health of ground infrastructure.\u003cbr/\u003e- Integrate with other existing systems such as trouble ticketing, dashboards, and metrics tools and services\u003cbr/\u003e- Measure and improve the performance and availability of the Amazon Leo Ground Infrastructure\u003cbr/\u003e - Provide critical operations support and incident response for the service, while taking part in an on-call rotation\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eDesign, Coding, Operational Excellence: \u003cbr/\u003e\u003cbr/\u003eWork with business partners, engineers, design of systems. We need your ideas and your ability to take initiative, innovate, and produce results as we continuously improve the customer experience. \u003cbr/\u003e\u003cbr/\u003eDay to day work will vary between automation or other scripting work, operational excellence initiatives, design meetings, coordination with engineering teams and external partners, and an on-call rotation.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe team is comprised of a leader and System Development Engineers in North America, Europe and Australia. The overall mission is to ensure Amazon Leo Ground Infrastructure is always available to serve customers.","department_cost_center":null,"description_short":"Amazon Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the","display_distance":null,"id":"4bbf016d-0fee-4a6b-81b9-d7a1c143ebd2","id_icims":"3065103","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"System Development Engineering","job_function_id":null,"job_path":"/en/jobs/3065103/systems-development-engineer-ground-infrastructure-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA107\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":["military-operations","military-tech","military-na","military","devices-apjc","devices-manufacturing","devices-services.kuiper-prod-ops"],"posted_date":"August 25, 2025","preferred_qualifications":"- Experience with distributed systems at scale\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Bellevue - 129,200.00 - 174,800.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Systems Development Engineer - Ground Infrastructure, Amazon Leo ","university_job":null,"updated_time":"about 3 hours","url_next_step":"https://account.amazon.com/jobs/3065103/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team\u003cbr/\u003e- Experience programming in Python","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon's low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon Leo will serve people and organizations operating in locations without reliable connectivity.\u003cbr/\u003e\t\u003cbr/\u003eExport Control Requirement: Due to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eInnovation is part of our DNA! Our goal is to be Earth's most customer centric company, and we are just getting started. We need people who want to join an ambitious program that continues to push the state of the art in space based systems design.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eYou should be comfortable with a high degree of ambiguity and relish the idea of solving problems that haven't been solved at scale before. Along the way, we guarantee that you will learn a lot, have fun and make a positive impact on tens of millions of people.\u003cbr/\u003e\u003cbr/\u003eIn this role, you will:\u003cbr/\u003e\t• Architect and build software to automate hardware test systems\u003cbr/\u003e\t• Develop software infrastructure to support test case execution\u003cbr/\u003e\t• Architect and build automation to support development (CI/CD)\u003cbr/\u003e\t• Align with various stakeholders on software requirements\u003cbr/\u003e\t• Document software requirements from users\u003cbr/\u003e\t• Support manufacturing as well as new product development\u003cbr/\u003e\t• Enable automated data collection, data analysis\u003cbr/\u003e\t• Deliver end-user documents\u003cbr/\u003e\t• Own and execute software quality and release process\u003cbr/\u003e\t• Work with electrical test equipment\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou will have the opportunity to write software to test exciting products and help us bring our idea to reality.  Your software will enable the team to validate our designs and ensure all our hardware is space-worthy.  You will make daily decision on how to best create and deliver these tools.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThis Software Development Engineer will have the opportunity to be a member of the Hardware Validation Team working within the wider Electrical Engineering Team.   This highly collaborative group of engineers has a diverse range of backgrounds and knowledge and looking for help to build a scalable and reliable test automation solution.  The team support both internal test needs as well as the needs of the manufacturing team.  They like to leverage and share work across the entire organization as well as utilize AWS resources and tools to accelerate their work.","department_cost_center":null,"description_short":"Amazon Leo is Amazon's low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to","display_distance":null,"id":"eb52c32c-1467-45c5-aab3-6da28537d850","id_icims":"3153885","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3153885/senior-software-dev-engineer-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA111\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":["kuiper-sde"],"posted_date":"January  6, 2026","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $151,300/year in our lowest geographic market up to $261,500/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Senior Software Dev Engineer, Amazon Leo","university_job":null,"updated_time":"about 3 hours","url_next_step":"https://account.amazon.com/jobs/3153885/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 8+ years of specific technology domain areas (e.g. software development, cloud computing, systems engineering, infrastructure, security, networking, data \u0026 analytics) experience\u003cbr/\u003e- 3+ years of design, implementation, or consulting in applications and infrastructures experience\u003cbr/\u003e- 10+ years of IT development or implementation/consulting in the software or Internet industries experience","business_category":"alexa-and-amazon-devices","city":"Bellevue","company_name":"Amazon Kuiper Commercial Services LLC","country_code":"USA","description":"Amazon Leo is an initiative to increase global broadband access through a constellation of 3,236 satellites in low Earth orbit (LEO). Its mission is to bring fast, affordable broadband to unserved and underserved communities around the world. Amazon Leo will help close the digital divide by delivering fast, affordable broadband to a wide range of customers, including consumers, businesses, government agencies, and other organizations operating in places without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eAmazon Leo is looking for experienced, creative, technical leaders to drive adoption of Leo broadband solutions in the telecommunications segment. This is an exciting opportunity to own definition and execution of solution development with Mobile Network Operators and telecom ecosystem partners.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Be the voice of the customer to influence the roadmap of new features and service capabilities.\u003cbr/\u003e• Incubate and launch new solutions to enable customer use cases.\u003cbr/\u003e• Understand the technical requirements of our customers and work closely with the product management and engineering teams to guide the direction of our product offerings and evolution.\u003cbr/\u003e• Be creative to help solve technical and commercial blockers and develop new product offerings.\u003cbr/\u003e• Earn trust with customers with transparency and subject matter expertise\u003cbr/\u003e• Focus on complex technical solutions and develop long-term strategic partnerships.\u003cbr/\u003e• Create and capture best practices, technical content and new reference architectures (e.g. white papers, code samples, blog posts)\u003cbr/\u003e• Contribute to the growth of the Solutions Architecture organization by hiring, coaching and mentoring others.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eHere at Amazon, we embrace our differences. We are committed to furthering our culture of inclusion. Amazon has ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and host annual and ongoing learning experiences. Amazon’s culture of inclusion is reinforced within our 16 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious and earn trust.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded professional and enable them to take on more complex tasks in the future.\u003cbr/\u003e\u003cbr/\u003eInnovation is part of our DNA! Our goal is to be Earth's most customer-centric company, and we are just getting started. We need people who want to join an ambitious program that continues to push the state of the art in space based systems design and wireless systems.","department_cost_center":null,"description_short":"Amazon Leo is an initiative to increase global broadband access through a constellation of 3,236 satellites in low Earth orbit (LEO). Its mission is to bring fast, affordable broadband to unserved and","display_distance":null,"id":"a2dc16a0-a443-4d03-9e38-1e0a63b1bf38","id_icims":"3186498","is_intern":null,"is_manager":null,"job_category":"Solutions Architect","job_family":"Solution Architect","job_function_id":null,"job_path":"/en/jobs/3186498/sr-solutions-architect-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"BELLEVUE\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, BELLEVUE\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, BELLEVUE\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA106\"],\"normalizedCityName\":\"Bellevue\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA106\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"February 22, 2026","preferred_qualifications":"- 5+ years of infrastructure architecture, database architecture and networking experience\u003cbr/\u003e- Knowledge of SAP systems (like SAP Business Suite, S/4HANA, SAP Business Warehouse, SAP HANA, SAP Business Objects, etc.) and their architecture and infrastructure needs\u003cbr/\u003e- Experience working with end user or developer communities\u003cbr/\u003e- Experience managing relationships with SAP customers and partners\u003cbr/\u003e- Experience in SAP S/4HANA, SAP Cloud Platform, SAP Cloud ERP and Cloud ERP Private\u003cbr/\u003e- Experience in SAP clean core design concepts, including design and build using non-SAP technologies in domains such as Generative / Agentic AI, and data \u0026 analytics\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Bellevue - 153,600.00 - 207,800.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Sr. Solutions Architect, Amazon Leo","university_job":null,"updated_time":"about 4 hours","url_next_step":"https://account.amazon.com/jobs/3186498/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 6+ years of business development, partner development, sales or alliances management experience\u003cbr/\u003e- 6+ years of customer-facing work, engaging with customer executives, technologists or partners to solve business problems with advanced technologies experience\u003cbr/\u003e- 6+ years of experience in one or more of the following industries: Space Satellite technology, Telecommunications Network Technology, and commercial frameworks","business_category":"alexa-and-amazon-devices","city":"Virtual","company_name":"Amazon Kuiper Commercial Services LLC","country_code":"USA","description":"Application deadline: Feb 27, 2026\u003cbr/\u003e\u003cbr/\u003eHave you ever wanted to be part of a team who is building industry changing technology? Amazon Leo is an initiative to launch a constellation of Low Earth Orbit satellites that will provide low-latency, high-speed broadband network connectivity to unserved and underserved communities around the world.\u003cbr/\u003e\u003cbr/\u003eDo you want to work at a company where you are the owner, where you are encouraged to build, and where you have the autonomy to push boundaries? Do you have a passion for design and a desire to bring delightful,  products and services to life in an entirely new way? This describes your daily journey. Are you ready? Then join us on Amazon Leo.\u003cbr/\u003e\u003cbr/\u003eAmazon Leo is looking for experienced, self-starter Senior Sales Leader to drive adoption of Leo broadband and additional services with Mobile Network Operators in North America. This is an exciting opportunity to influence and implement the Amazon Leo sales strategy with strategic partners in North American. This position is located in Bellevue WA or Arlington VA and also open to candidates in or within reasonable distance of other Amazon corporate office locations.\u003cbr/\u003e\u003cbr/\u003eThis position may require access to information, technology, or hardware that is subject to export control laws and regulations, including the Export Administration Regulations (EAR) and the International Traffic in Arms Regulations (ITAR). Employment in this position is contingent upon obtaining any required export licenses or other approvals from the United States government. As such, the successful candidate must be eligible to obtain any necessary export licenses or approvals based on their nationality, citizenship, and any other factors considered by the applicable export control regulations.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tInfluence strategy for Amazon Leo with specific focus on Mobile Network Operators in North America\u003cbr/\u003e•\tCurious to learn in depth about both technology and our customers\u003cbr/\u003e•\tA curious self-starter with a proven track record of diving into unknown territory, learning new concepts, and pushing your comfort zone.\u003cbr/\u003e•\tAn effective multi-tasker who navigates a fast-paced, deadline-driven environment with grace and efficiency.\u003cbr/\u003e•\tExcellent at creating and maintaining working relationships across all levels and disciplines, receptive to feedback and input from others, and quick to apply changes.\u003cbr/\u003e•\tWork with internal subject matter experts to gather information, synthesize business and technical concepts, build strategic business metrics, and write original content that drives decision-making at the highest levels of the organization.\u003cbr/\u003e•\tExperience working in start-up mode building or supporting products and services from the ground up. \u003cbr/\u003e•\tImplement business development plan while working with key internal stakeholders (e.g., Amazon Leo product and engineering teams, legal, support)\u003cbr/\u003e•\tManage complex contract negotiations and complex business requirements and activities which deliver results.\u003cbr/\u003e•\tAdept at thinking strategically and analytically about business, product, and technical challenges, with the ability to build and convey compelling value propositions, and work cross-organizationally to build consensus.\u003cbr/\u003e•\tAction-oriented, detailed programmatic approach to implement complex programs and strategic initiatives with customers\u003cbr/\u003e•\tConsistently exceeds key performance metrics and Delivers Results\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAbout the team\u003cbr/\u003eHere at Amazon, we embrace our differences. We are committed to furthering our culture of inclusion. Amazon has ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and host annual and ongoing learning experiences. Amazon’s culture of inclusion is reinforced within our 16 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious and earn trust.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eOur team puts a high value on work-life balance. It isn’t about how many hours you spend at home or at work; it’s about the flow you establish that brings energy to both parts of your life. We believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfillment. We offer flexibility in working hours and encourage you to find your own balance between your work and personal lives.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded professional and enable them to take on more complex tasks in the future.\u003cbr/\u003e\u003cbr/\u003eInnovation is part of our DNA! Our goal is to be Earth's most customer-centric company, and we are just getting started. We need people who want to join an ambitious program that continues to push the state of the art in space based systems design and wireless systems.","department_cost_center":null,"description_short":"Have you ever wanted to be part of a team who is building industry changing technology? Amazon Leo is an initiative to launch a constellation of Low Earth Orbit satellites that will provide low-latency,","display_distance":null,"id":"469709e0-b0cc-410a-90c8-5ab6730a490a","id_icims":"3186497","is_intern":null,"is_manager":null,"job_category":"Business \u0026 Merchant Development","job_family":"Tech Sales","job_function_id":null,"job_path":"/en/jobs/3186497/technical-sales-mobile-operator-amazon-leo-amazon-leo","job_schedule_type":"full-time","location":"US, Virtual","locations":["{\"normalizedCountryCode\":\"USA\",\"city\":\"Virtual\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, Virtual\",\"coordinates\":\"38.89036,-77.03196\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"USA\",\"location\":\"US, Virtual\",\"region\":\"\",\"buildingCodeList\":[\"VIR\"]}"],"normalized_location":"USA","optional_search_labels":[],"posted_date":"February 22, 2026","preferred_qualifications":"- Experience managing complex customer relationships and initiatives with considerable impact where the customer need, sales strategy, and opportunity are not defined\u003cbr/\u003e- Experience performing complex business case analysis to justify technical decisions and presenting the justification to management in a high-level review\u003cbr/\u003e- 6+ years of technology related sales, business development or equivalent experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments, restricted stock units (RSUs), and sales incentives. Final compensation will be determined based on factors including experience, qualifications, and location. \u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eAmazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, , Virtual - 142,800.00 - 193,200.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":null,"title":"Technical Sales, Mobile Operator, Amazon Leo, Amazon Leo","university_job":null,"updated_time":"about 4 hours","url_next_step":"https://account.amazon.com/jobs/3186497/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language\u003cbr/\u003e- Bachelor's degree in Computer Science","business_category":"fulfillment-and-operations","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":" At Amazon, the Leadership Principle \"Strive to be Earth’s Best Employer\" challenges us to create a safer, more productive, higher-performing, diverse, and just work environment. It reinforces the operating principle that nothing is more important than the safety and well-being of our global workforce. At Workplace Health and Safety (WHS), we strive to achieve this every day. We understand that people are at the center of safety, and we invest in talent that shares our passion for improving the safety of our global workforce. The WHS Tech team works on technology solutions such as sensor-based Internet of Things (IoT) solutions, web applications in native AWS, Generative AI based applications, and Computer Vision applications to enhance the safety of the global Operations workforce. If creating industry-first products and solutions interests you, then this is the team for you!\u003cbr/\u003e\u003cbr/\u003eWe are seeking smart, passionate engineers to own and manage these strategic initiatives. The ideal candidate is a self-starter, comfortable with ambiguity, and will move quickly with a high degree of ownership. As a member of this team, you will have opportunities to work on a wide array of technologies and build scalable, reliable products for the global network. You will build on top of Amazon’s extensive development infrastructure, leverage internal tools and community to learn and grow your technical skills, and drive impact on critical outcomes that are important to Amazon.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e1. Lead the entire product lifecycle, including design, implementation, testing, release, and maintenance of highly scalable distributed software systems.\u003cbr/\u003e2. Identify and enhance team processes and best practices, influence technical direction, drive operational excellence, and maintain quality standards for team deliverables.\u003cbr/\u003e3. Collaborate closely with Product Managers, Technical Program Managers, and cross-functional engineering teams to deliver new product features.\u003cbr/\u003e4. Mentor and develop junior engineers, demonstrating best development practices and providing constructive feedback.\u003cbr/\u003e5. Possess strong written and verbal communication skills.","department_cost_center":null,"description_short":" At Amazon, the Leadership Principle \"Strive to be Earth’s Best Employer\" challenges us to create a safer, more productive, higher-performing, diverse, and just work environment. It reinforces the operating","display_distance":null,"id":"43c26b02-ffe7-40ac-b7ce-f4e60800bbf3","id_icims":"3186495","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3186495/software-dev-engineer-ii-global-whs","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR22\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"February 22, 2026","preferred_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- Master's degree in Computer Science\u003cbr/\u003e- Experience in machine learning, data mining, information retrieval, statistics or natural language processing\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"KA","title":"Software Dev Engineer II, Global WHS","university_job":null,"updated_time":"about 5 hours","url_next_step":"https://account.amazon.com/jobs/3186495/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of program or project management experience\u003cbr/\u003e- Experience using data and metrics to determine and drive improvements\u003cbr/\u003e- Experience owning program strategy, end to end delivery, and communicating results to senior leadership\u003cbr/\u003e- 5+ years of cross functional project delivery experience\u003cbr/\u003e- Experience working cross functionally with tech and non-tech teams\u003cbr/\u003e- Bachelor’s degree in one of the following fields or similar: Occupational Health \u0026 Safety, Industrial Engineering, Education, Adult Learning or Instructional Design, Business Management","business_category":"fulfillment-and-operations","city":"Nashville","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon is seeking an experienced and enthusiastic Senior Training Manager to lead global Powered Industrial Truck (PIT) Training within the Workplace Health \u0026 Safety (WHS) organization. \u003cbr/\u003eThis position offers the chance to modernize and scale PIT training worldwide, building mechanisms that strengthen safety outcomes and support compliance across Operations. The Sr. Mgr will own the launch of new PIT training content, oversee continuous improvement, and guide change management efforts. A key part of the role is ensuring all training programs, materials, and procedures meet global regulatory requirements and internal compliance standards, and that updates are implemented consistently across regions.\u003cbr/\u003eYou will work cross-functionally with WHS, Operations, Learning, Instructional Designers, and global business partners to design, deploy, audit, and refine PIT training. This includes monitoring regulatory changes, validating alignment with compliance expectations, and partnering with legal and policy teams as needed.\u003cbr/\u003eSuccess in this role requires strong analytical acumen, clear communication, and the ability to influence leaders at every level. You will build strategy, drive execution, develop KPIs, and continually identify opportunities to improve adoption, effectiveness, compliance, and overall operational excellence.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Lead the global strategy, development, launch, and maintenance of PIT training programs, maintaining alignment with regulatory requirements and internal compliance standards.\u003cbr/\u003e• Serve as the global subject-matter expert (SME) for PIT training, acting as the primary point of contact for compliance expectations across regions and business units.\u003cbr/\u003e• Design and execute global training roadmaps, including gap analyses, standard setting, and long-term regulatory readiness planning.\u003cbr/\u003e• Lead change management efforts for new and updated PIT training, driving consistent implementation, adoption, and regulatory alignment worldwide.\u003cbr/\u003e• Establish scalable communication mechanisms to support training launches, program updates, and compliance or regulatory changes.\u003cbr/\u003e• Audit PIT training procedures, documentation, and materials, partnering with national and global teams to achieve accuracy, consistency, and regulatory adherence.\u003cbr/\u003e• Build and maintain strong cross-functional partnerships with WHS, Operations, Learning, Legal, and global stakeholders to embed training into operational rhythms and strengthen safety culture.\u003cbr/\u003e• Define and manage success metrics and KPIs, using data to measure program effectiveness, learner performance, compliance health, and business impact.\u003cbr/\u003e• Analyze trends and risks to identify compliance gaps and improvement opportunities, driving continuous improvement through stakeholder feedback and data insights.\u003cbr/\u003e• Provide clear leadership reporting through business reviews and status updates, highlighting progress, risks, compliance posture, and corrective actions.","department_cost_center":null,"description_short":"Amazon is seeking an experienced and enthusiastic Senior Training Manager to lead global Powered Industrial Truck (PIT) Training within the Workplace Health \u0026 Safety (WHS) organization. This position offers","display_distance":null,"id":"111c78ce-5fe1-44f3-8f7c-bff5ddd62dcc","id_icims":"3186493","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Program Management","job_function_id":null,"job_path":"/en/jobs/3186493/sr-program-manager-powered-industrial-truck-pit-training-safety-learning-and-development","job_schedule_type":"full-time","location":"US, TN, Nashville","locations":["{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Nashville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Nashville\",\"coordinates\":\"36.16792,-86.77798\",\"normalizedCountyName\":\"Davidson\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Nashville, Tennessee, USA\",\"location\":\"US, TN, Nashville\",\"region\":\"TN\",\"buildingCodeList\":[\"BNA12\"],\"normalizedCityName\":\"Nashville\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA94\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Nashville, Tennessee, USA","optional_search_labels":[],"posted_date":"February 22, 2026","preferred_qualifications":"- 2+ years of driving process improvements experience\u003cbr/\u003e- Master's degree, or Master's degree in business, operations, human resources, adult education, organizational development, instructional design or related field\u003cbr/\u003e- Experience implementing repeatable processes and driving automation or standardization\u003cbr/\u003e- Experience with safety programs, PIT operations, training development, or regulatory compliance\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TN, Nashville - 104,100.00 - 155,400.00 USD annually\u003cbr/\u003eUSA, WA, Bellevue - 115,600.00 - 160,000.00 USD annually","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"TN","title":"Sr Program Manager, Powered Industrial Truck (PIT) Training , Safety Learning and Development","university_job":null,"updated_time":"about 5 hours","url_next_step":"https://account.amazon.com/jobs/3186493/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of program or project management experience\u003cbr/\u003e- 3+ years of defining and implementing process improvement initiatives using data and metrics experience\u003cbr/\u003e- Knowledge of Excel (Pivot Tables, VLookUps) at an advanced level and SQL\u003cbr/\u003e- Experience using data and metrics to determine and drive improvements\u003cbr/\u003e- Experience working cross functionally with tech and non-tech teams\u003cbr/\u003e- Bachelor's degree","business_category":"fulfillment-and-operations","city":"Nashville","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The New Construction \u0026 Launch Workplace Health and Safety Program Manager (WHS PM) will be responsible for partnering with the Launch and Engineering teams to manage the safety deliverables required when opening new sites. They will execute the new site safety start-up plan to help ensure the site successfully implements our company safety procedures and all applicable local and regional regulations. The New Construction \u0026 Launch WHS PM will coordinate safety start-up functions.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eJob requires up to 75% travel to new launch sites during Construction phase through post launch visits. This role requires strong communication skills with stakeholders and senior leaders, strong written and verbal communication skills, self-motivated and strong organizational skills, ability to track metrics and meet standard KPI's, deliver on self-obtained projects to improve design and reduce risk, and ability to work with 3P's as well as Operational teams.\u003cbr/\u003e\u003cbr/\u003eThe New Construction \u0026 Launch WHS PM must demonstrate the ability to build trust and confidence with the Design, Engineering, Construction, Startup, Launch and New Site WHS teams. This individual must be an effective communicator and send clear, concise and consistent messages, both verbally and in writing. They will be required to possess excellent safety and relevant environmental and ergonomic knowledge and to demonstrate this expertise when working with Operations and Engineering teams. \u003cbr/\u003e\u003cbr/\u003eManage and monitor the safety start-up plan for all new sites\u003cbr/\u003eEnsure Amazon buildings are designed and built compliant to regulatory and Amazon standards\u003cbr/\u003eConduct design composite reviews for compliance with Amazon standards and regulatory requirements\u003cbr/\u003eConduct site safety, health and environmental commissioning inspections.\u003cbr/\u003eCreate and maintain punch lists with relevant teams.\u003cbr/\u003eIdentify the required safety supplies for new site start-up. Assist in the procurement of the safety items. Set-up all site safety supplies onsite as needed\u003cbr/\u003ePerform regular analysis and risk assessment of new build processes and equipment for site safety improvements and continuous standards improvement\u003cbr/\u003eDevelop safety commissioning lists with relevant teams\u003cbr/\u003eSet-up new site in all appropriate safety databases\u003cbr/\u003eInspect and certify PIT equipment meets Amazon requirements\u003cbr/\u003eSchedule applicable Safety training for site Safety team and managers with a local trainer\u003cbr/\u003eDevelop a positive working relationship with stakeholders involved throughout the project\u003cbr/\u003e Project Work for topics relating to the network\u003cbr/\u003eMaintain communication with Operational directors and General Managers\u003cbr/\u003eLead and influence cross functional teams as required to deliver safety centered processes and building designs\u003cbr/\u003eReview operations and determine the required site safety signage\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include:\u003cbr/\u003e1. Medical, Dental, and Vision Coverage\u003cbr/\u003e2. Maternity and Parental Leave Options\u003cbr/\u003e3. Paid Time Off (PTO)\u003cbr/\u003e4. 401(k) Plan\u003cbr/\u003e\u003cbr/\u003eIf you are not sure that every qualification on the list above describes you exactly, we'd still love to hear from you! At Amazon, we value people with unique backgrounds, experiences, and skill sets. If you’re passionate about this role and want to make an impact on a global scale, please apply! \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eRole consists of building template review/design to ensure it meets regulatory requirements, all safety requirements, aligns with current Amazon Policies and Procedures, and Federal/State/Local jurisdiction requirements. PM will also be responsible for traveling to the site during construction to perform commissioning of equipment/building/modules/safety supplies. Post launch lessons learned, design changes, and module updates/changes will be documented and actioned. Collaboration with stakeholders to align on changes/improvements of design including risk assessments and risk reduction.","department_cost_center":null,"description_short":"The New Construction \u0026 Launch Workplace Health and Safety Program Manager (WHS PM) will be responsible for partnering with the Launch and Engineering teams to manage the safety deliverables required when","display_distance":null,"id":"4040dea5-e6b0-4554-91db-a87883fb1a5c","id_icims":"3186494","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Program Management","job_function_id":null,"job_path":"/en/jobs/3186494/design-startup-workplace-healthy-and-safety-program-manager-whs-design-construction-startup-whs-dcs","job_schedule_type":"full-time","location":"US, TN, Nashville","locations":["{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Nashville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Nashville\",\"coordinates\":\"36.16792,-86.77798\",\"normalizedCountyName\":\"Davidson\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Nashville, Tennessee, USA\",\"location\":\"US, TN, Nashville\",\"region\":\"TN\",\"buildingCodeList\":[\"BNA12\"],\"normalizedCityName\":\"Nashville\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA94\"],\"normalizedCityName\":\"Bellevue\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS19\"],\"normalizedCityName\":\"Arlington\"}"],"normalized_location":"Nashville, Tennessee, USA","optional_search_labels":[],"posted_date":"February 22, 2026","preferred_qualifications":"- 3+ years of driving end to end delivery, and communicating results to senior leadership experience\u003cbr/\u003e- 3+ years of driving process improvements experience\u003cbr/\u003e- Experience in stakeholder management, dealing with multiple stakeholders at varied levels of the organization\u003cbr/\u003e- Experience building processes, project management, and schedules\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $66,800/year in our lowest geographic market up to $142,800/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"TN","title":"Design \u0026 Startup Workplace Healthy and Safety Program Manager, WHS Design, Construction \u0026 Startup, WHS DCS","university_job":null,"updated_time":"about 5 hours","url_next_step":"https://account.amazon.com/jobs/3186494/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}