{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- Current valid Basic Life Support (BLS) certification by an approved emergency cardiac care (ECC) provider; AND must have one of the following:\u003cbr/\u003e- Current valid Emergency Medical Technician (EMT) \u003cspan style=\"font-weight: bold;\"\u003eOR\u003c/span\u003e Paramedic Certification from the Department of Health \u003cspan style=\"font-weight: bold;\"\u003eOR\u003c/span\u003e the National Registry of Emergency Medical Technicians (NREMT); \u003cspan style=\"font-weight: bold;\"\u003eOR\u003c/span\u003e\u003cbr/\u003e- Current Active Athletic Trainer Certification by either the Board of Certification (BOC) or equivalent State Certification","business_category":"fulfillment-and-operations","city":"Houston","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. The Amazon Workplace Health \u0026 Safety (WHS) team sets the strategic direction to provide resources, best practices, and safe environments to proactively manage the health and wellbeing of our workforce. To support these goals, Amazon is seeking an experienced and dynamic Onsite Medical Representative (OMR) to join our team. In this position, you will work closely with the WHS Site Manager, WHS Specialist, and occasionally the Injury Prevention Specialist (IPS). This includes attending weekly associate safety committee meetings, greeting all new hires for the site or through daily one-on-one interaction. Additionally, the OMR will participate in weekly case management review meetings as necessary. As an OMR, you will independently assess and administer first aid as well as offer guidance to Amazon Associates (AAs) on both occupational and non-occupational injuries or illnesses. You should be passionate about learning and advocating health and wellness principles to consistently support AAs on a daily basis. You will refer care to outside medical providers as needed, and learn about OSHA regulations, risk, and analysis. The OMR will function as a part of the larger team onsite, assisting with all first aid needs and support safety operations as needed. \u003cbr/\u003e\u003cbr/\u003eResponsibilities include but are not limited to:\u003cbr/\u003e- Provide first aid support and make referrals to outside medical providers as necessary.\u003cbr/\u003e- Minimize the AA risk of injury through awareness, education, and proactive engagement.\u003cbr/\u003e- Maintain all records of care provided to AAs.\u003cbr/\u003e- Coordinate and maintain the workers’ compensation and return to work programs for AAs with work-related injuries.\u003cbr/\u003e- Provide daily activity logs and end of shift reports.\u003cbr/\u003e- Engage with AAs and leadership on operations floor to provide coaching regarding observed at-risk work habits.\u003cbr/\u003e- Maintain a clean working environment and ensure appropriate medical supply inventory is maintained.\u003cbr/\u003e- Participate in training and certification to facilitate first aid, CPR and AED certifications classes.\u003cbr/\u003e- Maintain all first aid, CPR, AED credentials.\u003cbr/\u003e- Work flexible shifts which could include days, nights, holidays, and/or weekends.\u003cbr/\u003e- Assist with random saliva drug testing protocols.\u003cbr/\u003e- Maintain effective care delivery in emergencies and assist emergency response at the site.\u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements include: \u003cbr/\u003e- Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Stand/walk for up to 12 hours during shifts\u003cbr/\u003e- Work in an environment where the noise level varies\u003cbr/\u003e- Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e- Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e\u003cbr/\u003eFor those that do not have an adult First Aid, CPR, AED certification from the American Heart Association or American Red Cross, must obtain within 3 weeks of start date.","department_cost_center":null,"description_short":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. The Amazon","display_distance":null,"id":"0cea41a7-9f90-4559-99d6-21791ce30eff","id_icims":"3171685","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Onsite Medical Services","job_function_id":null,"job_path":"/en/jobs/3171685/onsite-medical-representative","job_schedule_type":"full-time","location":"US, TX, Houston","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Houston\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Houston\",\"coordinates\":\"29.76078,-95.36952\",\"normalizedCountyName\":\"Harris\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Houston, Texas, USA\",\"location\":\"US, TX, Houston\",\"region\":\"TX\",\"buildingCodeList\":[\"WFM10645\",\"ZHS4\",\"ONM185\",\"IAH52\",\"IAH53\",\"XCH1\",\"ELRS26\",\"LHT4\",\"PAH1\",\"LHO7\",\"UTX3\",\"ZHS5\",\"LHT3\",\"IAH65\",\"IAH51\",\"ONM187\",\"IAH54\",\"ZHO1\",\"DHT5\",\"HOU14\",\"HON5\",\"HRS2\",\"TCH1\",\"WFM612\",\"HOU11\",\"ZHS7\",\"WFM115\",\"ELRS22\",\"IAH3\",\"ONM182\",\"SAH1\",\"WFM645\",\"HOU15\",\"ZHS1\",\"ONM219\",\"IAH50\",\"IAH56\",\"ELRS23\",\"JIA6\",\"ZHS8\",\"HOU40\",\"ZHS2\",\"ONM188\",\"ZHT1\",\"LHO6\",\"DPA7\",\"STX5\",\"HOU18\",\"WFM134\",\"LHO9\",\"LIDH\",\"IAH63\",\"XHX7\",\"IAH800\",\"WFM251\",\"HHO2\",\"ZHT2\",\"DHO2\",\"LTX3\",\"ZHT3\",\"TXS4\",\"IAH6\",\"DHO3\",\"LHO1\",\"IAH61\",\"KIAH1\",\"WFM552\",\"WFM497\",\"R086\",\"WFM652\",\"IAH62\",\"DHO4\",\"ONM181\",\"DHO1\",\"IAH7\",\"HOU2\",\"LHO2\",\"HOU17\",\"WFM346\",\"LHX1\",\"AHA1\",\"MUVA\",\"R059\",\"ZHO2\",\"IAH55\",\"DHT3\",\"LMTH\",\"DHX7\",\"XIA2\",\"IAH64\",\"DHX1\",\"ONM190\",\"IAH140\",\"HOU01\",\"AHA2\",\"HOU16\",\"HOU7\",\"R024\",\"ZHS3\",\"ZHS6\",\"ONM189\",\"DHO5\",\"ONM186\",\"ELRS24\",\"IAHA\",\"LHT2\",\"DHO8\",\"HOU1\"],\"normalizedCityName\":\"Houston\"}"],"normalized_location":"Houston, Texas, USA","optional_search_labels":[],"posted_date":"February  2, 2026","preferred_qualifications":"- Certified to teach first aid, CPR, and AED training from American Heart Association or American Red Cross\u003cbr/\u003e- Proficient in Microsoft Office\u003cbr/\u003e- Experience with an industrial wellness program\u003cbr/\u003e- Experience managing musculoskeletal disorders, ergonomics, and coaching on body mechanics\u003cbr/\u003e- Demonstrated work experience with OSHA regulations and Workers Compensation\u003cbr/\u003e- Proficient in digital recordkeeping\u003cbr/\u003e- In the last year, six months job experience in the Military as a Combat Medic (U.S. Army), Field Medic (U.S. Army), Healthcare Specialist (U.S. Army), Hospital Corpsman (U.S. Navy), or Aerospace Medical Service Technician (U.S. Air Force)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, HOUSTON - 26.00 - 31.00 USD hourly\u003cbr/\u003eUSA, TX, Houston - 26.00 - 31.00 USD hourly","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"TX","title":"Onsite Medical Representative","university_job":null,"updated_time":"3 minutes","url_next_step":"https://account.amazon.com/jobs/3171685/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school diploma, or equivalent\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.\u003cbr/\u003e- 1+ years of computer/server hardware troubleshooting or related IT experience\"","business_category":"aws","city":"Canton","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring seamless data center operations that power millions of businesses and services worldwide. \u003cbr/\u003e \u003cbr/\u003eData Center Technicians should be willing to work both independently and with a team. Work prioritization, organizational skills, effective communication, and the ability to react quickly are critical to success. In addition to hardware and network repair, candidates will install equipment, create documentation, innovate solutions, and fix problems within the data center space. This team works in an environment that operates 24/7. Traveling within and outside of the regional work area is required. \u003cbr/\u003e \u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e-Performing server rack installations, hardware break-fix on various components, troubleshooting network issues, and responding to operational incidents that impact service availability, escalating to senior technicians and management as needed/required \u003cbr/\u003e-Serving as a primary contact point for both internal and external stakeholders, including engineers, software developers, vendors, and contractors \u003cbr/\u003e-Performing on-call duties and participating in scheduled maintenance and change management activities \u003cbr/\u003e-Contributing to documentation and process improvement initiatives based on your analysis of operational issues \u003cbr/\u003e-Helping to train and onboard new team members \u003cbr/\u003e\u003cbr/\u003ePhysical requirements: \u003cbr/\u003e\u003cbr/\u003e-Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds \u003cbr/\u003e-Working in cramped and/or elevated locations \u003cbr/\u003e-Bending, lifting, stretching, and reaching \u003cbr/\u003e-Standing and walking for up to 8+ hours a day \u003cbr/\u003e-Ascending and descending ladders, stairs, and gangways safely and without limitation \u003cbr/\u003e-Work in a noisy environment \u003cbr/\u003e-Work shifts longer than 8 hours to support 24/7 operations (covering both night and day shifts). \u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e-Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e-Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e-Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Data Center Technician professional, you have industry-leading technical abilities and demonstrate a breadth of knowledge while you: \u003cbr/\u003e-Take ownership of technical issues brought by their customer base, engaging other teams when needed to drive resolution \u003cbr/\u003e-Solve problems at their root and step back to understand the broader context \u003cbr/\u003e-Maintain service level agreements through the implementation of proactive issue detection and reporting \u003cbr/\u003e\u003cbr/\u003eYou will be required to work shift work that will include days/nights/weekends/holidays. Traveling within and outside of the regional work area is required. You will be responsible for having a reliable personal vehicle and valid driver's license to travel within the regional work area, as company transportation will not be provided. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring","display_distance":null,"id":"d780c090-b487-4425-a487-028c1de5cdf7","id_icims":"3151135","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3151135/data-center-technician","job_schedule_type":"full-time","location":"US, MS, Canton","locations":["{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Canton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Canton\",\"coordinates\":\"32.61258,-90.03472\",\"normalizedCountyName\":\"Madison\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Canton, Mississippi, USA\",\"location\":\"US, MS, Canton\",\"region\":\"MS\",\"buildingCodeList\":[\"JAN200\"],\"normalizedCityName\":\"Canton\"}"],"normalized_location":"Canton, Mississippi, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"January  2, 2026","preferred_qualifications":"- Experience in data center\u003cbr/\u003e- \"Experience managing work and priorities through a ticketing system\u003cbr/\u003e- An Associate’s degree, technical certification, or equivalent professional or military experience in a relevant field (e.g., computer science, networking engineering, etc.)\u003cbr/\u003e- Understanding of network design, protocols and layer 1/2 troubleshooting\"\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MS, Canton - 24.00 - 42.00 USD hourly","primary_search_label":"aws.team-it-services","source_system":"JobCreator","state":"MS","title":"Data Center Technician","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3151135/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-it-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Euclid","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager. In this role, you will lead a team of hourly workforce and will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e\u003cbr/\u003eOur Operation’s workflow has three major components: First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Support, mentor, and motivate your hourly workforce\u003cbr/\u003e* Manage safety, quality, productivity, and customer delivery promises\u003cbr/\u003e* Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e* Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e* Stand/walk for up to 12 hours during shifts\u003cbr/\u003e* Work in an environment where the noise level varies and can be loud\u003cbr/\u003e* Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e* Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e\u003cbr/\u003eOur fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Area Managers based on location preference and the business’ current openings.","department_cost_center":null,"description_short":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager.","display_distance":null,"id":"728d2658-c53e-4666-93c0-b97c7d49df51","id_icims":"3183869","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3183869/area-manager-ii","job_schedule_type":"full-time","location":"US, OH, Euclid","locations":["{\"normalizedStateName\":\"Ohio\",\"normalizedCountryCode\":\"USA\",\"city\":\"Euclid\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OH, Euclid\",\"coordinates\":\"41.59946,-81.52682\",\"normalizedCountyName\":\"Cuyahoga\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Euclid, Ohio, USA\",\"location\":\"US, OH, Euclid\",\"region\":\"OH\",\"buildingCodeList\":[\"CLE3\"],\"normalizedCityName\":\"Euclid\"}"],"normalized_location":"Euclid, Ohio, USA","optional_search_labels":[],"posted_date":"February 18, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 20+ employees\u003cbr/\u003e- Experience with process improvements (Lean process, Kaizen, and/or Six Sigma)\u003cbr/\u003e- Excellent customer service, communication, and interpersonal skills\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Industry experience in: retail, F\u0026B, military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, OH, Euclid - 70,000.00 - 90,900.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"OH","title":"Area Manager II ","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3183869/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"•\t3+ years of relevant experience with US Import Customs.\u003cbr/\u003e•\t3+ years of relevant experience with engaging customs brokers and handling import transactions end to end from shipment start to entry filing and record maintenance.\u003cbr/\u003e•\t3+ years of relevant experience with advanced Excel and ERP systems (preferably SAP) and ability to interpret data.\u003cbr/\u003e•\t3+ years of relevant experience in auditing customs transactions both self-assessments and responding to external audits.\u003cbr/\u003e•\t3+ years of relevant experience in industry and/or academia.","business_category":"alexa-and-amazon-devices","city":"Bellevue","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the capacity, flexibility, and performance to serve a wide range of customers, from individual households to schools, hospitals, businesses, government agencies, and other organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement: Due to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tManage import customs compliance for Amazon Leo imports including, but not limited to, harmonized tariff classifications, country of origin determination, product valuation reporting, import license applications, ACE reporting\u003cbr/\u003e•\tReview import documents for accuracy and completeness\u003cbr/\u003e•\tSupport Amazon Leo's customs brokers with necessary data to enable entry filing for Leo\u003cbr/\u003e•\tMonitor entry status of imports and provide updates to concerned departments of any holds or delays\u003cbr/\u003e•\tTake action to respond timely and compliantly to import holds (e.g., CBP / PGA holds)\u003cbr/\u003e•\tUpload and maintain electronic import files in record retention repository for audit purposes\u003cbr/\u003e•\tHTS classification for Leo imports, maintenance of items database in ERP system, support to HTS challenges, work with direct manager and Legal on classification rulings as required\u003cbr/\u003e•\tAnalyze customs tariffs \u0026 duty rates\u003cbr/\u003e•\tMaintain Amazon Leo's customs compliance work instructions and SOPs, manage document revisions and support the continuous process improvement of Leo's customs compliance program\u003cbr/\u003e•\tFollow the customs compliance internal controls program to ensure compliance with foreign regulations governing imports\u003cbr/\u003e•\tKeep and communicate metrics of imports including transit time, compliance accuracy, cost, customs broker performance and relevant data for Leo’s leadership\u003cbr/\u003e•\tConduct self-assessments (compliance audits) and implement necessary corrective actions\u003cbr/\u003e•\tProvide compliance training to new employees and cross-functional teams and keep training records\u003cbr/\u003e•\tAnalyze and interpret US import regulations and keep abreast of changes\u003cbr/\u003e•\tCollaborate with supply chain, procurement, finance, tax and engineering functions as required\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eHere at Amazon, we embrace our differences. We are committed to furthering our culture of inclusion. Amazon has ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and host annual and ongoing learning experiences. Amazon’s culture of inclusion is reinforced within our 16 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious and earn trust. At Amazon, our mission is to be the most customer-centric company on Earth. To get there, we need exceptionally talented, bright and driven people.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded professional and enable them to take on more complex tasks in the future.\u003cbr/\u003e\u003cbr/\u003eInnovation is part of our DNA! Our goal is to be Earth's most customer-centric company, and we are just getting started. We need people who want to join an ambitious program that continues to push the state of the art in space-based systems design and wireless systems.\u003cbr/\u003e\u003cbr/\u003eWe're dedicated to supporting new team members. Our team has a broad mix of experience levels and Amazon tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. Our team also puts a high value on work-life balance. Striking a healthy balance between your personal and professional life is crucial to your happiness and success here, which is why we aren’t focused on how many hours you spend at work or online. Instead, we’re happy to offer a flexible schedule so you can have a more productive and well-balanced life—both in and outside of work.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Import Compliance Analyst has the primary responsibility of ensuring Leo’s Compliance with US laws and regulations. Reporting to the Global Customs Operations Manager, the Import Compliance Analyst will promote the sustainability and longevity of Leo’s customs compliance program by developing and implementing guidelines and procedures for customs compliance policy, and coordinating activities involved in daily import transactions including, but not limited to, harmonized tariff classifications, country of origin determination, product valuation reporting, import license applications, ACE reporting, dealing with exception shipments, handling free trade agreements, among others. \u003cbr/\u003e\u003cbr/\u003eAs a critical member of our Global Trade \u0026 Compliance Team, the Import Compliance Analyst interfaces with internal and external customers, customs brokers, government officers and other functional areas to ensure compliance and coordination of imports. The Import Compliance Analyst will also identify improvement opportunities and assist with projects to support Global Trade \u0026 Compliance initiatives.","department_cost_center":null,"description_short":"Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the capacity,","display_distance":null,"id":"ac41dbcd-d455-44af-a68f-ad8d9769b188","id_icims":"3059168","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Security Industry Specialist","job_function_id":null,"job_path":"/en/jobs/3059168/global-customs-ops-analyst-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA106\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":["military-spouse","military-adapt","military-na","military","military-leadership","devices-services.kuiper-prod-ops"],"posted_date":"August 13, 2025","preferred_qualifications":"•\tUS Customs Broker's License is considered a plus.\u003cbr/\u003e•\tKnowledge of PGA's Regulations in the Aerospace industry is considered a plus.\u003cbr/\u003e•\tBe comfortable with ambiguity and curious to learn new skills.\u003cbr/\u003e•\tExperience working in start-up mode building or supporting the compliance program from the ground up.\u003cbr/\u003e•\tA curious self-starter with a proven track record of diving into unknown territory, learning new concepts, and pushing your comfort zone.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, BELLEVUE - 102,000.00 - 178,400.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Global Customs Ops Analyst, Amazon Leo","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3059168/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of Design/Innovation, research \u0026 development, manufacturing, process, industrial engineering, or related experience\u003cbr/\u003e- Experience in Design/Innovation, research \u0026 development, manufacturing, process, industrial engineering, or related work\u003cbr/\u003e- Experience in management of engineering design projects","business_category":"fulfillment-ops","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Delivery relies on a wide array of hardware, covering automotive, warehousing, automation and robotics. Join our Design Research team in Amazon Delivery to push the boundaries of hardware design in challenging settings, using state-of-the-art software and robotics developments to build new forms of machinery and human interfaces. As a service that interfaces with millions of people, hardware supporting Amazon Delivery is the face of the company.\u003cbr/\u003e\u003cbr/\u003eOur team shares a passion for innovation using advanced technologies, a love for solving complex challenges, and a desire to impact customers in a meaningful way. We're looking for individuals who like dealing with ambiguity, solving hard, large scale problems, and are excited about inter-disciplinary collaboration.\u003cbr/\u003e\u003cbr/\u003eThis Industrial Design role seeks a candidate to work with our engineering, operations, manufacturing, and UX design teams on the framing and definition of current and future product opportunities. Successful candidates will demonstrate a desire to experiment and work well with others.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Use 2D and 3D tools to create designs that combine product appeal, functionality, and manufacturability\u003cbr/\u003e- Work with multi-dimensional constraints to find a workable design solution\u003cbr/\u003e- Design and fabricate compelling functional and/or appearance prototypes for review by team leaders and executive staff\u003cbr/\u003e- Present to product and program stakeholders and build alignment\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Amazon Delivery Experience design studio is an interdisciplinary team covering visual, UX, industrial and communication design. Our studio encompasses all aspects of Amazon delivery, from items being sent for shipping, the actual delivery process, all the way to customers indicating their delivery preferences.","department_cost_center":null,"description_short":"Amazon Delivery relies on a wide array of hardware, covering automotive, warehousing, automation and robotics. Join our Design Research team in Amazon Delivery to push the boundaries of hardware design","display_distance":null,"id":"890224e5-0fb3-4174-8cc4-b7cfa6656b7c","id_icims":"3183974","is_intern":null,"is_manager":null,"job_category":"Buying, Planning, \u0026 Instock Management","job_family":"Product Design","job_function_id":null,"job_path":"/en/jobs/3183974/industrial-designer-amazon-delivery-experience","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA94\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"February 18, 2026","preferred_qualifications":"- Master's degree or equivalent in Mechanical Engineering, Industrial Design or related field\u003cbr/\u003e- Experience designing products with interactive elements\u003cbr/\u003e- Mastery of a variety of visualization methods\u003cbr/\u003e- Proven ability to write detailed design documentation\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Bellevue - 99,300.00 - 160,000.00 USD annually","primary_search_label":"fulfillment-ops.team-procurement","source_system":"JobCreator","state":"WA","title":"Industrial Designer, Amazon Delivery Experience","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3183974/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-procurement","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Currently enrolled in and actively pursuing an accredited bachelor’s degree in Engineering, Construction Management or comparable field with graduation between December 2026 and June of 2027.\u003cbr/\u003e- Able to work 40 hours a week for the duration of the internship.\u003cbr/\u003e- Fluent written and verbal communication in English and Spanish.\u003cbr/\u003e- This is not a remote internship opportunity. A relocation package may be offered, subject to an eligibility criterion.","business_category":"studentprograms","city":"Zaragoza","company_name":"Amazon EU SARL (Spain Branch)","country_code":"ESP","description":"During your internship period as a Construction/Pre-Construction Program Manager Intern, you will be working with and learning side by side from Amazon’s customer obsessed leaders in construction. In this role, you may support in the implementation of the facility network infrastructure, including new builds, retrofits and expansion. You will learn how to partner with internal customers and external stakeholders to earn their trust and engage as a team to deliver results. Some key competencies of the Amazon construction process that will provide learning opportunities include; insisting on the highest standards, supporting the team to ensure that contracted resources deliver work meeting duration and quality targets, thinking big (seeking better ways to serve your customers), influencing internal stakeholders while holding them accountable for their actions, supporting construction managers to ensure all job internal and external team members are on point and maintaining schedules and budgets, helping to invent and simplify innovative solutions that allow for improved processes and results, and supporting more than one project in various locations. This internship opportunity provides for the familiarization of construction, engineering, planning, project management, facilities management, and contract management. The Construction Program Manager Intern position may include travel to project sites.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Observing the implementation and management of Amazon’s safety programs and standards with the entire internal and external project team.\u003cbr/\u003e• Supporting the construction team to ensure that the skills and competencies of contract labor are appropriate to need and fit to undertake the work.\u003cbr/\u003e• Witnessing comprehensive budget, schedule tracking and forecasting which strives for frugality and accomplishing more with less while identifying and solving factors that may impede a successful project hand-over to Amazon stakeholders.\u003cbr/\u003e• Studying the coordination with the authorities that have jurisdiction  on the project to ensure regulatory compliance and smooth job execution.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eEach day you will be observing Amazon Construction Managers act as owner to ensure the safe on-time and in-budget execution of Amazon construction projects. You may be asked to participate in the daily tasks in support of the team which may be comprised of coordinating with contractors on projected changes and project status, ensuring contractors are meeting their contractual obligations, seeking sustainable environmentally friendly solutions throughout the construction process while implementing Amazon’s building environmentally friendly practices, and utilizing the Amazon information systems to record and update scheduling, budget, and other key developments. You may see and may be asked to assist in negotiating terms of contracts with contractors all the while driving contractors to meet or exceed agreed-to schedules and budgets. Additionally, you will observe and may participate in weekly architect, owner and contractor  meetings providing input on root causes and corrective action.\u003cbr/\u003eAbout the Team\u003cbr/\u003eAt Amazon, we are all Owners and leverage unique opportunities presented to us by owning everything through design review, construction bidding, construction execution, and final hand-off to our customers. We are a diverse, upbeat, creative, team of engineers and managers working daily to develop the innovative physical assets our Customers expect and striving to be the Earth’s best employer.","department_cost_center":null,"description_short":"During your internship period as a Construction/Pre-Construction Program Manager Intern, you will be working with and learning side by side from Amazon’s customer obsessed leaders in construction. In this","display_distance":null,"id":"8a9c55f8-df2e-4c50-95fe-7b796520f458","id_icims":"3183971","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3183971/construction-manager-intern","job_schedule_type":"full-time","location":"ES, Zaragoza","locations":["{\"normalizedStateName\":\"Aragon\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Zaragoza\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, Zaragoza\",\"coordinates\":\"41.65184,-0.8811\",\"normalizedCountyName\":\"Zaragoza\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Zaragoza, Aragon, ESP\",\"location\":\"ES, Zaragoza\",\"region\":\"\",\"buildingCodeList\":[\"ZAZ11\"],\"normalizedCityName\":\"Zaragoza\"}"],"normalized_location":"Zaragoza, Aragon, ESP","optional_search_labels":[],"posted_date":"February 18, 2026","preferred_qualifications":"- Strong academic, leadership, and/or extracurricular record.\u003cbr/\u003e- Effective interpersonal, written, and oral communication skills.\u003cbr/\u003e- Ability to influence across all levels of an organization.\u003cbr/\u003e- Strong time management skills\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"studentprograms.team-internships-for-students","source_system":"JobCreator","state":null,"title":"Construction Manager Intern","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3183971/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-internships-for-students","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"St. Thomas","company_name":"Amazon Canada Fulfillment Services, ULC","country_code":"CAN","description":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Operations Manager. In this role, you will lead and develop a team of salaried and hourly talent. You will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. To achieve this, managers are expected to provide their team with the tools needed for success while driving improvements in productivity and efficiency through data-driven decisions and analytical problem-solving. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e   \u003cbr/\u003e  Our Operation’s workflow has three major components:  First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer.\u003cbr/\u003e \u003cbr/\u003e\u003cbr/\u003e   Our fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Operations Managers based on location preference and the business’ current openings. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003e - Support,      mentor, and motivate your salaried and hourly workforce\u003cbr/\u003e - Lead      large-scope projects with site and regional impact\u003cbr/\u003e - Build and      execute productivity plans through forecast reviews, determining      productivity requirements, and partnering with other Leaders to load      balance \u003cbr/\u003e - Manage      safety, quality, productivity, and customer delivery promises \u003cbr/\u003e - Collaborate      with all support teams including Safety, Engineering, Loss Prevention,      Quality Assurance, Human Resources to develop plans to meet business      objectives\u003cbr/\u003e - Lift up to 49      pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e - Stand/walk for      up to 12 hours during shifts \u003cbr/\u003e - Work in an      environment where the noise level varies and can be loud\u003cbr/\u003e - Work in an      environment that is subject to variable temperatures and weather (delivery      stations include outside loading departments)\u003cbr/\u003e - Continuously      climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Operations Manager.","display_distance":null,"id":"63754851-db1f-452d-a9d0-06c2bbf9f096","id_icims":"3183951","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3183951/operations-manager","job_schedule_type":"full-time","location":"CA, ON, St. Thomas","locations":["{\"normalizedStateName\":\"Ontario\",\"normalizedCountryCode\":\"CAN\",\"city\":\"St. Thomas\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, ON, St. Thomas\",\"coordinates\":\"42.77896,-81.1932\",\"normalizedCountyName\":\"Elgin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"St Thomas, Ontario, CAN\",\"location\":\"CA, ON, St. Thomas\",\"region\":\"ON\",\"buildingCodeList\":[\"YXU1\"],\"normalizedCityName\":\"St Thomas\"}"],"normalized_location":"St Thomas, Ontario, CAN","optional_search_labels":[],"posted_date":"February 18, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(34, 34, 34)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. As a total compensation company, Amazon's package may include other elements such as sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon offers comprehensive benefits including health insurance (medical, dental, vision, prescription, basic life \u0026amp; AD\u0026amp;D insurance), Registered Retirement Savings Plan (RRSP), Deferred Profit Sharing Plan (DPSP), paid time off, and other resources to improve health and well-being. We thank all applicants for their interest, however only those interviewed will be advised as to hiring status.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eCAN, ON, St. Thomas - 98,900.00 - 165,200.00 CAD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"ON","title":"Operations Manager ","university_job":null,"updated_time":"21 minutes","url_next_step":"https://account.amazon.com/jobs/3183951/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Bachelor's degree, or CSSLP (Certified Secure Software Lifecycle Professional)\u003cbr/\u003e- Experience programming with at least one software programming language\u003cbr/\u003e- US government security clearance of top secret or above\u003cbr/\u003e- Current, active US  Government Security Clearance of Secret or above","business_category":"aws","city":"Herndon","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"AWS Security is looking for a driven professional to join its high-security systems engineering team to manage the operation of our physical access control system (PACS), as well as help us automate a sustainable and robust architecture for future growth. \u003cbr/\u003e\u003cbr/\u003eAs an SysDev, you will be responsible for the overall health and security of our critical service, providing excellent customer service to our partners in a classified environment.\u003cbr/\u003e\u003cbr/\u003eEngineers on this team play an integral role in the future of physical security. You will own the integration with enterprise and commodity hardware through proprietary and open source protocols, build extensible management tooling by which customers are delighted, produce infrastructure as code and robust operational monitoring that scales with our growing infrastructure. You will make sure the entire deployment process is performant, automated, and well tested to keep development iteration fast and unhindered by unnecessary operational misses.\u003cbr/\u003e\u003cbr/\u003eThis position requires that the candidate selected be a US Citizen and must currently possess an active Secret security clearance. The position further requires that, after start, the selected candidate obtain and maintain an active TS/SCI security clearance with polygraph and satisfy other security related requirements.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Architect and implement enterprise-scale security solutions from conception to production, including custom PACS integrations and security automation frameworks\u003cbr/\u003e- Design and develop high-availability distributed systems with emphasis on security,  scalability, and fault tolerance\u003cbr/\u003e- Lead the development of custom  security tools and frameworks for system hardening, threat detection, and  automated incident response\u003cbr/\u003e- Architect and implement zero-trust security models for critical infrastructure components\u003cbr/\u003e- Design and build custom APIs and middleware solutions for security system integration\u003cbr/\u003e- Develop advanced automation frameworks for infrastructure as code (IaC) deployment and configuration management\u003cbr/\u003e- Create sophisticated monitoring and alerting systems using machine learning for anomaly  detection\u003cbr/\u003e- Implement cryptographic  solutions for secure communication between distributed systems\u003cbr/\u003e- Design and implement custom authentication and authorization protocols\u003cbr/\u003e- Lead technical design reviews and security architecture assessments\u003cbr/\u003e- Mentor junior engineers and establish technical best practices\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon Security values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy Amazon Security?\u003cbr/\u003eAt Amazon, security is central to maintaining customer trust and delivering delightful customer experiences. Our organization is responsible for creating and maintaining a high bar for security across all of Amazon’s products and services. We offer talented security professionals the chance to accelerate their careers with opportunities to build experience in a wide variety of areas including cloud, devices, retail, entertainment, healthcare, operations, and physical stores.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eIn Amazon Security, it’s in our nature to learn and be curious. Ongoing DEI events and learning experiences inspire us to continue learning and to embrace our uniqueness. Addressing the toughest security challenges requires that we seek out and celebrate a diversity of ideas, perspectives, and voices.\u003cbr/\u003e\u003cbr/\u003eTraining \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, training, and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.","department_cost_center":null,"description_short":"AWS Security is looking for a driven professional to join its high-security systems engineering team to manage the operation of our physical access control system (PACS), as well as help us automate a","display_distance":null,"id":"698920b5-60d9-43f3-9e8f-c64e3f686119","id_icims":"3183969","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3183969/software-development-engineer-us-amazon-dedicated-cloud-security","job_schedule_type":"full-time","location":"US, VA, Herndon","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD21\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Herndon, Virginia, USA","optional_search_labels":["aws.team-security-optional"],"posted_date":"February 18, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Herndon - 143,700.00 - 194,400.00 USD annually","primary_search_label":"aws.team-us-security-clearance-jobs-primary","source_system":"JobCreator","state":"VA","title":"Software Development Engineer, US Amazon Dedicated Cloud Security","university_job":null,"updated_time":"22 minutes","url_next_step":"https://account.amazon.com/jobs/3183969/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-us-security-clearance-jobs-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience delivering innovative entertainment experiences (inclusive of live events) to large audiences\u003cbr/\u003e- Bachelor's degree, or 7+ years of equivalent experience\u003cbr/\u003e- 10+ years video production experience\u003cbr/\u003e- 8+ years background working in or alongside a collaborative multi-disciplinary team and working directly with other designers, writers, art directors, and/or marketing managers\u003cbr/\u003e- Strong portfolio and work examples that demonstrate your ability to deliver bar-raising creative work for stakeholders","business_category":"fulfillment-and-operations","city":"Seattle","company_name":"Amazon.com LLC","country_code":"USA","description":"You? You’re a visual storyteller with an eye for making a story truly come together in post-production, and you’re looking to join a fast-paced team that will feed you consistent opportunities to flex that creative muscle. Us? We’re Amazon’s Delivery Experience (ADX) Creative team. We support and advocate for Amazon’s global network of delivery partners and Operations professionals, and we’re looking for a customer-obsessed, Senior Creative Producer to bring our messaging and brands to life across several bespoke channels. \u003cbr/\u003e\u003cbr/\u003eAmazon’s Delivery Service Partners (DSPs) and Amazon Freight Partners (AFPs) enable Amazon to deliver millions of packages per week for retail customers across the world. The ADX team serves as a conduit between Amazon and these partners, communicating business critical information and program updates. This role will oversee the development, execution, and delivery of creative projects for events, communications campaigns, and internal Amazon Operations org initiatives.\u003cbr/\u003e\u003cbr/\u003eThe Senior Creative Producer role is best fit for an experienced producer and project supervisor that can work both independently and collaboratively with diverse, cross-functional business teams. Our ideal candidate can dive deep into our various brands and develop best-fit creative video strategies that will inform all content formats and ladder into cross-functional campaigns and event needs as well as drive production efforts across multiple ongoing project types. Standouts in this role must have demonstrated experience in both creative and strategic throughputs – developing all-up video strategies to support campaigns, turning creative vision into compelling video, and overseeing production management, field and remote producing, talent interviewing, and shot supervision. They must possess skills to prioritize and deliver against multiple, competing priorities, and an ability to bring stories to life across a wide variety of messages and customer needs, with a demonstrated ability to deliver compelling video content for live events.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eIn this role, key responsibilities include:\u003cbr/\u003e•\tLeading creative video strategy for events and external-facing communications campaigns \u003cbr/\u003e•\tCollaborating with internal Amazon teams like the Events, Communities, and Communications teams to identify, consult, and develop project creative needs\u003cbr/\u003e•\tDeveloping compelling creative briefs that inspire stakeholders and serve as the production blueprint that agency partners can reliably deliver against\u003cbr/\u003e•\tLeading end-to-end production management, including scoping, budgeting, agency resourcing, scheduling, and asset delivery \u003cbr/\u003e•\tTraveling to worldwide shoots and events as needed (this role will need to travel 40% of the year to support production efforts)\u003cbr/\u003e•\tBuilding and managing production teams worldwide, connecting with diverse creatives to deliver work in a variety of regions and languages\u003cbr/\u003e•\tDeveloping and manage multiple ongoing project timelines, tracking milestones, deliverables, and dependencies to ensure on-time deliveries\u003cbr/\u003e•\tReviewing internal ADX Creative team’s intake form for new project assignments and track ongoing work\u003cbr/\u003e•\tEnsuring all creative deliverables align with various brand standards, project goals, and strategic marketing objectives\u003cbr/\u003e•\tSubmit reviews for internal stakeholder approval and revise efficiently and accurately based on feedback to deliver a bar-raising final product","department_cost_center":null,"description_short":"You? You’re a visual storyteller with an eye for making a story truly come together in post-production, and you’re looking to join a fast-paced team that will feed you consistent opportunities to flex","display_distance":null,"id":"80c5f5f7-2024-401f-9112-7a6818270a3e","id_icims":"3182161","is_intern":null,"is_manager":null,"job_category":"Marketing \u0026 PR","job_family":"Marketing","job_function_id":null,"job_path":"/en/jobs/3182161/senior-creative-producer-amazon-delivery-experience-adx","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Nashville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Nashville\",\"coordinates\":\"36.16792,-86.77798\",\"normalizedCountyName\":\"Davidson\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Nashville, Tennessee, USA\",\"location\":\"US, TN, Nashville\",\"region\":\"TN\",\"buildingCodeList\":[\"BNA12\"],\"normalizedCityName\":\"Nashville\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA41\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK36\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February 16, 2026","preferred_qualifications":"- Experience with a variety of digital media workflows and post production\u003cbr/\u003e- 5+ years producing creative for corporate brands\u003cbr/\u003e- Experience directing creative projects – remote and on-site\u003cbr/\u003e- Exceptional communication, presentation, and storytelling skills\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TN, Nashville - 127,100.00 - 172,000.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 141,000.00 - 190,700.00 USD annually","primary_search_label":"fulfillment-and-operations.team-last-mile-delivery","source_system":"JobCreator","state":"WA","title":"Senior Creative Producer, Amazon Delivery Experience (ADX)","university_job":null,"updated_time":"25 minutes","url_next_step":"https://account.amazon.com/jobs/3182161/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-delivery","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 6+ years of compliance, audit or risk management experience\u003cbr/\u003e- Bachelor's degree or equivalent\u003cbr/\u003e- 5+ years of health and safety experience in construction or industrial environments, including demonstrated knowledge of safety management systems, regulatory compliance, and contractor safety management\" should I input that into every job","business_category":"aws","city":"Lubbock","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"About AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDo you enjoy taking an idea and turning it into something? Do you ever find yourself marveling at buildings, infrastructure, or landmarks and ask \"what does it take to build something like that?\" The Construction Safety Manager role is for an experienced Health and Safety (H\u0026S) Specialist, H\u0026S Engineer, or H\u0026S Manager who will support AWS Data Center Planning and Delivery (DCPD) programs. Internally, you will partner with DCPD teams such as Real Estate, Due Diligence, Permitting, Energy, Water, Pre-Construction, Construction, Commissioning, Security and Procurement Teams to achieve health and safety goals and improve our safety culture. Externally, you will engage with General Contractors and AWS Suppliers to confirm/clarify the business expectations for H\u0026S, and look for ways to continually improve H\u0026S of our contracted services. You will work under the direction of the Regional Construction Safety Manager\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThis is a field based role, required to report to work at field construction projects around Lubbock, Tx five days per week. Occasional travel to other domestic locations may be required.\u003cbr/\u003e\u003cbr/\u003eYou will influence program development, framework and strategy but will be responsible for deploying programs that cover H\u0026S elements of leadership, planning, support, operational controls, continuous improvement, performance management, ensure the businesses are operating to jurisdictional requirements, and AWS Safety Management Program (SMP) requirements.\u003cbr/\u003e\u003cbr/\u003eExamples:\u003cbr/\u003e• Review due diligence risk assessments with real estate, preconstruction, construction operations on H\u0026S aspects of the AWS H\u0026S management program to ensure adequate implementation.\u003cbr/\u003e• Coordinates with DCPD managers to prioritize H\u0026S in planning and execution in all phases of DCPD projects.\u003cbr/\u003e• Ensures \u0026 Monitors General Contractors and AWS deployment vendors compliance to onboarding requirements in Avetta.\u003cbr/\u003e• Performs campus H\u0026S kickoff sessions, and performs reviews of General Contractor and AWS deployment vendor’s Construction Safety Management Plans\u003cbr/\u003e• Documents data and anecdotes in standard reporting tools (Weekly Business Reviews, Monthly Project Reviews) for DCPD and H\u0026S leadership teams\u003cbr/\u003e• Manages 3rd party/internal H\u0026S resources on DCPD projects (weekly business reviews, monthly project reviews)\u003cbr/\u003e• Identifies improvement opportunities at project(s), and partners with Data Center Health and Safety (DCHS) Operational Team on regional issues that impact construction/operations handover phases.\u003cbr/\u003e• Audits projects to the mental model ‘do you have a process, and are you following it?’ Then analyzes data (leading and lagging indicators) for trends, risks/opportunities and reports out at project/regional levels and within governance programs\u003cbr/\u003e• Conduct regular site visits with H\u0026S 3rd party resources, construction managers and Data Center Health and Safety Operational teams\u003cbr/\u003e• Hosts project and regional specific contractor and internal team H\u0026S kickoff sessions and annual performance review sessions.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis is a field based role, required to report to work at field construction projects around Lubbock, Tx five days per week. Occasional travel to other domestic locations may be required. \u003cbr/\u003e\u003cbr/\u003eYou will be integrated with a global network of H\u0026S professionals including Program Managers, other Construction Safety Managers, and Construction Managers.\u003cbr/\u003e\u003cbr/\u003eYou will use data and anecdotes to tactically drive internal customers to manage H\u0026S risks, which includes being an escalation path for issue resolution and managing site-based H\u0026S team members and/or consultants. You will apply your knowledge of the jurisdictional requirements, regional best practices, cultural norms, and location specific characteristics to improve DCPD activities in H\u0026S by jumping in and showing the business “this is what the data is telling us, and this is how it is done” and develop DCPD competencies to enable them ownership of your solutions.\u003cbr/\u003e\u003cbr/\u003eYou must be an effective communicator, sending clear, concise and consistent messages verbally, in written form, and/or public speaking forums. You will play a key role in deploying mechanisms that manage H\u0026S, while developing competencies and ownership of H\u0026S in the business. You must have diplomacy, patience and tact to earn trust in relationships to effectively advise, instruct and challenge DCPD teams on H\u0026S.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e","department_cost_center":null,"description_short":"About AWSAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful","display_distance":null,"id":"f797b3dc-fc83-4b4b-b96f-8f5df3988282","id_icims":"3183961","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Risk Family","job_function_id":null,"job_path":"/en/jobs/3183961/construction-safety-manager-dcpd-health-and-safety","job_schedule_type":"full-time","location":"US, TX, Lubbock","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Lubbock\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Lubbock\",\"coordinates\":\"33.58451,-101.84462\",\"normalizedCountyName\":\"Lubbock\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Lubbock, Texas, USA\",\"location\":\"US, TX, Lubbock\",\"region\":\"TX\",\"buildingCodeList\":[\"LBB5\"],\"normalizedCityName\":\"Lubbock\"}"],"normalized_location":"Lubbock, Texas, USA","optional_search_labels":["aws.team-ais","aws.team-dcpd-optional","aws.team-dc"],"posted_date":"February 18, 2026","preferred_qualifications":"- Experience leveraging technology and implementing lean principles / Six Sigma methodologies to drive process improvements or equivalent\u003cbr/\u003e- ASP, CSP, or CHST Preferred\u003cbr/\u003e- Construction Safety Experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Lubbock - 121,200.00 - 163,900.00 USD annually","primary_search_label":"aws.team-no-matching-primary-label-listed","source_system":"JobCreator","state":"TX","title":"Construction Safety Manager, DCPD Health and Safety","university_job":null,"updated_time":"30 minutes","url_next_step":"https://account.amazon.com/jobs/3183961/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-no-matching-primary-label-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}