{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 10+ years of specific technology domain areas (e.g. software development, cloud computing, systems engineering, infrastructure, security, networking, data \u0026 analytics) experience\u003cbr/\u003e- Experience communicating across technical and non-technical audiences, including executive level stakeholders or clients\u003cbr/\u003e- Knowledge of AWS services, market segments, customer base and industry verticals","business_category":"aws","city":"Sydney","company_name":"Amazon Web Services Australia Pty Ltd","country_code":"AUS","description":"AWS is seeking an experienced Software Solutions Architect to provide expert guidance to our Independent Software Vendors (ISV) and SaaS platform customers. In this role, you will serve as a trusted advisor, helping Australian B2B software companies scale-up and grow their business on AWS.\u003cbr/\u003e\u003cbr/\u003eYou understand best practices around modern technology, AI and advanced cloud-based solutions, and provide advice on strategies for modernising and optimising existing workloads and deploying new innovative solutions. You will have the opportunity to help shape and execute a strategy to build deep adoption and broad use of AWS within your customers, and you will do this by mobilising resources within AWS and working with our extensive partner network.\u003cbr/\u003e\u003cbr/\u003eAWS Global Sales drives adoption of the AWS cloud worldwide, enabling customers of all sizes to innovate and expand in the cloud. Our team empowers every customer to grow by providing tailored service, unmatched technology, and consistent support. We dive deep to understand each customer's unique challenges, then craft innovative solutions that accelerate their success. This customer-first approach is how we built the world's most adopted cloud. Join us and help us grow.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Work directly with customers to accelerate their products and initiatives and recommend best-practice cloud architectures in line with their long-term business outcomes.\u003cbr/\u003e- Drive technical solutions discussions with your customers, diving deep into the details to solve complex technical challenges and use your knowledge to craft scalable, flexible, and resilient cloud architectures. \u003cbr/\u003e- Scope and own each customer engagement, with attention towards clear and well-defined objectives and success criteria.\u003cbr/\u003e- Define and execute on the strategy by engaging highly technical teams (Solutions Architects, Technical Account Managers, AWS professional services consultants and consulting/managed services partners).\u003cbr/\u003e- Act as a thought leader in the wider community, playing a key role in educating, sharing best practices, presenting at events, writing white papers, blogs, and running workshops. \u003cbr/\u003e- Share the voice of the customer to influence the roadmap of new features and services for the AWS platform. \u003cbr/\u003e- Serve as a key technical member of the Solutions Architecture team through influencing decision makers across multiple domains to ensure customer success in building applications and services on the AWS platform which align to long-term business goals.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eSoftware businesses are investing in cloud-native technology stacks and platforms to iterate faster, increase the velocity of service delivery, achieve a global reach for their products and services, improve their security posture, all whilst keeping the cost to serve and acquire customers as low as possible. Our solutions architects are experienced technologists with technical breadth and depth coupled with strong interpersonal skills. You’ll help our customers define scalable, resilient and secure architectures using the latest technologies provided by AWS and our partners including serverless platforms and container-based, microservices architecture. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Global Sales drives adoption of the AWS cloud worldwide, enabling customers of all sizes to innovate and expand in the cloud. Our team empowers every customer to grow by providing tailored service, unmatched technology, and consistent support. We dive deep to understand each customer's unique challenges, then craft innovative solutions that accelerate their success. This customer-first approach is how we built the world's most adopted cloud. Join us and help us grow.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"AWS is seeking an experienced Software Solutions Architect to provide expert guidance to our Independent Software Vendors (ISV) and SaaS platform customers. In this role, you will serve as a trusted advisor,","display_distance":null,"id":"0117dd47-0799-4756-847d-652cfd26c587","id_icims":"3176575","is_intern":null,"is_manager":null,"job_category":"Solutions Architect","job_family":"Solution Architect","job_function_id":null,"job_path":"/en/jobs/3176575/sr-solutions-architect-isv-isv","job_schedule_type":"full-time","location":"AU, NSW, Sydney","locations":["{\"normalizedStateName\":\"New South Wales\",\"normalizedCountryCode\":\"AUS\",\"city\":\"Sydney\",\"countryIso3a\":\"AUS\",\"countryIso2a\":\"AU\",\"locationNonStemming\":\"Australia, NSW, Sydney\",\"coordinates\":\"-33.87073,151.20788\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Australia\",\"normalizedLocation\":\"Sydney, New South Wales, AUS\",\"location\":\"AU, NSW, Sydney\",\"region\":\"NSW\",\"buildingCodeList\":[\"SYD12\"],\"normalizedCityName\":\"Sydney\"}"],"normalized_location":"Sydney, New South Wales, AUS","optional_search_labels":[],"posted_date":"February  9, 2026","preferred_qualifications":"- Cloud Technology Certification (such as Solutions Architecture, Cloud Security Professional or Cloud DevOps Engineering)\u003cbr/\u003e- Knowledge of software development tools and methodologies\u003cbr/\u003e- Experience architecting/operating solutions built on AWS\u003cbr/\u003e\u003cbr/\u003eAcknowledgement of country:\u003cbr/\u003eIn the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.\u003cbr/\u003e\u003cbr/\u003eIDE statement:\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-solutions-architect-primary","source_system":"JobCreator","state":"NSW","title":"Sr Solutions Architect, ISV, ISV","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3176575/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-solutions-architect-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Haymarket","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"665b8cd9-9182-41ae-8b26-709b61040b69","id_icims":"3153266","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3153266/engineering-operations-technician","job_schedule_type":"full-time","location":"US, VA, Haymarket","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Haymarket\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Haymarket\",\"coordinates\":\"38.81259,-77.63731\",\"normalizedCountyName\":\"Prince William\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Haymarket, Virginia, USA\",\"location\":\"US, VA, Haymarket\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD64\"],\"normalizedCityName\":\"Haymarket\"}"],"normalized_location":"Haymarket, Virginia, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"January  6, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Technical (Military/Trade School) training\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Haymarket - 32.00 - 57.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"VA","title":"Engineering Operations Technician","university_job":null,"updated_time":"28 minutes","url_next_step":"https://account.amazon.com/jobs/3153266/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of design/implementation/operations/consulting with distributed applications experience\u003cbr/\u003e- 5+ years of technical engineering experience","business_category":"aws","city":"Kuala Lumpur","company_name":"Amazon Web Services Malaysia SDN. BHD.","country_code":"MYS","description":"Would you like join one of the fastest-growing organizations within Amazon Web Services (AWS) and help customers of all industries and sizes gain the best value and service from AWS? At AWS Enterprise Support we’re looking for a Senior Technical Account Manager (TAM) to support our customers’ creative and transformative spirit of innovation across all technologies, including Compute, Storage, Database, Data Analytics, Application-level services, Networking, Serverless and more. This is not a sales role, but rather an opportunity to be the principal technical advisor and ‘voice of the customer’ to organizations ranging from start-ups to enterprises. \u003cbr/\u003e\u003cbr/\u003eAs a Senior Technical Account Manager you will provide consultative architectural and operational guidance delivered to help customers achieve the greatest value from AWS.\u003cbr/\u003e\u003cbr/\u003eAs we continue to rapidly expand in Malaysia, you’ll have plenty of opportunities to develop your technical, consulting and leadership skills. You’ll work with talented cloud technologists whilst expanding your knowledge of AWS products. You’ll also have the chance to receive mentorship and gain AWS certifications.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- You’ll build solutions, provide technical guidance and advocate for the customer\u003cbr/\u003e- Ensure AWS environments remain operationally healthy whilst reducing cost and complexity\u003cbr/\u003e- Develop trusting relationships with customers, understanding their business needs and technical challenges\u003cbr/\u003e- Using your technical acumen and customer obsession, you’ll drive technical discussions regarding incidents, trade-offs, and risk management\u003cbr/\u003e- Consult with a range of partners from developers through to C-suite executives\u003cbr/\u003e- Collaborate with AWS Solutions Architects, Business Developers, Professional Services Consultants, and Sales Account Managers\u003cbr/\u003e- With a bias for action, you'll proactively find opportunities for customers to gain additional value from AWS\u003cbr/\u003e- Provide detailed reviews of service disruptions, metrics, detailed prelaunch planning\u003cbr/\u003e- Being part of a wider Enterprise Support team you’ll provide post-sales, consultative expertise\u003cbr/\u003e- Solve a variety of problems across different customers as they migrate their workloads to the cloud\u003cbr/\u003e- Uplift customer capabilities by running workshops, brown bag sessions, etc.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a trusted advisor you’ll have a direct impact in helping our customers gain the most value from cloud technology. You’ll craft and execute strategies to drive our customers’ adoption and use of AWS services.\u003cbr/\u003e\u003cbr/\u003eOur Technical Account Managers partner with some of the most iconic businesses in the country. These range from rising startups building their business from scratch through to large enterprises going through significant transformation. You’ll provide advice on architecture, support strategy, project, and launch planning as well as ongoing operational issues. Watch a short video about life as a Technical Account Manager team here https://www.youtube.com/watch?v=EBA_8o0F9D0\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.","department_cost_center":null,"description_short":"Would you like join one of the fastest-growing organizations within Amazon Web Services (AWS) and help customers of all industries and sizes gain the best value and service from AWS? At AWS Enterprise","display_distance":null,"id":"618d5824-7b09-47b8-bbea-334df7252940","id_icims":"3180956","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Solution Architect","job_function_id":null,"job_path":"/en/jobs/3180956/senior-technical-account-manager-es-apjc-asean","job_schedule_type":"full-time","location":"MY, 15, Kuala Lumpur","locations":["{\"normalizedStateName\":\"Wilayah Persekutuan Kuala Lumpur\",\"normalizedCountryCode\":\"MYS\",\"city\":\"Kuala Lumpur\",\"countryIso3a\":\"MYS\",\"countryIso2a\":\"MY\",\"locationNonStemming\":\"Malaysia, 15, Kuala Lumpur\",\"coordinates\":\"3.14789,101.69405\",\"normalizedCountyName\":\"Kuala Lumpur\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Malaysia\",\"normalizedLocation\":\"Kuala Lumpur, Wilayah Persekutuan Kuala Lumpur, MYS\",\"location\":\"MY, 15, Kuala Lumpur\",\"region\":\"15\",\"buildingCodeList\":[\"KUL15\"],\"normalizedCityName\":\"Kuala Lumpur\"}"],"normalized_location":"Kuala Lumpur, Wilayah Persekutuan Kuala Lumpur, MYS","optional_search_labels":[],"posted_date":"February 13, 2026","preferred_qualifications":"- Experience in a 24x7 operational services or support environment\u003cbr/\u003e- Experience in internal enterprise or external customer-facing environment as a technical lead\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"15","title":"Senior Technical Account Manager, ES - APJC - ASEAN","university_job":null,"updated_time":"29 minutes","url_next_step":"https://account.amazon.com/jobs/3180956/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Chantilly","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"8472d3a5-5200-4431-9e03-98f9af61925b","id_icims":"3154075","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3154075/engineering-operations-technician","job_schedule_type":"full-time","location":"US, VA, Chantilly","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Chantilly\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Chantilly\",\"coordinates\":\"38.88675,-77.43892\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Chantilly, Virginia, USA\",\"location\":\"US, VA, Chantilly\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD150\"],\"normalizedCityName\":\"Chantilly\"}"],"normalized_location":"Chantilly, Virginia, USA","optional_search_labels":["aws.team-ais","aws.team-dc","hourly","military"],"posted_date":"January  7, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Technical (Military/Trade School) training\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Chantilly - 32.00 - 57.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"VA","title":"Engineering Operations Technician","university_job":null,"updated_time":"30 minutes","url_next_step":"https://account.amazon.com/jobs/3154075/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in engineering, computer science or equivalent\u003cbr/\u003e- 5+ years of technical product or program management experience\u003cbr/\u003e- 5+ years of project management disciplines including scope, schedule, budget, quality, along with risk and critical path management experience\u003cbr/\u003e- 7+ years of working directly with engineering teams experience\u003cbr/\u003e- Experience leading complex technical programs for Mechanical Cooling and/or Controls Systems for large commercial/industrial or mission critical buildings","business_category":"aws","city":"Seattle","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\t- Build strategic plans for new Mechanical Solutions and methods to reach maturity for global deployment. \u003cbr/\u003e\t- Plan for global and regional nuances, test and validate, create deployment schedules, and similar production readiness actions.\u003cbr/\u003e\t- Lead the development, deployment, and sustainment of Mechanical Systems for our next generation data center in a highly cross-functional environment, which includes internal customers, hardware, and software development teams. \u003cbr/\u003e\t- Provide program management leadership in the application of new technologies and/or retro-fit type work to enable large scale hardware deployments in a continuous effort to deliver a world-class customer experience. \u003cbr/\u003e- Drive teams inside and outside the organization to deliver complex cross-functional programs with high impact to the organization. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eOur TPMs work closely with key partners to innovate, create, manage, and deliver holistic programs, and ensure products are fully production ready at launch. “Production ready at launch” addresses requirements for a product to be viable for global deployment: approved financials, technical specifications and designs, supplier sourcing and qualification, testing, operations training, and similar requirements. We build and execute the plan that addresses requirements in these areas, resulting in a product or solution that is production ready for global deployment. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWithin AWS Data Center Engineering, the Mechanical Products \u0026 Services team provides engineering expertise and design support for mechanical equipment in data centers globally. This includes support for new products and design features that address the mechanical cooling systems included in data center deployments. We own and support mechanical products throughout their lifecycle. Our scope also includes emergent global scale remediation strategic efforts that impact Data Center capacity or availability and introducing and driving business improvement initiatives increasing visibility and enabling data driven decision making. \u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"c0e7f9bf-a4fb-4e3a-ad09-f4ea54a0830d","id_icims":"3185684","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Technical Program Management","job_function_id":null,"job_path":"/en/jobs/3185684/senior-technical-program-management-mechanical-systems-dce-mechanical-products-services","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS16\"],\"normalizedCityName\":\"Austin\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA84\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD31\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["aws.team-dc","aws.team-ais","aws.team-product-and-program-management","aws.team-product-program-management"],"posted_date":"February 20, 2026","preferred_qualifications":"- 7+ years of technical product or program management experience\u003cbr/\u003e- Experience leading highly technical programs involving infrastructure, complex systems, systems engineering\u003cbr/\u003e- Experience defining KPI's/SLA's used to drive multi-million dollar businesses and reporting to senior leadership\u003cbr/\u003e- Bachelor's degree in Mechanical Engineering, Aerospace Engineering, Manufacturing Engineering, or an equivalent field\u003cbr/\u003e- Bachelor's degree in Mechanical Engineering - focus on Thermal/Cooling solutions\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Austin - 148,700.00 - 201,200.00 USD annually\u003cbr/\u003eUSA, VA, Herndon - 148,700.00 - 201,200.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 148,700.00 - 201,200.00 USD annually","primary_search_label":"aws.team-program-management-primary","source_system":"JobCreator","state":"WA","title":"Senior Technical Program Management - Mechanical Systems, DCE - Mechanical Products \u0026 Services","university_job":null,"updated_time":"33 minutes","url_next_step":"https://account.amazon.com/jobs/3185684/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-program-management-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Five or more years of experience in security assurance roles such as cybersecurity, auditing, security architecture and design, or within public sector agencies involved in cybersecurity.\u003cbr/\u003e- Proven experience working in large scale governance, audit, risk and compliance programmes.\u003cbr/\u003e- Experience with cloud native technologies and data transfer/gateway solutions.\u003cbr/\u003e- Strong written and presentation communication skills.","business_category":"aws","city":"Sydney","company_name":"Amazon Web Services Australia Pty Ltd","country_code":"AUS","description":"AWS Region Services is recruiting a Security Specialist to lead, contribute to the onboarding and assurance of regional cloud services in Australia. The successful candidates will be analytical problem solvers who take ownership of complex technical and security challenges, possess a deep understanding of Security Risk Assessment (SRA), cloud native and development technologies, and are conversant with enterprise gateways and data transfer solutions. This team is a unique team as it creates opportunity to work with over 100 AWS commercial service teams globally.\u003cbr/\u003e\u003cbr/\u003eThis is an opportunity to make a lasting impact on Australia’s digital future. You’ll work with AWS services, implement innovative solutions, and help customers succeed in their most important missions.\u003cbr/\u003e\u003cbr/\u003eWe’re committed to helping our builders grow through continuous learning, mentoring, and collaboration with industry experts. Are you ready to build the future of secure cloud computing in Australia?\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eLead security onboarding and assurance for region-specific cloud services, ensuring operational readiness of regional AWS infrastructure.\u003cbr/\u003eReview and contribute to technical documentation from service teams, ensuring adherence with regional security requirements.\u003cbr/\u003ePartner with service teams and customers to establish security baselines, requirements and control objectives.\u003cbr/\u003eDeliver high-quality results under tight deadlines with exceptional attention to detail and accuracy.\u003cbr/\u003eLead and implement auditing engagement for data-flow controls, incorporating service assurance and audit frameworks.\u003cbr/\u003eConduct thorough reviews of transfer policies to ensure they meet agreed specifications.\u003cbr/\u003eCreate and maintain patterns and best practices for secure data transfer into the region.\u003cbr/\u003eCollect evidence of key controls in AWS environments and communicate security outcomes to customers and service teams.\u003cbr/\u003eIdentify risks and improvement opportunities and investigate and resolve non-conformance events.\u003cbr/\u003eDevelop and review customer-facing documentation and provide strategic security guidance to ensure optimal security outcomes\u003cbr/\u003eWork with global service teams to identify product improvements, explore innovative solutions, and manage feature requests.\u003cbr/\u003eParticipate in the on-call rotation.\u003cbr/\u003eApply knowledge of Australian security frameworks (ISM, PSPF, DSPF) to design and build security baselines that meet required security postures.\u003cbr/\u003e\u003cbr/\u003eHold or obtain an Australian Government Security Vetting Agency (AGSVA) clearance for the duration of employment. (See https://www.agsva.gov.au/applicants/eligibility-and-suitability)\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour day involves balancing strategic security oversight with hands-on technical work. You review service team documentation and security submissions, conduct onboarding assessments for regional cloud services, and collaborate with teams to establish security baselines and control objectives. Throughout the day, you lead auditing engagements examining data-flow controls, investigate non-conformance events, and collect evidence of key controls across AWS environments. \u003cbr/\u003e\u003cbr/\u003eYou partner with global service teams on product improvements and feature requests while maintaining customer-facing documentation and security patterns. Your work requires delivering accurate results under tight deadlines, communicating security outcomes to diverse stakeholders, and participating in the on-call rotation to ensure continuous operational readiness of regional infrastructure.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Region Services provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2) to consistently released new product innovations that continue to set AWS's services and features apart in the industry. As a member of Region Services, you will contribute to the security and operational management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS, including support for customers who require specialised security solutions for their cloud services.\u003cbr/\u003e\u003cbr/\u003eOur Region Services team redefines the way AWS designs, builds, and operates AWS regions to enable new AWS Cloud Infrastructure and Services offerings to customers across every industry and of every size, including start-ups, enterprises, and public sector organisations. ","department_cost_center":null,"description_short":"AWS Region Services is recruiting a Security Specialist to lead, contribute to the onboarding and assurance of regional cloud services in Australia. The successful candidates will be analytical problem","display_distance":null,"id":"0d5b92e8-3d9b-4ae1-875f-a4ed483d4522","id_icims":"3185674","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"Security Industry Specialist","job_function_id":null,"job_path":"/en/jobs/3185674/security-specialist-region-services","job_schedule_type":"full-time","location":"AU, NSW, Sydney","locations":["{\"normalizedStateName\":\"New South Wales\",\"normalizedCountryCode\":\"AUS\",\"city\":\"Sydney\",\"countryIso3a\":\"AUS\",\"countryIso2a\":\"AU\",\"locationNonStemming\":\"Australia, NSW, Sydney\",\"coordinates\":\"-33.87073,151.20788\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Australia\",\"normalizedLocation\":\"Sydney, New South Wales, AUS\",\"location\":\"AU, NSW, Sydney\",\"region\":\"NSW\",\"buildingCodeList\":[\"SYD12\"],\"normalizedCityName\":\"Sydney\"}"],"normalized_location":"Sydney, New South Wales, AUS","optional_search_labels":["aws.adc-australia"],"posted_date":"February 20, 2026","preferred_qualifications":"- Degree or equivalent experience in Computer Science, Engineering, Cyber Security, IT Security Management, Security Risk Management or a related field.\u003cbr/\u003e- Demonstrated ability to influence and lead business partners and support teams.\u003cbr/\u003e- Credible coordination between technical teams and stakeholders.\u003cbr/\u003e- AWS certifications (AWS Certified Solutions Architect – Associate and AWS Certified Security – Specialty).\u003cbr/\u003e- Knowledge of agile development, secure software development life cycle and AWS native services.\u003cbr/\u003e- Ability to interpret Australian government security frameworks, policies and standards (e.g., PSPF, ISM, DSPF).\u003cbr/\u003e\u003cbr/\u003eAcknowledgement of country:\u003cbr/\u003eIn the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.\u003cbr/\u003e\u003cbr/\u003eIDE statement:\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-security-engineer-primary","source_system":"JobCreator","state":"NSW","title":"Security Specialist, Region Services ","university_job":null,"updated_time":"42 minutes","url_next_step":"https://account.amazon.com/jobs/3185674/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-security-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 7+ years of technology related sales, business development or equivalent experience\u003cbr/\u003e- Bachelor's degree or equivalent\u003cbr/\u003e- Experience working with and presenting to C-level executives, IT, and lines of businesses across organizations or equivalent","business_category":"aws","city":"Virtual Location - Hawaii","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Would you like to help build the AWS cloud computing business for the Combatant Commands (COCOM) and Department of Defense (DoD) teams? As a Principal Sales Executive for Amazon Web Services (AWS), you will have the exciting opportunity to lead, shape and deliver on an INDOPACOM strategy to build mind share and accelerate broad use of Amazon’s cloud computing services. \u003cbr/\u003e\u003cbr/\u003eThis position requires that the candidate selected be a US Citizen and currently possess and maintain an active Top Secret security clearance.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eOwn, lead, and develop a growing book of business within the INDOPACOM area of responsibility (AoR) as part of our DoD sales team.\u003cbr/\u003e* Think strategically about the overall DoD mission within INDOPACOM, understand customer mission/technical challenges, and build/convey compelling value propositions to key customer/partner stakeholders to drive AWS cloud adoption in the region.\u003cbr/\u003e* Drive business and technical relationships and close business by helping to define, identify, and pursue key opportunities.\u003cbr/\u003e* Establish deep business and technical relationships with INDOPACOM leadership to position AWS as a trusted advisor and collaborator on customer mission endeavors.\u003cbr/\u003e*Actively engage with AWS DoD/Federal/Global Public Sector leadership to execute against broader US DoD business strategies through and with our global allied nations.\u003cbr/\u003e*Lead an account team of sales support resources aligned to AWS INDOPACOM business.\u003cbr/\u003e* Conduct day-to-day interactions with customers along with the various system integrators and other OEMs providing solutions in the INDOPACOM AoR.\u003cbr/\u003e*Manage a steady/growing pipeline of opportunities and progress deals through the sales cycle with account teammates and support resources.\u003cbr/\u003e*Collaborate closely with AWS DoD team members outside of the COCOM team to help drive success within the military department (Mildep) sales teams active in the INDOPACOM AoR.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. \u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Would you like to help build the AWS cloud computing business for the Combatant Commands (COCOM) and Department of Defense (DoD) teams? As a Principal Sales Executive for Amazon Web Services (AWS), you","display_distance":null,"id":"e8efc6a3-60e6-4e4b-bd5e-429135e26491","id_icims":"3180316","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Tech Sales","job_function_id":null,"job_path":"/en/jobs/3180316/principal-sales-indopacom-department-of-defense-air-force","job_schedule_type":"full-time","location":"US, HI, Virtual Location - Hawaii","locations":["{\"normalizedStateName\":\"Hawaii\",\"normalizedCountryCode\":\"USA\",\"city\":\"Virtual Location - Hawaii\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, HI, Virtual Location - Hawaii\",\"coordinates\":\"21.30493,-157.85788\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Hawaii, USA\",\"location\":\"US, HI, Virtual Location - Hawaii\",\"region\":\"HI\",\"buildingCodeList\":[\"VIR\"]}"],"normalized_location":"Hawaii, USA","optional_search_labels":["amazon-cleared-jobs","aws.team-clearedvets"],"posted_date":"February 12, 2026","preferred_qualifications":"- Experience selling cloud solutions at a software company or equivalent\u003cbr/\u003e- Experience with AWS and technology as a service (IaaS, SaaS, PaaS)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments, restricted stock units (RSUs), and sales incentives. Final compensation will be determined based on factors including experience, qualifications, and location. \u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eAmazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, HI, Virtual Location - Hawaii - 170,000.00 - 230,000.00 USD annually","primary_search_label":"aws.team-us-security-clearance-jobs-primary","source_system":"JobCreator","state":"HI","title":"Principal Sales - INDOPACOM, Department of Defense - Air Force","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3180316/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-us-security-clearance-jobs-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Work experience: 15+ years sales or pre-sales experience in Data/Analytics/AI-ML/Digital Transformation  in Banking and Financial services with last couple of years in AI aligned roles.\u003cbr/\u003e- Technical Expertise: Proven experience in  sales and/or practitioner roles across end-to-end AI value chain incl. LLMs, foundation models, RAG, model fine-tuning, ML Ops and AI infrastructure (GPUs, custom silicon and accelerated compute). Deep familiarity with AWS AI services, with the ability to translate technical capabilities to business outcomes.\u003cbr/\u003e- Executive \u0026 Sales Skills: Ability to engage and earn C-suite trust. Strong communication skills (simplify complex AI concepts for diverse audiences). Consultative selling with discovery, problem framing, solution design. Strong business acumen across financial modeling, ROI analysis, competitive dynamics. Experience managing complex, multi-stakeholder sales cycles.","business_category":"aws","city":"Mumbai","company_name":"AWS India - Haryana","country_code":"IND","description":"About the Role: AWS seeks a Senior AI Specialist Sales professional to drive adoption of AWS's full stack AI services across Banking and NBFCs in India and SAARC region. This individual contributor role requires deep AI/ML expertise, executive presence, and proven sales success. You'll engage C-level executives (CEOs, CTOs, CAIOs, CFOs, line of business owners) to accelerate Generative AI and Agentic AI adoption, bridging business strategy with technical implementation.\u003cbr/\u003e \u003cbr/\u003eKey requirement: Ability to engage with CEO/LOB owners for strategic conversations to leverage AI for business transformation, as well as with CTO/CAIO for AI-implementation linked technical architecture conversations. AI specialist solution architects will support for Level 300+ deep dives.\u003cbr/\u003e \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e1. Engage C-suite executives to drive AWS AI services adoption: CEOs (business transformation), CTOs/CAIOs (technical architecture), CFOs (ROI models), line of business owners (use cases). Lead AI-focussed Executive Briefing Centers, board presentations, and strategic planning workshops. \u003cbr/\u003e\u003cbr/\u003e2. Drive adoption of AWS full stack AI services (incl., but not limited to Amazon Bedrock, SageMaker, Amazon Q, Trainium / Inferentia etc.). Focus on Generative AI and Agentic AI as priority areas. Articulate business value from infrastructure (custom silicon) to applications; and position AWS AI services differentiation across aspects of model choice, security, cost optimization, responsible AI etc. \u003cbr/\u003e\u003cbr/\u003e3. Solution Design \u0026 Sales Execution: Structure C-suite conversations on business outcomes that can be delivered using AI. Identify high-value industry-aligned use cases. Develop compelling business cases with quantified ROI and time-to-value. Own revenue targets for AI/ML services for assigned territories. Manage end-to-end sales cycles. Lead POCs and pilots demonstrating AWS AI services\u003cbr/\u003e\u003cbr/\u003e4. Thought Leadership: Represent AWS at industry-aligned events. Develop executive presentations, thought leadership and case studies. Provide market insights to inform AWS product roadmaps\u003cbr/\u003e \u003cbr/\u003e","department_cost_center":null,"description_short":"About the Role: AWS seeks a Senior AI Specialist Sales professional to drive adoption of AWS's full stack AI services across Banking and NBFCs in India and SAARC region. This individual contributor role","display_distance":null,"id":"f8bc50dd-b215-4219-97b5-dd711fc1fd0f","id_icims":"3151556","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Tech Sales","job_function_id":null,"job_path":"/en/jobs/3151556/aws-senior-ai-specialist-sales-banking-india-saarc-region","job_schedule_type":"full-time","location":"IN, MH, Mumbai","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR18\"],\"normalizedCityName\":\"Bengaluru\"}","{\"normalizedStateName\":\"Maharashtra\",\"normalizedCountryCode\":\"IND\",\"city\":\"Mumbai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, MH, Mumbai\",\"coordinates\":\"18.94018,72.83484\",\"normalizedCountyName\":\"Mumbai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Mumbai, Maharashtra, IND\",\"location\":\"IN, MH, Mumbai\",\"region\":\"MH\",\"buildingCodeList\":[\"BOM14\"],\"normalizedCityName\":\"Mumbai\"}","{\"normalizedStateName\":\"Haryana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Gurugram\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, HR, Gurugram\",\"coordinates\":\"28.47716,77.06847\",\"normalizedCountyName\":\"Gurugram\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Gurugram, Haryana, IND\",\"location\":\"IN, HR, Gurugram\",\"region\":\"HR\",\"buildingCodeList\":[\"DEL24\"],\"normalizedCityName\":\"Gurugram\"}"],"normalized_location":"Mumbai, Maharashtra, IND","optional_search_labels":[],"posted_date":"February  3, 2026","preferred_qualifications":"- MBA, or Bachelor's degree in computer science, engineering, analytics, mathematics, statistics, IT or equivalent\u003cbr/\u003e- AWS certification\u003cbr/\u003e- Experience working as Chief AI Officer, AI Practice leader or AI Solution Leader.\u003cbr/\u003e- Published thought leadership in AI/ML.\u003cbr/\u003e- Work experience with Hyperscalers, Strategy Consulting, Technology consulting arm of Big 4, AI consulting/services firms, GSIs, Banking GCCs, ISVs.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-sales-primary","source_system":"JobCreator","state":"MH","title":"AWS Senior AI Specialist Sales – Banking, India \u0026 SAARC Region","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3151556/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sales-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Work experience: 15+ years sales or pre-sales experience in Data/Analytics/AI-ML/Digital Transformation  in Insurance sector with last couple of years in AI aligned roles.\u003cbr/\u003e- Technical Expertise: Proven experience in  sales and/or practitioner roles across end-to-end AI value chain incl. LLMs, foundation models, RAG, model fine-tuning, ML Ops and AI infrastructure (GPUs, custom silicon and accelerated compute). Deep familiarity with AWS AI services, with the ability to translate technical capabilities to business outcomes.\u003cbr/\u003e- Executive \u0026 Sales Skills: Ability to engage and earn C-suite trust. Strong communication skills (simplify complex AI concepts for diverse audiences). Consultative selling with discovery, problem framing, solution design. Strong business acumen across financial modeling, ROI analysis, competitive dynamics. Experience managing complex, multi-stakeholder sales cycles.","business_category":"aws","city":"Gurugram","company_name":"AWS India - Haryana","country_code":"IND","description":"About the Role: AWS seeks a Senior AI Specialist Sales professional to drive adoption of AWS's full stack AI services across Insurance Companies in India and SAARC region. This individual contributor role requires deep AI/ML expertise, executive presence, and proven sales success. You'll engage C-level executives (CEOs, CTOs, CAIOs, CFOs, line of business owners) to accelerate Generative AI and Agentic AI adoption, bridging business strategy with technical implementation.\u003cbr/\u003e \u003cbr/\u003eKey requirement: Ability to engage with CEO/LOB owners for strategic conversations to leverage AI for business transformation, as well as with CTO/CAIO for AI-implementation linked technical architecture conversations. AI specialist solution architects will support for Level 300+ deep dives.\u003cbr/\u003e \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e1. Engage C-suite executives to drive AWS AI services adoption: CEOs (business transformation), CTOs/CAIOs (technical architecture), CFOs (ROI models), line of business owners (use cases). Lead AI-focussed Executive Briefing Centers, board presentations, and strategic planning workshops. \u003cbr/\u003e\u003cbr/\u003e2. Drive adoption of AWS full stack AI services (incl., but not limited to Amazon Bedrock, SageMaker, Amazon Q, Trainium / Inferentia etc.). Focus on Generative AI and Agentic AI as priority areas. Articulate business value from infrastructure (custom silicon) to applications; and position AWS AI services differentiation across aspects of model choice, security, cost optimization, responsible AI etc. \u003cbr/\u003e\u003cbr/\u003e3. Solution Design \u0026 Sales Execution: Structure C-suite conversations on business outcomes that can be delivered using AI. Identify high-value industry-aligned use cases. Develop compelling business cases with quantified ROI and time-to-value. Own revenue targets for AI/ML services for assigned territories. Manage end-to-end sales cycles. Lead POCs and pilots demonstrating AWS AI services\u003cbr/\u003e\u003cbr/\u003e4. Thought Leadership: Represent AWS at industry-aligned events. Develop executive presentations, thought leadership and case studies. Provide market insights to inform AWS product roadmaps\u003cbr/\u003e \u003cbr/\u003e","department_cost_center":null,"description_short":"About the Role: AWS seeks a Senior AI Specialist Sales professional to drive adoption of AWS's full stack AI services across Insurance Companies in India and SAARC region. This individual contributor role","display_distance":null,"id":"cf728498-8de1-46ae-b5ac-00a8c502f407","id_icims":"3151554","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Tech Sales","job_function_id":null,"job_path":"/en/jobs/3151554/aws-senior-ai-specialist-sales-insurance-india-saarc-region","job_schedule_type":"full-time","location":"IN, HR, Gurugram","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR18\"],\"normalizedCityName\":\"Bengaluru\"}","{\"normalizedStateName\":\"Maharashtra\",\"normalizedCountryCode\":\"IND\",\"city\":\"Mumbai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, MH, Mumbai\",\"coordinates\":\"18.94018,72.83484\",\"normalizedCountyName\":\"Mumbai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Mumbai, Maharashtra, IND\",\"location\":\"IN, MH, Mumbai\",\"region\":\"MH\",\"buildingCodeList\":[\"BOM14\"],\"normalizedCityName\":\"Mumbai\"}","{\"normalizedStateName\":\"Haryana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Gurugram\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, HR, Gurugram\",\"coordinates\":\"28.47716,77.06847\",\"normalizedCountyName\":\"Gurugram\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Gurugram, Haryana, IND\",\"location\":\"IN, HR, Gurugram\",\"region\":\"HR\",\"buildingCodeList\":[\"DEL24\"],\"normalizedCityName\":\"Gurugram\"}"],"normalized_location":"Gurugram, Haryana, IND","optional_search_labels":[],"posted_date":"February  3, 2026","preferred_qualifications":"- MBA, or Bachelor's degree in computer science, engineering, analytics, mathematics, statistics, IT or equivalent\u003cbr/\u003e- AWS certification\u003cbr/\u003e- Experience working as Chief AI Officer, AI Practice leader or AI Solution Leader.\u003cbr/\u003e- Published thought leadership in AI/ML.\u003cbr/\u003e- Work experience in Insurance Sector aligned roles with Hyperscalers, Strategy Consulting, Technology consulting arm of Big 4, AI consulting/services firms, GSIs, GCCs, ISVs.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-sales-primary","source_system":"JobCreator","state":"HR","title":"AWS Senior AI Specialist Sales – Insurance, India \u0026 SAARC Region","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3151554/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sales-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Work experience: 15+ years sales or pre-sales experience in Data/Analytics/AI-ML/Digital Transformation  in Retail, E-Commerce \u0026 CPG sector with last couple of years in AI aligned roles.\u003cbr/\u003e- Technical Expertise: Proven experience in  sales and/or practitioner roles across end-to-end AI value chain incl. LLMs, foundation models, RAG, model fine-tuning, ML Ops and AI infrastructure (GPUs, custom silicon and accelerated compute). Deep familiarity with AWS AI services, with the ability to translate technical capabilities to business outcomes.\u003cbr/\u003e- Executive \u0026 Sales Skills: Ability to engage and earn C-suite trust. Strong communication skills (simplify complex AI concepts for diverse audiences). Consultative selling with discovery, problem framing, solution design. Strong business acumen across financial modeling, ROI analysis, competitive dynamics. Experience managing complex, multi-stakeholder sales cycles.","business_category":"aws","city":"Gurugram","company_name":"AWS India - Haryana","country_code":"IND","description":"About the Role: AWS seeks a Senior AI Specialist Sales professional to drive adoption of AWS's full stack AI services across Retail, E-Commerce \u0026 CPG sector in India and SAARC region. This individual contributor role requires deep AI/ML expertise, executive presence, and proven sales success. You'll engage C-level executives (CEOs, CTOs, CAIOs, CFOs, line of business owners) to accelerate Generative AI and Agentic AI adoption, bridging business strategy with technical implementation.\u003cbr/\u003e \u003cbr/\u003eKey requirement: Ability to engage with CEO/LOB owners for strategic conversations to leverage AI for business transformation, as well as with CTO/CAIO for AI-implementation linked technical architecture conversations. AI specialist solution architects will support for Level 300+ deep dives.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eEngage C-suite executives to drive AWS AI services adoption: CEOs (business transformation), CTOs/CAIOs (technical architecture), CFOs (ROI models), line of business owners (use cases). Lead AI-focussed Executive Briefing Centers, board presentations, and strategic planning workshops. \u003cbr/\u003e\u003cbr/\u003eDrive adoption of AWS full stack AI services (incl., but not limited to Amazon Bedrock, SageMaker, Amazon Q, Trainium / Inferentia etc.). Focus on Generative AI and Agentic AI as priority areas. Articulate business value from infrastructure (custom silicon) to applications; and position AWS AI services differentiation across aspects of model choice, security, cost optimization, responsible AI etc. \u003cbr/\u003e\u003cbr/\u003eSolution Design \u0026 Sales Execution: Structure C-suite conversations on business outcomes that can be delivered using AI. Identify high-value industry-aligned use cases. Develop compelling business cases with quantified ROI and time-to-value. Own revenue targets for AI/ML services for assigned territories. Manage end-to-end sales cycles. Lead POCs and pilots demonstrating AWS AI services\u003cbr/\u003e\u003cbr/\u003eThought Leadership: Represent AWS at industry-aligned events. Develop executive presentations, thought leadership and case studies. Provide market insights to inform AWS product roadmaps\u003cbr/\u003e \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"About the Role: AWS seeks a Senior AI Specialist Sales professional to drive adoption of AWS's full stack AI services across Retail, E-Commerce \u0026 CPG sector in India and SAARC region. This individual contributor","display_distance":null,"id":"ce388cb6-46df-47a2-aa33-aa96e60f331f","id_icims":"3151553","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Tech Sales","job_function_id":null,"job_path":"/en/jobs/3151553/aws-senior-ai-specialist-sales-retail-e-commerce-cpg-india-saarc-region","job_schedule_type":"full-time","location":"IN, HR, Gurugram","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR18\"],\"normalizedCityName\":\"Bengaluru\"}","{\"normalizedStateName\":\"Maharashtra\",\"normalizedCountryCode\":\"IND\",\"city\":\"Mumbai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, MH, Mumbai\",\"coordinates\":\"18.94018,72.83484\",\"normalizedCountyName\":\"Mumbai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Mumbai, Maharashtra, IND\",\"location\":\"IN, MH, Mumbai\",\"region\":\"MH\",\"buildingCodeList\":[\"BOM14\"],\"normalizedCityName\":\"Mumbai\"}","{\"normalizedStateName\":\"Haryana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Gurugram\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, HR, Gurugram\",\"coordinates\":\"28.47716,77.06847\",\"normalizedCountyName\":\"Gurugram\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Gurugram, Haryana, IND\",\"location\":\"IN, HR, Gurugram\",\"region\":\"HR\",\"buildingCodeList\":[\"DEL24\"],\"normalizedCityName\":\"Gurugram\"}"],"normalized_location":"Gurugram, Haryana, IND","optional_search_labels":[],"posted_date":"February  3, 2026","preferred_qualifications":"- MBA, or Bachelor's degree in computer science, engineering, analytics, mathematics, statistics, IT or equivalent\u003cbr/\u003e- AWS certification\u003cbr/\u003e- Experience working as Chief AI Officer, AI Practice leader or AI Solution Leader.\u003cbr/\u003e- Published thought leadership in AI/ML.\u003cbr/\u003e- Work experience in Retail \u0026 CPG sector with Hyperscalers, Strategy Consulting, Technology consulting arm of Big 4, AI consulting/services firms, GSIs, GCCs, ISVs.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-sales-primary","source_system":"JobCreator","state":"HR","title":"AWS Senior AI Specialist Sales – Retail, E-Commerce \u0026 CPG - India \u0026 SAARC Region","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3151553/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sales-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}