{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"aws","city":"Austin","company_name":"Annapurna Labs (U.S.) Inc.","country_code":"USA","description":"Annapurna Labs designs silicon and software that accelerates innovation. Customers choose us to create cloud solutions that solve challenges that were unimaginable a short time ago—even yesterday. Our custom chips, accelerators, and software stacks enable us to take on technical challenges that have never been seen before, and deliver results that help our customers change the world.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eIn Annapurna Labs we are at the forefront of hardware/software co-design not just in Amazon Web Services (AWS) but across the industry.  Our Chassis Software team is looking for candidates interested in diving deep into the different hardware technologies that power our Machine Learning servers and develop the software and firmware to drive, support and sustain these technologies as they evolve though concept and manufacturing, and finally take their place in our rapidly expanding fleet of cutting edge Machine Learning products our customers demand.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Provide Baseboard Management Controller (BMC) and Satellite Management Controller (SMC) software and firmware for Machine Learning Accelerator (MLA) servers.\u003cbr/\u003e- Continuously collaborate with other server and board software teams responsible for accelerator management firmware and other programmable logic devices.\u003cbr/\u003e- Work within the larger MLA Systems Software group to support development of mission-mode firmware, exercisers for manufacturing and vetting, and automation for qualification and deployment.\u003cbr/\u003e- Engage in new product development by participating in early concept design reviews, schematic approvals, offsite board bringup and laboratory-based testing.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThe MLA Chassis Software team was formed to focus on board firmware primarily for mission-mode control of sensors and other board-level hardware. This includes debug, testing, qualification, and manufacturing. We touch technologies from device drivers to the I2C infrastructure pervasive in the server and everything in between. We are not working on machine learning algorithms, but rather we work on the physical systems (hardware) which execute and accelerate those machine learning algorithms. Data paths, I2C, and device control are our bread and butter. Some of us know what a Tensor is but really it's not what we do.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge-sharing and mentorship. Our senior members enjoy one-on-one mentoring and thorough, but kind, code reviews. We care about your career growth and strive to assign projects that help our team members develop your engineering expertise so you feel empowered to take on more complex tasks in the future.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eAbout AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. ","department_cost_center":null,"description_short":"Annapurna Labs designs silicon and software that accelerates innovation. Customers choose us to create cloud solutions that solve challenges that were unimaginable a short time ago—even yesterday. Our","display_distance":null,"id":"6edeb472-6a77-42eb-aa7d-1aa0a0ba519a","id_icims":"3170758","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3170758/software-engineer-ii-server-control-firmware","job_schedule_type":"full-time","location":"US, TX, Austin","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS16\"],\"normalizedCityName\":\"Austin\"}"],"normalized_location":"Austin, Texas, USA","optional_search_labels":["aws.team-utility-computing","aws.team-annapurna-labs"],"posted_date":"January 30, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Austin - 143,700.00 - 194,400.00 USD annually","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"TX","title":"Software Engineer II, Server Control Firmware","university_job":null,"updated_time":"less than a minute","url_next_step":"https://account.amazon.com/jobs/3170758/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in a customer-focused field or business","business_category":"advertising","city":"New York","company_name":"Amazon Advertising LLC","country_code":"USA","description":"Amazon Advertising operates at the intersection of eCommerce and advertising, offering a rich array of advertising solutions. We partner with advertisers to reach Amazon customers on Amazon.com, across our other owned and operated sites, on other high quality sites across the web, and on millions of devices. If you’re interested in joining a rapidly growing organization working to build a unique, world-class advertising group with a relentless focus on the customer, you’ve come to the right place.\u003cbr/\u003e\u003cbr/\u003eWe’re looking for a results oriented Associate Account Manager who is passionate about partnering with our advertisers, educating them and helping to solve ambiguous business problems, mitigating risks before they become roadblocks. As an Associate Account Manager, you manage and deliver against complex advertiser goals and problems to drive revenue and achieve revenue targets. You nurture customer relationships and create revenue opportunities from the advertisers you own. You’ll not only dive deep into data to understand trends, but also communicate the “why” behind results and make actionable recommendations to internal and external stakeholders. Additionally, you’ll be able to leverage Amazon’s proprietary data to provide strategic and personalized recommendations, influencing both your internal team and your external customer to facilitate them reaching their business goals. This role is highly collaborative, working with Creative, Senior Sales, Product, and Retail partners and will drive process improvement to gain efficiency and foster collaboration. The Associate Account Manager’s strategic digital expertise and influence is considered critical to unlocking greater value and impact for our advertisers.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e - Become a knowledgeable partner and leader on Amazon Advertising solutions\u003cbr/\u003e - Deliver the highest level of sales and customer service to our clients.\u003cbr/\u003e - Retain and grow revenue from existing advertisers.\u003cbr/\u003e - Drive deals to closure in a new business environment.\u003cbr/\u003e - Develop annual media strategies for growth based on overall advertiser goals and objectives\u003cbr/\u003e - Develop campaign strategies and audience engagement recommendations\u003cbr/\u003e - Evaluate success metrics and drive campaign performance using data\u003cbr/\u003e - Perform in-depth data analysis to form and deliver actionable recommendations for both short- and long-term advertising strategy\u003cbr/\u003e - Educate advertisers on performance metrics, insights, and how to drive greater results\u003cbr/\u003e - Work cross-functionally with Senior Sales and other Amazon partners to drive incremental revenue and increase advertiser satisfaction\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Advertising operates at the intersection of eCommerce and advertising, offering a rich array of advertising solutions. We partner with advertisers to reach Amazon customers on Amazon.com, across","display_distance":null,"id":"eda6850c-38d2-4849-9f78-d39ad4af9148","id_icims":"3170997","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Ad Sales","job_function_id":null,"job_path":"/en/jobs/3170997/sales-account-manager-gold","job_schedule_type":"full-time","location":"US, NY, New York","locations":["{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK19\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"New York, New York, USA","optional_search_labels":["advertising.team-sales"],"posted_date":"January 30, 2026","preferred_qualifications":"- Bachelor's degree\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments, restricted stock units (RSUs), and sales incentives. Final compensation will be determined based on factors including experience, qualifications, and location. \u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eAmazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, New York - 66,300.00 - 108,800.00 USD annually","primary_search_label":"advertising.team-amazon-ads","source_system":"JobCreator","state":"NY","title":"Sales Account Manager, Gold","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3170997/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-ads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Information Technology, Computer Science, or a related field\u003cbr/\u003e- Experience with computer hardware troubleshooting and repair\u003cbr/\u003e- 1+ years of Linux operating systems experience","business_category":"aws","city":"Mumbai","company_name":"ADSIPL - Maharashtra","country_code":"IND","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs Data Centre Operations Tech, you will be the primary point of contact for internal customers. There is never a dull moment as each day presents itself with different challenges. Some of the key responsibilities you will undertake are:\u003cbr/\u003e•\tYou will troubleshoot technical issues on advanced hardware, ranging from servers, storage and networking devices on a 24/7 basis.\u003cbr/\u003e•\tYou will maintain a high level of system reliability and availability.\u003cbr/\u003e•\tYou will participate in projects to enhance operational efficiencies with opportunities to share experiences and knowledge with our global network of technical experts.\u003cbr/\u003e•\tYou will share knowledge and help train less technical staff on the best practices related to all service owner issues\u003cbr/\u003e•\tYou will contribute towards building a great team by getting involved in the Amazon hiring process/candidate interviews\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs Data Centre Operations Engineer, you will be the primary point of contact for internal customers. There is never a dull moment as each day presents itself with different challenges. Some of the key responsibilities you will undertake are:\u003cbr/\u003e•\tYou will troubleshoot technical issues on advanced hardware, ranging from servers, storage and networking devices on a 24/7 basis.\u003cbr/\u003e•\tYou will maintain a high level of system reliability and availability.\u003cbr/\u003e•\tYou will participate in projects to enhance operational efficiencies with opportunities to share experiences and knowledge with our global network of technical experts.\u003cbr/\u003e•\tYou will share knowledge and help train less technical staff on the best practices related to all service owner issues\u003cbr/\u003e•\tYou will contribute towards building a great team by getting involved in the Amazon hiring process/candidate interviews\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS\u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. \u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"faa40047-f8ff-4825-8de4-919a6ff24a3f","id_icims":"3146468","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3146468/data-center-operations-tech-l4-data-center-operations-dco","job_schedule_type":"full-time","location":"IN, MH, Mumbai","locations":["{\"normalizedStateName\":\"Maharashtra\",\"normalizedCountryCode\":\"IND\",\"city\":\"Mumbai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, MH, Mumbai\",\"coordinates\":\"18.94018,72.83484\",\"normalizedCountyName\":\"Mumbai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Mumbai, Maharashtra, IND\",\"location\":\"IN, MH, Mumbai\",\"region\":\"MH\",\"buildingCodeList\":[\"BOM76\"],\"normalizedCityName\":\"Mumbai\"}"],"normalized_location":"Mumbai, Maharashtra, IND","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"December 19, 2025","preferred_qualifications":"- Experience dealing effectively with customers during problem resolution and operating efficiently under pressure\u003cbr/\u003e- Experience managing work and priorities through a ticketing system\u003cbr/\u003e- Experience working in a data center environment (racking and stacking gear, cable management, hot/cold aisle containment)\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"MH","title":"Data Center Operations Tech (L4), Data Center Operations (DCO)","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3146468/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 4+ years of compliance program management, legal, governance, audit, risk/loss prevention, or equivalent experience Bachelor's degree or equivalent Experience handling confidential information","business_category":"selling-partner-services","city":"Tempe","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Selling Partner Trust and Store Integrity (TSI) is responsible for creating a trustworthy shopping experience across Amazon stores worldwide by protecting customers, brands, selling partners, vendors and Amazon from fraud, counterfeit, and abuse as well as providing world‐class support and building loyalty with Amazon’s millions of selling partners. \u003cbr/\u003e\u003cbr/\u003eThe Special Projects and Investigations (SPI) team within TSI protects Amazon customers and stores by launching investigative projects and detection mechanisms by deep diving key events within the bad actor lifecycle to detect abuse at the earliest point and close the gap for bad actors. Our growth requires highly skilled candidates who move fast, have an entrepreneurial spirit to create new solutions, a tenacity to get things done, thrive in an environment of ambiguity and change, and are capable of breaking down and solving complex problems. We value individual expression, respect different opinions, and work together to create a culture where each of us is able to contribute fully. \u003cbr/\u003e\u003cbr/\u003eOur unique backgrounds and perspectives strengthen our ability to achieve Amazon's mission of being Earth's most customer-centric company.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eWe catch bad actors and stop online fraud. It’s fun! It’s hard! It matters! We are passionate about protecting our selling partners and customers from bad actors and want a candidate that shares that passion. Amazon is one of the world’s most trusted companies, help us keep it that way! To achieve this, we are looking for an experienced Risk Manager to join our team with background in risk/digital fraud, abuse, or infringement, to conduct critical, high impact, quick-turn investigations and make high judgement decisions. \u003cbr/\u003e\u003cbr/\u003eThe ideal candidate should be passionate about using and understanding data to discover bad actor trends and help us ensure that customers make great purchase decisions and our selling partners using Amazon are successful listing and selling their products. Your decisions will help proactively identify risk and take direct, high confidence actions to protect Amazon customers, selling partners, and help maintain the overall health of Amazon's WW stores.\u003cbr/\u003e\u003cbr/\u003e- The ideal candidate has a proven track record of delivering results in highly ambiguous and fast-moving environments. \u003cbr/\u003e\u003cbr/\u003e- Lead and support the team in responding to, investigating, managing and resolving high-impact incidents around product authenticity (counterfeit, trademark, copyright) and safety issues.\u003cbr/\u003e\u003cbr/\u003e- Use high-level judgment to own complex investigations and enforcement decisions driven through data.\u003cbr/\u003e\u003cbr/\u003e- Closely monitor media and global events to anticipate and mitigate potential risks. Be comfortable using data to analyze trends, predict and fix problems before they happen.\u003cbr/\u003e\u003cbr/\u003e- Own and/or manage projects designed to improve operational and process efficiency.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role is focused on delivering results by identifying and enforcing bad actors. Each day is different as new behaviors and trends are constantly discovered. You will be making high judgement decisions and taking direct actions to stop bad actors on WW stores as early as possible. While taking direct actions you will need to share your observations and trends with partner teams to constantly improve detection mechanisms. You and the team are on the front lines of protecting Amazon customers and stopping abuse in our stores.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur team is comprised of experts in the risk domains like fraud, cybersecurity, data security, internal risk, threat intelligence, regulatory compliance, vendor risk, etc. with strong data analysis skills and and judgement. We complement specialized skills with broad risk experiences gathered through years of experience to deliver results - we wear a lot of hats, move quickly, and are frugal to the core by doing things ourselves whenever possible. We speak 15 different languages, value diverse experiences and natural curiosity, and celebrate learning and taking risks. We make mistakes, learn from them, and support each other.\u003cbr/\u003e\u003cbr/\u003eOur work is to solve hard puzzles - typically with data and always with a lot persistence and curiosity. If you like the sound of that, come join us.\u003cbr/\u003e","department_cost_center":null,"description_short":"Selling Partner Trust and Store Integrity (TSI) is responsible for creating a trustworthy shopping experience across Amazon stores worldwide by protecting customers, brands, selling partners, vendors and","display_distance":null,"id":"36d929ff-3be0-4927-b49d-1d621338a5e4","id_icims":"3169198","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Risk Family","job_function_id":null,"job_path":"/en/jobs/3169198/risk-manager-spi-enforcements","job_schedule_type":"full-time","location":"US, AZ, Tempe","locations":["{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Tempe\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Tempe\",\"coordinates\":\"33.42554,-111.93722\",\"normalizedCountyName\":\"Maricopa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Tempe, Arizona, USA\",\"location\":\"US, AZ, Tempe\",\"region\":\"AZ\",\"buildingCodeList\":[\"PHX92\",\"LAZ3\",\"PHX11\",\"PHX700\",\"ZPH4\",\"MTU3\",\"PHX01\",\"AZA17\",\"CAZ1\",\"PHX19\",\"WFM347\",\"AZA1\",\"AZA7\",\"CAZ2\",\"PHX12\",\"DPX4\",\"AZA10\",\"WFM084\",\"ONM296\",\"LPX6\",\"PHX93\",\"PHX10\",\"AZA12\",\"ZPX6\",\"AZA3\",\"R069\",\"ONM265\"],\"normalizedCityName\":\"Tempe\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"ZST8\",\"SHK5\",\"IBF4\",\"SEA43\",\"SEA88\",\"SEA57\",\"SEA109\",\"ONM125\",\"SEA91\",\"ATBP18\",\"SEA910\",\"UWA2\",\"BFI83\",\"SEA33R\",\"SEA26\",\"LBV2\",\"METR7\",\"BFI33\",\"XSE9\",\"UWA4\",\"SEA141\",\"SEA28\",\"LBV4\",\"WFM761\",\"JSE5\",\"LUM9\",\"SEA55\",\"SEA41\",\"SEA1\",\"SEA69\",\"ONM127\",\"SEA60\",\"BFI81\",\"SEA74\",\"ISE1\",\"DSW9\",\"PSE\",\"ATBP23\",\"QDS1\",\"SEA38\",\"SEA76\",\"LJG6\",\"SHK3\",\"ZSL2\",\"WFM216\",\"SEA98\",\"SEA45\",\"DCA53\",\"LFC1\",\"SEA116\",\"MAB6\",\"CPA2\",\"ASL1\",\"SEA86\",\"ZST1\",\"SEA70\",\"SEA19\",\"LUM5\",\"ZST4\",\"WFM103\",\"LUM2\",\"SOD5\",\"SEA134\",\"SEA49\",\"SOD4\",\"FSE1\",\"LWA2\",\"SEA48\",\"FSE2\",\"PSL1\",\"ONM234\",\"ZST2\",\"ISG2\",\"SEA801\",\"DWX3\",\"ISE3\",\"SEA33\",\"SEA4\",\"ONM135\",\"ZST3\",\"SEA52\",\"SEA63\",\"BFI99\",\"JSE4\",\"SEA300\",\"LUM1\",\"CPA3\",\"SEA62\",\"CPA4\",\"SEA68\",\"SEA3\",\"WFM524\",\"TFC2\",\"T001\",\"ONM126\",\"SEA53\",\"DSE9\",\"ATBP24\",\"SEA81\",\"SEA72\",\"SEA59\",\"COL1\",\"SEA78\",\"BLU1\",\"METR2\",\"WFM59\",\"SEA24\",\"HUS1\",\"SHK4\",\"CWA42\",\"BFI82\",\"ATBP20\",\"DWA8\",\"LWES\",\"LBV3\",\"SEA142\",\"R004\",\"PUP\",\"UWA3\",\"SEA73\",\"CPA1\",\"SHK6\",\"IBF5\",\"SEA190\",\"SEA42\",\"SEA25\",\"SSE1\",\"SEA39\",\"DSW8\",\"SEA9\",\"MAE1\",\"ZST9\",\"KRA1\",\"IBF3\",\"ATBP22\",\"CWA2\",\"ONM124\",\"SEA44\",\"ATBP17\",\"SEA90\",\"WFM630\",\"HDG13\",\"SEA71\",\"ISE9\",\"SEA58\",\"ISE7\",\"SEA32\",\"SHK2\",\"SEA77\",\"MAB7\",\"XBF2\",\"ONM122\",\"LRSQ\",\"ZSL1\",\"SEA2\",\"SEA01\",\"SEA54\",\"WFM755\",\"SEA23\",\"SEA29\",\"ATBP5\",\"T002\",\"PKD1\",\"FSE3\",\"SEA61\",\"SEA83\",\"ATBP10\",\"ONM232\",\"DTS2\",\"DWX8\",\"ONM128\",\"SEA89\",\"SEA803\",\"ZST7\",\"JSE1\",\"WFM604\",\"LUM4\",\"HCS8\",\"SEA51\",\"MAC8\",\"SEA20\",\"SEA65\",\"ATBP12\",\"SEA18\",\"SEA95\",\"SEA804\",\"SEA22\",\"LUM3\",\"SEA36\",\"SEA147\",\"METR4\",\"ISE6\",\"SEA117\",\"SEA47\",\"ZSE1\",\"CRP1\",\"ZST5\",\"DWX7\",\"SEA40\",\"IBF1\",\"SOD1\",\"PSE3\",\"WJL5\",\"SEA46\",\"SEA37\",\"SEA401\",\"SEA84\",\"BWA1\",\"XXX0\",\"BFI80\",\"SEA102\",\"R097\",\"SEA75\",\"METR5\",\"WFM275\",\"SEA27\",\"DSW4\",\"SHK7\",\"ZKL3\",\"SEA21\",\"SEA02\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Tempe, Arizona, USA","optional_search_labels":[],"posted_date":"January 29, 2026","preferred_qualifications":"- 3+ years of program requirements definition and data and metrics leveraging to drive improvements experience Professional auditing qualification, or similar risk or compliance credentials Experience with SQL and Excel Amazon is committed to a diverse and inclusive workplace.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, AZ, TEMPE - 55,600.00 - 97,400.00 USD annually\u003cbr/\u003eUSA, AZ, Tempe - 55,600.00 - 97,400.00 USD annually\u003cbr/\u003eUSA, WA, SEATTLE - 80,200.00 - 97,400.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 55,600.00 - 97,400.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 80,200.00 - 97,400.00 USD annually","primary_search_label":"selling-partner-services.no-team-listed","source_system":"JobCreator","state":"AZ","title":"Risk Manager, SPI - Enforcements","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3169198/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Ensino Superior Completo em Engenharia, Administração, Operações ou áreas relacionadas.\u003cbr/\u003e- MS Office, com nível avançado em Excel (vlookup, fórmulas avançadas, tabelas dinâmicas, macros).\u003cbr/\u003e- Disponibilidade para trabalhar em turnos flexíveis incluindo fins de semana e feriados.\u003cbr/\u003e- Disponibilidade para viagens em 25% do tempo.\u003cbr/\u003e- Inglês básico.","business_category":"transportation-and-logistics","city":"Recife","company_name":"Amazon Logistica do Brasil","country_code":"BRA","description":"Nossas equipes de logística estão mudando a maneira como interagimos com clientes em todo o mundo todos os dias e resolvendo alguns dos maiores desafios logísticos enfrentados não apenas pela Amazon, mas também por toda a indústria.\u003cbr/\u003eSejam itens grandes ou pequenos, encontramos soluções para garantir que estamos cumprindo nossa promessa para os clientes. \u003cbr/\u003e\u003cbr/\u003eA equipe da Amazon Logistics Brasil (AMZL) está procurando uma pessoa Analista de Operações Logísticas para se juntar ao time de EDSP (External Delivery Service Providers), ou seja, as estações de entrega da AMZL operadas por parceiros. Essa pessoa irá atuar como Torre de Controle para essas operações operadas por parceiros. As operações serão feitas 7 dias por semana, incluindo feriados; portanto, os Analistas de Operações Logísticas são todos em escala 4x3, separados entre equipe front e back, podendo haver mudanças de turno.  \u003cbr/\u003e\u003cbr/\u003eEssa pessoa atuará na gestão de estações de entrega dos parceiros logísticos externos para garantir o desempenho e conformidade dos processos desses parceiros. Trabalhará em um ambiente altamente colaborativo que é mais próximo de uma start-up do que uma grande empresa. A atitude adotada é que nenhuma ideia é uma má ideia e as melhores ideias são aquelas que devem ser testadas e experimentadas. \u003cbr/\u003eEssa pessoa precisará prosperar e entregar resultados em um ambiente ambíguo, rápido e dinâmico. Parte de suas funções poderão ser realizadas virtualmente, como também auditoria /visitas aos parceiros logísticos in loco.\u003cbr/\u003eNossa cultura inclusiva capacita os Amazonians a oferecer os melhores resultados para nossos clientes. Não celebramos apenas a diversidade de nossa força de trabalho, celebramos as diversas formas como trabalhamos. Se você quiser solicitar uma acomodação para a entrevista ou o processo de integração, avise seu recrutador e ele o conectará à nossa equipe de acomodação.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Monitorar diariamente o funcionamento eficiente dos parceiros logísticos, sugerir e implantar melhorias;\u003cbr/\u003e- Criar e acompanhar métricas operacionais com os parceiros logísticos;\u003cbr/\u003e- Analisar dados de várias fontes e identificar tendências relevantes para que, a partir deles, decisões rápidas e importantes ao negócio sejam tomadas;\u003cbr/\u003e- Encontrar soluções práticas e simples para problemas complexos;\u003cbr/\u003e- Servir de elo entre os stakeholders internos e externos tendo em vista os objetivos, limites, conformidade e privacidade das informações;\u003cbr/\u003e- Mergulhar profundamente nas causas raízes dos problemas operacionais.\u003cbr/\u003e","department_cost_center":null,"description_short":"Nossas equipes de logística estão mudando a maneira como interagimos com clientes em todo o mundo todos os dias e resolvendo alguns dos maiores desafios logísticos enfrentados não apenas pela Amazon, mas","display_distance":null,"id":"be6c1efd-b338-49e3-af4b-2d463693ced2","id_icims":"3167475","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3167475/analista-operacoes-logisticas-amzl","job_schedule_type":"full-time","location":"BR, PE, Recife","locations":["{\"normalizedStateName\":\"Pernambuco\",\"normalizedCountryCode\":\"BRA\",\"city\":\"Recife\",\"countryIso3a\":\"BRA\",\"countryIso2a\":\"BR\",\"locationNonStemming\":\"Brazil, PE, Recife\",\"coordinates\":\"-8.05603,-34.87036\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Brazil\",\"normalizedLocation\":\"Recife, Pernambuco, BRA\",\"location\":\"BR, PE, Recife\",\"region\":\"PE\",\"buildingCodeList\":[\"DPE4\"],\"normalizedCityName\":\"Recife\"}"],"normalized_location":"Recife, Pernambuco, BRA","optional_search_labels":[],"posted_date":"January 27, 2026","preferred_qualifications":"- Inglês avançado.\u003cbr/\u003e- Experiência em Logística, e/ou Transportes.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-amzl","source_system":"JobCreator","state":"PE","title":"Analista Operações Logísticas, AMZL","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3167475/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amzl","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of computer hardware troubleshooting and repair experience\u003cbr/\u003e- 1+ years of computer networking experience\u003cbr/\u003e- High school or equivalent diploma","business_category":"aws","city":"Mumbai","company_name":"ADSIPL - Maharashtra","country_code":"IND","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eData Center Operations designs, installs \u0026 maintains the world’s largest Cloud Computing Infrastructure. We are looking for skilled Data Centre Linux \u0026 HW Engineer at Amazon Data Services India Private Limited (“ADSIPL”) with a passion for technology to help us expand AWS Cloud offerings to the next level.\u003cbr/\u003e  \u003cbr/\u003eADSIPL offers an exciting, dynamic and challenging environment encouraging creativity and personal development while maintaining AWS computing environments in a secure, scalable, and cost-effective manner. \u003cbr/\u003e \u003cbr/\u003eAt ADSIPL, career progression is part of our environment. We want you to progress. If your career path is in Systems, Network or Database Engineering, Software Development or maybe AWS Support, Technical Operations or perhaps Project Management, we will create a development plan to enable you to succeed reaching those goals. This begins on Day One!\u003cbr/\u003e  \u003cbr/\u003eA Data Centre Linux \u0026 HW Engineer at ADSIPL may be the primary point of contact for both internal customers (for example: Network Engineers, Systems Engineers, Software Developers, Database Engineers, Technical Operations) and external customers (Hardware Vendors, Contractors, Service Providers among others). \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eA Data Centre Operation Technician at ADSIPL, expectation from role are:\u003cbr/\u003e\u003cbr/\u003e• You work as part of the Operations team, whose primary responsibility is the maintenance and upkeep of the data center infrastructure.\u003cbr/\u003e• your role and responsibilities include, but are not limited to, server rack installation, hardware break-fix on various components, troubleshooting network issues also responding to emergent situations that affect operational stability.\u003cbr/\u003e• You may be the primary contact point for both internal customers (for example: Network Engineers, Systems Engineers, Software Developers, Technical Operations) and external service partners (Hardware Vendors, Contractors, Service Providers among others).\u003cbr/\u003e• You will work and meet SLAs against assigned trouble tickets via a directed workflow, be the first line touch point for hardware troubleshooting and technical issues.\u003cbr/\u003e• You perform on-call duties and will participate in Data Center operations, handling scheduled maintenance and change management activities that require monitoring of the data center infrastructure.\u003cbr/\u003e• You participate in team meetings for metric analysis and to discuss achieving daily/weekly goals.\u003cbr/\u003e• You possess knowledge of the policies and procedures, including safety and security, within your department, and understand the appropriate application of such knowledge\u003cbr/\u003e• You contribute to documentation on technical issues through root cause analysis for operational issues that occur, and contribute to process improvement initiatives relevant to the data center environment.\u003cbr/\u003e• More experienced technicians may assist in training less experienced members of the team.\u003cbr/\u003e* This position also has a physical component requiring the ability to lift \u0026 rack equipment up to 20kg; it may require working in cramped spaces or in elevated locations while adhering to health \u0026 safety guidelines.\u003cbr/\u003e* This role involves covering 24x7 shift rotation\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. ","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"ea0fb6f0-6c74-4cc4-b951-94d1b721f095","id_icims":"3123521","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3123521/data-centre-operation-technician-dco-tech","job_schedule_type":"full-time","location":"IN, MH, Mumbai","locations":["{\"normalizedStateName\":\"Maharashtra\",\"normalizedCountryCode\":\"IND\",\"city\":\"Mumbai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, MH, Mumbai\",\"coordinates\":\"18.94018,72.83484\",\"normalizedCountyName\":\"Mumbai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Mumbai, Maharashtra, IND\",\"location\":\"IN, MH, Mumbai\",\"region\":\"MH\",\"buildingCodeList\":[\"BOM109\"],\"normalizedCityName\":\"Mumbai\"}"],"normalized_location":"Mumbai, Maharashtra, IND","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"November 10, 2025","preferred_qualifications":"- Experience dealing effectively with customers during problem resolution and operating efficiently under pressure\u003cbr/\u003e- 2+ years of data center engineering experience\u003cbr/\u003e- Experience with network hardware: copper and optical fiber cabling, switches, routers\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-no-matching-primary-label-listed","source_system":"JobCreator","state":"MH","title":"Data Centre Operation Technician, DCO Tech","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3123521/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-no-matching-primary-label-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 3+ years of Video Games Industry (supporting title Development, Release, or Live Ops) experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"international-stores","city":"Chennai","company_name":"ADCI - Karnataka","country_code":"IND","description":"The Kindle Publishing Tools (PubTools) team owns the self-service content creators tools. Our vision is to enable all content creators to prepare and publish their ideated work in a fast, easy, and low-cost manner to Kindle to provide the widest selection of high-quality books with unique Kindle features for our customers. We achieve this via our product portfolio: Kindle Create (KC), Kindle Previewer (KPR), Online Previewer (OPR) - which is integrated with KDP (Kindle Direct Publishing) title setup workflow.\u003cbr/\u003e\u003cbr/\u003ePart of the team, you will invent, design and develop end-to-end products to make book creation experience simpler and high quality.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Collaborate with experienced cross-disciplinary Amazonians to conceive, design, and bring innovative products and services to customers.\u003cbr/\u003e• Design and implement system architecture and underlying components. Establish design principles, select design patterns, and instill best practices for software development across multiple teams\u003cbr/\u003e• Anticipate bottlenecks, make trade-offs, and balance the business needs versus technical constraints.\u003cbr/\u003e• Work in an agile, startup-like environment to deliver high-quality software.\u003cbr/\u003e","department_cost_center":null,"description_short":"The Kindle Publishing Tools (PubTools) team owns the self-service content creators tools. Our vision is to enable all content creators to prepare and publish their ideated work in a fast, easy, and low-cost","display_distance":null,"id":"7e9c93d3-f1ed-4c58-b21d-7fde43ab0f66","id_icims":"3172533","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3172533/software-dev-engineer-ii-publisher-tools","job_schedule_type":"full-time","location":"IN, TN, Chennai","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR26\"],\"normalizedCityName\":\"Bengaluru\"}","{\"normalizedStateName\":\"Tamil Nadu\",\"normalizedCountryCode\":\"IND\",\"city\":\"Chennai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TN, Chennai\",\"coordinates\":\"13.08404,80.28274\",\"normalizedCountyName\":\"Chennai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Chennai, Tamil Nadu, IND\",\"location\":\"IN, TN, Chennai\",\"region\":\"TN\",\"buildingCodeList\":[\"MAA15\"],\"normalizedCityName\":\"Chennai\"}"],"normalized_location":"Chennai, Tamil Nadu, IND","optional_search_labels":[],"posted_date":"February  3, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"international-stores.team-kindlecontent","source_system":"JobCreator","state":"TN","title":"Software Dev Engineer-II, Publisher Tools","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3172533/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-kindlecontent","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of analyzing and interpreting data with Redshift, Oracle, NoSQL etc. experience\u003cbr/\u003e- Experience with data visualization using Tableau, Quicksight, or similar tools\u003cbr/\u003e- Experience with data modeling, warehousing and building ETL pipelines\u003cbr/\u003e- Experience in Statistical Analysis packages such as R, SAS and Matlab\u003cbr/\u003e- Experience using SQL to pull data from a database or data warehouse and scripting experience (Python) to process data for modeling","business_category":"amazon-business","city":"Hyderabad","company_name":"ADCI HYD 13 SEZ","country_code":"IND","description":"As EU 3P AB, we need to build or rebuild the whole data structure serving our team and streamline reporting, strengthening our whole data architecture. Bandwidth to be allocated on scaling up initiatives rather avoiding ad-hoc requests to facilitate our transition to AI powered tools leveraging clean and standard datasets.  \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey priorities:\u003cbr/\u003ea. Data Infrastructure Development: Design, build, and maintain structured, standardized, and well-documented data marts that serve multiple business programs. Ensure data architecture follows best practices and is optimized for integration with AI/ML systems and analytical tools. Contribute to establishing and maintaining data architecture standards in collaboration with the Business Intelligence team.\u003cbr/\u003eb. Dashboard \u0026 Analytics Migration: contribute to the transition of key business reporting to modern analytics platforms, including both backend data mart development and frontend dashboard creation and maintenance.\u003cbr/\u003ec. Data Foundation for Advanced Analytics: Build scalable data components and pipelines to support Data Science and Software Development teams on upcoming analytical projects.\u003cbr/\u003ed. Operational Data Solutions: Develop self-service datasets and automated reporting solutions that improve team productivity across various business functions (e.g., recruitment, program management), reducing manual data requests and enabling teams to access standardized metrics independently.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eOur team puts a high value on work-life balance. It isn’t about how many hours you spend at home or at work; it’s about the flow you establish that brings energy to both parts of your life. We believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfilment.\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eOur team is intentional about attracting, developing, and retaining amazing talent from diverse backgrounds. Yes, we do get to build a really cool service, but we also think a big reason for that is inclusive and welcoming culture we try to cultivate every day.\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe care about your career growth. Whether your goals are to explore new design concepts, take on bigger opportunities, or get to the next level, we'll help you get there. Our business is growing fast and our people will grow with it.","department_cost_center":null,"description_short":"As EU 3P AB, we need to build or rebuild the whole data structure serving our team and streamline reporting, strengthening our whole data architecture. Bandwidth to be allocated on scaling up initiatives","display_distance":null,"id":"dbb8533e-9716-4040-92a0-7e3691c47531","id_icims":"3173504","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Business Intel Engineer","job_function_id":null,"job_path":"/en/jobs/3173504/sr-business-intel-engineer-eu-3p-ab","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD13\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":[],"posted_date":"February  4, 2026","preferred_qualifications":"- Experience with AWS solutions such as EC2, DynamoDB, S3, and Redshift\u003cbr/\u003e- Experience in data mining, ETL, etc. and using databases in a business environment with large-scale, complex datasets\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-business.no-team-listed","source_system":"JobCreator","state":"TS","title":"Sr. Business Intel Engineer, EU 3P AB","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3173504/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of analyzing and interpreting data with Redshift, Oracle, NoSQL etc. experience\u003cbr/\u003e- Experience with data visualization using Tableau, Quicksight, or similar tools\u003cbr/\u003e- Experience with data modeling, warehousing and building ETL pipelines\u003cbr/\u003e- Experience in Statistical Analysis packages such as R, SAS and Matlab\u003cbr/\u003e- Experience using SQL to pull data from a database or data warehouse and scripting experience (Python) to process data for modeling","business_category":"amazon-business","city":"Hyderabad","company_name":"ADCI HYD 13 SEZ","country_code":"IND","description":"The FBA Analytics team is seeking a Business Intelligence Engineer to lead compliance analytics and develop tech solutions that simplify Placement and Speed processes, and the fulfillment experience. In this role, you will take full ownership of BI processes—from identifying opportunities and defining problems to scoping new ideas, estimating financial impact, and developing data engineering, reporting, and visualization solutions. You will collaborate with stakeholders across the EU and globally. This role provides exposure to senior leadership and the opportunity to develop a holistic understanding of FBA business.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tReporting: Develop and manage Weekly, Monthly, and Quarterly Business Reviews and data visualizations for topline metrics, programs, and goals.\u003cbr/\u003e•\tCross-functional Collaboration: Partner with teams such as the Placement \u0026 Speed team, EU Supply Chain team, WW FBA team, and Account Managers to build scalable frameworks and drive implementation.\u003cbr/\u003e•\tData Management: Create and optimize data tables, automate data pipelines, and integrate new data sources outside the existing data lake.\u003cbr/\u003e•\tStrategic Analysis: Conduct in-depth analyses of new seller-facing programs, estimate the impact of new legislation and associated risks, model business scenarios, and design tailored data visualizations.\u003cbr/\u003e•\tMentoring: Play a key role within the analytics team by sharing knowledge, formalizing BI best practices, and mentoring junior engineers and analysts.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eOur team puts a high value on work-life balance. It isn’t about how many hours you spend at home or at work; it’s about the flow you establish that brings energy to both parts of your life. We believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfilment.\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eOur team is intentional about attracting, developing, and retaining amazing talent from diverse backgrounds. Yes, we do get to build a really cool service, but we also think a big reason for that is inclusive and welcoming culture we try to cultivate every day.\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe care about your career growth. Whether your goals are to explore new design concepts, take on bigger opportunities, or get to the next level, we'll help you get there. Our business is growing fast and our people will grow with it.","department_cost_center":null,"description_short":"The FBA Analytics team is seeking a Business Intelligence Engineer to lead compliance analytics and develop tech solutions that simplify Placement and Speed processes, and the fulfillment experience. In","display_distance":null,"id":"8fc85885-0086-4e7a-b3b8-ad3ba1345265","id_icims":"3173501","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Business Intel Engineer","job_function_id":null,"job_path":"/en/jobs/3173501/sr-business-intel-engineer-fba-eu","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD13\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":[],"posted_date":"February  4, 2026","preferred_qualifications":"- Experience with AWS solutions such as EC2, DynamoDB, S3, and Redshift\u003cbr/\u003e- Experience in data mining, ETL, etc. and using databases in a business environment with large-scale, complex datasets\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-business.no-team-listed","source_system":"JobCreator","state":"TS","title":"Sr. Business Intel Engineer, FBA EU","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3173501/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 7+ years of professional or military experience, or Bachelor's degree in business administration, finance, economics, computer science, data science, engineering, or other related field\u003cbr/\u003e- 7+ years of consulting, design and implementation of serverless distributed solutions experience\u003cbr/\u003e- Experience leading the design, development and deployment of business software at scale or recent hands-on technology infrastructure, network, compute, storage, and virtualization experience\u003cbr/\u003e- 3+ years of software development experience\u003cbr/\u003e- Current, active US Government Security Clearance of Top Secret or above","business_category":"aws","city":"Jessup","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"This position requires that the candidate selected be a US Citizen and must currently possess and maintain an active TS/SCI security clearance with polygraph.\u003cbr/\u003e\u003cbr/\u003eThe Amazon Web Services Professional Services (ProServe) team is seeking a skilled Senior Delivery Consultant to join our team at Amazon Web Services (AWS).\u003cbr/\u003e\u003cbr/\u003eIn this role, you'll work closely with customers to design, implement, and manage AWS solutions that meet their technical requirements and business objectives. You'll be a key player in driving customer success through their cloud journey, providing technical expertise and best practices throughout the project lifecycle. Possessing a deep understanding of AWS products and services, as a Delivery Consultant you will be proficient in architecting complex, scalable, and secure solutions tailored to meet the specific needs of each customer. You’ll work closely with stakeholders to gather requirements, assess current infrastructure, and propose effective migration strategies to AWS. As trusted advisors to our customers, providing guidance on industry trends, emerging technologies, and innovative solutions, you will be responsible for leading the implementation process, ensuring adherence to best practices, optimizing performance, and managing risks throughout the project.\u003cbr/\u003e\u003cbr/\u003eThe AWS Professional Services organization is a global team of experts that help customers realize their desired business outcomes when using the AWS Cloud. We work together with customer teams and the AWS Partner Network (APN) to execute enterprise cloud computing initiatives. Our team provides assistance through a collection of offerings which help customers achieve specific outcomes related to enterprise cloud adoption. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries.\u003cbr/\u003e\u003cbr/\u003eThe AWS Professional Services organization is a global team of experts that help customers realize their desired business outcomes when using the AWS Cloud. We work together with customer teams and the AWS Partner Network (APN) to execute enterprise cloud computing initiatives. Our team provides assistance through a collection of offerings which help customers achieve specific outcomes related to enterprise cloud adoption. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs an experienced technology professional, you will be responsible for:\u003cbr/\u003e\u003cbr/\u003e- Designing and implementing complex, scalable, and secure AWS solutions tailored to customer needs\u003cbr/\u003e- Providing technical guidance and troubleshooting support throughout project delivery\u003cbr/\u003e- Collaborating with stakeholders to gather requirements and propose effective migration strategies\u003cbr/\u003e- Acting as a trusted advisor to customers on industry trends and emerging technologies\u003cbr/\u003e- Sharing knowledge within the organization through mentoring, training, and creating reusable artifacts\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS \u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon  conferences, inspire us to never stop embracing our uniqueness. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eIt is expected to work from the AWS Office Location listed (or customer sites) at least 1+ days in a week. This is not a remote position. You are expected to be in the office or with customers as needed.","department_cost_center":null,"description_short":"This position requires that the candidate selected be a US Citizen and must currently possess and maintain an active TS/SCI security clearance with polygraph.The Amazon Web Services Professional Services","display_distance":null,"id":"648be617-feab-49af-b61f-b057c579040f","id_icims":"3170937","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Professional Services","job_function_id":null,"job_path":"/en/jobs/3170937/sr-delivery-consultant-wwps-proserve","job_schedule_type":"full-time","location":"US, MD, Jessup","locations":["{\"normalizedStateName\":\"Maryland\",\"normalizedCountryCode\":\"USA\",\"city\":\"Jessup\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MD, Jessup\",\"coordinates\":\"39.15512,-76.79892\",\"normalizedCountyName\":\"Howard\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Jessup, Maryland, USA\",\"location\":\"US, MD, Jessup\",\"region\":\"MD\",\"buildingCodeList\":[\"BWI24\"],\"normalizedCityName\":\"Jessup\"}"],"normalized_location":"Jessup, Maryland, USA","optional_search_labels":["amazon-cleared-jobs"],"posted_date":"January 30, 2026","preferred_qualifications":"- 7+ years of infrastructure architecture, database architecture and networking experience\u003cbr/\u003e- Experience in technology/software sales, pre-sales, or consulting\u003cbr/\u003e- Experience architecting/operating solutions built on AWS\u003cbr/\u003e- Experience working within software development or Internet-related industries\u003cbr/\u003e- Experience migrating or transforming legacy customer solutions to the cloud\u003cbr/\u003e- Experience managing data center operations, including data assurance, monitoring, alerting and notifications demonstrated ability to think strategically about business, product, and technical challenges\u003cbr/\u003e- Knowledge of security and compliance standards including HIPAA and GDPR\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MD, Jessup - 153,600.00 - 207,800.00 USD annually","primary_search_label":"aws.team-pro-serv","source_system":"JobCreator","state":"MD","title":"Sr. Delivery Consultant, WWPS ProServe","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3170937/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-pro-serv","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}