{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- PhD, or Master's degree and 4+ years of CS, CE, ML or related field experience\u003cbr/\u003e- Experience programming in Java, C++, Python or related language\u003cbr/\u003e- Experience in any of the following areas: algorithms and data structures, parsing, numerical optimization, data mining, parallel and distributed computing, high-performance computing\u003cbr/\u003e- Experience with popular deep learning frameworks such as MxNet and Tensor Flow","business_category":"transportation-and-logistics","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"  Welcome to the Worldwide Returns \u0026 ReCommerce team (WWR\u0026R) at Amazon.com.\u003cbr/\u003e  WWR\u0026R is an agile, innovative organization dedicated to ‘making zero happen’ to benefit our customers, our company, and the environment. Our goal is to achieve the three zeroes: zero cost of returns, zero waste, and zero defects. We do this by developing groundbreaking products and driving truly innovative operational excellence to help customers keep what they buy, recover returned and damaged product value, keep thousands of tons of waste from landfills, and create the best customer returns experience in the world. We have an eye to the future – we create long-term value at Amazon by focusing not just on the bottom line, but on the planet. We are building the most sustainable re-use channel we can by driving multiple aspects of the Circular Economy for Amazon – Returns \u0026 ReCommerce.\u003cbr/\u003e  Amazon WWR\u0026R is comprised of business, product, operational, program, software engineering and data teams that manage the life of a returned or damaged product from a customer to the warehouse and on to its next best use. Our work is broad and deep: we train machine learning models to automate routing and find signals to optimize re-use; we invent new channels to give products a second life; we develop highly respected product support to help customers love what they buy; we pilot smarter product evaluations; we work from the customer backward to find ways to make the return experience remarkably delightful and easy; and we do it all while scrutinizing our business with laser focus.\u003cbr/\u003e  You will help create everything from customer-facing and vendor-facing websites to the internal software and tools behind the reverse-logistics process. You can develop scalable, high-availability solutions to solve complex and broad business problems.\u003cbr/\u003e   \u003cbr/\u003e  We are a group that has fun at work while driving incredible customer, business, and environmental impact. We are backed by a strong leadership group dedicated to operational excellence that empowers a reasonable work-life balance. As an established, experienced team, we offer the scope and support needed for substantial career growth.\u003cbr/\u003e  Amazon is earth’s most customer-centric company and through WWR\u0026R, the earth is our customer too. Come join us and innovate with the Amazon Worldwide Returns \u0026 ReCommerce team!\u003cbr/\u003e  \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Design, develop, and evaluate highly innovative models for our Natural Language Understanding (NLU) and Large Language Model (LLM) models\u003cbr/\u003e* Use SQL to query and analyze the data.\u003cbr/\u003e* Use Python, Jupyter notebook, and Pytorch to train/test/deploy NLU/LLM/GenAI models. \u003cbr/\u003e* Use machine learning and analytical techniques to create scalable solutions for business problems.\u003cbr/\u003e* Research and implement novel machine learning and statistical approaches.\u003cbr/\u003e* Mentor interns.\u003cbr/\u003e* Work closely with data \u0026 software engineering teams to build model implementations and integrate successful models and algorithms in production systems at very large scale.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eIf you are not sure that every qualification on the list above describes you exactly, we'd still love to hear from you! At Amazon, we value people with unique backgrounds, experiences, and skillsets. If you’re passionate about this role and want to make an impact on a global scale, please apply! \u003cbr/\u003e\u003cbr/\u003eBenefits:\u003cbr/\u003eAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include: \u003cbr/\u003e\t1. Medical, Dental, and Vision Coverage \u003cbr/\u003e\t2. Maternity and Parental Leave Options \u003cbr/\u003e\t3. Paid Time Off (PTO) \u003cbr/\u003e\t4. 401(k) Plan \u003cbr/\u003e\u003cbr/\u003eLearn more about our benefits here: https://amazon.jobs/en/internal/benefits/us-benefits-and-stock \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhen a customer returns a package to Amazon, the request and package will be passed through our WWRR machine learning (ML) systems so that we could improve the customer experience, identify return root cause, optimize re-use, and evaluate the returned package. Our problems touch multiple modalities spanning from: textual, categorical, image, to speech data. \u003cbr/\u003eWe operate at large scale and rely on state-of-the-art modeling techniques to power our ML models: XGBoost, BERT, Vision Transformers, Large Language Models.","department_cost_center":null,"description_short":"  Welcome to the Worldwide Returns \u0026 ReCommerce team (WWR\u0026R) at Amazon.com.  WWR\u0026R is an agile, innovative organization dedicated to ‘making zero happen’ to benefit our customers, our company, and the","display_distance":null,"id":"6df69aa3-7591-4bc1-bd3c-258f5800ab2d","id_icims":"3174113","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3174113/applied-scientist-worldwide-returns-recommerce-science","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA94\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":["ats.team-science"],"posted_date":"February  4, 2026","preferred_qualifications":"- Experience with Machine Learning and Large Language Model fundamentals, including architecture, training/inference lifecycles, and optimization of model execution, or experience (non-internship) in professional software development\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Bellevue - 142,800.00 - 193,200.00 USD annually","primary_search_label":"transportation-and-logistics.team-ww-returns-recommerce","source_system":"JobCreator","state":"WA","title":"Applied Scientist, Worldwide Returns \u0026 Recommerce - Science ","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/3174113/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-ww-returns-recommerce","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- 5+ years of increasing responsibilities in EHS and/or environmental programs in manufacturing, production, or service operations\u003cbr/\u003e- 5+ years of increasing responsibilities in people and performance management\u003cbr/\u003e- Experience implementing lean principles and process improvement in an operational environment","business_category":"fulfillment-and-operations","city":"North Las Vegas","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We’re seeking a dedicated Workplace Health \u0026 Safety (WHS) Manager to help drive this mission forward. As our next WHS Manager, you'll be more than a safety professional – you'll be a catalyst for change, leading a comprehensive safety program that touches thousands of lives. Working at the intersection of operations and safety, you'll shape the future of workplace health while delivering real-time solutions that protect our most valuable asset: our people.  \u003cbr/\u003e\u003cbr/\u003eIn this role, you'll serve as the site's safety facilitator, orchestrating our Global WHS Program with precision and passion. You'll partner with Operations leadership to weave safety into the fabric of our daily operations, using data-driven insights to create innovative solutions that reduce risk and enhance productivity. Your ability to build trust, influence change, and drive results will be crucial as you lead comprehensive risk assessments and transform safety data into actionable strategies.\u003cbr/\u003eLeadership is at the heart of this role. You'll build and develop a high-performing team of WHS professionals, fostering a culture of continuous improvement and excellence. \u003cbr/\u003e\u003cbr/\u003eCore Impact Areas:\u003cbr/\u003eSafety Leadership \u0026 Innovation - Transform safety culture through leadership and innovative solutions. Drive continuous improvement initiatives that set new benchmarks in workplace safety. Leverage technology and data analytics to drive preventive safety measures that protect our associates while enhancing operational excellence. Develop leadership plans, communicate expectations, and drive initiatives to create a safe work environment. Measure performance against WHS policies, analyze metrics, and conduct site audits to address non-compliance issues. \u003cbr/\u003e\u003cbr/\u003eStrategic Partnership \u0026 Influence - Build partnerships with Operations leadership to integrate safety into every aspect of our business. Use compelling data analysis and risk insights to influence positive change and drive strategic decision-making. Establish yourself as a trusted advisor who balances safety excellence with operational demands. Oversee recordkeeping, workplace organization, and WHS training programs. \u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements include: \u003cbr/\u003e- Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Stand/walk for up to 12 hours during shifts\u003cbr/\u003e- Work in an environment where the noise level varies \u003cbr/\u003e- Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e- Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e- Maintain effective care delivery in emergencies and assist emergency response at the site\u003cbr/\u003e\u003cbr/\u003eThose that do not have an adult First Aid, CPR, AED certification from the American Heart Association or American Red Cross must obtain within 3 weeks of start date.","department_cost_center":null,"description_short":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We’re seeking","display_distance":null,"id":"16cab358-7e81-406b-bf13-1c30605cba0a","id_icims":"3112333","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3112333/site-ehs-manager-iii","job_schedule_type":"full-time","location":"US, NV, North Las Vegas","locations":["{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"North Las Vegas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, North Las Vegas\",\"coordinates\":\"36.20069,-115.12228\",\"normalizedCountyName\":\"Clark\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"North Las Vegas, Nevada, USA\",\"location\":\"US, NV, North Las Vegas\",\"region\":\"NV\",\"buildingCodeList\":[\"LAS7\"],\"normalizedCityName\":\"North Las Vegas\"}"],"normalized_location":"North Las Vegas, Nevada, USA","optional_search_labels":[],"posted_date":"October 20, 2025","preferred_qualifications":"- Distribution Center or Manufacturing EHS experience with mix of exempt and non-exempt employees at a site of at least 250 people\u003cbr/\u003e- Master’s degree\u003cbr/\u003e- Experience implementing lean principles and process improvement in an operational environment.\u003cbr/\u003e- Experience in a fast paced, dynamic organization\u003cbr/\u003e- Certified Safety Professional\u003cbr/\u003e- Excellent written and verbal communication skills, including comfort interfacing with site leaders.\u003cbr/\u003e- Ability to develop and implement department goals and strategies\u003cbr/\u003e- Strong analytical skills with demonstrated problem solving ability\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NV, North Las Vegas - 94,200.00 - 141,400.00 USD annually","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"NV","title":"Site EHS Manager III","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3112333/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of program or project management experience\u003cbr/\u003e- 3+ years of defining and implementing process improvement initiatives using data and metrics experience\u003cbr/\u003e- Knowledge of Excel (Pivot Tables, VLookUps) at an advanced level and SQL\u003cbr/\u003e- Experience using data and metrics to determine and drive improvements\u003cbr/\u003e- Experience working cross functionally with tech and non-tech teams\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Experience in Business, Operations, Supply Chain, Learning, or a related field","business_category":"fulfillment-and-operations","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Workplace Health \u0026 Safety (WHS) mission is to provide tools, resources, and environments that support safe, efficient, and healthy behaviors and encourage employees to proactively manage their health and well being. To support this focus area, Amazon is seeking a leader to serve as our Program Manager for Worldwide WHS to build programs that create a safe workplace and build a world-class safety culture. In this role, you will dive deep into operations processes; identify risks through data and first-hand experience; build programs and improve processes to eliminate risks; and influence operations to sustain a culture of safety. This role will focus on leading large, strategic projects within Amazon Business Units (BU) and across different geographies – the role will also look for ways to replicate these BU-specific solutions to other BU, and find commonalities to support scale and speed.\u003cbr/\u003e\u003cbr/\u003eThe Program manager role will challenge you to push boundaries and lead transformative innovation while having the autonomy to make rapid data-driven decisions and invent on behalf of Operators (leaders) and Associates. In this role, you will work cross-functionally with members from various teams, including Operations; Amazon Fulfillment Technologies (AFT); Amazon Robotics (AR); Inbound Supply Chain; Launch; Sales \u0026 Operations Planning (S\u0026OP); Capacity Planning; Finance and others to deploy solutions at scale.\u003cbr/\u003e\u003cbr/\u003eThis position requires travel up to approximately 25%, when needed (and with appropriate health and safety conditions).\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003e    Manage complex program life-cycles that span multiple business units, delivering projects that achieve meaningful safety improvement metrics across fulfillment centers.\u003cbr/\u003e    Define and scope safety improvement initiatives, set clear objectives, analyze data, and drive improvements quantified with specific metrics.\u003cbr/\u003e    Collaborate with stakeholders across multiple business units to identify safety risks and develop innovative solutions to engineer these risks out of our fulfillment centers.\u003cbr/\u003e    Apply relevant tools and mechanisms to track progress, communicate status to stakeholders, and escalate issues when required to maintain project timelines.\u003cbr/\u003e    Anticipate potential blockers by looking around corners, develop mitigation strategies, and balance simultaneous tasks to ensure consistent project delivery.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour typical day involves balancing short-term site-level program delivery with long-term business-wide change initiatives. You'll start by reviewing safety metrics across fulfillment centers, identifying trends that require attention. Throughout the day, you'll coordinate with stakeholders across business units, influence them to meet their delivery commitments, and work to accomplish necessary tasks that move your safety programs forward. You'll analyze data to track progress against safety improvement metrics and adjust plans as needed to keep projects on track.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur team is dedicated to engineering risk out of Amazon's fulfillment centers through innovative program delivery. We work across multiple business units to identify safety improvement opportunities and implement solutions that protect our employees while maintaining operational excellence. The team's mission focuses on developing and delivering programs that drive measurable safety improvements across the network. Our collaborative approach brings together expertise from various disciplines to create comprehensive safety solutions that address both immediate concerns and long-term strategic goals.","department_cost_center":null,"description_short":"Amazon Workplace Health \u0026 Safety (WHS) mission is to provide tools, resources, and environments that support safe, efficient, and healthy behaviors and encourage employees to proactively manage their health","display_distance":null,"id":"4cede7be-3e70-48ce-b80f-9d881f0e0941","id_icims":"3186491","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Program Management","job_function_id":null,"job_path":"/en/jobs/3186491/program-manager-workplace-health-and-safety","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Nashville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Nashville\",\"coordinates\":\"36.16792,-86.77798\",\"normalizedCountyName\":\"Davidson\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Nashville, Tennessee, USA\",\"location\":\"US, TN, Nashville\",\"region\":\"TN\",\"buildingCodeList\":[\"BNA12\"],\"normalizedCityName\":\"Nashville\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA94\"],\"normalizedCityName\":\"Bellevue\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS19\"],\"normalizedCityName\":\"Arlington\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"February 22, 2026","preferred_qualifications":"- 3+ years of driving end to end delivery, and communicating results to senior leadership experience\u003cbr/\u003e- 3+ years of driving process improvements experience\u003cbr/\u003e- Experience in stakeholder management, dealing with multiple stakeholders at varied levels of the organization\u003cbr/\u003e- Experience building processes, project management, and schedules\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TN, Nashville - 66,800.00 - 116,800.00 USD annually\u003cbr/\u003eUSA, VA, Arlington - 74,200.00 - 129,800.00 USD annually\u003cbr/\u003eUSA, WA, Bellevue - 82,700.00 - 129,800.00 USD annually","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"WA","title":"Program Manager, Workplace Health and Safety","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3186491/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Work flexible hours as business demands, including overnight, weekends and holidays\u003cbr/\u003e- Bachelor’s Degree or 2+ years Amazon experience. • 7+ years direct management experience, including a salaried workforce, in a manufacturing, production or distribution environment. • Prior experience with performance metrics, process improvement and Lean techniques. • Prior experience with the full staffing lifecycle, including interviewing, hiring, performance management, promotions and termination.","business_category":"fulfillment-ops","city":"Phoenix","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our Sr. Operations Managers responsible for all budgetary, people development and operations objectives. The Sr. Operations Managers is responsible for all aspects of operation or functions  at the site. Additional responsibilities include managing and leading a team of Operations and Area Managers, coaching and mentoring the team to ensure performance objectives are met, building positive employee relations and building leadership bench strength within the Fulfillment Center. \r\u003cbr/\u003e\r\u003cbr/\u003eResponsibilities: \r\u003cbr/\u003e• Drives creation of quality initiatives, process change initiatives and other Lean initiatives to enable their functional area and ultimately the FC to meet and exceed business plan. \r\u003cbr/\u003e• Responsible for the overall safety, quality and performance and customer experience of either Inbound or Outbound operations. \r\u003cbr/\u003e• Will set and clarify requirements and expectations for Operations and Area Managers. Measures performance, provides feedback, and holds Ops Managers accountable for their performance and the performance of their departments. \r\u003cbr/\u003e• Leverages the Operations and Area Managers by sourcing and nurturing ideas, and rolling them into the creation of improvement plans for the functional area. \r\u003cbr/\u003e• Takes proactive steps to ensure that best practices are shared across all departments, shifts and among the network. \r\u003cbr/\u003e• Works closely with support staff (HR, Finance, Facilities, Safety, IT and other Sr. Operations Managers) to build and secure support and resources for projects and initiatives in their area, as well as providing needed support and resources for other staff initiatives.\r\u003cbr/\u003e\r\u003cbr/\u003eAdditional Job Elements: \r\u003cbr/\u003e• Lift and move totes up to 49 pounds each \r\u003cbr/\u003e• Regular bending, lifting, stretching and reaching both below the waist and above the head \r\u003cbr/\u003e• Walking in the FC and around area with great frequency; facilities are over a quarter mile in length \r\u003cbr/\u003e• Continual standing and/or walking an average of 5 miles daily \r\u003cbr/\u003e• Ability to work in construction /distribution environments that may be noisy, unlit, unheated, not air-conditioned \r\u003cbr/\u003e• Able to access all areas of building (ascending and descending ladders, stairs, gangways safely and without limitation)","department_cost_center":null,"description_short":"Our Sr. Operations Managers responsible for all budgetary, people development and operations objectives. The Sr. Operations Managers is responsible for all aspects of operation or functions  at the site.","display_distance":null,"id":"76c88d28-4eec-4564-98ac-77a03d9fdc05","id_icims":"3146114","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3146114/sr-operations-manager","job_schedule_type":"full-time","location":"US, AZ, Phoenix","locations":["{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Phoenix\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Phoenix\",\"coordinates\":\"33.44825,-112.0758\",\"normalizedCountyName\":\"Maricopa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Phoenix, Arizona, USA\",\"location\":\"US, AZ, Phoenix\",\"region\":\"AZ\",\"buildingCodeList\":[\"PHX51\",\"AZA5\",\"PHX101\",\"CMKT6\",\"ZPX7\",\"PHX3\",\"LALT2\",\"FFZ61\",\"LPX4\",\"PHX102\",\"PHX60\",\"PHX801\",\"WFM788\",\"LALT3\",\"KRB3\",\"PCA1\",\"FFZ70\",\"PHX78\",\"HPX9\",\"VUDS\",\"GYR3\",\"PHX30\",\"PPX1\",\"ONM217\",\"PHX250\",\"HPX2\",\"PHX402\",\"FFZ80\",\"WFM476\",\"DAZ2\",\"DPX5\",\"AZA6\",\"VXAZ\",\"DPX8\",\"ONM105\",\"WFM172\",\"PHX100\",\"MBE8\",\"PHX62\",\"KPHX1\",\"TUS1\",\"DTU8\",\"DPX2\",\"PHX73\",\"XUSH\",\"PHX68\",\"PHX54\",\"DTU6\",\"ONM113\",\"XPH2\",\"TFC1\",\"PHX6\",\"PHX40\",\"PHX052\",\"LPX1\",\"PHX7\",\"PHX120\",\"SDL1\",\"PHX55\",\"PHX251\",\"LPX5\",\"LALT6\",\"ADS63\",\"PHX41\",\"OSW9\",\"FFZ81\",\"PHX72\",\"VUKC\",\"FFZ71\",\"LALT7\",\"AZA4\",\"PHX50\",\"FFZ82\",\"UAZ1\",\"LPVM\",\"PHX131\",\"ZPH1\",\"ONM103\",\"ONM111\",\"ZPX9\",\"ZPX3\",\"PHX750\",\"PHX31\",\"SAZ1\",\"LALT4\",\"FFZ60\",\"PHX20\",\"GEU4\"],\"normalizedCityName\":\"Phoenix\"}"],"normalized_location":"Phoenix, Arizona, USA","optional_search_labels":[],"posted_date":"December 19, 2025","preferred_qualifications":"- Degree in Engineering, Operations or related field and MBA preferred • Experience with a contingent workforce during peak seasons • Ability to handle changing priorities and use good judgment in stressful situations • Interest in long-term career development through assignments in multiple FCs across the nation.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, AZ, Phoenix - 135,000.00 - 182,700.00 USD annually","primary_search_label":"fulfillment-ops.team-global-specialty-fulfillment","source_system":"JobCreator","state":"AZ","title":"Sr. Operations Manager","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3146114/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-specialty-fulfillment","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of program or project management experience\u003cbr/\u003e- 3+ years of defining and implementing process improvement initiatives using data and metrics experience\u003cbr/\u003e- Knowledge of Excel (Pivot Tables, VLookUps) at an advanced level and SQL\u003cbr/\u003e- Experience using data and metrics to determine and drive improvements\u003cbr/\u003e- Experience working cross functionally with tech and non-tech teams\u003cbr/\u003e- Bachelor's degree","business_category":"fulfillment-and-operations","city":"Nashville","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The New Construction \u0026 Launch Workplace Health and Safety Program Manager (WHS PM) will be responsible for partnering with the Launch and Engineering teams to manage the safety deliverables required when opening new sites. They will execute the new site safety start-up plan to help ensure the site successfully implements our company safety procedures and all applicable local and regional regulations. The New Construction \u0026 Launch WHS PM will coordinate safety start-up functions.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eJob requires up to 75% travel to new launch sites during Construction phase through post launch visits. This role requires strong communication skills with stakeholders and senior leaders, strong written and verbal communication skills, self-motivated and strong organizational skills, ability to track metrics and meet standard KPI's, deliver on self-obtained projects to improve design and reduce risk, and ability to work with 3P's as well as Operational teams.\u003cbr/\u003e\u003cbr/\u003eThe New Construction \u0026 Launch WHS PM must demonstrate the ability to build trust and confidence with the Design, Engineering, Construction, Startup, Launch and New Site WHS teams. This individual must be an effective communicator and send clear, concise and consistent messages, both verbally and in writing. They will be required to possess excellent safety and relevant environmental and ergonomic knowledge and to demonstrate this expertise when working with Operations and Engineering teams. \u003cbr/\u003e\u003cbr/\u003eManage and monitor the safety start-up plan for all new sites\u003cbr/\u003eEnsure Amazon buildings are designed and built compliant to regulatory and Amazon standards\u003cbr/\u003eConduct design composite reviews for compliance with Amazon standards and regulatory requirements\u003cbr/\u003eConduct site safety, health and environmental commissioning inspections.\u003cbr/\u003eCreate and maintain punch lists with relevant teams.\u003cbr/\u003eIdentify the required safety supplies for new site start-up. Assist in the procurement of the safety items. Set-up all site safety supplies onsite as needed\u003cbr/\u003ePerform regular analysis and risk assessment of new build processes and equipment for site safety improvements and continuous standards improvement\u003cbr/\u003eDevelop safety commissioning lists with relevant teams\u003cbr/\u003eSet-up new site in all appropriate safety databases\u003cbr/\u003eInspect and certify PIT equipment meets Amazon requirements\u003cbr/\u003eSchedule applicable Safety training for site Safety team and managers with a local trainer\u003cbr/\u003eDevelop a positive working relationship with stakeholders involved throughout the project\u003cbr/\u003e Project Work for topics relating to the network\u003cbr/\u003eMaintain communication with Operational directors and General Managers\u003cbr/\u003eLead and influence cross functional teams as required to deliver safety centered processes and building designs\u003cbr/\u003eReview operations and determine the required site safety signage\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include:\u003cbr/\u003e1. Medical, Dental, and Vision Coverage\u003cbr/\u003e2. Maternity and Parental Leave Options\u003cbr/\u003e3. Paid Time Off (PTO)\u003cbr/\u003e4. 401(k) Plan\u003cbr/\u003e\u003cbr/\u003eIf you are not sure that every qualification on the list above describes you exactly, we'd still love to hear from you! At Amazon, we value people with unique backgrounds, experiences, and skill sets. If you’re passionate about this role and want to make an impact on a global scale, please apply! \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eRole consists of building template review/design to ensure it meets regulatory requirements, all safety requirements, aligns with current Amazon Policies and Procedures, and Federal/State/Local jurisdiction requirements. PM will also be responsible for traveling to the site during construction to perform commissioning of equipment/building/modules/safety supplies. Post launch lessons learned, design changes, and module updates/changes will be documented and actioned. Collaboration with stakeholders to align on changes/improvements of design including risk assessments and risk reduction.","department_cost_center":null,"description_short":"The New Construction \u0026 Launch Workplace Health and Safety Program Manager (WHS PM) will be responsible for partnering with the Launch and Engineering teams to manage the safety deliverables required when","display_distance":null,"id":"4040dea5-e6b0-4554-91db-a87883fb1a5c","id_icims":"3186494","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Program Management","job_function_id":null,"job_path":"/en/jobs/3186494/design-startup-workplace-healthy-and-safety-program-manager-whs-design-construction-startup-whs-dcs","job_schedule_type":"full-time","location":"US, TN, Nashville","locations":["{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Nashville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Nashville\",\"coordinates\":\"36.16792,-86.77798\",\"normalizedCountyName\":\"Davidson\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Nashville, Tennessee, USA\",\"location\":\"US, TN, Nashville\",\"region\":\"TN\",\"buildingCodeList\":[\"BNA12\"],\"normalizedCityName\":\"Nashville\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA94\"],\"normalizedCityName\":\"Bellevue\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS19\"],\"normalizedCityName\":\"Arlington\"}"],"normalized_location":"Nashville, Tennessee, USA","optional_search_labels":[],"posted_date":"February 22, 2026","preferred_qualifications":"- 3+ years of driving end to end delivery, and communicating results to senior leadership experience\u003cbr/\u003e- 3+ years of driving process improvements experience\u003cbr/\u003e- Experience in stakeholder management, dealing with multiple stakeholders at varied levels of the organization\u003cbr/\u003e- Experience building processes, project management, and schedules\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TN, Nashville - 66,800.00 - 116,800.00 USD annually\u003cbr/\u003eUSA, VA, Arlington - 74,200.00 - 129,800.00 USD annually\u003cbr/\u003eUSA, WA, Bellevue - 82,700.00 - 129,800.00 USD annually","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"TN","title":"Design \u0026 Startup Workplace Healthy and Safety Program Manager, WHS Design, Construction \u0026 Startup, WHS DCS","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3186494/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of program or project management experience\u003cbr/\u003e- 3+ years of defining and implementing process improvement initiatives using data and metrics experience\u003cbr/\u003e- Knowledge of Excel (Pivot Tables, VLookUps) at an advanced level and SQL\u003cbr/\u003e- Experience using data and metrics to determine and drive improvements\u003cbr/\u003e- Experience working cross functionally with tech and non-tech teams\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Experience in Business, Operations, Supply Chain, Learning, or a related field","business_category":"fulfillment-and-operations","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Workplace Health \u0026 Safety (WHS) mission is to provide tools, resources, and environments that support safe, efficient, and healthy behaviors and encourage employees to proactively manage their health and well being. To support this focus area, Amazon is seeking a leader to serve as our Program Manager for Worldwide WHS to build programs that create a safe workplace and build a world-class safety culture. In this role, you will dive deep into operations processes; identify risks through data and first-hand experience; build programs and improve processes to eliminate risks; and influence operations to sustain a culture of safety. This role will focus on leading large, strategic projects within Amazon Business Units (BU) and across different geographies – the role will also look for ways to replicate these BU-specific solutions to other BU, and find commonalities to support scale and speed.\u003cbr/\u003e\u003cbr/\u003eThe Program manager role will challenge you to push boundaries and lead transformative innovation while having the autonomy to make rapid data-driven decisions and invent on behalf of Operators (leaders) and Associates. In this role, you will work cross-functionally with members from various teams, including Operations; Amazon Fulfillment Technologies (AFT); Amazon Robotics (AR); Inbound Supply Chain; Launch; Sales \u0026 Operations Planning (S\u0026OP); Capacity Planning; Finance and others to deploy solutions at scale.\u003cbr/\u003e\u003cbr/\u003eThis position requires travel up to approximately 25%, when needed (and with appropriate health and safety conditions).\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003e    Manage complex program life-cycles that span multiple business units, delivering projects that achieve meaningful safety improvement metrics across fulfillment centers.\u003cbr/\u003e    Define and scope safety improvement initiatives, set clear objectives, analyze data, and drive improvements quantified with specific metrics.\u003cbr/\u003e    Collaborate with stakeholders across multiple business units to identify safety risks and develop innovative solutions to engineer these risks out of our fulfillment centers.\u003cbr/\u003e    Apply relevant tools and mechanisms to track progress, communicate status to stakeholders, and escalate issues when required to maintain project timelines.\u003cbr/\u003e    Anticipate potential blockers by looking around corners, develop mitigation strategies, and balance simultaneous tasks to ensure consistent project delivery.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour typical day involves balancing short-term site-level program delivery with long-term business-wide change initiatives. You'll start by reviewing safety metrics across fulfillment centers, identifying trends that require attention. Throughout the day, you'll coordinate with stakeholders across business units, influence them to meet their delivery commitments, and work to accomplish necessary tasks that move your safety programs forward. You'll analyze data to track progress against safety improvement metrics and adjust plans as needed to keep projects on track.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur team is dedicated to engineering risk out of Amazon's fulfillment centers through innovative program delivery. We work across multiple business units to identify safety improvement opportunities and implement solutions that protect our employees while maintaining operational excellence. The team's mission focuses on developing and delivering programs that drive measurable safety improvements across the network. Our collaborative approach brings together expertise from various disciplines to create comprehensive safety solutions that address both immediate concerns and long-term strategic goals.","department_cost_center":null,"description_short":"Amazon Workplace Health \u0026 Safety (WHS) mission is to provide tools, resources, and environments that support safe, efficient, and healthy behaviors and encourage employees to proactively manage their health","display_distance":null,"id":"b7e45a76-8dd7-494d-8407-49a2523ef207","id_icims":"3186492","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Program Management","job_function_id":null,"job_path":"/en/jobs/3186492/program-manager-workplace-health-and-safety","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Nashville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Nashville\",\"coordinates\":\"36.16792,-86.77798\",\"normalizedCountyName\":\"Davidson\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Nashville, Tennessee, USA\",\"location\":\"US, TN, Nashville\",\"region\":\"TN\",\"buildingCodeList\":[\"BNA12\"],\"normalizedCityName\":\"Nashville\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA94\"],\"normalizedCityName\":\"Bellevue\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS19\"],\"normalizedCityName\":\"Arlington\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"February 22, 2026","preferred_qualifications":"- 3+ years of driving end to end delivery, and communicating results to senior leadership experience\u003cbr/\u003e- 3+ years of driving process improvements experience\u003cbr/\u003e- Experience in stakeholder management, dealing with multiple stakeholders at varied levels of the organization\u003cbr/\u003e- Experience building processes, project management, and schedules\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TN, Nashville - 66,800.00 - 116,800.00 USD annually\u003cbr/\u003eUSA, VA, Arlington - 74,200.00 - 129,800.00 USD annually\u003cbr/\u003eUSA, WA, Bellevue - 82,700.00 - 129,800.00 USD annually","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"WA","title":"Program Manager, Workplace Health and Safety","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3186492/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Electrical Engineering or a related field\u003cbr/\u003e- 3+ years of electrical and electronic principles experience\u003cbr/\u003e- Experience working with equipment suppliers, laboratories and manufacturing plants\u003cbr/\u003e- Experience testing hardware/mechanical sub-components, research and data analysis skills, and/or Printed Circuit Board (PCB) layout best practices\u003cbr/\u003e- 4+ years of hardware development, test lab, space/aerospace maintenance or hands-on engineering environment experience\u003cbr/\u003e- Understanding of power semiconductor switches and diodes, and their characteristics\u003cbr/\u003e- Understanding of devices built upon various materials such as Si, SiC, and GaN\u003cbr/\u003e- Experience designing and analyzing inverter and converter circuits including gate drivers\u003cbr/\u003e- Knowledge and experience with embedded control of power electronic circuits\u003cbr/\u003e- Experience using software tools such as Spice, PLECS, Mathcad, Ansys Simplorer, and Matlab\u003cbr/\u003e- Experience leading PCBA Board bring-Up and validation testing\u003cbr/\u003e- Experience with CAD software (CATIA preferred)\u003cbr/\u003e- Experience with written and Verbal communication in aerospace and/or automotive industry settings","business_category":"retail","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Here at Amazon, we embrace our differences. We are committed to furthering our culture of diversity and inclusion of our teams within the organization.\u003cbr/\u003e\u003cbr/\u003eHow do you get items to customers quickly, cost-effectively, and—most importantly—safely, in less than an hour? And how do you do it in a way that can scale? Our teams of hundreds of scientists, engineers, aerospace professionals, and futurists have been working hard to do just that! We are delivering to customers, and are excited for what’s to come. Check out more information about Prime Air on the About Amazon blog(https://www.aboutamazon.com/news/transportation/amazon-prime-air-delivery-drone-reveal-photos).\u003cbr/\u003eIf you are seeking an iterative environment where you can drive innovation, apply state-of-the-art technologies to solve real world delivery challenges, and provide benefits to customers, Prime Air is the place for you.\u003cbr/\u003e\u003cbr/\u003eCome work on the Amazon Prime Air Team!\u003cbr/\u003e\u003cbr/\u003ePrime Air is seeking an experienced Electrical Engineer to design and develop low voltage and high voltage power electronics hardware and related electrical power systems for Prime Air Drones. This includes, RF and Cellular communication hardware, Avionics Compute,  DC-DC converters, DC-AC inverters, Motor Controllers and power distribution systems. In this role you will be working to deploy new hardware and electrical power systems for Prime Air Drones. You will work with internal and external vendors to support hardware development, manufacturing and test. You will also be supporting other ongoing development and testing efforts for the Drone.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe ideal candidate will help the team in the following ways:\u003cbr/\u003e-Designs, develops, and tests power electronics hardware and analog/digital devices components such as inverters, battery chargers, DC-DC converts and protection circuitry.\u003cbr/\u003e-Design circuits, perform electrical analyses, select components, create electrical schematics and perform/support PCB layout.\u003cbr/\u003e-Support engineering trades, estimates and interact with suppliers/partners on critical components and develop hardware from concept to mass production\u003cbr/\u003e-Support developing hardware and component level requirements/specifications\u003cbr/\u003e-Increase the engineering rigor behind designs, verification, and documentation.\u003cbr/\u003e-Simulate circuits and key component. \u003cbr/\u003e-Test prototype hardware and systems in labs\u003cbr/\u003e-Identify and incorporate design for reliability/manufacturing elements \u0026 iterate! \u003cbr/\u003e\u003cbr/\u003eIf this sounds like the role for you, come make history with us! ","department_cost_center":null,"description_short":"Here at Amazon, we embrace our differences. We are committed to furthering our culture of diversity and inclusion of our teams within the organization.How do you get items to customers quickly, cost-effectively,","display_distance":null,"id":"f2e1fc89-4f0e-406f-ac7e-f9e58846eff4","id_icims":"3181174","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/3181174/electrical-hardware-development-engineer-ii-prime-air","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA109\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February 13, 2026","preferred_qualifications":"- Master's degree or Ph.D. degree in Electrical Engineering or related field\u003cbr/\u003e- Experience in low power design techniques\u003cbr/\u003e- Experience using advanced simulation modeling tools (Flexsim, Arena, Simio, etc.)\u003cbr/\u003e- Knowledge of and proficiency in the use of Python scripting language\u003cbr/\u003e- Experience working with commercial standards (DO-254, DO-160G, DO-178)\u003cbr/\u003e- Experience with EMI/EMC filter design for power electronics products\u003cbr/\u003e- Experience developing aviation power electronic hardware\u003cbr/\u003e- Knowledge or experience with dual active bridge DC/DC modeling and control\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 117,300.00 - 160,000.00 USD annually","primary_search_label":"retail.team-global-prime-air","source_system":"JobCreator","state":"WA","title":"Electrical Hardware Development Engineer II, Prime Air ","university_job":null,"updated_time":"21 minutes","url_next_step":"https://account.amazon.com/jobs/3181174/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-prime-air","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- Technical (Military/ Trade School) School diploma or Associate degree with one year experience related to industrial instrumentation/controls or equivalent electrical or mechanical operations experience.\u003cbr/\u003e- Minimum one year of experience working with computer components and operating systems.\u003cbr/\u003e- Minimum one year of experience with mission critical low and medium voltage electrical and/or mechanical systems.","business_category":"aws","city":"Mesa","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own\u003cbr/\u003e\u003cbr/\u003eThe Data Center Global Services team is looking for exceptional individuals to join our Controls organization as a Controls Technician for Service \u0026 Construction of the Building Management Systems (BMS) and Electrical Power Monitoring System (EPMS) within Amazon data centers. If you are passionate about the Customer Experience, think and act globally and have the ability to contribute to major new innovations in the area of building controls and automation this is the challenge you are looking for!\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will possess technical background and experience in installation, troubleshooting and maintenance of field sensors, controllers, wiring, networking and programming associated with the industrial controls systems. Controls Technicians shall be responsible for participating in the installation, testing, troubleshooting and startup of equipment and controls system associated with the BMS and EPMS system deployment in the data centers. They will verify, configure, and troubleshoot field devices including Air Handler Unit (AHU) controllers, Variable Frequency Drives (VFDs), Temperature and Pressure Sensors, and Third Party Network or Serial Devices, controllers and network equipment.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e· Primarily working in field at Data Center sites and supporting multiple sites under Deployment and/or Service.\u003cbr/\u003e· Perform point to point checkouts between field devices and controllers.\u003cbr/\u003e· Perform first-line diagnostics, troubleshooting and maintenance of instrumentation associated with the BMS and EPMS in data centers.\u003cbr/\u003e· Perform network configurations and communication testing between third party devices and controllers or servers.\u003cbr/\u003e· Configuration and calibration of sensors.\u003cbr/\u003e· Able to read and understand Electrical schematics, control panel drawings. Basic understanding of close loop controls, field sensors scaling, AND/OR functions typically performed by industrial controllers.\u003cbr/\u003e· Supervise low voltage electrical contractors who perform wiring and installation of field devices.\u003cbr/\u003e· Commissioning and systems level testing support.\u003cbr/\u003e· Provide red-lined drawings and recommendations based on field work and verify accuracy of as-built drawings.\u003cbr/\u003e· Assist in performing root cause analysis during testing and commissioning.\u003cbr/\u003e· Ensure all personnel on site utilize proper safety methodology.\u003cbr/\u003e· Work on-call and a rotating schedule when required and responds to after-hours emergencies.\u003cbr/\u003e· Perform basic support concepts such as ticketing systems, root cause analysis, and task prioritization.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e\u003cbr/\u003e· Walk jobsites in uneven terrain and work at heights and from ladders.\u003cbr/\u003e· Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or craw.\u003cbr/\u003e· On occasions, lift and/or move up to 49 pounds; and participate in group lifts for 50 pounds or more.\u003cbr/\u003e· Work shifts longer than eight hours in duration.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"18de28ee-dd8c-4d85-b139-b7994b0302bc","id_icims":"3186055","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3186055/data-center-controls-technician-data-center-capacity-delivery","job_schedule_type":"full-time","location":"US, AZ, Mesa","locations":["{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Mesa\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Mesa\",\"coordinates\":\"33.41704,-111.83146\",\"normalizedCountyName\":\"Maricopa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Mesa, Arizona, USA\",\"location\":\"US, AZ, Mesa\",\"region\":\"AZ\",\"buildingCodeList\":[\"PHX65\"],\"normalizedCityName\":\"Mesa\"}"],"normalized_location":"Mesa, Arizona, USA","optional_search_labels":["aws.team-dc","aws.team-ais","military"],"posted_date":"February 20, 2026","preferred_qualifications":"- International Society of Automation (ISA) Certified Controls System Technician (CCST) Level I or higher certification.\u003cbr/\u003e- Basic understanding of Industrial controls system, controllers, and programming including troubleshooting of industrial controls analog, discrete and networked input/output field signals.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, AZ, Mesa - 32.00 - 57.00 USD hourly","primary_search_label":"aws.team-no-matching-primary-label-listed","source_system":"JobCreator","state":"AZ","title":"Data Center Controls Technician, Data Center Capacity Delivery ","university_job":null,"updated_time":"21 minutes","url_next_step":"https://account.amazon.com/jobs/3186055/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-no-matching-primary-label-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- Technical (Military/ Trade School) School diploma or Associate degree with one year experience related to industrial instrumentation/controls or equivalent electrical or mechanical operations experience.\u003cbr/\u003e- Minimum one year of experience working with computer components and operating systems.\u003cbr/\u003e- Minimum one year of experience with mission critical low and medium voltage electrical and/or mechanical systems.","business_category":"aws","city":"Avondale","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own\u003cbr/\u003e\u003cbr/\u003eThe Data Center Global Services team is looking for exceptional individuals to join our Controls organization as a Controls Technician for Service \u0026 Construction of the Building Management Systems (BMS) and Electrical Power Monitoring System (EPMS) within Amazon data centers. If you are passionate about the Customer Experience, think and act globally and have the ability to contribute to major new innovations in the area of building controls and automation this is the challenge you are looking for!\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will possess technical background and experience in installation, troubleshooting and maintenance of field sensors, controllers, wiring, networking and programming associated with the industrial controls systems. Controls Technicians shall be responsible for participating in the installation, testing, troubleshooting and startup of equipment and controls system associated with the BMS and EPMS system deployment in the data centers. They will verify, configure, and troubleshoot field devices including Air Handler Unit (AHU) controllers, Variable Frequency Drives (VFDs), Temperature and Pressure Sensors, and Third Party Network or Serial Devices, controllers and network equipment.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e· Primarily working in field at Data Center sites and supporting multiple sites under Deployment and/or Service.\u003cbr/\u003e· Perform point to point checkouts between field devices and controllers.\u003cbr/\u003e· Perform first-line diagnostics, troubleshooting and maintenance of instrumentation associated with the BMS and EPMS in data centers.\u003cbr/\u003e· Perform network configurations and communication testing between third party devices and controllers or servers.\u003cbr/\u003e· Configuration and calibration of sensors.\u003cbr/\u003e· Able to read and understand Electrical schematics, control panel drawings. Basic understanding of close loop controls, field sensors scaling, AND/OR functions typically performed by industrial controllers.\u003cbr/\u003e· Supervise low voltage electrical contractors who perform wiring and installation of field devices.\u003cbr/\u003e· Commissioning and systems level testing support.\u003cbr/\u003e· Provide red-lined drawings and recommendations based on field work and verify accuracy of as-built drawings.\u003cbr/\u003e· Assist in performing root cause analysis during testing and commissioning.\u003cbr/\u003e· Ensure all personnel on site utilize proper safety methodology.\u003cbr/\u003e· Work on-call and a rotating schedule when required and responds to after-hours emergencies.\u003cbr/\u003e· Perform basic support concepts such as ticketing systems, root cause analysis, and task prioritization.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e\u003cbr/\u003e· Walk jobsites in uneven terrain and work at heights and from ladders.\u003cbr/\u003e· Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or craw.\u003cbr/\u003e· On occasions, lift and/or move up to 49 pounds; and participate in group lifts for 50 pounds or more.\u003cbr/\u003e· Work shifts longer than eight hours in duration.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"61b8df62-b897-4046-8abc-d80979a154d9","id_icims":"3186061","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3186061/data-center-controls-technician-data-center-capacity-delivery","job_schedule_type":"full-time","location":"US, AZ, Avondale","locations":["{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Avondale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Avondale\",\"coordinates\":\"33.44096,-112.34966\",\"normalizedCountyName\":\"Maricopa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Avondale, Arizona, USA\",\"location\":\"US, AZ, Avondale\",\"region\":\"AZ\",\"buildingCodeList\":[\"PHX69\"],\"normalizedCityName\":\"Avondale\"}"],"normalized_location":"Avondale, Arizona, USA","optional_search_labels":["aws.team-dc","aws.team-ais","military"],"posted_date":"February 20, 2026","preferred_qualifications":"- International Society of Automation (ISA) Certified Controls System Technician (CCST) Level I or higher certification.\u003cbr/\u003e- Basic understanding of Industrial controls system, controllers, and programming including troubleshooting of industrial controls analog, discrete and networked input/output field signals.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, AZ, Avondale - 32.00 - 57.00 USD hourly","primary_search_label":"aws.team-no-matching-primary-label-listed","source_system":"JobCreator","state":"AZ","title":"Data Center Controls Technician, Data Center Capacity Delivery ","university_job":null,"updated_time":"21 minutes","url_next_step":"https://account.amazon.com/jobs/3186061/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-no-matching-primary-label-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Work flexible shifts including night shifts/weekends\u003cbr/\u003e- 1+ years of electrical/mechanical/industrial water experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products","business_category":"aws","city":"Frederick","company_name":"Amazon Data Services, Inc. - A19","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tDaily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability \u003cbr/\u003e•\tMonitor Building Management Systems (BMS) and Electrical Power Management System (EPMS) \u003cbr/\u003e•\tAssist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA) \u003cbr/\u003e•\tPerform rack installs and rack decommissioning within internal SLA \u003cbr/\u003e•\tPerform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment \u003cbr/\u003e•\tTechnical writing to support change management program \u003cbr/\u003e•\tMonitor daily work requests and manage to resolution, and execute projects from conception to completion \u003cbr/\u003e•\tOn-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation \u003cbr/\u003e•\tWork schedule changes depending on specific site needs. Shifts can be up to 12 hours and may rotate on a predefined schedule. Some locations have on-call rotations. \u003cbr/\u003e•\tRole may support more than one location/site. \u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e•\tWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations: \u003cbr/\u003e•\tRegularly lift and/or move up to 39 pounds independently \u003cbr/\u003e•\tParticipate in group lifts for 40+ pounds \u003cbr/\u003e•\tMaintain balance and perform construction tasks while on a ladder \u003cbr/\u003e•\tRegularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position \u003cbr/\u003e•\tWork in an environment requiring provided ear protection \u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e•\tAbility to travel to or commute between data center locations as needed  \u003cbr/\u003e•\tWillingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e•\tTravel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. \u003cbr/\u003e","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"8cf13e10-5c96-4578-a236-8b6fa29234d3","id_icims":"3160748","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3160748/engineering-operation-technician","job_schedule_type":"full-time","location":"US, MD, Frederick","locations":["{\"normalizedStateName\":\"Maryland\",\"normalizedCountryCode\":\"USA\",\"city\":\"Frederick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MD, Frederick\",\"coordinates\":\"39.41574,-77.41203\",\"normalizedCountyName\":\"Frederick\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Frederick, Maryland, USA\",\"location\":\"US, MD, Frederick\",\"region\":\"MD\",\"buildingCodeList\":[\"IAD531\"],\"normalizedCityName\":\"Frederick\"}"],"normalized_location":"Frederick, Maryland, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"January 16, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Industrial-scale chiller plant operation\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MD, Frederick - 32.00 - 57.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"MD","title":"Engineering Operation Technician ","university_job":null,"updated_time":"22 minutes","url_next_step":"https://account.amazon.com/jobs/3160748/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}