{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 5+ years of technical product or program management experience\u003cbr/\u003e- 7+ years of working directly with engineering teams experience\u003cbr/\u003e- 3+ years of software development experience\u003cbr/\u003e- 5+ years of technical program management working directly with software engineering teams experience\u003cbr/\u003e- Experience managing programs across cross functional teams, building processes and coordinating release schedules","business_category":"operations","city":"Austin","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon's External Fulfillment Technology enables Amazon businesses and third party sellers and warehouse providers to run Fulfillment Centers (FCs) leveraging Amazon's expertise in fulfillment planning and optimization. Our team is chartered with making the Amazon Fulfillment Tech's WMS (Warehouse Management Systems) accessible and flexible for emerging markets and businesses. \u003cbr/\u003e\u003cbr/\u003eOur WMS enables fulfillment of millions of items WW each day.  We are investing in several new initiatives to scale our platforms, including building next generation external fulfillment solutions that expand our current footprint across third party-managed warehouses as well as Amazon fulfillment network. \u003cbr/\u003e\u003cbr/\u003eWe are looking for a Technical Program Manager who is passionate about building scalable systems in our space. In this role, you will large complex projects and have the opportunity to work with engineers (including PEs and Sr. PEs) within Fulfillment Tech and supply chain optimization. \u003cbr/\u003e\u003cbr/\u003eYou will solve for architectural challenges in making large volumes of constantly changing data available to various applications owned by diverse customers (internal and external) and business use cases, as well as innovative solutions for managing data quality and in complex event processing. You will be empowered to think big and invent on behalf of our customers, make high judgment calls to keep teams moving and find simple solutions to hard problems. You will leverage your engineering skill set and expertise across multiple initiatives, as well as go own large projects where you get to dive deep to solve. You will influence senior business and technical leaders to deliver these critical business goals through our solutions.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eYou will join a team in a startup mode with a group of highly passionate engineers that are developing fulfillment solutions, and:\u003cbr/\u003e1. Own complex, cross-organization programs that are transforming our products and constantly improving customer experience worldwide.\u003cbr/\u003e2. Drive alignment across senior leaders, engineering teams, and product managers.\u003cbr/\u003e3. Collaborate with other TPMs and SDMs on roadmaps, priorities, planning, dependency mapping, forecasting, and tradeoffs.\u003cbr/\u003e4. Facilitate regular program meetings and provide updates to senior leadership on project status, milestones, and adjustments\u003cbr/\u003e5. Engage with Sr. SDEs and Principal Engineers to evaluate technical decisions.\u003cbr/\u003e6. Lead the building of scalable, tier-1, AWS-based platforms.\u003cbr/\u003e7. Partner with other senior leaders in developing product design, tech solutions, project plans etc to launch our next generation orchestration platform.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include:\u003cbr/\u003e1. Medical, Dental, and Vision Coverage\u003cbr/\u003e2. Maternity and Parental Leave Options\u003cbr/\u003e3. Paid Time Off (PTO)\u003cbr/\u003e4. 401(k) Plan\u003cbr/\u003e \u003cbr/\u003eIf you are not sure that every qualification on the list above describes you exactly, we'd still love to hear from you! At Amazon, we value people with unique backgrounds, experiences, and skillsets. If you’re passionate about this role and want to make an impact on a global scale, please apply!\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Fulfillment Technologies (AFT) powers Amazon’s global fulfillment network. We invent and deliver software, hardware, and data science solutions that orchestrate processes, robots, machines, and people. We harmonize the physical and virtual world so Amazon customers can get what they want, when they want it.\u003cbr/\u003e\u003cbr/\u003eExternal Fulfillment\u003cbr/\u003eAFT’s External Fulfillment team builds flexible, scalable solutions specifically designed for the needs of Amazon’s emerging markets and businesses.","department_cost_center":null,"description_short":"Amazon's External Fulfillment Technology enables Amazon businesses and third party sellers and warehouse providers to run Fulfillment Centers (FCs) leveraging Amazon's expertise in fulfillment planning","display_distance":null,"id":"41074567-288c-4669-bc25-a0f347179312","id_icims":"3056656","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Technical Program Management","job_function_id":null,"job_path":"/en/jobs/3056656/sr-technical-program-manager-aft-external-fulfillment-tech","job_schedule_type":"full-time","location":"US, TX, Austin","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS13\"],\"normalizedCityName\":\"Austin\"}"],"normalized_location":"Austin, Texas, USA","optional_search_labels":[],"posted_date":"August 11, 2025","preferred_qualifications":"- 5+ years of project management disciplines including scope, schedule, budget, quality, along with risk and critical path management experience\u003cbr/\u003e- Experience managing projects across cross functional teams, building sustainable processes and coordinating release schedules\u003cbr/\u003e- Experience defining KPI's/SLA's used to drive multi-million dollar businesses and reporting to senior leadership\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Austin - 148,700.00 - 201,200.00 USD annually","primary_search_label":"operations.team-amazon-fulfillment-technology","source_system":"JobCreator","state":"TX","title":"Sr. Technical Program Manager, AFT - External Fulfillment Tech","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3056656/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-fulfillment-technology","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- PhD, or Master's degree and 6+ years of applied research experience\u003cbr/\u003e- Hands-on deep learning expertise, with demonstrated impact in one or more: multimodal modeling, imitation learning/RL for robotics, vision-language/video models, sim2real/real2sim\u003cbr/\u003e- Experience leading technical projects end-to-end (problem framing → execution → measurable outcomes), with strong experimental rigor and reproducible baselines\u003cbr/\u003e- Software engineering skills (Python + C++/Java), ability to build reliable training/evaluation infrastructure and production-quality research code\u003cbr/\u003e- Demonstrated technical contributions (publications/patents/open-source or substantial internal impact) and ability to communicate technical direction clearly","business_category":"subsidiaries","city":"Sunnyvale","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Industrial Robotics is seeking exceptional talent to help develop the next generation of advanced robotics systems that will transform automation at Amazon's scale. We're building revolutionary robotic systems that combine innovative AI, sophisticated control systems, and advanced mechanical design to create adaptable automation solutions capable of working safely alongside humans in dynamic environments. This is a unique opportunity to shape the future of robotics and automation at unprecedented scale, working with world-class teams pushing the boundaries of what's possible in robotic manipulation, locomotion, and human-robot interaction.  This role presents an opportunity to shape the future of robotics through innovative applications of deep learning and large language models.\u003cbr/\u003e\u003cbr/\u003eWe leverage advanced robotics, machine learning, and artificial intelligence to solve complex operational challenges at unprecedented scale. Our fleet of robots operates across hundreds of facilities worldwide, working in sophisticated coordination to fulfill our mission of customer excellence.\u003cbr/\u003e\u003cbr/\u003eWe are pioneering the development of robotics foundation models that: \u003cbr/\u003e•\tEnable unprecedented generalization across diverse tasks\u003cbr/\u003e•\tIntegrate multi-modal learning capabilities (visual, tactile, linguistic)\u003cbr/\u003e•\tAccelerate skill acquisition through demonstration learning\u003cbr/\u003e•\tEnhance robotic perception and environmental understanding\u003cbr/\u003e•\tStreamline development processes through reusable capabilities\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will contribute to research that bridges the gap between theoretical advancement and practical implementation in robotics. You will be part of a team that's revolutionizing how robots learn, adapt, and interact with their environment.\u003cbr/\u003e\u003cbr/\u003eJoin us in building the next generation of intelligent robotics systems that will transform the future of automation and human-robot collaboration.\u003cbr/\u003e\u003cbr/\u003eAs a Senior Applied Scientist, you will lead the development of machine learning systems that help robots perceive, reason, and act in real-world environments. You will set technical direction for adapting and advancing state-of-the-art models (open source and internal research) into robust, safe, and high-performing “robot brain” capabilities for our target tasks, environments, and robot embodiments. You will drive rigorous capability profiling and experimentation, lead targeted innovation where gaps exist, and partner across research, controls, hardware, and product teams to ensure outputs can be further customized and deployed on specific robots.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs a Senior Applied Scientist in the Foundation Model team, you will:\u003cbr/\u003e•\tLead technical initiatives for foundation-model capabilities (e.g., visuomotor / VLA / video-action worldmodel-action policies), from problem definition through validated model deliverables.\u003cbr/\u003e•\tOwn model readiness for our embodiment class: drive adaptation, fine-tuning, and optimization (latency/throughput/robustness), and define success criteria that downstream teams can build on.\u003cbr/\u003e•\tEstablish and evolve capability evaluation: define benchmark strategy, metrics, and profiling methodology to quantify performance, generalization, and failure modes; ensure evaluations drive clear roadmap decisions.\u003cbr/\u003e•\tDrive the data + training strategy needed to close key capability gaps, including data requirements, collection/curation standards, dataset quality/provenance, and repeatable training recipes (sim + real).\u003cbr/\u003e•\tInvent and validate new methods when leveraging SOTA is insufficient—new training schemes, model components, supervision signals, or sim↔real techniques—backed by strong empirical evidence.\u003cbr/\u003e•\tInfluence cross-team technical decisions by collaborating with controls/WBC, hardware, and product teams on interfaces, constraints, and integration plans; communicate results via design docs and technical reviews.\u003cbr/\u003e•\tMentor and raise the bar: guide junior scientists/engineers, set best practices for experimentation and code quality, and drive a culture of rigor and reproducibility.\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Industrial Robotics is seeking exceptional talent to help develop the next generation of advanced robotics systems that will transform automation at Amazon's scale. We're building revolutionary","display_distance":null,"id":"1b00ec95-efab-4714-8f32-fc6729be2c46","id_icims":"3185187","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3185187/sr-applied-scientist-foundation-model-amazon-industrial-robotics-industrial-robotics-group","job_schedule_type":"full-time","location":"US, CA, Sunnyvale","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sunnyvale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Sunnyvale\",\"coordinates\":\"37.37188,-122.03751\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sunnyvale, California, USA\",\"location\":\"US, CA, Sunnyvale\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC14\"],\"normalizedCityName\":\"Sunnyvale\"}"],"normalized_location":"Sunnyvale, California, USA","optional_search_labels":[],"posted_date":"February 19, 2026","preferred_qualifications":"- Experience with modeling tools such as R, scikit-learn, Spark MLLib, MxNet, Tensorflow, numpy, scipy etc.\u003cbr/\u003e- Experience with large scale distributed systems such as Hadoop, Spark etc.\u003cbr/\u003e- Experience driving robotics foundation models (VLA/visuomotor/video-action/world-model-based policies) and multi-task robot learning\u003cbr/\u003e- Experience building evaluation/benchmarking systems that meaningfully guide roadmap and model iteration\u003cbr/\u003e- Experience with scaling (large-scale data, distributed training, inference efficiency/latency optimization)\u003cbr/\u003e- Experience with real-robot experimentation and sim↔real pipelines; comfort partnering across controls/hardware teams\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Sunnyvale - 192,200.00 - 260,000.00 USD annually","primary_search_label":"subsidiaries.team-amazon-robotics","source_system":"JobCreator","state":"CA","title":"Sr. Applied Scientist, Foundation Model, Amazon Industrial Robotics , Industrial Robotics Group","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3185187/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-robotics","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of building models for business application experience\u003cbr/\u003e- PhD, or Master’s + 4+ years building ML models/algorithms in applied settings\u003cbr/\u003e- 2+ years hands-on experience in deep learning with strength in at least one: computer vision, multimodal models, imitation learning / RL for robotics, or human-robot interaction\u003cbr/\u003e- Programming skills in Python plus one of C++/Java; ability to write production-quality research code\u003cbr/\u003e- Ability to design rigorous experiments, analyze results, and iterate quickly with reproducible baselines\u003cbr/\u003e- Demonstrated technical contributions (e.g., publications, patents, open-source, or impactful internal systems)","business_category":"subsidiaries","city":"Sunnyvale","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Industrial Robotics Group is seeking exceptional talent to help develop the next generation of advanced robotics systems that will transform automation at Amazon's scale. We're building revolutionary robotic systems that combine innovative AI, sophisticated control systems, and advanced mechanical design to create adaptable automation solutions capable of working safely alongside humans in dynamic environments. This is a unique opportunity to shape the future of robotics and automation at unprecedented scale, working with world-class teams pushing the boundaries of what's possible in robotic manipulation, locomotion, and human-robot interaction.  This role presents an opportunity to shape the future of robotics through innovative applications of deep learning and large language models.\u003cbr/\u003e\u003cbr/\u003eWe leverage advanced robotics, machine learning, and artificial intelligence to solve complex operational challenges at unprecedented scale. Our fleet of robots operates across hundreds of facilities worldwide, working in sophisticated coordination to fulfill our mission of customer excellence.\u003cbr/\u003eWe are pioneering the development of robotics foundation models that: \u003cbr/\u003e•\tEnable unprecedented generalization across diverse tasks\u003cbr/\u003e•\tIntegrate multi-modal learning capabilities (visual, tactile, linguistic)\u003cbr/\u003e•\tAccelerate skill acquisition through demonstration learning\u003cbr/\u003e•\tEnhance robotic perception and environmental understanding\u003cbr/\u003e•\tStreamline development processes through reusable capabilities\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will contribute to research that bridges the gap between theoretical advancement and practical implementation in robotics. You will be part of a team that's revolutionizing how robots learn, adapt, and interact with their environment.\u003cbr/\u003e\u003cbr/\u003eJoin us in building the next generation of intelligent robotics systems that will transform the future of automation and human-robot collaboration.\u003cbr/\u003e\u003cbr/\u003eAs an Applied Scientist, you will develop and improve machine learning systems that help robots perceive, reason, and act in real-world environments. You will leverage state-of-the-art models (open source and internal research), evaluate them on representative tasks, and adapt/optimize them to meet robustness, safety, and performance needs. You will invent new algorithms where gaps exist. You’ll collaborate closely with research, controls, hardware, and product-facing teams, and your outputs will be used by downstream teams to further customize and deploy on specific robot embodiments.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs an Applied Scientist in the Foundations Model team, you will: \u003cbr/\u003e-\tLeverage state-of-the-art models for targeted tasks, environments, and robot embodiments through fine-tuning and optimization.\u003cbr/\u003e-\tExecute rapid, rigorous experimentation with reproducible results and solid engineering practices, closing the gap between sim and real environments. \u003cbr/\u003e-\tBuild and run capability evaluations/benchmarks to clearly profile performance, generalization, and failure modes.\u003cbr/\u003e-\tContribute to the data and training workflow: collection/curation, dataset quality/provenance, and repeatable training recipes.\u003cbr/\u003e-\tWrite clean, maintainable, well commented and documented code, contribute to training infrastructure, create tools for model evaluation and testing, and implement necessary APIs\u003cbr/\u003e-\tStay current with latest developments in foundation models and robotics, assist in literature reviews and research documentation, prepare technical reports and presentations, and contribute to research discussions and brainstorming sessions.\u003cbr/\u003e-\tWork closely with senior scientists, engineers, and leaders across multiple teams, participate in knowledge sharing, support integration efforts with robotics hardware teams, and help document best practices and methodologies.","department_cost_center":null,"description_short":"Industrial Robotics Group is seeking exceptional talent to help develop the next generation of advanced robotics systems that will transform automation at Amazon's scale. We're building revolutionary robotic","display_distance":null,"id":"e39588c5-4e70-4365-9cfa-6ccab2b1900d","id_icims":"3185183","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3185183/applied-scientist-foundation-model-industrial-robotics-group","job_schedule_type":"full-time","location":"US, CA, Sunnyvale","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sunnyvale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Sunnyvale\",\"coordinates\":\"37.37188,-122.03751\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sunnyvale, California, USA\",\"location\":\"US, CA, Sunnyvale\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC14\"],\"normalizedCityName\":\"Sunnyvale\"}"],"normalized_location":"Sunnyvale, California, USA","optional_search_labels":[],"posted_date":"February 19, 2026","preferred_qualifications":"- Experience using Unix/Linux\u003cbr/\u003e- Experience in professional software development\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Sunnyvale - 171,600.00 - 222,200.00 USD annually","primary_search_label":"subsidiaries.team-amazon-robotics","source_system":"JobCreator","state":"CA","title":"Applied Scientist - Foundation Model, Industrial Robotics Group","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3185183/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-robotics","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- 1+ year of experience in any of the following or similar technical or vocational roles: Computer Hardware Repair, Infrastructure Cabling, Network Deployment, Data Center Operations, Technical Project Management","business_category":"aws","city":"Sparks","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon is looking for an Infrastructure Delivery Installation Technician to join our growing team within infrastructure operations. You will work with minimum supervision in a dynamic environment to drive the stability and sustainability of our next-generation networks and assist in the development of innovative ways to automate and scale our network.\u003cbr/\u003e\u003cbr/\u003eTo be successful in this role you should possess technical aptitude, written and oral communications skills and the ability to deal effectively with people in a wide variety of situations. In addition, you must possess strong analytical skills with demonstrated problem solving ability. You will be able to leverage your experience exercising high levels of initiative, judgment, and diplomacy.\u003cbr/\u003e\u003cbr/\u003eAdditionally, all candidates should be willing to work both independently and with a team. Work prioritization, organizational skills, effective communication, and the ability to react quickly are critical to being successful.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Moving and implementing large enterprise equipment\u003cbr/\u003e- Installing Fiber and Copper cabling and patching cabling between equipment\u003cbr/\u003e- Ensuring proper safety and security standards are maintained during cabling and rack installation, \u003cbr/\u003e- Following well established hardware installation procedures and break-fix activities\u003cbr/\u003e- Safely using material handling tools and equipment\u003cbr/\u003e- Traveling within and outside of regional work area is required. You will be responsible for having a reliable personal vehicle and valid driver's license to travel within the regional work area, as company transportation will not be provided\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is committed to a diverse and inclusive workplace to deliver the best results for our customers. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status; we celebrate the diverse ways we work. For individuals with disabilities who would like to request an accommodation, please let us know and we will connect you to our accommodation team. You may also reach them directly by visiting please https://www.amazon.jobs/en/disability/us.\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"a58eacbb-5b69-4287-b0cb-647375b8bd9e","id_icims":"3095509","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3095509/network-install-technician-infrastructure-delivery","job_schedule_type":"full-time","location":"US, NV, Sparks","locations":["{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sparks\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, Sparks\",\"coordinates\":\"39.54115,-119.74832\",\"normalizedCountyName\":\"Washoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sparks, Nevada, USA\",\"location\":\"US, NV, Sparks\",\"region\":\"NV\",\"buildingCodeList\":[\"RNO103\"],\"normalizedCityName\":\"Sparks\"}"],"normalized_location":"Sparks, Nevada, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"October  7, 2025","preferred_qualifications":"- Industry standard certifications (CompTIA, CCENT, Network+)\u003cbr/\u003e- Knowledge of network cabling, optic types, and test equipment\u003cbr/\u003e- Experience with cabling infrastructure best practices and methodologies\u003cbr/\u003e- Experience with medium to large, complex project scopes and ambiguous details within work environment\u003cbr/\u003e- Knowledge of major Command Line Protocols (Cisco IOS, JunOS, GNU/Linux) and common Networking Protocols (BGP, OSPF)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NV, Sparks - 27.00 - 48.00 USD hourly","primary_search_label":"aws.team-it-services","source_system":"JobCreator","state":"NV","title":"Network Install Technician, Infrastructure Delivery","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3095509/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-it-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent\u003cbr/\u003e- 5+ years of Go-To-Market, Business Development, Sales, or Consulting experience\u003cbr/\u003e- Experience with brand strategy\u003cbr/\u003e- 3+ years working with C-suite and VP-level stakeholders, using data to solve complex business problems","business_category":"ats","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Shipping is building a high-growth business designed to transform how the world thinks about logistics. We’re rapidly expanding our shipping and delivery services to brands and merchants across the U.S., and we’re looking for entrepreneurial Business Development leaders who can help customers meet rising end-customer expectations in an increasingly competitive landscape.\u003cbr/\u003e\u003cbr/\u003eAs a Sr. Business Development Lead, you will shape how customers think about fulfillment and shipping. You will leverage data and industry insights to teach customers something new about their business, tailor Amazon’s solutions to their unique goals, and guide them through complex decision cycles. You’ll work cross-functionally with Product, Tech, and Operations to translate customer needs into scalable solutions and help define the future of Amazon Shipping.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Drive revenue, adoption, and market share for Amazon Shipping by leading insight-driven engagements that teach customers new ways to meet rising end-customer expectations and challenge the limitations of their current shipping strategy.\u003cbr/\u003e• Work backwards from customer needs, earning trust by diving deep into financial, operational, and customer-experience data to design tailored Amazon Shipping solutions that reframe how brands think about speed, reliability, and fulfillment.\u003cbr/\u003e• Deliver perspective and influence decisions by introducing data-backed insights, clarifying the costs of the status quo, and guiding customers through complex decision cycles toward measurable business outcomes.\u003cbr/\u003e• Serve as the voice of the customer, translating market signals and customer feedback into clear inputs for Product, Tech, Operations, and other Amazon teams to improve features, performance, and scalability.\u003cbr/\u003e• Define and own program goals and metrics, track progress rigorously, remove obstacles, and manage through ambiguity to deliver long-term customer value and sustained business impact.\u003cbr/\u003e• Think big and innovate, identifying emerging segments, new use cases, and differentiated delivery models that help customers win—and accelerate the growth of Amazon Shipping.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou are a strategic, insight-driven Business Development lead who thrives on helping customers re-imagine what’s possible. You lead with a point of view—grounded in data, industry trends, and operational realities—and use it to challenge assumptions and illuminate better paths forward. You excel in ambiguous, fast-scaling environments, influence senior stakeholders with clarity and confidence, and consistently drive deals toward measurable outcomes.\u003cbr/\u003e\u003cbr/\u003eYou quickly understand complex businesses, uncover the true drivers behind customer decisions, and translate those insights into clear recommendations. You build trust through expertise and preparation, communicate with precision, and operate with the ownership required to support a rapidly growing business.\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Shipping is building a high-growth business designed to transform how the world thinks about logistics. We’re rapidly expanding our shipping and delivery services to brands and merchants across","display_distance":null,"id":"284f2340-4bcd-43a6-9bee-c3b6797d42e0","id_icims":"3185064","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Business/merchant Development","job_function_id":null,"job_path":"/en/jobs/3185064/sr-business-development-lead-amazon-shipping","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Boston\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Boston\",\"coordinates\":\"42.35866,-71.05674\",\"normalizedCountyName\":\"Suffolk\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Boston, Massachusetts, USA\",\"location\":\"US, MA, Boston\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS21\"],\"normalizedCityName\":\"Boston\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS20\"],\"normalizedCityName\":\"Austin\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Santa Clara\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Santa Clara\",\"coordinates\":\"37.3558,-121.95512\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Santa Clara, California, USA\",\"location\":\"US, CA, Santa Clara\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC44\",\"LSO3\",\"SJC254\",\"SFO21\",\"BLZ1\",\"SFO6\",\"SJC401\",\"CTN26\",\"LYSM27\",\"SJC25\",\"SJC38\",\"SFO094\",\"SFO7\",\"SFO093\",\"SFO64\",\"DFX6\",\"SFO090\",\"SJC5\",\"SJO33\",\"DRD4\",\"SFO53\",\"SFO45\",\"SFO092\",\"USF1\",\"BLZ2\",\"SJC50\",\"SFO68\",\"SJC255\",\"SFO091\",\"SFO20\",\"JSJ2\",\"SFO62\",\"WFM633\"],\"normalizedCityName\":\"Santa Clara\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA112\"],\"normalizedCityName\":\"Bellevue\"}","{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Atlanta\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Atlanta\",\"coordinates\":\"33.74831,-84.39111\",\"normalizedCountyName\":\"Fulton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Atlanta, Georgia, USA\",\"location\":\"US, GA, Atlanta\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL22\"],\"normalizedCityName\":\"Atlanta\"}","{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK27\"],\"normalizedCityName\":\"New York\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Santa Monica\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Santa Monica\",\"coordinates\":\"34.01158,-118.49227\",\"normalizedCountyName\":\"Los Angeles\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Santa Monica, California, USA\",\"location\":\"US, CA, Santa Monica\",\"region\":\"CA\",\"buildingCodeList\":[\"LAX78\"],\"normalizedCityName\":\"Santa Monica\"}","{\"normalizedStateName\":\"Illinois\",\"normalizedCountryCode\":\"USA\",\"city\":\"Chicago\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, IL, Chicago\",\"coordinates\":\"41.88425,-87.63245\",\"normalizedCountyName\":\"Cook\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Chicago, Illinois, USA\",\"location\":\"US, IL, Chicago\",\"region\":\"IL\",\"buildingCodeList\":[\"ORD10\"],\"normalizedCityName\":\"Chicago\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Diego\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Diego\",\"coordinates\":\"32.71568,-117.16171\",\"normalizedCountyName\":\"San Diego\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Diego, California, USA\",\"location\":\"US, CA, San Diego\",\"region\":\"CA\",\"buildingCodeList\":[\"SAN18\"],\"normalizedCityName\":\"San Diego\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"February 19, 2026","preferred_qualifications":"- Experience working in e-commerce / retail / supply chain / financial services business\u003cbr/\u003e- 1+ years of logistics experience\u003cbr/\u003e- Experience working in a customer-facing environment\u003cbr/\u003e- Experience driving new business segment or services launches\u003cbr/\u003e- Experience in a new unit business or a startup\u003cbr/\u003e- Experience defining roadmap strategy and prioritizing deliverables for your team products\u003cbr/\u003e- Excellent written and verbal communication skills, with the ability to thrive in ambiguity and at a fast pace\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, San Diego - 147,900.00 - 200,100.00 USD annually\u003cbr/\u003eUSA, CA, Santa Clara - 147,900.00 - 200,100.00 USD annually\u003cbr/\u003eUSA, CA, Santa Clara - 162,700.00 - 220,200.00 USD annually\u003cbr/\u003eUSA, CA, Santa Monica - 147,900.00 - 200,100.00 USD annually\u003cbr/\u003eUSA, GA, Atlanta - 147,900.00 - 200,100.00 USD annually\u003cbr/\u003eUSA, IL, Chicago - 147,900.00 - 200,100.00 USD annually\u003cbr/\u003eUSA, MA, Boston - 147,900.00 - 200,100.00 USD annually\u003cbr/\u003eUSA, NY, New York - 162,700.00 - 220,200.00 USD annually\u003cbr/\u003eUSA, TX, Austin - 147,900.00 - 200,100.00 USD annually\u003cbr/\u003eUSA, WA, Bellevue - 147,900.00 - 200,100.00 USD annually","primary_search_label":"ats.team-middle-mile-tech","source_system":"JobCreator","state":"WA","title":"Sr. Business Development Lead , Amazon Shipping","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3185064/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-middle-mile-tech","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"Requirements:  Requires a Master’s degree in Computer Science, Engineering, Mathematics, or a related field plus two (2) years of experience as a Quality Assurance Engineer, Software Test Developer, or a related occupation. Experience may be gained concurrently and must include:\u003cbr/\u003e\u003cbr/\u003eTwo (2) years in each of the following:\u003cbr/\u003e-  Documenting and coordinating the deployment of manual and automated tests for complex systems\u003cbr/\u003e-  Owning full test strategy through test completion for major components of a software system\u003cbr/\u003e-  Test automation for consumer-facing front end applications\u003cbr/\u003e-  Testing across a full stack system, including Front End, Services, or databases\u003cbr/\u003e-  Writing Java or Python based test automation\u003cbr/\u003e-  Testing in an Agile development environment.\u003cbr/\u003e\u003cbr/\u003eOne (1) year in each of the following:\u003cbr/\u003e-  Load testing experience\u003cbr/\u003e-  AWS Hydra test\u003cbr/\u003e-  Playwright test automation.\u003cbr/\u003e\u003cbr/\u003eAlternatively, will accept a Bachelor’s degree and five (5) years of experience.","business_category":"no-business-category","city":"Cambridge","company_name":"Audible, Inc.","country_code":"USA","description":"Employer:\tAudible, Inc.\u003cbr/\u003eTitle:\t\tQuality Assurance Engineer II\u003cbr/\u003eLocation:\t101 Main Street, Cambridge, MA 02142\u003cbr/\u003e\u003cbr/\u003eDuties:  Lead the testing of large-scale software systems. Create test plans, test cases, and drive continuous improvements to the quality assurance processes using AWS, Internet and Web technologies including HTTP, XML, HTML, Load Balancing, and DNS. Develop software tests using Java, Python, AWS Lambda, and other tools, document and coordinate the deployment of manual and automated tests for complex systems, and test mobile device development kits and device frameworks. Design and build automated test cases for mobile device-based graphical user interfaces using test automation frameworks such as Selenium and Java. Design, develop, and execute quality assurance test cases and support tests for large-scale, distributed software systems using Java including white and black box tests. Work closely with engineers, business owners, and customer service professionals throughout the software development and testing lifecycle, including the requirements gathering and design. Consult with and advise project management and development teams on technical issues related to planning, developing, implementing, and modifying testing procedures. Use functional specifications to plan, create, or sign-off on test plans, test cases, and automated test cases. Provide regular, detailed status reports on project progress, including test cases executed, bugs discovered, and bugs fixed. Position reports into Cambridge, MA office; however, telecommuting from a home office is allowed.\u003cbr/\u003e\u003cbr/\u003eRequirements:  Requires a Master’s degree in Computer Science, Engineering, Mathematics, or a related field plus two (2) years of experience as a Quality Assurance Engineer, Software Test Developer, or a related occupation. Experience may be gained concurrently and must include:\u003cbr/\u003e\u003cbr/\u003eTwo (2) years in each of the following:\u003cbr/\u003e-  Documenting and coordinating the deployment of manual and automated tests for complex systems\u003cbr/\u003e-  Owning full test strategy through test completion for major components of a software system\u003cbr/\u003e-  Test automation for consumer-facing front end applications\u003cbr/\u003e-  Testing across a full stack system, including Front End, Services, or databases\u003cbr/\u003e-  Writing Java or Python based test automation\u003cbr/\u003e-  Testing in an Agile development environment.\u003cbr/\u003e\u003cbr/\u003eOne (1) year in each of the following:\u003cbr/\u003e-  Load testing experience\u003cbr/\u003e-  AWS Hydra test\u003cbr/\u003e-  Playwright test automation.\u003cbr/\u003e\u003cbr/\u003eAlternatively, will accept a Bachelor’s degree and five (5) years of experience.\u003cbr/\u003e\u003cbr/\u003eSalary: $140,525 - $160,00 /year. Multiple positions. Apply online: www.amazon.jobs  Job code: ADBL185.","department_cost_center":null,"description_short":"Employer:\tAudible, Inc.Title:\t\tQuality Assurance Engineer IILocation:\t101 Main Street, Cambridge, MA 02142Duties:  Lead the testing of large-scale software systems. Create test plans, test cases, and drive","display_distance":null,"id":"d4b14246-1e7d-4773-b2e7-724d37901a78","id_icims":"3185152","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Systems Quality","job_function_id":null,"job_path":"/en/jobs/3185152/quality-assurance-engineer-ii-adbl185","job_schedule_type":"full-time","location":"US, MA, Cambridge","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Cambridge\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Cambridge\",\"coordinates\":\"42.36679,-71.10601\",\"normalizedCountyName\":\"Middlesex\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Cambridge, Massachusetts, USA\",\"location\":\"US, MA, Cambridge\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS11\",\"LBO7\",\"ONM91\",\"XUXC\",\"MIT1\",\"LRVR\",\"JOR7\",\"LCAM\",\"JOR9\",\"JBO8\",\"ONM236\",\"ONM88\",\"UMA1\",\"LES1\",\"WFM113\",\"WFM026\",\"JOR10\",\"WFM010\"],\"normalizedCityName\":\"Cambridge\"}"],"normalized_location":"Cambridge, Massachusetts, USA","optional_search_labels":[],"posted_date":"February 19, 2026","preferred_qualifications":"Please see job description and the position requirements above.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MA, Cambridge - 113,900.00 - 160,000.00 USD annually","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"MA","title":"Quality Assurance Engineer II (ADBL185)","university_job":null,"updated_time":"21 minutes","url_next_step":"https://account.amazon.com/jobs/3185152/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Electrical Engineering or a related field\u003cbr/\u003e- 2+ years of semiconductor industry experience as a product/test engineer analyzing test data\u003cbr/\u003e- Experience using Python or other scripting languages for data analysis and automation\u003cbr/\u003e- Strong analytical and problem-solving skills","business_category":"aws","city":"Austin","company_name":"Annapurna Labs (U.S.) Inc.","country_code":"USA","description":"AWS-Annapurna team develops the silicon used in our most advanced machine learning accelerator servers at cutting edge process nodes. These SOCs are used in massively scaled server clusters to provide best hardware platform for our customers to run training and inference workloads. \u003cbr/\u003e\u003cbr/\u003eWe are seeking an experienced Silicon Yield Product engineer with expertise in yield debug on leading edge process technology nodes. This experienced engineer will be responsible for optimizing manufacturing process with foundry partners to improve yield and performance of our machine learning chips. They will interact with ATE, Systems test teams and Silicon design teams to identify systematic yield issues and work on debug to find root cause.  This role involves collaborating with various teams to develop innovative solutions to optimize yield and performance for our products. Strong analytical and problem solving skills, knowledge of semiconductor manufacturing process and expertise in statistical analysis are essential for success in this role. \u003cbr/\u003e\u003cbr/\u003eOur final product is a server, not just the silicon, so you will find yourself stretching beyond traditional silicon product engineering boundaries and dealing with various system issues and data sets, providing ample opportunities to learn.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Perform detailed data analysis of ATE Test, SLT test, and System test data to optimize yield, test time, and implement optimal screening methodologies across platforms.\u003cbr/\u003e- Develop and maintain automation systems to compare yields across OSATs, testers, and setups, while monitoring performance metrics to drive timely corrective actions.\u003cbr/\u003e- Lead functional and structural test coverage improvements at ATE and system levels through strategic DOE planning and targeted characterization efforts to collect critical performance data.\u003cbr/\u003e- Design and maintain comprehensive dashboards enabling cross-functional teams to monitor key metrics, with automated alert systems for rapid issue identification and resolution.\u003cbr/\u003e- Foster strong stakeholder relationships and drive corrective actions for yield and quality improvements through effective collaboration with test engineering, system validation, and DFT teams\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge-sharing and mentorship. Our senior members enjoy one-on-one mentoring and thorough, but kind, code reviews. We care about your career growth and strive to assign projects that help our team members develop your engineering expertise so you feel empowered to take on more complex tasks in the future.","department_cost_center":null,"description_short":"AWS-Annapurna team develops the silicon used in our most advanced machine learning accelerator servers at cutting edge process nodes. These SOCs are used in massively scaled server clusters to provide","display_distance":null,"id":"c6383f7b-1cd1-4f4b-8f23-5736cdc617de","id_icims":"3179977","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"ASIC","job_function_id":null,"job_path":"/en/jobs/3179977/product-development-engineer-annapurna-labs-silicon-operations","job_schedule_type":"full-time","location":"US, TX, Austin","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS16\"],\"normalizedCityName\":\"Austin\"}"],"normalized_location":"Austin, Texas, USA","optional_search_labels":["aws.team-annapurna-labs","aws.team-generative-ai"],"posted_date":"February 12, 2026","preferred_qualifications":"- Experience with yield and performance optimization at system or ATE test on advanced FINFET nodes\u003cbr/\u003e- Understanding of ATE test content (Scan, BIST, Functional, IO tests) and experience setting test limits based on characterization.\u003cbr/\u003e- Experience with power, performance characterization on high performance chips.\u003cbr/\u003e- Knowledge of usage of ATPG scan diagnostics and SRAM bitmap analysis for FA and yield debug.\u003cbr/\u003e- Proficiency in statistical analysis tools (JMP, Python) and automation for semiconductor test data.\u003cbr/\u003e- Experience building automated analysis systems and interactive dashboards for yield and quality monitoring.\u003cbr/\u003e- Familiarity with AWS services (Sagemaker, S3, Quicksight etc.) and ability to use these for automation.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Austin - 136,000.00 - 184,000.00 USD annually","primary_search_label":"aws.team-machine-learning-primary","source_system":"JobCreator","state":"TX","title":"Product Development Engineer, Annapurna Labs Silicon Operations","university_job":null,"updated_time":"21 minutes","url_next_step":"https://account.amazon.com/jobs/3179977/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-machine-learning-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 8+ years of specific technology domain areas (e.g. software development, cloud computing, systems engineering, infrastructure, security, networking, data \u0026 analytics) experience\u003cbr/\u003e- 3+ years of design, implementation, or consulting in applications and infrastructures experience\u003cbr/\u003e- 10+ years of IT development or implementation/consulting in the software or Internet industries experience","business_category":"aws","city":"New York","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"AWS Global Sales drives adoption of the AWS cloud worldwide, enabling customers of all sizes to innovate and expand in the cloud. Our team empowers every customer to grow by providing tailored service, unmatched technology, and unwavering support. We dive deep to understand each customer's unique challenges, then craft innovative solutions that accelerate their success. This customer-first approach is how we built the world's most adopted cloud. Join us and help us grow.\u003cbr/\u003e\u003cbr/\u003eThe Amazon Web Services (AWS) Solutions Architect team partners with customers to design and build some of the most scalable, flexible and resilient cloud architectures and solutions. AWS Solutions Architects collaborate with AWS Sales and other AWS teams to help address customer business challenges and accelerate the adoption of AWS services.\u003cbr/\u003e\u003cbr/\u003eAs a trusted customer advocate, Solutions Architects help organizations understand best practices around advanced cloud-based solutions, and provide advice on strategies for migrating existing workloads to the cloud. You’ll help drive successful business outcomes across a broad set of enterprise customers through your passion for educating, training, designing and building cloud solutions.\u003cbr/\u003e\u003cbr/\u003eYou will have the opportunity to help shape and execute a strategy to build deep adoption and broad use of AWS within your enterprise customers, and you will do this by mobilizing resources within AWS and working with our extensive partner network.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e-Communicate effectively with both business and technical stakeholders as a trusted technical advisor.\u003cbr/\u003e\u003cbr/\u003e-Participate in deep architectural and design discussions to create world-class solutions built on AWS while ensuring solutions are designed for successful deployment in the cloud.\u003cbr/\u003e\u003cbr/\u003e-Author and contribute to AWS customer-facing publications such as whitepapers and proof of concepts.\u003cbr/\u003e\u003cbr/\u003e-In partnership with the sales team, formulate and execute a sales strategy to exceed revenue objectives through the adoption of AWS.\u003cbr/\u003e\u003cbr/\u003e-Build deep relationships with business and senior technical individuals within customers to enable them to be cloud advocates.\u003cbr/\u003e\u003cbr/\u003e-Capture and share best-practice knowledge amongst the AWS solutions architect community.\u003cbr/\u003e\u003cbr/\u003e-Travel is mostly regional, and is expected to be 15-20%\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003e\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003e\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.","department_cost_center":null,"description_short":"AWS Global Sales drives adoption of the AWS cloud worldwide, enabling customers of all sizes to innovate and expand in the cloud. Our team empowers every customer to grow by providing tailored service,","display_distance":null,"id":"4c9cb92e-f81e-4c8c-9eeb-35d7df3e8be0","id_icims":"3184317","is_intern":null,"is_manager":null,"job_category":"Solutions Architect","job_family":"Solution Architect","job_function_id":null,"job_path":"/en/jobs/3184317/senior-solutions-architect-fintech","job_schedule_type":"full-time","location":"US, NY, New York","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Boston\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Boston\",\"coordinates\":\"42.35866,-71.05674\",\"normalizedCountyName\":\"Suffolk\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Boston, Massachusetts, USA\",\"location\":\"US, MA, Boston\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS17\"],\"normalizedCityName\":\"Boston\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS11\"],\"normalizedCityName\":\"Austin\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS17\"],\"normalizedCityName\":\"Arlington\"}","{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK27\"],\"normalizedCityName\":\"New York\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Francisco\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Francisco\",\"coordinates\":\"37.77702,-122.41956\",\"normalizedCountyName\":\"San Francisco\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Francisco, California, USA\",\"location\":\"US, CA, San Francisco\",\"region\":\"CA\",\"buildingCodeList\":[\"SFO28\"],\"normalizedCityName\":\"San Francisco\"}"],"normalized_location":"New York, New York, USA","optional_search_labels":[],"posted_date":"February 18, 2026","preferred_qualifications":"- 5+ years of infrastructure architecture, database architecture and networking experience\u003cbr/\u003e- Experience working with end user or developer communities\u003cbr/\u003e- Proven experience as a technical builder or leader in the Financial Services Industry\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, San Francisco - 176,600.00 - 239,000.00 USD annually\u003cbr/\u003eUSA, MA, Boston - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, NY, New York - 169,000.00 - 228,600.00 USD annually\u003cbr/\u003eUSA, TX, Austin - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, VA, Arlington - 153,600.00 - 207,800.00 USD annually","primary_search_label":"aws.team-solutions-architect-primary","source_system":"JobCreator","state":"NY","title":"Senior Solutions Architect, Fintech","university_job":null,"updated_time":"24 minutes","url_next_step":"https://account.amazon.com/jobs/3184317/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-solutions-architect-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Caledonia","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager. In this role, you will lead a team of hourly workforce and will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e\u003cbr/\u003eOur Operation’s workflow has three major components: First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Support, mentor, and motivate your hourly workforce\u003cbr/\u003e* Manage safety, quality, productivity, and customer delivery promises\u003cbr/\u003e* Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e* Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e* Stand/walk for up to 12 hours during shifts\u003cbr/\u003e* Work in an environment where the noise level varies and can be loud\u003cbr/\u003e* Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e* Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e\u003cbr/\u003eOur fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Area Managers based on location preference and the business’ current openings.","department_cost_center":null,"description_short":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager.","display_distance":null,"id":"41c574be-0f21-46ee-b1b6-69fe4ff9aa8b","id_icims":"3185172","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3185172/area-manager-ii","job_schedule_type":"full-time","location":"US, MI, Caledonia","locations":["{\"normalizedStateName\":\"Michigan\",\"normalizedCountryCode\":\"USA\",\"city\":\"Caledonia\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MI, Caledonia\",\"coordinates\":\"42.78835,-85.51179\",\"normalizedCountyName\":\"Kent\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Caledonia, Michigan, USA\",\"location\":\"US, MI, Caledonia\",\"region\":\"MI\",\"buildingCodeList\":[\"GRR1\"],\"normalizedCityName\":\"Caledonia\"}"],"normalized_location":"Caledonia, Michigan, USA","optional_search_labels":[],"posted_date":"February 19, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 20+ employees\u003cbr/\u003e- Experience with process improvements (Lean process, Kaizen, and/or Six Sigma)\u003cbr/\u003e- Excellent customer service, communication, and interpersonal skills\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Industry experience in: retail, F\u0026B, military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MI, Caledonia - 70,000.00 - 90,900.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"MI","title":"Area Manager II ","university_job":null,"updated_time":"26 minutes","url_next_step":"https://account.amazon.com/jobs/3185172/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- Technical (Military/Trade School) training or 2+ years of electrical or mechanical, HVAC, fire system experience in a mission-critical infrastructure or equivalent experience in a relevant industry (for example: electrical or mechanical) 2+ years of electrical or mechanical experience\u003cbr/\u003e- 2+ years’ experience with Microsoft Office products (including Excel, Word and PowerPoint)","business_category":"aws","city":"Umatilla","company_name":"Amazon Data Services, Inc. - A19","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eTasked with driving innovation while reducing operational costs in the facilities.\u003cbr/\u003e\u003cbr/\u003eDrive projects with moderate complexity.\u003cbr/\u003e\u003cbr/\u003eAssist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA).\u003cbr/\u003e\u003cbr/\u003ePerform rack installs, rack decommissioning, operational readings and facility management.\u003cbr/\u003e\u003cbr/\u003eProvide key performance indicators to senior engineers.\u003cbr/\u003e\u003cbr/\u003eResponsible for the on-site management of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation.\u003cbr/\u003e\u003cbr/\u003ePerformance and oversight of maintenance and operations on all electrical, mechanical, and fire/life safety equipment within the data center.\u003cbr/\u003e\u003cbr/\u003eEnsure all safety procedures are adhered to while performing work.\u003cbr/\u003e\u003cbr/\u003ePerform basic support concepts such as ticketing systems, root cause analysis, change management creation, writing procedures and building management systems.\u003cbr/\u003e\u003cbr/\u003eWork schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e\u003cbr/\u003eMaintain data center critical infrastructure equipment ensuring 99.999% up-time of the world's largest cloud computing portfolio.\u003cbr/\u003e\u003cbr/\u003eRole may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003eWalk job sites in uneven terrain. Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e\u003cbr/\u003eRegularly lift and/or move up to 39 pounds unassisted and participate in group lifts for 40+ pounds\u003cbr/\u003e\u003cbr/\u003eRegularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"70357039-19f7-4e10-b46e-153b1e09b391","id_icims":"3140826","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3140826/data-center-engineering-operations-technician","job_schedule_type":"full-time","location":"US, OR, Umatilla","locations":["{\"normalizedStateName\":\"Oregon\",\"normalizedCountryCode\":\"USA\",\"city\":\"Umatilla\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OR, Umatilla\",\"coordinates\":\"45.91768,-119.34203\",\"normalizedCountyName\":\"Umatilla\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Umatilla, Oregon, USA\",\"location\":\"US, OR, Umatilla\",\"region\":\"OR\",\"buildingCodeList\":[\"PDX127\",\"PDX124\",\"PDX121\",\"PDX194\",\"PDT122\",\"PDT130\",\"PDT197\",\"PDX132\",\"PDX2\",\"PDT194\",\"PDX201\",\"PDX130\",\"PDX135\",\"PDX199\",\"PDT51\",\"PDX96\",\"PDX51\",\"PDT65\",\"PDX123\",\"PDX195\",\"PDX54\",\"PDT54\",\"PDX134\",\"PDX126\",\"PDX131\",\"PDX57\",\"PDX200\",\"PDT69\",\"PDT196\",\"PDX60\",\"PDT2\",\"PDX100\",\"PDX137\",\"PDX198\",\"PDX122\",\"PDX136\",\"PDX196\",\"PDX133\",\"PDT195\",\"PDX125\",\"PDX78\",\"PDX128\",\"PDX197\",\"PDT60\",\"PDX071\"],\"normalizedCityName\":\"Umatilla\"}"],"normalized_location":"Umatilla, Oregon, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"December 10, 2025","preferred_qualifications":"- 4+ years of data center engineering experience\u003cbr/\u003e- Associate's degree, or Bachelor's degree\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, OR, Umatilla - 37.00 - 65.00 USD hourly\u003cbr/\u003eUSA, WA, Attalia - 37.00 - 65.00 USD hourly","primary_search_label":"aws.team-administrative-support-primary","source_system":"JobCreator","state":"OR","title":"Data Center Engineering Operations Technician","university_job":null,"updated_time":"27 minutes","url_next_step":"https://account.amazon.com/jobs/3140826/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-administrative-support-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}