{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 1+ years of data analytics or automation experience\u003cbr/\u003e- 1+ years of capacity planning, operations planning, business analysis or similar experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Knowledge of data pipelining and extraction using SQL\u003cbr/\u003e- Knowledge of SQL and Excel at a moderate or advanced level\u003cbr/\u003e- Experience with data mining tools like SQL, SAS, SPSS, or similar","business_category":"retail","city":"Bengaluru","company_name":"ASSPL - Karnataka","country_code":"IND","description":"Are you customer obsessed, flexible, smart and analytical, strategic yet  execution focused, hungry and passionate about e-commerce, experienced,  and entrepreneurial leader with a strong work ethic? Want to work in  one of the fastest growing and most innovative businesses at Amazon?  Interested in working in a high impact role? If yes, this opportunity  will appeal to you. Come join our Business Intelligence team and help  define the course of the Amazon Private Brands business. \r\u003cbr/\u003e\r\u003cbr/\u003eAbout the Role\r\u003cbr/\u003e  We are looking for a smart, enthusiastic, hard-working, and creative candidate to join our team as a Business Analyst Support. This position offers an exciting opportunity to develop reporting standards and business intelligence support for one of Amazon's key exciting businesses - Amazon Private Brands.\r\u003cbr/\u003e   \r\u003cbr/\u003e  Responsibilities\r\u003cbr/\u003e  The successful candidate will be the owner for data reporting \u0026 Automation, He/she must be an effective leader and communicator working with internal \u0026 External stake holders. He or she will have strong business judgment with a track record of strong ownership values and relationship management skills.\r\u003cbr/\u003e  The Business Analyst will be responsible for driving deep insights and driving continuous improvement using the analysis. The person should have a detailed understanding of a business requirement or the ability to quickly get to the root cause of a particular business issue, and draft solutions to meet requirements or resolve the root problems. \r\u003cbr/\u003e   \r\u003cbr/\u003e   - Own the design, development,      and maintenance of ongoing metrics, reports, analyses, dashboards, etc. to      drive key business decisions. Ensure data accuracy by validating data for      new and existing tools. Learn and understand a broad range of Amazon’s      data resources and know how, when, and which to use and which not to use.\u003cbr/\u003e - Work closely with category,      marketing and sales stakeholders to understand and automate processes\u003cbr/\u003e - Respond with urgency to high      priority requests from senior business leaders.\u003cbr/\u003e - Identify, develop, manage,      and execute analyses to uncover areas of opportunity and present written      business recommendations that will help shape the direction of the      business.\u003cbr/\u003e - Provide customer and vendor      data and insights for better impact decisions\u003cbr/\u003e - Create and publish category      scorecards \u0026 campaign performance reports\u003cbr/\u003e - Automate data templates and      reports\u003cbr/\u003e - Build a SQL repository for      adhoc requests and reports\u003cbr/\u003e  \r\u003cbr/\u003e","department_cost_center":null,"description_short":"Are you customer obsessed, flexible, smart and analytical, strategic yet  execution focused, hungry and passionate about e-commerce, experienced,  and entrepreneurial leader with a strong work ethic? Want","display_distance":null,"id":"c0d49567-746a-4d45-8560-b19b747bbc63","id_icims":"3172778","is_intern":null,"is_manager":null,"job_category":"Business Intelligence","job_family":"Planning/development","job_function_id":null,"job_path":"/en/jobs/3172778/business-analyst-support-private-brands","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR37\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"February  3, 2026","preferred_qualifications":"- Are enrolled in or have completed a Bachelor's degree in mathematics, engineering, statistics, computer science or a related field\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"retail.team-icb-in","source_system":"JobCreator","state":"KA","title":"Business Analyst Support, Private Brands","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3172778/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-icb-in","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience working and communicating with multiple stakeholders, C-level executives and cross functional teams or equivalent\u003cbr/\u003e- Knowledge of Excel (Pivot Tables, VLookUps) at an advanced level and SQL\u003cbr/\u003e- Experience working with fast-moving, high-performance teams and driving innovative solutions tailored to unique business environments\u003cbr/\u003e- - 10+ 2 degree","business_category":"transportation-and-logistics","city":"Visakhapatnam - Virtual","company_name":"ADCI - Andra Pradesh - P17","country_code":"IND","description":"TOC (Transportation Operation Center) is the central command and control center for ‘Transportation Execution’ across the Amazon Supply Chain network supporting multiple geographies like NA, India and EU. It    ensures hassle free, timely pick-up and delivery of freight from   vendors  to Amazon fulfillment centers (FC) and from Amazon FCs to   carrier hubs.  In case of any exceptions, TOC steps in to resolve the   issue and keeps  all the stakeholders informed on the proceedings. Along   with this  tactical problem solving TOC is also charged with   understanding trends  in network exceptions and then automating   processes or proposing process  changes to streamline operations. This   second aspect involves network  monitoring and significant analysis of   network data.\r\u003cbr/\u003e  Overall, TOC  plays a critical role in ensuring the   smooth functioning of Amazon  transportation and thereby has a direct   impact on Amazon’s ability to  serve its customers on time.\r\u003cbr/\u003e  Purview of a Trans Ops Specialist\r\u003cbr/\u003e     A Trans Ops Specialist at TOC facilitates flow of information  between   different stakeholders (Trans Carriers/Hubs/Warehouses) and  resolves  any  potential issues that impacts customer experience and  business   continuity. Trans Ops Specialist at TOC works across two verticals – Inbound and Outbound operations. \r\u003cbr/\u003e     Inbound Operations deals with Vendor/Carrier/FC relationship,   ensuring  that the freight is picked-up on time and is delivered at FC   as per the  given appointment. Trans Ops Specialist on Inbound addresses   any  potential issues occurring during the lifecycle of pick-up to   delivery.\r\u003cbr/\u003e   Outbound Operations deals with FC/Carrier/Carrier Hub   relationship,  ensuring that the truck leaves the FC in order to   delivery customer  orders as per promise. Trans Ops Specialist    on Outbound addresses any potential issues occurring during the    lifecycle of freight leaving the FC and reaching customer premises.\r\u003cbr/\u003e\r\u003cbr/\u003e  A Trans Ops Specialist    provides timely resolution to the issue in hand by researching and    querying internal tools and by taking real-time decisions. An ideal    candidate should be able to understand the requirements/be able to    analyze data and notice trends and be able to drive Customer Experience    without compromising on time. The candidate should have the basic    understanding of Logistics and should be able to communicate clearly in    the written and oral form. Trans Ops Specialist should be able to   ideate  process improvements and should have the zeal to drive them to    conclusion. \r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003eResponsibilities include, but are not limited to:\r\u003cbr/\u003e   \r\u003cbr/\u003e     ·         Communication with external customers (Carriers,    Vendors/Suppliers) and internal customers (Retail, Finance, Software    Support, Fulfillment Centers)\r\u003cbr/\u003e  ·         Ability to pull data from    numerous databases (using Excel, Access, SQL and/or other data    management systems) and to perform ad hoc reporting and analysis as    needed is a plus.\r\u003cbr/\u003e  ·         Develop and/or understand performance metrics to assist with driving business results.\r\u003cbr/\u003e     ·         Ability to scope out business and functional requirements    for the Amazon technology teams who create and enhance the software    systems and tools are used by TOC.\r\u003cbr/\u003e  ·         Must be able to    quickly understand the business impact of the trends and make decisions    that make sense based on available data.\r\u003cbr/\u003e  ·         Must be able  to   systematically escalate problems or variance in the information and   data  to the relevant owners and teams and follow through on the   resolutions  to ensure they are delivered.\r\u003cbr/\u003e  ·         Work within   various time  constraints to meet critical business needs, while   measuring and  identifying activities performed.\r\u003cbr/\u003e  ·           Excellent  communication, both verbal and written as one may be required   to create a  narrative outlining weekly findings and the variances to   goals, and  present these finding in a review forum.\r\u003cbr/\u003e - Providing real-time customer experience by working in 24*7      operating environment.\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003eA day in the life\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003eAbout the hiring group\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003eJob responsibilities\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003eA day in the life\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003eAbout the hiring group\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003eJob responsibilities\r\u003cbr/\u003e\r\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e Communication with external customers (Carriers, Vendors/Suppliers) and internal customers (Retail, Finance, Software Support, Fulfillment Centers)\u003cbr/\u003e· Ability to pull data from numerous databases (using Excel, Access, SQL and/or other data management systems) and to perform ad hoc reporting and analysis as needed is a plus.\u003cbr/\u003e· Develop and/or understand performance metrics to assist with driving business results.\u003cbr/\u003e· Ability to scope out business and functional requirements for the Amazon technology teams who create and enhance the software systems and tools are used by TOC.\u003cbr/\u003e· Must be able to quickly understand the business impact of the trends and make decisions that make sense based on available data.\u003cbr/\u003e· Must be able to systematically escalate problems or variance in the information and data to the relevant owners and teams and follow through on the resolutions to ensure they are delivered.\u003cbr/\u003e· Work within various time constraints to meet critical business needs, while measuring and identifying activities performed.\u003cbr/\u003e· Excellent communication, both verbal and written as one may be required to create a narrative outlining weekly findings and the variances to goals, and present these finding in a review forum.\u003cbr/\u003e\u003cbr/\u003eProviding real-time customer experience by working in 24*7 operating environment.","department_cost_center":null,"description_short":"TOC (Transportation Operation Center) is the central command and control center for ‘Transportation Execution’ across the Amazon Supply Chain network supporting multiple geographies like NA, India and","display_distance":null,"id":"cc976038-b99a-4590-8c47-008346dcca2a","id_icims":"3174708","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Cust. Experience Qualit Ops","job_function_id":null,"job_path":"/en/jobs/3174708/transportation-representative-av","job_schedule_type":"full-time","location":"IN, AP, Visakhapatnam - Virtual","locations":["{\"normalizedStateName\":\"Andhra Pradesh\",\"normalizedCountryCode\":\"IND\",\"city\":\"Visakhapatnam - Virtual\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, AP, Visakhapatnam - Virtual\",\"coordinates\":\"17.7199,83.26281\",\"normalizedCountyName\":\"Visakhapatnam\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Visakhapatnam, Andhra Pradesh, IND\",\"location\":\"IN, AP, Visakhapatnam - Virtual\",\"region\":\"AP\",\"buildingCodeList\":[\"VCC18\"],\"normalizedCityName\":\"Visakhapatnam\"}"],"normalized_location":"Visakhapatnam, Andhra Pradesh, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"February  5, 2026","preferred_qualifications":"- Knowledge of Six Sigma, Lean manufacturing efforts, transportation and logistics, or fulfillment and distribution centers\u003cbr/\u003e- Knowledge of and proficiency in Excel and SQL\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-fulfillment-transportation","source_system":"JobCreator","state":"AP","title":"Transportation Representative, AV","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3174708/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-transportation","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Advanced proficiency in local language in both written and verbal communication\u003cbr/\u003e- Previous experience in a customer service environment\u003cbr/\u003e- Relevant experience working with data analytics and using these metrics to identify problems\u003cbr/\u003e- Excellent listening skills; able to demonstrate empathy and willingness to help\u003cbr/\u003e- Able to troubleshoot, research and effectively translate technical and procedural instructions to customers in a way they can understand\u003cbr/\u003e- Relevant experience working with the MS Office suite (Word, Excel, Outlook) in a professional environment","business_category":"amazon-customer-service","city":"Swansea","company_name":"Project Kite - UK Parent","country_code":"GBR","description":"Veeqo is a multi-channel shipping software built to simplify fast-growth e-commerce. Acquired by Amazon in 2021, Veeqo helps sellers cut shipping costs while increasing the speed of fulfilling customer orders. Selected candidate(s) as Seller Support Associates will serve as the first-line support partners to act as the primary interface for our Veeqo customers, providing phone, email and live chat support.\u003cbr/\u003e\u003cbr/\u003eOur team in Swansea will be responsible for providing timely and accurate operational support to customers on our internal platform, offering a first class customer experience in all interactions. A First Line Support Agent will also identify chronic system issues, provide process improvements and recommendations, develop internal documentation, and contribute to a team environment.\u003cbr/\u003e\u003cbr/\u003eThe Sr. First Line Support Agent demonstrates end-to-end ownership of every seller interaction and handles proactive problem solving to provide exceptional support to our customers. Able to deal with pressure and satisfy customer concerns or frustration even in the most challenging of environments, our first line support can diffuse complex situations, ensuring customer satisfaction.\u003cbr/\u003e\u003cbr/\u003eThe successful candidate will work a five-day shift pattern running from Monday through Friday, with Saturday and Sunday as rest days. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs part of your role, you will have the opportunity to:\u003cbr/\u003e\u003cbr/\u003eSupport Veeqo's Selling Partner’s to solve any incoming issues via 3 channels of communication (Phone, Email \u0026 Chat).\u003cbr/\u003eManage high volumes of inbound and outbound calls, emails and chats in a timely manner.\u003cbr/\u003eIdentify customers’ needs, clarify information, research every issue and providing solutions.\u003cbr/\u003eExemplify Amazons Leadership Principle for Customer Obsession by consistently displaying a genuine empathy and passion for our customers, delivering an exceptional customer care experience with every contact.\u003cbr/\u003eBuild sustainable relationships and engaging customers by going the extra mile.\u003cbr/\u003eOversee and achieve various productivity and quality targets and metrics.\u003cbr/\u003eCollaborate with various internal stakeholders and teams.\u003cbr/\u003eTroubleshoot and provide product guidance and support to all Veeqo Sellers and Vendors.\u003cbr/\u003eAttend and conduct regular training sessions, learn product details and key selling points of products and technologies.\u003cbr/\u003eAny other duties and special projects as directed by management in keeping with the employee’s skills and experience\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eEach day begins with a team huddle 30 minutes into the shift, creating a collaborative space where team members share updates, seek peer support on complex cases, and receive important announcements from management. The workday is strategically structured to balance dedicated ticket-handling time with project work, allowing team members to contribute to key initiatives such as trend analysis, process documentation, and training development – ensuring both immediate customer support and long-term service improvements.","department_cost_center":null,"description_short":"Veeqo is a multi-channel shipping software built to simplify fast-growth e-commerce. Acquired by Amazon in 2021, Veeqo helps sellers cut shipping costs while increasing the speed of fulfilling customer","display_distance":null,"id":"dad71891-1931-49ee-9e67-c3db78a28ae9","id_icims":"3055253","is_intern":null,"is_manager":null,"job_category":"Customer Service","job_family":"Seller Support Operations","job_function_id":null,"job_path":"/en/jobs/3055253/seller-support-advisor-veeqo","job_schedule_type":"full-time","location":"GB, Swansea","locations":["{\"normalizedStateName\":\"Wales\",\"normalizedCountryCode\":\"GBR\",\"city\":\"Swansea\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, Swansea\",\"coordinates\":\"51.62315,-3.94083\",\"normalizedCountyName\":\"West Glamorgan\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"Swansea, Wales, GBR\",\"location\":\"GB, Swansea\",\"region\":\"\",\"buildingCodeList\":[\"SWS11\"],\"normalizedCityName\":\"Swansea\"}"],"normalized_location":"Swansea, Wales, GBR","optional_search_labels":[],"posted_date":"August  9, 2025","preferred_qualifications":"- Business acumen in areas of e-commerce and retail is advantageous\u003cbr/\u003e-  2 or more years experience within a customer service/contact centre environment would be an advantage\u003cbr/\u003e- Ability to work against and deliver performance in metric driven environment with high productivity and quality standards\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-customer-service.team-associates","source_system":"JobCreator","state":null,"title":"Seller Support Advisor, Veeqo","university_job":null,"updated_time":"23 minutes","url_next_step":"https://account.amazon.com/jobs/3055253/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-associates","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience","business_category":"fulfillment-ops","city":"Chennai","company_name":"ASSPL - Tamil Nadu - D31","country_code":"IND","description":"Amazon Now is seeking an operations leader to support cluster-level operational indexing and performance tracking in a city. This role involves monitoring key operational metrics across dark stores, managing data accuracy for operational dashboards, and supporting the team in maintaining visibility into network health and performance. Managing 3P partners and driving standardization/improvement is a key requirement of the role.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eTrack and index operational metrics including count compliance, fulfillment times, inventory accuracy, and delivery performance across city networks\u003cbr/\u003e\u003cbr/\u003eMaintain data integrity for operational dashboards and reporting systems used by leadership teams\u003cbr/\u003eSupport root cause analysis for operational defects and SLA breaches\u003cbr/\u003e\u003cbr/\u003eCoordinate with store operations teams to ensure timely data updates and metric accuracy\u003cbr/\u003eAssist in identifying trends and patterns in operational performance to support continuous improvement initiatives","department_cost_center":null,"description_short":"Amazon Now is seeking an operations leader to support cluster-level operational indexing and performance tracking in a city. This role involves monitoring key operational metrics across dark stores, managing","display_distance":null,"id":"9f50967e-1b8b-49ec-ab9b-a7b88188a22f","id_icims":"3146225","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3146225/cluster-manager-amazon-now-operations-amazon-now","job_schedule_type":"full-time","location":"IN, TN, Chennai","locations":["{\"normalizedStateName\":\"Tamil Nadu\",\"normalizedCountryCode\":\"IND\",\"city\":\"Chennai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TN, Chennai\",\"coordinates\":\"13.08404,80.28274\",\"normalizedCountyName\":\"Chennai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Chennai, Tamil Nadu, IND\",\"location\":\"IN, TN, Chennai\",\"region\":\"TN\",\"buildingCodeList\":[\"UMAS\",\"TCI2\",\"QSAG\",\"MAA2\",\"TCF1\",\"TCJ6\",\"YSFC\",\"TCD4\",\"MAA400\",\"TCH9\",\"MAA200\",\"SMAA\",\"MAA10\",\"HBC93\",\"HMAA\",\"MAA55\",\"TCG5\",\"YSYM\",\"TCC2\",\"TCB7\",\"TCJ8\",\"SMAC\",\"MAT1\",\"TCA3\",\"UMA2\",\"IRXA\",\"TCG3\",\"MAA53\",\"TCD6\",\"UIXU\",\"TCE6\",\"QSAV\",\"MAA43\",\"YZZR\",\"TCC4\",\"TCK1\",\"UMA9\",\"RSBF\",\"UIXS\",\"XINC\",\"TCI4\",\"TCB5\",\"MAA140\",\"TCF3\",\"QSLE\",\"TCH5\",\"TCH2\",\"MAA84\",\"TCJ4\",\"YZZI\",\"TCI8\",\"QSN1\",\"TCH4\",\"MAA15\",\"SMAS\",\"ZSE6\",\"HBC40\",\"TCC7\",\"UMAA\",\"MAA8\",\"SMAT\",\"TCH3\",\"MAAO\",\"MAA252\",\"TCC6\",\"MAA16\",\"YZZ1\",\"MAA251\",\"MAA7\",\"UMAL\",\"ZSE5\",\"TCC5\",\"YSIW\",\"TCB1\",\"YSFK\",\"TCF5\",\"MAA45\",\"FMAC\",\"TCG9\",\"UIXR\",\"PIXS\",\"TCE4\",\"YSYO\",\"KERS\",\"TCJ9\",\"TCF4\",\"TCJ3\",\"TCE5\",\"TCJ2\",\"MAA82\",\"TCG4\",\"PMA5\",\"MAA44\",\"PMQF\",\"YSUW\",\"PIXR\",\"QSDA\",\"IRDV\",\"TCB6\",\"TCI3\",\"TCI9\",\"MAA98\",\"MAA54\",\"HCI4\",\"YEY6\",\"TCE9\",\"TCB8\",\"MAA85\",\"MAA40\",\"MAA23\",\"MAA99\",\"TCD5\",\"IRYO\",\"UIXV\",\"ZSE0\",\"MAA71\",\"TCI1\",\"UMA93\",\"MAD41\",\"SUTH\",\"TCJ5\",\"TCD3\",\"IRDW\",\"MAA83\",\"TCF2\",\"MAA56\",\"TCG6\",\"TCE7\",\"TCI5\",\"FTPA\",\"MAA49\",\"PMA1\",\"YEXF\",\"IRCB\",\"TCD7\",\"IRXT\",\"TCG2\",\"MAA52\",\"RSBE\",\"HMA1\",\"ZSE4\",\"TCD1\",\"TCG8\",\"TCH8\",\"TCA8\",\"FMAB\",\"TCF9\",\"TCF6\",\"TCJ7\",\"MAA87\",\"MAA81\",\"TCJ1\",\"HCI2\",\"MAA11\",\"TCE3\",\"FMAA\",\"TCF7\",\"VOMM\",\"YSFI\",\"MAA46\",\"RSB6\",\"TCI7\",\"XSAC\",\"TCE2\",\"TCB2\",\"HSCC\",\"PTMG\",\"TCC8\",\"SMAF\",\"MAA80\",\"TCB4\",\"UMA8\",\"TCE1\",\"TCF8\",\"MAA48\",\"MAA50\",\"TCD9\",\"PIXV\",\"MAA51\",\"MAA12\",\"TCC9\",\"SMAK\",\"UMAD\",\"TCD8\",\"QSO2\",\"TCH7\",\"MAA255\",\"TCD2\",\"PMMK\",\"QSO3\",\"PIXU\",\"YSIY\",\"IRXC\",\"MAAY\",\"KEL40\",\"TCC3\",\"TCH6\",\"TCG1\",\"TCG7\",\"MAA47\",\"UMA7\",\"MAA41\",\"MAA22\",\"TCE8\",\"TCB9\",\"TCB3\",\"XSIQ\",\"TCI6\",\"QSN9\",\"PNOH\",\"MAT2\"],\"normalizedCityName\":\"Chennai\"}"],"normalized_location":"Chennai, Tamil Nadu, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"December 19, 2025","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience with analytical tools and ability to dive deep into metrics and reporting\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"TN","title":"Cluster Manager- Amazon NOW Operations, Amazon Now","university_job":null,"updated_time":"26 minutes","url_next_step":"https://account.amazon.com/jobs/3146225/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Finance, Economics, Statistics, Business, or a related field\u003cbr/\u003e- Experience working with stakeholders, or experience in financial modeling, P\u0026L management or analysis\u003cbr/\u003e- Experience working with Excel and large-scale data mining and reporting tools such as Python, SQL or Tableau\u003cbr/\u003e- Experience with financial analysis and modeling","business_category":"amazon-operations","city":"London","company_name":"Amazon EU SARL (UK Branch)","country_code":"GBR","description":"Amazon is seeking an experienced Finance Manager for its WW Amazon Shipping (SWA) Finance org, a growing area that is integral to the Amazon flywheel. This person will be a leader in the Finance organization supporting the business initiatives related to SWA EU. This is a very high impact and high visibility role supporting business leaders to drive sustainable growth in the EU business. Person in this role will have advancement opportunities to support different businesses and to lead programs or products.\u003cbr/\u003e \u003cbr/\u003eThe ideal candidate will be primarily responsible for marketplace Commercial Finance business partnering and  Financial Planning \u0026 Analysis activities for EU, driving financial modelling, controllership and identifying opportunities across pricing and operations cost as a result. This person will be working closely with Business, Operations, Product and Tech teams, as well as ATS and AMZL Finance teams. A successful candidate will partner with multiple stakeholders to provide timely analysis, insightful guidance, and financial leadership to this high-growth organization. This role requires extensive cross-functional partnership with various retail, transportation, and finance teams to identify best practices across the network and lead cost improvement efforts for operations. It also requires a strong self-starter mentality, exceptional stakeholder management capabilities and will stretch your leadership skills while also requiring you to digest the complexity of the Amazon transportation network to deliver process improvement. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAmazon’s Marketplace services over 2 million Sellers, disrupting traditional notions of retail marketplace and connecting millions of businesses, big and small, to millions of Amazon Customers. The Marketplace business exceeds 50% of the total Amazon.com sales and each year, tens of thousands of businesses join the marketplace adding millions of new products. Sellers are a critical part of Amazons ecosystem to deliver on our vision of offering the earth’s largest selection, lowest prices, and exceptional delivery experience. \u003cbr/\u003e \u003cbr/\u003eWant to help build the finance team at the world's leading e-commerce company? Do you view problems as treasures, and are you willing to dive deep to develop those solutions and deliver results? Will you seek to challenge the status quo, and accept that your ideas and mechanisms may be tested daily?\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Drive core financial processes for the organisation including Annual Operating Plans, 3 year Strategic Plan, and Monthly/Quarterly Business Reviews\u003cbr/\u003e• Educate business partners on financial and non-financial trade-offs, and make thoughtful judgement calls in ambiguous environments where data may be scarce or difficult to procure.\u003cbr/\u003e• Partner with senior business leaders and develop operational metrics and goal setting to help the team improve performance\u003cbr/\u003e• Use active listening skills intuitively to communicate data (both written and verbal) in a clear, concise, and unambiguous manner. Adjust style for various audiences to articulate complex finance issues clearly. Your communications drive critical business decisions.\u003cbr/\u003e• Analyse ROI of different programs/initiatives and generate actionable insights from large amounts of data\u003cbr/\u003e• Have backbone, disagree and commit to foster constructive dialogues, harmonize conflicting views, resolve issues, and drive decisions.\u003cbr/\u003e• Exhibit social responsibility. Actively recruit bar-raising talent, continuously develop your team.","department_cost_center":null,"description_short":"Amazon is seeking an experienced Finance Manager for its WW Amazon Shipping (SWA) Finance org, a growing area that is integral to the Amazon flywheel. This person will be a leader in the Finance organization","display_distance":null,"id":"fa54c013-472c-485a-83aa-5915198fb209","id_icims":"3175727","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/Planning","job_function_id":null,"job_path":"/en/jobs/3175727/finance-manager-amazon-shipping","job_schedule_type":"full-time","location":"GB, London","locations":["{\"normalizedStateName\":\"England\",\"normalizedCountryCode\":\"GBR\",\"city\":\"London\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, London\",\"coordinates\":\"51.50643,-0.12719\",\"normalizedCountyName\":\"London\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"London, England, GBR\",\"location\":\"GB, London\",\"region\":\"\",\"buildingCodeList\":[\"LHR139\"],\"normalizedCityName\":\"London\"}"],"normalized_location":"London, England, GBR","optional_search_labels":[],"posted_date":"February  6, 2026","preferred_qualifications":"- Advanced or master’s degree in finance, economics or mathematics, such as a CA, CMA, CWA or MBA\u003cbr/\u003e- Experience working in a fast-paced and ambiguous environment\u003cbr/\u003e- Experience working in large teams or at a national/multinational organisation\u003cbr/\u003e- Experience communicating complex information and solutions to senior stakeholders and influence decisions\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-operations.team-finance-emea","source_system":"JobCreator","state":null,"title":"Finance Manager, Amazon Shipping","university_job":null,"updated_time":"28 minutes","url_next_step":"https://account.amazon.com/jobs/3175727/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-finance-emea","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- 3+ years of program or project management experience\u003cbr/\u003e- Knowledge of Excel (Pivot Tables, VLookUps) at an advanced level and SQL\u003cbr/\u003e- Experience in Business English skills, both verbal and written","business_category":"fulfillment-and-operations","city":"Tokyo","company_name":"Amazon Japan G.K.","country_code":"JPN","description":"We are seeking someone to help think about and support Amazon Japan's further growth through delivery optimization.\u003cbr/\u003e\u003cbr/\u003eDelivering orders as accurately and reliably as possible is what our customers expect from us. And exceeding these expectations by maintaining and improving delivery quality and speed within an increasingly complex and diverse business environment is key to our growth.\u003cbr/\u003e\u003cbr/\u003eWe aim to provide better purchasing experiences for Amazon customers by optimizing orders from various perspectives, including delivery services, speed, and associated costs. This requires analyzing vasvast internal data, understanding the current situation, identifying challenges, and continuously improving to enhance service while reducing costs.\u003cbr/\u003e\u003cbr/\u003eThe position we're recruiting for is within the Supply Chain Optimization team, which specifically focuses on delivery efficiency within the supply chain. The role involves planning and executing initiatives for further system and operational optimization and cost reduction opportunities. Therefore, data analysis skills (Excel analysis and SQL) are essential for this position. You will also actively communicate with Finance, Sales, Transportation, and other teams within Supply Chain to drive efficiency improvements.\u003cbr/\u003e\u003cbr/\u003eWe welcome applications from motivated individuals who want to drive business quickly and dynamically through data analysis, not limited to those with supply chain (EC, logistics, production) experience.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Data Analysis and Reporting: You will be responsible for analyzing various data and metrics, and creating reports to share information with stakeholders. You must independently understand complex supply chain mechanisms and effectively deep-dive into vast amounts of data. This requires advanced comprehension and logical thinking skills.\u003cbr/\u003e\u003cbr/\u003e• Planning and Execution of Delivery Efficiency Improvements: Based on analysis results, you will identify issues and plan and execute initiatives to improve shipping/delivery efficiency and reduce costs. You will manage projects while coordinating with relevant departments.\u003cbr/\u003e\u003cbr/\u003e• Planning Creation: Working collaboratively with Business, Finance, and Transportation departments, you will create short-term and medium-to-long-term plans. You will consistently handle everything from creating plans based on the above analysis and understanding of future changes to explaining them to stakeholders.\u003cbr/\u003e\u003cbr/\u003e• System Improvements: Regarding planning systems, you will serve as the point of contact until implementation by determining implementation priorities considering Japan-specific business context, localizing specifications, and coordinating with stakeholders while assessing impact on Japanese business operations.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e[Work Style]\u003cbr/\u003eFlextime System with no core time - While the standard working hours are 8 hours per day, working hours can be adjusted in consultation with your manager based on business needs and personal circumstances. We emphasize work-life harmony, allowing for flexible arrangements such as shifting work hours to different times of day if daytime work is difficult due to personal circumstances.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDepartment/Job Category Introduction\u003cbr/\u003e• Department: \u003ca href=\"https://www.amazon.co.jp/b?node=5637338051\"\u003eSupply Chain Management (SCM)/Middle Mile\u003c/a\u003e\u003cbr/\u003e• Job Category: \u003ca href=\"https://www.amazon.co.jp/b?node=5609904051\"\u003eProject Management\u003c/a\u003e\u003cbr/\u003e• Work Location: \u003ca href=\"https://www.amazon.co.jp/b?node=5589794051\"\u003eTokyo Office\u003c/a\u003e\u003cbr/\u003e\u003cbr/\u003eAmazon strives to create a diverse and inclusive workplace. Amazon complies with the Equal Employment Opportunity Act. We provide equal employment opportunities without discrimination based on race, national origin, sexual orientation, disability, age, or other attributes. For individuals with disabilities, please see: https://www.amazon.jobs/disability/jp","department_cost_center":null,"description_short":"We are seeking someone to help think about and support Amazon Japan's further growth through delivery optimization.Delivering orders as accurately and reliably as possible is what our customers expect","display_distance":null,"id":"5c78484e-a676-4590-9000-ee320899dd80","id_icims":"3175726","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Program Management","job_function_id":null,"job_path":"/en/jobs/3175726/senior-specialist-supply-chain-optimization-supply-chain-fulfillment-optimization","job_schedule_type":"full-time","location":"JP, 13, Tokyo","locations":["{\"normalizedStateName\":\"Tokyo\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Tokyo\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, 13, Tokyo\",\"coordinates\":\"35.68946,139.69172\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Tokyo, JPN\",\"location\":\"JP, 13, Tokyo\",\"region\":\"13\",\"buildingCodeList\":[\"HND11\"]}"],"normalized_location":"Tokyo, JPN","optional_search_labels":[],"posted_date":"February  6, 2026","preferred_qualifications":"- 3+ years of driving end to end delivery, and communicating results to senior leadership experience\u003cbr/\u003e- 3+ years of driving process improvements experience\u003cbr/\u003e- Experience in stakeholder management, dealing with multiple stakeholders at varied levels of the organization\u003cbr/\u003e- Experience building processes, project management, and schedules\u003cbr/\u003e- Excited about working in a diverse group and contributing to an inclusive culture\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-jp-fulfillment-center-management","source_system":"JobCreator","state":"13","title":"Senior Specialist, Supply Chain Optimization, Supply Chain Fulfillment Optimization","university_job":null,"updated_time":"30 minutes","url_next_step":"https://account.amazon.com/jobs/3175726/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-jp-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 3+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"finance","city":"Hyderabad","company_name":"ADCI HYD 13 SEZ","country_code":"IND","description":"Are you interested in building high-performance, globally scalable Financial systems that support Amazon's current and future growth? Are you seeking an environment where you can drive innovation? Does the prospect of working with top engineering talent get you charged up? If so, Amazon Finance Technology (FinTech) is for you!\u003cbr/\u003eAmazon Finance Technology is looking for a Software Development Engineer to help build systems and automate solutions. You will support critical finance business functions for customers around the world while meeting availability goals and ensuring robust system performance. You will discover innovative ways to automate and scale our infrastructure as we expand globally. You will work together with multiple teams and departments, with plenty of opportunities to learn and grow. The ideal candidate has a passion for understanding computing systems and for applying that understanding with an obsession for delighting customers.  As an SDE in the team, you will take part in in the architecture, design, implementation and deployment of large-scale and complex software systems. You will get to leverage your experience and expertise to deliver innovative solutions to challenging problems. You will communicate your ideas effectively to achieve the right outcome for your team and customer. You enjoy collaborating with others to increase the effectiveness of the overall team. Your code, design, and implementation decisions should set a great example to other engineers. You will also have the opportunity to impact the technical decisions in the broader organization as well as mentor other engineers in the team. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 3+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","department_cost_center":null,"description_short":"Are you interested in building high-performance, globally scalable Financial systems that support Amazon's current and future growth? Are you seeking an environment where you can drive innovation? Does","display_distance":null,"id":"0247f928-df32-4ef6-b8b2-cceac644699b","id_icims":"3175606","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3175606/software-development-engineer-ii-fintech","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD13\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":[],"posted_date":"February  6, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-fintech","source_system":"JobCreator","state":"TS","title":"Software Development Engineer II, FinTech","university_job":null,"updated_time":"40 minutes","url_next_step":"https://account.amazon.com/jobs/3175606/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fintech","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- - 2+ years of professional work experience in a customer facing role\u003cbr/\u003e- - Business level fluency in both Japanese and English (written and verbal format)\u003cbr/\u003e- - Experience in using data and metrics to drive innovation to address challenges and mitigate risks effectively.\u003cbr/\u003e- - Proven ability to prioritize work, manage complex tasks, and demonstrate attention to detail in a fast-paced environment","business_category":"global-corporate","city":"Tokyo","company_name":"Amazon Japan G.K.","country_code":"JPN","description":"At Amazon, we believe that every day is still Day 1 - a day to take the first step, look forward to new challenges, and be part of something great. As one of the most recognizable brands in the world, we are working tirelessly to be the most customer-centric company on Earth. To achieve this, we need exceptionally talented, bright, and driven people to join our team.\u003cbr/\u003e\u003cbr/\u003eOur Campus Recruiting team is responsible for attracting the future leaders of Amazon from top universities and campuses. We are seeking a talented and committed Full Lifecycle Recruiter to play a critical role in managing and expanding our campus recruiting efforts.\u003cbr/\u003e\u003cbr/\u003eAs part of our Campus Recruiting team, you will have the opportunity to make your ideas come to life and be part of a company that redefines itself every day. The successful candidate will possess excellent analytical, organizational, prioritization, and communication skills, with a keen eye for detail. You will work effectively with internal and external clients and candidates, demonstrating the ability to adapt quickly to changing priorities. Most importantly, you will share our passion for building a great organization of talented individuals who will redefine the future of Amazon.\u003cbr/\u003e\u003cbr/\u003eIf you are ready to be part of something truly remarkable, we encourage you to apply. This is your day to join a company that is driven by energy, passion, and a relentless focus on the customer. Together, we will continue to push the boundaries of what's possible and shape the future of Amazon.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eResponsible for full-lifecycle recruitment of students and early career talent.\u003cbr/\u003e・Partner with hiring teams to build effective sourcing, assessment, and closing approaches with an ability to manage customer/partner expectations through a deep understanding of return on investment.\u003cbr/\u003e・Build and maintain network of potential candidates through pro-active market research and on-going relationship management; conducts in-depth interviews of potential candidates, demonstrating ability to anticipate hiring manager preferences through high offer-to-interview ratios.\u003cbr/\u003e・Recommend ideas and strategies related to recruitment of talent that will contribute to the long-range growth of the company, implementing any new processes and fine-tuning current processes for recruiting that fits within Amazon's mission to deliver the highest quality results to the customer.\u003cbr/\u003e・Articulate in writing a plan with deliverables, timelines and a formal tracking process.\u003cbr/\u003e・Interview candidates within the framework of the position specification and Amazon’s Leadership Principles. Possess strong ability to screen, interview and prepare a candidate slate within an appropriate and consistent timeline.\u003cbr/\u003e・Responsible for developing strong working relationships with all key hiring managers and working closely with them to ensure hiring needs are met for their groups\u003cbr/\u003e・Create innovative plans to attract qualified candidates for open roles and monitor new trends and opportunities to consistently raise the standard for recruitment at Amazon","department_cost_center":null,"description_short":"At Amazon, we believe that every day is still Day 1 - a day to take the first step, look forward to new challenges, and be part of something great. As one of the most recognizable brands in the world,","display_distance":null,"id":"e58f1a9d-ac06-45cf-9daf-06287701fe4a","id_icims":"3175723","is_intern":null,"is_manager":null,"job_category":"Human Resources","job_family":"Human Resources","job_function_id":null,"job_path":"/en/jobs/3175723/full-lifecycle-recruiter-amazon-university-talent-acquisition","job_schedule_type":"full-time","location":"JP, 13, Tokyo","locations":["{\"normalizedStateName\":\"Tokyo\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Tokyo\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, 13, Tokyo\",\"coordinates\":\"35.68946,139.69172\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Tokyo, JPN\",\"location\":\"JP, 13, Tokyo\",\"region\":\"13\",\"buildingCodeList\":[\"HND10\"]}"],"normalized_location":"Tokyo, JPN","optional_search_labels":[],"posted_date":"February  6, 2026","preferred_qualifications":"- Experience working in a fast paced, quickly changing or international environment\u003cbr/\u003e- 1+ years of corporate or search firm progressive recruiting or research experience\u003cbr/\u003e- Familiarity with Campus (early-careers) Recruitment and market best practices in Japan\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"global-corporate.team-global-talent-acquisition","source_system":"JobCreator","state":"13","title":"Full Lifecycle Recruiter, Amazon University Talent Acquisition","university_job":null,"updated_time":"43 minutes","url_next_step":"https://account.amazon.com/jobs/3175723/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-talent-acquisition","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Abschluss im Fachbereich Elektrotechnik\u003cbr/\u003e- Arbeitserfahrung in einem Wartungsteam in Bereichen der Industrie oder Produktion, in denen verschiedene komplexe Prozesse ablaufen\u003cbr/\u003e- Erfahrung im Management von technischen Fachkräften\u003cbr/\u003e- Erfahrung in der Kommunikation und im Beziehungsmanagement mit verschiedenen Stakeholdern, einschließlich Drittanbietern\u003cbr/\u003e- Fortgeschrittene Deutsch- und Englischkenntnisse in Wort und Schrift","business_category":"fulfillment-ops","city":"Bad Hersfeld","company_name":"Amazon Logistik GmbH - A33","country_code":"DEU","description":"Amazon unterhält Hunderte von Betriebsstandorten in ganz Europa. Diese Standorte sind mehr als nur Arbeitsplätze – hier treffen sich unsere Teams und sorgen gemeinsam dafür, dass unsere Kund:innen zufrieden sind. Als Reliability Maintenance Engineering (RME) Area Manager:in bringst Du die Elemente zusammen, die unsere Arbeitsumgebung so unterstützend und effizient wie möglich machen. Du leitest und betreust ein Team technischer Fachkräfte, die dafür sorgen, dass unsere Geräte zuverlässig arbeiten.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Unterstützung der Kolleg:innen bei der Einhaltung der Sicherheitsrichtlinien und -abläufe am Standort\u003cbr/\u003e- Umsetzung des EU-Netzwerkstandards, Planung vorbeugender Wartungsmaßnahmen und Gewährleistung technischer Verfügbarkeit \u003cbr/\u003e- Kollaboration mit Kolleg:innen zur Datenerhebung und -analyse, um Prozesse zu verbessern\u003cbr/\u003e- Umsetzung und Unterstützung sowohl standortbasierter als auch netzwerkbasierter Projekte\u003cbr/\u003e- Leitung, Unterstützung und Mentoring für Dein Team, um die berufliche Entwicklung zu fördern\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eDu arbeitest an einem unserer Betriebsstandorte, bietest Deinem Team praktische Anleitung und verschaffst Dir einen klaren Überblick über alle Aktivitäten am Standort. Das beinhaltet die Erhebung von Daten und die Lösung von Problemen in einer dynamischen Umgebung. Außerdem erstellst Du einen Betriebsplan, um den Standort produktiver und effizienter zu machen. Dazu führst Du auch neue Projekte ein, die alles von den Betriebsabläufen bis hin zur Gerätewartung optimieren. Neben der Sicherheit ist der wichtigste Aspekt dieser Rolle die Leitung Deines Teams. Das beinhaltet das Management der Leistung und Entwicklung Deiner Teammitglieder ebenso wie die Organisation zusätzlicher Schulungen.","department_cost_center":null,"description_short":"Amazon unterhält Hunderte von Betriebsstandorten in ganz Europa. Diese Standorte sind mehr als nur Arbeitsplätze – hier treffen sich unsere Teams und sorgen gemeinsam dafür, dass unsere Kund:innen zufrieden","display_distance":null,"id":"2cfe2636-2069-4bc7-afb1-2f33db51f894","id_icims":"3175720","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3175720/reliability-maintenance-engineering-area-manager-in","job_schedule_type":"full-time","location":"DE, HE, Bad Hersfeld","locations":["{\"normalizedStateName\":\"Hesse\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Bad Hersfeld\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, HE, Bad Hersfeld\",\"coordinates\":\"50.86952,9.71282\",\"normalizedCountyName\":\"Hersfeld-Rotenburg\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Bad Hersfeld, Hesse, DEU\",\"location\":\"DE, HE, Bad Hersfeld\",\"region\":\"HE\",\"buildingCodeList\":[\"XDED\",\"FRA3\",\"FRA1\"],\"normalizedCityName\":\"Bad Hersfeld\"}"],"normalized_location":"Bad Hersfeld, Hesse, DEU","optional_search_labels":["ops.lander-emea-rme-manager"],"posted_date":"February  6, 2026","preferred_qualifications":"- Erfahrung im Umgang mit gesetzlichen Vorschriften, beispielsweise Compliance-Prüfungen und Sicherheitsprotokollen für Maschinen\u003cbr/\u003e- Erfahrung mit automatisierten Geräten, einschließlich Packmaschinen, Sortier- und Fördersystemen\u003cbr/\u003e- Erfahrung im Gebrauch von Datenanalysetools und SPS-basierten Steuersystemen\u003cbr/\u003e- Erfahrung mit Projektmanagement oder mit Kaizen-, Lean- oder Six-Sigma-Prozessen\u003cbr/\u003e- Erfahrung mit Computerized Maintenance Management Systemen (CMMS)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":"HE","title":"Reliability Maintenance Engineering Area Manager:in","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3175720/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- • A degree or degree equivalent • Relevant security- or risk-related experience (e.g., security services, asset protection, loss prevention, risk management, inventory management, investigations, supply chain, auditing, compliance, or similar) • Relevant experience working with the MS Office suite (Word, Excel, Outlook) in a professional environment • Upper intermediate proficiency in written and verbal English and Spanish","business_category":"fulfillment-and-operations","city":"Malaga","company_name":"Amazon Spain Fulfillment, S.L.U.","country_code":"ESP","description":"Our operations network, known for our speed, accuracy, and exceptional service, delivers millions of packages and smiles to Amazon customers every day. \u003cbr/\u003e\u003cbr/\u003eTo keep our operations network secure and assure operational continuity, we are looking for proactive and solution-based professionals who want to join our team as Loss Prevention Expert. \u003cbr/\u003e\u003cbr/\u003eIn this key role, you will deliver security as a service to our operational sites across the end-to-end supply chain to protect our people and prevent loss.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tSupport resilience of our business operations by contributing to emergency and crisis planning for sites within your area of responsibility\u003cbr/\u003e•\tContribute to the identification of vulnerabilities (e.g., loss, associate experience, process improvement) and define appropriate mitigating actions while ensuring compliance with legal and ethical standards\u003cbr/\u003e•\tServe as point of contact for and coordinate measures to manage risk with local management and external actors (e.g., law enforcement agencies and industry associations) on all security-related matters\u003cbr/\u003e•\tEnsure compliance of your assigned sites with Amazon global security standards\u003cbr/\u003e•\tOwn Security and Loss Prevention-related projects on the local, regional, and country level\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Loss Prevention Expert, you will join a team of Security and Loss Prevention professionals providing security as a service to business customers across multiple business units within a dedicated geographical area. \u003cbr/\u003e\u003cbr/\u003eYou perform regular physical security audits and investigate policy violations, security-related incidents, and loss events. During your investigations, you collect information by monitoring systems and tools, analysing data reports, and conducting interviews. \u003cbr/\u003e\u003cbr/\u003eYour findings contribute to identifying vulnerabilities in our processes and you identify and drive mitigating measures. You play a key role in maintaining the physical integrity of our sites by auditing and monitoring the health status of our systems and, jointly with subject matter experts and external suppliers, maintain their functionality. Furthermore, you identify and act upon initiatives improving our physical security infrastructure and contribute directly to the budgetary planning for our external suppliers. \u003cbr/\u003e\u003cbr/\u003eYou interact on a daily basis with our external security service providers to ensure delivery of high-quality security services and a smooth customer experience. Finally, you deliver loss prevention-related education and awareness programs to other teams across all management levels and manage the implementation of our Security and Loss Prevention plan.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eSitting within the Global Security Operations organisation, Security and Loss Prevention supports the accomplishment of Amazon´s business targets and the strengthening of our brand by effectively protecting against relevant threats and by managing security and loss prevention risks that could:\u003cbr/\u003e\u003cbr/\u003e•\tPut our associates and customers under jeopardy\u003cbr/\u003e•\tDisrupt the continuity of our business operations\u003cbr/\u003e•\tInflict damage to our assets\u003cbr/\u003e•\tHave adverse impact on our brand reputation\u003cbr/\u003e\u003cbr/\u003eWorking in partnership with our stakeholders, we secure the Amazon supply chain end-to-end and promote security during business conversations. We do this by preventing security and loss prevention-related risks and vulnerabilities as early as possible, intervening in unfolding incidents to minimize any negative impact as well as thoroughly investigating security-related incidents to identify and remove root causes, preventing reoccurrence.\u003cbr/\u003e","department_cost_center":null,"description_short":"Our operations network, known for our speed, accuracy, and exceptional service, delivers millions of packages and smiles to Amazon customers every day. To keep our operations network secure and assure","display_distance":null,"id":"05ac0ab8-bc2c-41d5-9866-3f3f3ffc0312","id_icims":"3175719","is_intern":null,"is_manager":null,"job_category":"Investigation \u0026 Loss Prevention","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3175719/loss-prevention-expert-profit-protection-manager-gerente-de-mermas-gerente-de-prevencion-de-perdidas-security-loss-prevention","job_schedule_type":"full-time","location":"ES, MA, Malaga","locations":["{\"normalizedStateName\":\"Andalucia\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Malaga\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, MA, Malaga\",\"coordinates\":\"36.71847,-4.41965\",\"normalizedCountyName\":\"Málaga\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Málaga, Andalucia, ESP\",\"location\":\"ES, MA, Malaga\",\"region\":\"MA\",\"buildingCodeList\":[\"DQA3\"],\"normalizedCityName\":\"Málaga\"}"],"normalized_location":"Málaga, Andalucia, ESP","optional_search_labels":["ops.lander-emea-slp"],"posted_date":"February  6, 2026","preferred_qualifications":"- Preferred qualifications are not required to apply for a position at Amazon. If you have all the basic qualifications above, we’d love to hear from you. • A relevant advanced degree, advanced degree equivalent, or industry certification • Relevant experience with physical security systems, investigation techniques, and/or management of contract security officers • Relevant experience with retail, warehouse, distribution centre services, delivery service, or supply chain • Relevant experience in working with data • Driver’s license Amazon is an equal opportunities employer.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-global-fulfillment-loss-prevention-and-security","source_system":"JobCreator","state":"MA","title":"Loss Prevention Expert/ Profit Protection Manager / Gerente de Mermas / Gerente de Prevención de Pérdidas, Security \u0026 Loss Prevention","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3175719/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-fulfillment-loss-prevention-and-security","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}