{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 3+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"transportation-and-logistics","city":"Rockford","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Come build the future with Amazon Global Air!\u003cbr/\u003e \u003cbr/\u003eA part of Amazon’s transportation solution, Amazon Global Air provides an exhilarating, customer-centric transportation option to safely and efficiently deliver goods across long distances. We’re defining the future of air cargo through a talented, diverse team, leveraging innovative technologies and a sustainability-aware mindset to solve large-scale challenges. Ready for your career to take off? Fly Amazon!\u003cbr/\u003e \u003cbr/\u003e#AmazonAir #FlyAmazon\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Support, mentor, and motivate your team\u003cbr/\u003e- Lead large-scope projects with site and regional impact\u003cbr/\u003e- Create and implement productivity plans through forecast reviews, determining productivity requirements, and partnering with other Leaders to load balance\u003cbr/\u003e- Manage safety, quality, productivity, and customer delivery promises\u003cbr/\u003e- Collaborate with all support teams including Safety, Ops Integration, Loss Prevention and Human Resources to develop plans to meet business objectives\u003cbr/\u003e- Lift up to 49 pounds, stand and walk during shifts lasting up to 12 hours, and frequently push, pull, squat, bend, and reach, as well as continuously climb and descend stairs\u003cbr/\u003e- Work in an environment where the noise level varies and is subject to variable temperatures and weather (Air gateways include outside loading departments/ramp loading)\u003cbr/\u003e- Supporting all safety programs, OSHA and Air Carrier FAA compliance to ensure a safe work environment for all Associates\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs an Operations Manager, you will lead and develop a team of salaried and hourly talent. You will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. To achieve this, managers are expected to provide their team with the tools needed for success while driving improvements in productivity and efficiency through data-driven decisions and analytical problem-solving. In addition, you’ll be partnering and communicating with multiple stakeholders daily: Safety, HR, Facilities, and etc. The Air Operations Manager has complete responsibility for inbound, outbound, package sortation and ramp operations or a functional process responsibility within the hub on a specified shift or across multiple shifts.\u003cbr/\u003e\u003cbr/\u003eEligibility requirements\u003cbr/\u003e- Individuals hired into this position will have unescorted access privileges to airport security identification display areas (SIDA). For this reason, eligibility for this role will be limited to individuals who pass a security screening, as required by the FAA, DHS, and TSA (as applicable).\u003cbr/\u003e- Must be able to secure appropriate airport authority and/or US Customs security badges, if applicable.\u003cbr/\u003e- This position requires an employee’s full and unimpaired skills and judgment to safely execute their job duties to ensure the safety and security of Amazon AIR personnel, third-party contractors, Airport personnel, cargo, and equipment.  This position is therefore designated as a safety sensitive position and is subject to mandatory pre-employment and, where permitted, post-hire drug testing.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eTemperature in the Air Gateway may vary between depending on outside weather conditions and will fluctuate depending on the season and daily weather conditions. You may be working outdoors your entire shift. The ability to work outdoors in a variety of weather conditions is a must.\u003cbr/\u003e\u003cbr/\u003eAmazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. ","department_cost_center":null,"description_short":"Come build the future with Amazon Global Air! A part of Amazon’s transportation solution, Amazon Global Air provides an exhilarating, customer-centric transportation option to safely and efficiently deliver","display_distance":null,"id":"a8b0959f-b61f-4ee2-aaaf-2cdc651a4a78","id_icims":"3179253","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3179253/operations-manager-amazon-air","job_schedule_type":"full-time","location":"US, IL, Rockford","locations":["{\"normalizedStateName\":\"Illinois\",\"normalizedCountryCode\":\"USA\",\"city\":\"Rockford\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, IL, Rockford\",\"coordinates\":\"42.2669,-89.0774\",\"normalizedCountyName\":\"Winnebago\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Rockford, Illinois, USA\",\"location\":\"US, IL, Rockford\",\"region\":\"IL\",\"buildingCodeList\":[\"KRFD\"],\"normalizedCityName\":\"Rockford\"}"],"normalized_location":"Rockford, Illinois, USA","optional_search_labels":[],"posted_date":"February 11, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Bachelor's degree in Engineering, Operations, Supply Chain/Logistics, or a related field\u003cbr/\u003e- 2+ years of operations management experience\u003cbr/\u003e- Experience with process improvements (Lean Six Sigma and/or Kaizen)\u003cbr/\u003e- Master's degree in a related field\u003cbr/\u003e- 3+ years of air cargo/third party integrator ramp experience\u003cbr/\u003e- Proven track record of taking ownership and driving results\u003cbr/\u003e- Aviation related experience\u003cbr/\u003e- Possess a valid in-state driver’s license\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, IL, Rockford - 91,000.00 - 136,500.00 USD annually","primary_search_label":"transportation-and-logistics.team-airplanes","source_system":"JobCreator","state":"IL","title":"Operations Manager, Amazon Air","university_job":null,"updated_time":"2 minutes","url_next_step":"https://account.amazon.com/jobs/3179253/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-airplanes","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 4+ years of Information Technology (IT) experience, or Bachelor's degree in computer science, engineering, mathematics or equivalent\u003cbr/\u003e- 2+ years of people management experience\u003cbr/\u003e- 2+ years of operations and on-call support for data center facilities, mission critical plants, or production facilities experience","business_category":"aws","city":"Garland","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services (AIS) owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe successful candidate will be operationally responsible for a Data Center. Some high-level responsibilities include:\u003cbr/\u003e- Prioritize and assign trouble tickets to data center technicians and operators\u003cbr/\u003e- Manage the performance of a diverse team(s) of data center operation professionals with varying skills across different locations\u003cbr/\u003e- Developing Career Paths for the employees and to make updates in our internal tools.\u003cbr/\u003e- Recruit and train data technicians to ensure appropriate staffing levels\u003cbr/\u003e- Ensure effective and efficient management of day to day data center operations including queue management, 7/24 shift arrangement and hardware logistics\u003cbr/\u003e- Fast learn or act as the subject matter expert across all aspects in data center operations\u003cbr/\u003e- Ensure all operational KPIs and metrics are being measured and met\u003cbr/\u003e- Inspire and guide improvement in team process, technology innovation and automation\u003cbr/\u003e- Manage Large Scale Events (outages) and act as the call leader\u003cbr/\u003e- Manage and improve the work-flows and through-put for data centers operations\u003cbr/\u003e- Recommend, document, and oversee policies and procedures to meet industry best practices and to meet required SLAs \u003cbr/\u003e - Maintain the on-call schedule coordinating absence and vacations\u003cbr/\u003e- Be passionate about the quality and quantity of services being provided, and continuously strive to improve our Customer Experience\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAmazon Web Services (AWS) is growing rapidly, and we are looking for a Data Center Manager to join our expanding Infrastructure Operations team.\u003cbr/\u003e\u003cbr/\u003eAWS is a fast paced technology company and a leader in the world of data centers. The position will help ensure overall availability and reliability to meet or exceed defined service levels of data center operations. We are currently expanding our infrastructure management team and are looking for technology managers with experience in people management, strong technical understanding and the drive and vision to take AWS Data Center Operations to the next level. \u003cbr/\u003e\u003cbr/\u003eThe successful candidate will have experience creating/devising strategies, mentoring people in all levels, sponsoring projects and proposing technical solutions. This position involves leading teams in hardware and network diagnostics followed by physical repair and includes participation in an on-call rotation. \u003cbr/\u003e\u003cbr/\u003eAll candidates should be willing to work both independently and managing their teams effectively. Work prioritization, organizational skills, effective communication, and the ability to react quickly are critical to being successful. In addition to strong knowledge in Data Centers, hardware and network repair, candidates will create documentation, innovate solutions, participate in site-level project work, and fix complex problems within the Data Center Space. This team works in an environment that operates 24/7.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. ","department_cost_center":null,"description_short":"AWS Infrastructure Services (AIS) owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data","display_distance":null,"id":"c3c92347-5516-492f-88b4-5bd0538df345","id_icims":"3177166","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3177166/data-center-operations-night-manager-l4-dcc-communities","job_schedule_type":"full-time","location":"US, TX, Garland","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Garland\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Garland\",\"coordinates\":\"32.91427,-96.63655\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Garland, Texas, USA\",\"location\":\"US, TX, Garland\",\"region\":\"TX\",\"buildingCodeList\":[\"DFW62\"],\"normalizedCityName\":\"Garland\"}"],"normalized_location":"Garland, Texas, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"February  9, 2026","preferred_qualifications":"- 2+ years of computer hardware experience, including troubleshooting and repairing experience\u003cbr/\u003e- Experience in technical writing in a relevant field\u003cbr/\u003e- certification in an applicable field like A+, Net+, Sec+, CCNA, LPIC, Linux+, AWS certification, or A+ or CND (Certified Network Defender) or Network+ or Security+\u003cbr/\u003e- Experience with system management tools and client/server environments\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Garland - 78,400.00 - 137,300.00 USD annually","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"TX","title":"Data Center Operations Night Manager L4, DCC Communities ","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3177166/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 8+ years of tax, finance or a related analytical field experience\u003cbr/\u003e- 3+ years of advanced proficiency in Excel (pivots, lookups, etc.) experience\u003cbr/\u003e- 6+ years of Accounts Receivable or Account Payable experience\u003cbr/\u003e- 6+ years of applying key financial performance indicators (KPIs) to analyses experience\u003cbr/\u003e- 6+ years of building financial and operational reports/data sets that inform business decision-making experience\u003cbr/\u003e- 6+ years of creating process improvements with automation and analysis experience\u003cbr/\u003e- 5+ years of directly managing and leading a team of 5+ members experience","business_category":"finance","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The Mechatronics and Sustainable Packaging (MSP) team owns Amazon's end-to-end packaging strategy.  The MSP finance team is seeking an analytical, driven, and creative finance leader to support the Packaging Automation team, which designs and implements packaging automation solutions for Amazon’s fulfillment network. This position will partner with business teams to design and implement solutions to scale the program across new platforms, networks, and products, while ensuring the financial controls are in place to measure the end-to-end impact on Amazon’s cost to serve. \u003cbr/\u003e\u003cbr/\u003eThis role partners closely with the business team to measure the entitlements and performance of the packaging solutions that the team develops and deploys.  This is an exciting role for someone who enjoys influencing both strategy and tactical execution and has a passion for innovation and scale.\u003cbr/\u003e \u003cbr/\u003eTo be successful in this role, the incumbent will need excellent communication skills, strong ownership, and the ability to work with complex data sets to build financial analyses that will be used to inform MSP’s strategy and drive engagement across cross-functional stakeholders. This position comes with executive-level visibility, and experience on this team can open up several career opportunities across Amazon.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Partnering with senior leaders in Worldwide Operations and WW Ops Finance.\u003cbr/\u003e - Creating, improving, and maintaining financial analysis (ROI and NPV models) which drive operational decisions across the WW Operations Fulfillment network.\u003cbr/\u003e - Gathering analytical insights and developing financial frameworks to help improve cost to serve\u003cbr/\u003e - Driving the core financial processes for the business including Annual Operating Plans, 3 year Strategic Plan, Long Range Plan and Monthly/Quarterly Business Reviews.\u003cbr/\u003e - Completing cost / benefit analyses and communicate key drivers / inputs to support business decisions. \u003cbr/\u003e - Performing financial reporting, deep project analyses, and financial modeling.\u003cbr/\u003e - Facilitating financial review meetings with business groups and working with business managers to ensure effective finance and cost management.\u003cbr/\u003e- Communicating financial and business results including variance analyses to senior business leaders.\u003cbr/\u003e","department_cost_center":null,"description_short":"The Mechatronics and Sustainable Packaging (MSP) team owns Amazon's end-to-end packaging strategy.  The MSP finance team is seeking an analytical, driven, and creative finance leader to support the Packaging","display_distance":null,"id":"d557a90d-9ada-4b98-a398-27be042c854c","id_icims":"3107078","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/Planning","job_function_id":null,"job_path":"/en/jobs/3107078/finance-manager-mechatronics-sustainable-packaging","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Nashville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Nashville\",\"coordinates\":\"36.16792,-86.77798\",\"normalizedCountyName\":\"Davidson\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Nashville, Tennessee, USA\",\"location\":\"US, TN, Nashville\",\"region\":\"TN\",\"buildingCodeList\":[\"BNA12\"],\"normalizedCityName\":\"Nashville\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA90\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA112\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"October 13, 2025","preferred_qualifications":"- 6+ years of participating in continuous improvement projects in your team to scale and improve controllership with measurable results experience\u003cbr/\u003e- 6+ years of identifying incomplete or inaccurate data, identifying the root cause and creating/implementing an escalation plan experience\u003cbr/\u003e- 6+ years of mentoring junior finance and/or business team members experience\u003cbr/\u003e- 3+ years of working with senior staff (e.g. c-suite) experience\u003cbr/\u003e- MBA, or CFA\u003cbr/\u003e- Experience working with large-scale data mining and reporting tools (i.e. SQL, MSAccess, Essbase or Cognos) and providing recommendations based on results of ad hoc analyses to management for strategic decision-making\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TN, Nashville - 125,200.00 - 169,400.00 USD annually\u003cbr/\u003eUSA, WA, Bellevue - 139,100.00 - 188,200.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 139,100.00 - 188,200.00 USD annually","primary_search_label":"finance.team-consumer","source_system":"JobCreator","state":"WA","title":"Finance Manager, Mechatronics Sustainable Packaging","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3107078/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-consumer","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of engineering team management experience\u003cbr/\u003e- 7+ years of working directly within engineering teams experience\u003cbr/\u003e- 3+ years of designing or architecting (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Knowledge of engineering practices and patterns for the full software/hardware/networks development life cycle, including coding standards, code reviews, source control management, build processes, testing, certification, and livesite operations\u003cbr/\u003e- Experience partnering with product or program management teams","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon's low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon Leo will serve people and organizations operating in locations without reliable connectivity.\u003cbr/\u003e\t\u003cbr/\u003eExport Control Requirement: Due to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eAs a leader of the Satellite Test Design team, you will lead and engage an experienced, cross-disciplinary team to conceive, develop, implement, and operate frameworks and services for testing integrated satellite components.\u003cbr/\u003e\u003cbr/\u003eAs a manager of the team you will play a crucial role in ensuring Leo's readiness for manufacturing and launch through detailed and efficient test operations. You will work closely with internal engineering and manufacturing teams across ground and space systems to help architect and implement advanced test infrastructure and code.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Build, lead, and manage a diverse team of engineers focused on development frameworks and production services to support satellite manufacturing environments  while leveraging technologies such as Python, Docker, and AWS technologies (e.g., APIGW, ECS, ECR, CDK, S3, IAM, and CloudFront).\u003cbr/\u003e\u003cbr/\u003e- Provide technical guidance for the team in addressing projects with broad scope and limited definition to ensure test and design objectives are met.\u003cbr/\u003e\u003cbr/\u003e- Define team growth expectations and organization strategy.\u003cbr/\u003e\u003cbr/\u003e- Coordinate internal and external resources to ensure team and project success.\u003cbr/\u003e\u003cbr/\u003e- Develop innovative hardware, software, and processes to optimize and improve testing capabilities and processes.\u003cbr/\u003e\u003cbr/\u003e- Provide technical leadership for integration campaigns and collaborate with responsible engineers, manufacturing engineers, software developers, and tooling teams to deliver a thoroughly tested spacecraft ready for launch.\u003cbr/\u003e\u003cbr/\u003e- Communicate fluidly across a variety of teams to identify product risks and how they will be addressed to ensure mission success.\u003cbr/\u003e\u003cbr/\u003e- Juggle multiple priorities while optimizing the system and schedule.\u003cbr/\u003e\u003cbr/\u003e- Apply critical thinking in complex situations and ambiguous environments.\u003cbr/\u003e\u003cbr/\u003e- Conduct cause of error analysis and drive issue resolutions to improve team and process performance.","department_cost_center":null,"description_short":"Amazon Leo is Amazon's low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to","display_distance":null,"id":"966255cf-fe4d-4505-9fb3-62b4cd26b8a7","id_icims":"3145352","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3145352/software-development-manager-integrated-vehicle-testing","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA99\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":["alexa-and-amazon-devices.team-hardware-development-job-family","alexa-and-amazon-devices.team-software-development-job-family"],"posted_date":"December 18, 2025","preferred_qualifications":"- Experience in communicating with users, other technical teams, and senior leadership to collect requirements, describe software product features, technical designs, and product strategy\u003cbr/\u003e- Experience in recruiting, hiring, mentoring/coaching and managing teams of Software Engineers to improve their skills, and make them more effective, product software engineers\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, REDMOND - 184,900.00 - 250,200.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Software Development Manager, Integrated Vehicle Testing","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3145352/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- PhD, or Master's degree and 4+ years of quantitative field research experience\u003cbr/\u003e- Experience investigating the feasibility of applying scientific principles and concepts to business problems and products\u003cbr/\u003e- Experience analyzing both experimental and observational data sets","business_category":"selling-partner-services","city":"Vancouver","company_name":"Amazon Development Centre Canada ULC","country_code":"CAN","description":"The Brand Registry Science team is looking for a talented scientist to help solve complex problems faced by brands using the latest science solutions. In this role, you will work closely will product team and engineering partners to launch the solution into production and owning the end-to-end solution. \u003cbr/\u003e\u003cbr/\u003eWe are looking for a highly talented scientist to help build our vision for agent-based intelligent automation. As an research scientist on the team, you will use large language models' techniques to build automated AI solutions that thinks like human to assist decision making and eventually make autonomous decisions that impacts millions of brands, selling partners, and customers. You will work backwards from data insights and customer feedback to build the right machine learning solutions, collaborate with other domain experts in finding innovative solutions to unsolved problems.  \u003cbr/\u003e\u003cbr/\u003eAn ideal candidate should have extensive experience driving large-scale Machine Learning initiatives, specially in GenAI and LLM applications, from conception to launch in a rapidly evolving environment. Amazon’s growth requires leaders who move fast, have an entrepreneurial spirit to create new solutions, have an unrelenting tenacity to get things done, and are capable of breaking down and solving complex problems.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Understand business challenges by analyzing data and customer feedback \u003cbr/\u003e- Collaborate with tech and product teams on building ML strategies, experimentation, implementation and continuous improvement \u003cbr/\u003e- Analyze and extract relevant information from large amounts of both structured and unstructured data to design strategies to solve business problems. \u003cbr/\u003e- Use large language models and machine learning techniques to create scalable solutions for business problems \u003cbr/\u003e- Create business and analytics reports and present to the senior management teams \u003cbr/\u003e- Research and implement novel AI solutions and publish research papers\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003e ","department_cost_center":null,"description_short":"The Brand Registry Science team is looking for a talented scientist to help solve complex problems faced by brands using the latest science solutions. In this role, you will work closely will product team","display_distance":null,"id":"7a4bd4af-8c5a-4ac1-bab0-652c05caeb8f","id_icims":"3178384","is_intern":null,"is_manager":null,"job_category":"Research Science","job_family":"Research Science","job_function_id":null,"job_path":"/en/jobs/3178384/research-scientist-ii-brand-registry","job_schedule_type":"full-time","location":"CA, BC, Vancouver","locations":["{\"normalizedStateName\":\"British Columbia\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Vancouver\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, BC, Vancouver\",\"coordinates\":\"49.26038,-123.11336\",\"normalizedCountyName\":\"Metro Vancouver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Vancouver, British Columbia, CAN\",\"location\":\"CA, BC, Vancouver\",\"region\":\"BC\",\"buildingCodeList\":[\"YVR14\"],\"normalizedCityName\":\"Vancouver\"}","{\"normalizedStateName\":\"Ontario\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Toronto\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, ON, Toronto\",\"coordinates\":\"43.64869,-79.38544\",\"normalizedCountyName\":\"Toronto\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Toronto, Ontario, CAN\",\"location\":\"CA, ON, Toronto\",\"region\":\"ON\",\"buildingCodeList\":[\"YYZ14\"],\"normalizedCityName\":\"Toronto\"}"],"normalized_location":"Vancouver, British Columbia, CAN","optional_search_labels":[],"posted_date":"February 11, 2026","preferred_qualifications":"- Knowledge of R, MATLAB, Python or similar scripting language\u003cbr/\u003e- Experience with agile development\u003cbr/\u003e- Experience building web based dashboards using common frameworks\u003cbr/\u003e- Demonstrated experience leveraging generative AI tools to enhance workflow efficiency and productivity, with the ability to craft effective prompts and critically evaluate AI-generated outputs in a professional setting\u003cbr/\u003e- Experience identifying opportunities to integrate AI solutions into products and services to drive business value\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(34, 34, 34)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. As a total compensation company, Amazon's package may include other elements such as sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon offers comprehensive benefits including health insurance (medical, dental, vision, prescription, basic life \u0026amp; AD\u0026amp;D insurance), Registered Retirement Savings Plan (RRSP), Deferred Profit Sharing Plan (DPSP), paid time off, and other resources to improve health and well-being. We thank all applicants for their interest, however only those interviewed will be advised as to hiring status.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eCAN, BC, Vancouver - 126,300.00 - 210,900.00 CAD annually\u003cbr/\u003eCAN, ON, Toronto - 126,300.00 - 210,900.00 CAD annually","primary_search_label":"selling-partner-services.no-team-listed","source_system":"JobCreator","state":"BC","title":"Research Scientist II, Brand Registry","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3178384/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor’s degree in electrical engineering, aerospace engineering, computer science or a related field.\u003cbr/\u003e- 5+ years of hands-on testing experience.\u003cbr/\u003e- 5+ years in design and validation of hardware systems.\u003cbr/\u003e- 5+ years in a development environment\u003cbr/\u003e- 5+ years experience developing and executing test plans for complex aerospace, automotive or consumer electronics systems.\u003cbr/\u003e- 2+ years of scripting or programming experience (Python, MATLAB, C)\u003cbr/\u003e","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the capacity, flexibility, and performance to serve a wide range of customers, from individual households to schools, hospitals, businesses, government agencies, and other organizations operating in locations without reliable connectivity.\u003cbr/\u003e\t\u003cbr/\u003eExport Control Requirement: Due to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eWe are looking for an experienced Senior Satellite Test Engineer to help architect cutting edge test infrastructure and take satellites from initial build, through functional testing, spacecraft validation, and chart the path to reliably integrating and launching thousands of satellites. \u003cbr/\u003e\u003cbr/\u003eThis is a fast-paced, intellectually challenging opportunity to work with thought leaders in multiple technology areas. You’ll have relentlessly high standards for yourself and everyone you work with, and you’ll be constantly looking for ways to improve. We want individuals who want to reach beyond what is possible today. Everyone on the team needs to be entrepreneurial, wear many hats and work in a highly collaborative environment. Our team is responsible for development and implementation of test hardware and test campaigns for integrated vehicle testing.\u003cbr/\u003e\u003cbr/\u003eAs Amazon Leo Satellite Test Engineer you will work with multiple engineering and manufacturing teams across ground and space systems to specify test equipment requirements, develop test plans and complex test commanding scripts and execute test campaigns to support development and production test initiatives. Your focus will be in optimization of test processes to enable Amazon Leo production plans. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Develop, augment, and support testing of components, from subsystems to the full spacecraft to determine suitability for flight.\u003cbr/\u003e- Lead the definition and implementation of organization wide test strategies to mitigate product risks to stakeholders.\u003cbr/\u003e- Work with avionics, payload and software teams to gather requirements, design test plans, determine applicable test cases, and prepare for test execution.\u003cbr/\u003e- Own vehicle level test campaigns and collaborate with responsible engineers, manufacturing engineers, software developers, tooling teams and ground support teams to deliver a thoroughly tested spacecraft ready for launch.\u003cbr/\u003e- Communicate fluidly across a variety of teams to identify product risks and how they will be addressed to ensure mission success.\u003cbr/\u003e- Develop complex test automation sequences using scripting languages such as Python and MATLAB.\u003cbr/\u003e- Develop innovative hardware and processes to optimize and improve testing capabilities.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Integrated Vehicle Test team is responsible for development and execution of test plans to ensure reliable operation of satellite vehicles in space. The team’s responsibilities include process development, test hardware and software development and test execution for qualification vehicles and improving and scaling processes for production cadence. The tasks and daily focus change rapidly, and you will often take on exciting new responsibilities to ensure project success. Expect to be deployed to address complex problems by identifying the scope of the issue and quickly establishing innovative and functional solutions.","department_cost_center":null,"description_short":"Amazon Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the","display_distance":null,"id":"51bdc584-601c-427b-bb7a-3d68cef3335a","id_icims":"3019928","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"Interdisciplinary Systems Engr","job_function_id":null,"job_path":"/en/jobs/3019928/sr-satellite-test-engineer-amazon-leo-integrated-vehicle-testing","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA99\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":["alexa-and-amazon-devices.team-hardware-development-job-family"],"posted_date":"June 26, 2025","preferred_qualifications":"- Experience in development of test plans and protocols related to established Space Hardware test processes (GEVS / SMC-S-016)\u003cbr/\u003e- 5+ years experience with integration and testing of satellite hardware.\u003cbr/\u003e- 5+ years experience in a development environment.\u003cbr/\u003e- 5+ years of scripting or programming experience (Python, MATLAB, C)\u003cbr/\u003e- Demonstrated ability to plan and execute test campaigns on complex systems.\u003cbr/\u003e- Experience as a technical lead, leading small groups of engineers through product development or test campaigns.\u003cbr/\u003e- Demonstrated ability to apply critical thinking in complex situations\u003cbr/\u003e- Excellent problem-solving, root causing and analysis skills\u003cbr/\u003e- Strong organizational, analytical, and root cause analysis skills\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, REDMOND - 151,200.00 - 204,600.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Sr. Satellite Test Engineer, Amazon Leo Integrated Vehicle Testing","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3019928/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"aws","city":"Cupertino","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services is looking for Software Development Engineers to develop state of the art Linux based networking platforms. You will join a team of engineers developing embedded routing platforms that enable one of the world's largest and complex networks.\u003cbr/\u003e\u003cbr/\u003eWe are seeking engineers with a demonstrated track record of designing and implementing Linux-based solutions on embedded devices, ideally for networking products. We want people who are passionate about changing the way data center networking is done.\u003cbr/\u003e\u003cbr/\u003ePlenty of complexity and scope for your next challenge! Why would you want to work on network devices for Amazon?\u003cbr/\u003e\u003cbr/\u003e   \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e You like to get stuff done and solve complex, impactful problems.\u003cbr/\u003e    AWS develops both the network and the devices, allowing us to innovate in a way that others cannot.\u003cbr/\u003e    Amazon’s network is global in scope and it continues to grow: most of the network runs on our switches and we continue to expand our footprint.\u003cbr/\u003e    Very large impact: these devices are central to Amazon.com (http://amazon.com/), AWS and more AWS customers.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThere are two main components to forwarding the Linux Kernel and it’s constructs for L2/L3 forwarding and management, and the underlying hardware.\u003cbr/\u003e\u003cbr/\u003eOur goal is to have the Kernel state and the hardware state mirror one another, and as such we need people that have expertise in Linux kernel and core networking expertise. Ideally you understand both how Linux manages forwarding as well as how that maps to the underlying forwarding hardware.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe are the Data Plane team and are split between Cupertino, Seattle, and Raleigh; and are looking to expand in either site. Our team owns packet forwarding in our networking devices; that is, the core functionality of a networking switch.\u003cbr/\u003e\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eWorking at AWS in the Core Networking Team • Meet Matt, Director, Core Networking --- https://youtu.be/DqTStjRtjX4 \u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"c07fcf75-1e58-49e0-9459-3bb12563b614","id_icims":"3188290","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3188290/software-development-engineer-data-plane-network-product-development","job_schedule_type":"full-time","location":"US, CA, Cupertino","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA29\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"North Carolina\",\"normalizedCountryCode\":\"USA\",\"city\":\"Raleigh\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NC, Raleigh\",\"coordinates\":\"35.78543,-78.6427\",\"normalizedCountyName\":\"Wake\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Raleigh, North Carolina, USA\",\"location\":\"US, NC, Raleigh\",\"region\":\"NC\",\"buildingCodeList\":[\"RDU11\"],\"normalizedCityName\":\"Raleigh\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Cupertino\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Cupertino\",\"coordinates\":\"37.31913,-122.02929\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Cupertino, California, USA\",\"location\":\"US, CA, Cupertino\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC3\"],\"normalizedCityName\":\"Cupertino\"}"],"normalized_location":"Cupertino, California, USA","optional_search_labels":["aws.team-neteng","aws.team-ais"],"posted_date":"February 24, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Cupertino - 165,200.00 - 223,600.00 USD annually\u003cbr/\u003eUSA, NC, Raleigh - 143,700.00 - 194,400.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 143,700.00 - 194,400.00 USD annually","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"CA","title":"Software Development Engineer, Data Plane, Network Product Development","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3188290/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"operations","city":"Mexico City","company_name":"Servicios Comerciales Amazon Mexico S. de R.L. de C.V.","country_code":"MEX","description":"We are seeking a highly skilled and motivated software engineer to join our team in the commercial real estate industry. In this role, you will work at a global scale to solve real-world challenges that will transform Amazon’s approach to Industrial Real Estate in ways we can’t even image yet. You will by applying tools in workflow automation, geospatial intelligence and mapping, and artificial intelligence. You will work closely with a team of experts to develop and implement innovative technology solutions that will revolutionize the way our stakeholders conduct business.\u003cbr/\u003e\u003cbr/\u003eThis is a fantastic opportunity for a strong software engineer looking to make a significant impact in the commercial real estate industry. You will have the chance to work on innovative technology solutions that will transform the way our clients do business. We offer competitive compensation, comprehensive benefits, and a dynamic work environment where you will be challenged and rewarded for your contributions. We invent every day. We are Global Realty Technologies and we will give you the tools and support you need to invent with us in ways that are rewarding, fulfilling and fun. If you are a strong developer with a passion for innovation, we encourage you to apply today.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e- Lead, mentor, challenge and grow other software engineers on the team\u003cbr/\u003e - Develop and implement software solutions that leverage workflow automation, geospatial intelligence and mapping, and artificial intelligence to improve our clients' business processes\u003cbr/\u003e - Collaborate with cross-functional teams to design, develop, and deploy innovative software solutions that meet our clients' needs\u003cbr/\u003e - Actively engage and participate in software architecture and design reviews\u003cbr/\u003e - Maintain and enhance existing software applications to ensure they meet the evolving needs of the business\u003cbr/\u003e - Write clean, efficient, and well-documented code that adheres to industry best practices\u003cbr/\u003e - Participate in code reviews and provide constructive feedback to peers\u003cbr/\u003e - Stay up-to-date with emerging technologies and industry trends to ensure our software solutions remain at the forefront of the industry\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eGlobal Realty Tech manages software tools to centralize data about what buildings Amazon launches. Since inception, these tools have grown to encompass Amazon's worldwide operations (outside physical stores): we now cover thousands of active new launches, retrofit, and lease-related projects. We create global standards for managing data related to these capital projects.\u003cbr/\u003e\u003cbr/\u003eInclusive team culture \u003cbr/\u003eAt Amazon we embrace our differences and we are committed to furthering our culture of inclusion. We host annual and ongoing learning experiences. Amazon’s culture of inclusion is reinforced within our Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust\u003cbr/\u003e\u003cbr/\u003eWork Life Balance \u003cbr/\u003eWe believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfillment. We offer flexibility in working hours and encourage you to find your own balance between your work and personal lives.\u003cbr/\u003e\u003cbr/\u003eMentorship\u0026 Career Growth \u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded professional. ","department_cost_center":null,"description_short":"We are seeking a highly skilled and motivated software engineer to join our team in the commercial real estate industry. In this role, you will work at a global scale to solve real-world challenges that","display_distance":null,"id":"1b53bf18-8ac3-4ff4-a7e0-ef0cc817255e","id_icims":"3150708","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3150708/software-development-engineer-global-realty-technology","job_schedule_type":"full-time","location":"MX, DIF, Mexico City","locations":["{\"normalizedStateName\":\"Mexico City\",\"normalizedCountryCode\":\"MEX\",\"city\":\"Mexico City\",\"countryIso3a\":\"MEX\",\"countryIso2a\":\"MX\",\"locationNonStemming\":\"Mexico, DIF, Mexico City\",\"coordinates\":\"19.43195,-99.13315\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Mexico\",\"normalizedLocation\":\"Mexico City, Mexico City, MEX\",\"location\":\"MX, DIF, Mexico City\",\"region\":\"DIF\",\"buildingCodeList\":[\"MEX16\"],\"normalizedCityName\":\"Mexico City\"}"],"normalized_location":"Mexico City, Mexico City, MEX","optional_search_labels":["fulfillment-operations.wwre-roles","mx-stores","mexico-sde"],"posted_date":"December 31, 2025","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"operations.team-technology","source_system":"JobCreator","state":"DIF","title":"Software Development Engineer, Global Realty Technology","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3150708/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-technology","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"fulfillment-and-operations","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join Amazon's Last Mile Technology Revolution!\u003cbr/\u003e\u003cbr/\u003eAre you ready to reshape the future of logistics? Join us in transforming how millions of packages reach their final destination through state of the art technology and innovation!\u003cbr/\u003e\u003cbr/\u003eThe Last Mile Technology organization is pioneering advanced solutions that are revolutionizing Amazon Logistics (AMZL). Our mission is to create intelligent, efficient, and scalable systems that will transform the delivery experience. We're building the future of last-mile logistics while maintaining Amazon's highest standards for safety and reliability.\u003cbr/\u003e\u003cbr/\u003eThe Last Mile challenge is a fascinating blend of real-world complexity and technological innovation. We're tackling multidimensional problems that involve orchestrating complex delivery networks, optimizing routes through dynamic environments, and adapting to everything from unexpected city events to seasonal weather patterns – all while ensuring every package arrives as per our promise.\u003cbr/\u003e\u003cbr/\u003eAs a Software Development Engineer on our Last Mile Technology team, you'll be at the forefront of solving these intricate puzzles. You'll work on systems that make intelligent decisions in real-time, optimize complex logistics networks, and coordinate thousands of delivery events across diverse geographical areas. Our systems must excel in environments ranging from dense urban centers to suburban neighborhoods, each presenting unique challenges that require innovative solutions.\u003cbr/\u003e\u003cbr/\u003eWhat Makes This Role Exciting:\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e    Real-World Impact: Your code will power systems that deliver millions of packages to customers, making their lives better every day\u003cbr/\u003e\u003cbr/\u003e    Scale That Matters: Build systems that coordinate thousands of delivery events across different cities, weather conditions, and scenarios\u003cbr/\u003e\u003cbr/\u003e    State of the Art Tech Stack: Leverage the latest in Gen-AI, machine learning, IoT, and cloud computing to solve real-world problems\u003cbr/\u003e\u003cbr/\u003e    Innovation at Scale: Create entirely new approaches to last-mile delivery challenges\u003cbr/\u003e\u003cbr/\u003e    End-to-End Ownership: Work on complete solutions from route optimization to fleet management, from simulation to real-world deployment\u003cbr/\u003e","department_cost_center":null,"description_short":"Join Amazon's Last Mile Technology Revolution!Are you ready to reshape the future of logistics? Join us in transforming how millions of packages reach their final destination through state of the art technology","display_distance":null,"id":"788ab8eb-d3cc-4432-97bb-3b94d83c7202","id_icims":"3176580","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3176580/software-development-engineer-last-mile-delivery","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA94\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"February  9, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Bellevue - 143,700.00 - 194,400.00 USD annually","primary_search_label":"fulfillment-and-operations.team-last-mile-delivery","source_system":"JobCreator","state":"WA","title":"Software Development Engineer, Last Mile Delivery ","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3176580/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-delivery","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- Experience owning/driving roadmap strategy and definition\u003cbr/\u003e- Experience with feature delivery and tradeoffs of a product\u003cbr/\u003e- Experience contributing to engineering discussions around technology decisions and strategy related to a product\u003cbr/\u003e- Experience managing technical products or online services\u003cbr/\u003e- Experience in representing and advocating for a variety of critical customers and stakeholders during executive-level prioritization and planning","business_category":"kindlecontent","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Are you passionate about languages and translation? Are you motivated to have a direct impact on customers around the world? Do you have a tech background and love finding creative solutions to challenging problems? Amazon's Translation Services team is responsible for building the tools and features that support the localization and translation needs of all Amazon businesses. We partner with content owners to translate and deliver content for customers around the world, and we are obsessed with providing the right quality content in each language we support. We are looking for a Senior Product Manager to create the vision, strategy, and roadmap that will continually improve and scale our services and deliver the best experience for our customers in their preferred language. If you are passionate about building equitable experiences for worldwide customers and are undaunted by large scope, let’s talk.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs a Senior Product Manager - Technical, you will own the strategy and execution of one of the product charters within the Translation Services space. You will partner with stakeholders across the business -- content owners, localization program managers, and translators -- to understand their biggest problems and opportunities, then build a backlog of features to address those problems. You will work closely with one or more software development teams to define and build those features, then measure the features' ability to successfully meet your stakeholders' needs. You will own the following deliverables: documentation of your product's vision; assessment of entitlement and ROI for your product roadmap; feature requirements and user stories; experimentation set-up and analysis; and release notes. You must be able to be deeply connected to the customer experience, product details, and success metrics, yet be able to zoom out to the 10,000-foot level to understand how your charter fits into the broader Translation Services ecosystem and Amazon as a whole.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThere may not be a typical day. One day you may be leading a vision workshop or presenting to a VP, and the next day conducting a deep dive into a customer anecdote or collaborating with your software development and UX Design partners to build a feature. But what is consistent is always have your charter’s goals and progress top of mind, driving clarity and stakeholder alignment, and looking around corners to anticipate problems that may affect individual or team outcomes.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe team consists of Product Managers, Program Managers, and Software Developers located in Seattle, Barcelona, and Hyderabad. The central team builds end-to-end translation technology, optimizing the quality and cost of translations across all of Amazon's content. We build state of the art translation technology: traditional and LLM-based machine translation, computer-aided translation, translation memories and term bases, LLM-based QA, dynamic workflow/routing decisions, etc.) to streamline productivity and ensure consistent quality.","department_cost_center":null,"description_short":"Are you passionate about languages and translation? Are you motivated to have a direct impact on customers around the world? Do you have a tech background and love finding creative solutions to challenging","display_distance":null,"id":"af14f4b2-d838-4a9d-9ada-9a7d6e8f0eb6","id_icims":"3152666","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Product Management - Technical","job_function_id":null,"job_path":"/en/jobs/3152666/sr-product-manager-technical-translation-services","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA86\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"January  5, 2026","preferred_qualifications":"- Experience in using analytical tools, such as Tableau, Qlikview, QuickSight\u003cbr/\u003e- Experience in building and driving adoption of new tools\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 151,200.00 - 204,600.00 USD annually","primary_search_label":"kindlecontent.team-no-team-listed","source_system":"JobCreator","state":"WA","title":"Sr. Product Manager -Technical, Translation Services","university_job":null,"updated_time":"19 minutes","url_next_step":"https://account.amazon.com/jobs/3152666/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}