{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Bachelor's degree or above\u003cbr/\u003e- 4+ years of doing one of several roles: quantitative/financial analysis, retail buying, retail planning \u0026 allocation, product/project management, pricing, marketing or e-commerce experience\u003cbr/\u003e- Experience collaborating and influencing multiple teams across multiple organizations\u003cbr/\u003e- Experience handling ambiguous or undefined challenges through strong problem solving abilities\u003cbr/\u003e- Experience in written and oral communication, including the ability to communicate with all levels in the organization (technical, business, executive)","business_category":"worldwide-grocery-stores","city":"Austin","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Whole Foods Market is seeking a dynamic category merchant to lead our Packaged Seafood category in Austin, TX. \u003cbr/\u003eAre you a data-driven strategist with a passion for a fast paced and dynamic set of categories? Join our team and drive innovation, profitability, and customer satisfaction.\u003cbr/\u003eIn this high visibility role, you'll develop category goals, strategies, and assortments tailored to our customers. You'll collaborate cross-functionally to execute category resets, manage supplier relationships, and deliver business results through data-rich, customer-centric product selection, pricing, presentation, and promotion.  \u003cbr/\u003eYou'll get to contribute to a team that is leading the industry in advancing sustainability standards, and drive innovation with suppliers. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tStrategize \u0026 Innovate: Create data-driven customer centric category strategies that leverage customer insights, market trends, and competitive analysis.\u003cbr/\u003e•\tDrive Success: Take ownership of the financial performance for your category. Develop and execute pre-season strategies that align with our business goals. \u003cbr/\u003e•\tCurate Assortments: Collaborate with suppliers to bring the best products to our stores and online channels. Lead line reviews, assortment planning, and item forecasting. \u003cbr/\u003e•\tPricing \u0026 Promotion: Help shape pricing strategies that balance profitability with customer value. Work with marketing teams to support impactful promotional events. \u003cbr/\u003e•\tSupplier Relationships: Build and maintain strong partnerships with suppliers. Negotiate for early access to new products, exclusive items, and competitive costs. \u003cbr/\u003e•\tItem Management: Maintain accurate item level data in partnership with support teams that adhere to regulatory compliance. \u003cbr/\u003e•\tCross-Functional Collaboration: Work closely with Merchandising Planning, Operations, Procurement, and other teams to ensure smooth execution of category goals. \u003cbr/\u003e•\tAnalyze \u0026 Adapt: Monitor category performance and adapt strategies based on data insights. Lead testing initiatives to continuously improve our offerings. \u003cbr/\u003e•\t Brand Advocacy. Consistently represent and promote our brand values, products and mission, acting as a trusted representative internally and externally.\u003cbr/\u003e•\tMentorship: Share your knowledge and experience by coaching other team members.","department_cost_center":null,"description_short":"Whole Foods Market is seeking a dynamic category merchant to lead our Packaged Seafood category in Austin, TX. Are you a data-driven strategist with a passion for a fast paced and dynamic set of categories?","display_distance":null,"id":"c1557ec6-2ee3-4e09-9e54-515ce35a3f85","id_icims":"3169704","is_intern":null,"is_manager":null,"job_category":"Buying, Planning, \u0026 Instock Management","job_family":"Buying/Planning","job_function_id":null,"job_path":"/en/jobs/3169704/senior-category-manager-packaged-seafood-seafood-merchandising","job_schedule_type":"full-time","location":"US, TX, Austin","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"WFM50092\"],\"normalizedCityName\":\"Austin\"}"],"normalized_location":"Austin, Texas, USA","optional_search_labels":[],"posted_date":"January 29, 2026","preferred_qualifications":"- Experience identifying, mitigating, and managing business risks and tradeoffs\u003cbr/\u003e- Experience with sustainably sourced seafood and working knowledge of the Marine Stewardship Council, Aquaculture Stewardship Council, and Monterey Bay Seafood Watch Program.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Austin - 140,300.00 - 189,800.00 USD annually","primary_search_label":"worldwide-grocery-stores.team-whole-foods-market","source_system":"JobCreator","state":"TX","title":"Senior Category Manager, Packaged Seafood, Seafood Merchandising","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3169704/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-whole-foods-market","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Leesburg","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"77945eaa-a136-45e6-9828-a7c7eb87d05d","id_icims":"3153191","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3153191/engineering-operations-technician","job_schedule_type":"full-time","location":"US, VA, Leesburg","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Leesburg\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Leesburg\",\"coordinates\":\"39.1158,-77.56578\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Leesburg, Virginia, USA\",\"location\":\"US, VA, Leesburg\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD667\"],\"normalizedCityName\":\"Leesburg\"}"],"normalized_location":"Leesburg, Virginia, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"January  6, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Technical (Military/Trade School) training\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Leesburg - 31.00 - 55.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"VA","title":"Engineering Operations Technician","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3153191/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Work a flexible schedule including weekends, nights, and holidays\u003cbr/\u003e- 18+ months of computer/server hardware troubleshooting or related IT experience\u003cbr/\u003e- 18+ months of computer layer 1/2 networking experience (including troubleshooting and repair)\"","business_category":"aws","city":"Mesa","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring seamless data center operations that power millions of businesses and services worldwide. \u003cbr/\u003eData Center Technician position involves in-depth hardware and network diagnostics followed by physical repair as well as participating in an on-call rotation. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e-Performing server rack installations, hardware break-fix on various components, troubleshooting network issues, responding to operational incidents that impact service availability, and carrying out routine network, server hardware, and operating system repairs to contribute to the overall availability of AWS services \u003cbr/\u003e-Serving as a primary contact point for both internal and external stakeholders, including engineers, software developers, vendors, and contractors \u003cbr/\u003e-Performing on-call duties and participating in scheduled maintenance and change management activities \u003cbr/\u003e-Contributing to documentation and process improvement initiatives based on your analysis of operational issues \u003cbr/\u003e-Helping to interview, train and onboard new team members \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e-Lifting and moving material up to 40 pounds each \u003cbr/\u003e-Working in cramped and/or elevated locations \u003cbr/\u003e-Bending, lifting, stretching, and reaching \u003cbr/\u003e-Standing and walking for up to 8+ hours a day \u003cbr/\u003e-Ascending and descending ladders, stairs, and gangways safely and without limitation \u003cbr/\u003e\u003cbr/\u003eWork in an industrial environment \u003cbr/\u003e-Work shifts longer than 8 hours to support 24/7 operations (covering both night and day shifts). \u003cbr/\u003e-This role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e-Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e-Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e-Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eOur Data Center Technician professionals, who have industry-leading technical abilities and demonstrate a breadth of knowledge while they: \u003cbr/\u003e\u003cbr/\u003e-Take ownership of technical issues brought by their customer base, engaging other teams when needed to drive resolution \u003cbr/\u003e-Show a strong aptitude for troubleshooting and problem solving \u003cbr/\u003e-Solve problems at their root and step back to understand the broader context \u003cbr/\u003e-Maintain service level agreements through the implementation of proactive issue detection and reporting \u003cbr/\u003e-Are biased to act in the absence of direction or support \u003cbr/\u003e-Improve effectiveness through process innovation \u003cbr/\u003e\u003cbr/\u003e You will be required to work shift work that will include days/nights/weekends/holidays. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring","display_distance":null,"id":"fccd434d-3fbc-45ba-95e3-8b0691a39ada","id_icims":"3153201","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3153201/data-center-technician","job_schedule_type":"full-time","location":"US, AZ, Mesa","locations":["{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Mesa\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Mesa\",\"coordinates\":\"33.41704,-111.83146\",\"normalizedCountyName\":\"Maricopa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Mesa, Arizona, USA\",\"location\":\"US, AZ, Mesa\",\"region\":\"AZ\",\"buildingCodeList\":[\"PHX53\"],\"normalizedCityName\":\"Mesa\"}"],"normalized_location":"Mesa, Arizona, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"January  6, 2026","preferred_qualifications":"- Experience in a data center or other critical environment\u003cbr/\u003e- Bachelor's degree or equivalent professional or military experience in an IT-related field (e.g. computer science, network engineering, etc.)\u003cbr/\u003e- Industry standard certifications (CompTIA, CCENT, Network+)\u003cbr/\u003e- Understanding of Linux or similar operating systems\u003cbr/\u003e- Behavioral interviewing and hiring experience\u003cbr/\u003e- Experience training and onboarding of new team members\"\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, AZ, Mesa - 29.00 - 52.00 USD hourly","primary_search_label":"aws.team-it-services","source_system":"JobCreator","state":"AZ","title":"Data Center Technician ","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3153201/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-it-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of senior level leadership support, or 3+ years of Amazon experience\u003cbr/\u003e- High school or equivalent diploma\u003cbr/\u003e- Experience with Microsoft Office products and applications\u003cbr/\u003e- Experience with executive level calendar management\u003cbr/\u003e- Experience handling administrative details independently, while exercising good judgment in keeping team members adequately informed\u003cbr/\u003e- Experience with domestic or international travel coordination\u003cbr/\u003e- Strong organizational, communication, and interpersonal skills\u003cbr/\u003e- Strong organizational, communication, and interpersonal skills","business_category":"no-business-category","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The Worldwide Amazon Stores organization is looking for an Executive Assistant who wants to work in a fast-paced, exciting, and growing organization. We are looking for someone to support two Directors on our Trustworthy Shopping Experience team in Seattle, WA.\u003cbr/\u003e\u003cbr/\u003eThe Trustworthy Shopping Experience (TSE) team strives to guarantee customers a worry-free shopping journey on Amazon. We provide a trustworthy listing discovery experience by (1) eliminating catalog defects and discovery risk, and (2) ensuring listings are compliant with regulations and policy. We provide a trustworthy order experience by (3) connecting customers with selling partners with a good track record of order performance, (4) ensuring customers receive authentic products in the condition they expect, and (5) in the rare chance the order experience does not meet customer expectations, protecting them by making things right with our A-to-z Guarantee. We do all of this in close partnership with our selling partners and we work hard to (6) provide selling partners a positive and friction-free experience. Last, we fully recognize we are not perfect and (7) we leverage our incident management process to embrace anecdotes of negative customer and selling partner experiences as opportunities to eliminate root causes of defects.\u003cbr/\u003e\u003cbr/\u003eThis Executive Assistant will be responsible for handling confidential information and maintaining professionalism in dealing with senior executives. Role responsibilities include managing multiple complex calendars, planning and organizing events of all sizes, and coordinating domestic and international travel. This candidate will help build a positive team environment and establish working relationships inside and outside of the group.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e· Management of multiple complex calendars, meeting prioritization, and large scale meeting coordination\u003cbr/\u003e· Coordination and planning of domestic and international travel, including organizing trip agendas and local logistics\u003cbr/\u003e· Completing expense reports, and managing corporate card purchases; participation in budget planning and tracking as needed\u003cbr/\u003e· Managing other core administrative activities (space planning, new-hire onboarding, team morale events)\u003cbr/\u003e· Planning and coordinating team activities and events\u003cbr/\u003e· Tracking and helping to drive completion of key deliverables for team and executives, following up on key items\u003cbr/\u003e· Having fun at work and helping others do the same\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Trustworthy Shopping Experience (TSE) Operations team's vision is to be the most trusted investigation-based and compliance-based operations service provider who empower and service business, both sellers and selling platforms, to build and guarantee a safe, trustworthy and compliant shopping experience – inside and outside Amazon. Our mission is to make quick, accurate decisions that protect Customers while enabling Brands and Selling Partners to succeed. We do this at scale for both, internal and external customers, through technology and selective use of expert human judgment, all while keeping costs low. We do all this while ensuring a culture of learning, development and fun to be a part of.","department_cost_center":null,"description_short":"The Worldwide Amazon Stores organization is looking for an Executive Assistant who wants to work in a fast-paced, exciting, and growing organization. We are looking for someone to support two Directors","display_distance":null,"id":"553273ac-960e-46c5-b589-a399a7e13bc2","id_icims":"3164056","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Administrative Support","job_function_id":null,"job_path":"/en/jobs/3164056/executive-assistant-trustworthy-shopping-experience-operations","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA24\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"January 22, 2026","preferred_qualifications":"- Experience leading process improvements\u003cbr/\u003e- Experience in a fast-paced, high-tech company\u003cbr/\u003e- Experience with work space planning/management\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Superior attention to detail and ability to meet tight deadlines\u003cbr/\u003e- Ability to complete complex tasks quickly with little to no guidance and react with appropriate urgency to situations that require a quick turnaround\u003cbr/\u003e- Strong analytical skills\u003cbr/\u003e- Demonstrated ability to design and improve processes\u003cbr/\u003e- Ability to prioritize and handle multiple assignments at any given time\u003cbr/\u003e- High level of integrity and discretion\u003cbr/\u003e- Impeccable attention to detail\u003cbr/\u003e- Ability to work effectively with minimal supervision\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 82,700.00 - 129,800.00 USD annually","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"WA","title":"Executive Assistant , Trustworthy Shopping Experience Operations","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3164056/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of senior level leadership support, or 1+ years of Amazon experience\u003cbr/\u003e- Experience with executive level calendar management\u003cbr/\u003e- Experience with Microsoft Office products and applications\u003cbr/\u003e- High school or equivalent diploma","business_category":"no-business-category","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The Worldwide Amazon Stores organization is looking for an Executive Assistant who wants to work in a fast-paced, exciting, and growing organization. We are looking for someone to support two Directors on ROW team in Seattle, Washington.\u003cbr/\u003e\u003cbr/\u003eThis Executive Assistant will be responsible for handling confidential information and maintaining professionalism in dealing with senior executives. Role responsibilities include managing multiple complex calendars, planning and organizing events of all sizes, and coordinating domestic and international travel. This candidate will help build a positive team environment and establish working relationships inside and outside of the group.\u003cbr/\u003e \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eManage complex calendar and scheduling to support teams in multiple locations, familiar with multiple time-zones planning\u003cbr/\u003eManage domestic and international travel \u003cbr/\u003eManage expense report coordination and submission \u003cbr/\u003eOrganize, execute, and assist with team activities (staff meeting agendas, all-hands meetings, off-sites, and team social events) \u003cbr/\u003eEnsure the timely completion of critical tasks and follow up the tasks closely \u003cbr/\u003eAct as a liaison for your leaders direct reports \u003cbr/\u003eWork closely with the leadership team, program managers, recruiting, and other Executive Assistants to provide support to the organization \u003cbr/\u003eHelp to develop \u0026 maintain new mechanisms within the team\u003cbr/\u003e","department_cost_center":null,"description_short":"The Worldwide Amazon Stores organization is looking for an Executive Assistant who wants to work in a fast-paced, exciting, and growing organization. We are looking for someone to support two Directors","display_distance":null,"id":"57d1af62-dfc7-4ad9-9415-4008fca64c8f","id_icims":"3143208","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Administrative Support","job_function_id":null,"job_path":"/en/jobs/3143208/executive-assistant-row-stores","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA86\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"December 15, 2025","preferred_qualifications":"- Experience in a fast-paced, high-tech company\u003cbr/\u003e- Experience managing multiple calendars\u003cbr/\u003e- Experience completing complex tasks quickly with little to no guidance and react with appropriate urgency to situations that require a quick turnaround\u003cbr/\u003e- Experience managing multiple complex calendars, planning and organizing events of all sizes, and coordinating domestic and international travel\u003cbr/\u003e- Experience using strong customer service, communication, and interpersonal skills\u003cbr/\u003e- Experience leading process improvements\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 80,200.00 - 97,400.00 USD annually","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"WA","title":"Executive Assistant , ROW Stores","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3143208/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of construction or project management experience\u003cbr/\u003e- 3+ years experience managing projects in data centers or comparable critical infrastructure in an operational space. Comparable critical infrastructure experience is defined as a facility that includes a 24/7 emergency backup system, manufacturing facility (semiconductor, auto, medical equipment or Clean rooms), Mass Transportation (freight or passenger rail), Oil and Gas, Utility, Hospitals or similar industry\u003cbr/\u003e- 3+ years in on-site construction trades (mechanical, electrical, general) Vendor Management","business_category":"aws","city":"Santa Clara","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eThe Critical Projects Implementation (CPI) team is a project management and execution team that manages construction activity within the operational data center spaces. The CPI team is tasked with critical infrastructure improvement projects to optimize utilization of space, power, and cooling within operation data centers around the globe. These activities are outside of the scope of standard construction delivery and regular preventative maintenance tasks.  \u003cbr/\u003e\u003cbr/\u003eWe are currently seeking a Data Center Project Manager to serve as a technical resource within Amazon data centers. You will be part of a highly creative, efficient team tasked with tackling the most fascinating and challenges in designing, building, and operating Amazon data facilities. The Project Manager is ultimately responsible for project oversight and review of all disciplines including electrical, mechanical, controls, and architectural. A fundamental understanding of these systems is required, as the individual will be expected to identify areas for improvement as well as act on data provided from other team and organizations. Ideal candidates will possess the ability to design, develop and deploy innovative solutions to address operational challenges. This role requires both independent contribution as well as the ability to work within multi-disciplinary teams. The scope of projects will include but not limited to the improvement of electrical, mechanical, fire detection and building automation system. The Project Manager is responsible for the overall direction, coordination, implementation, execution, control and completion of specific projects ensuring consistency with company strategy, commitments and goals. \u003cbr/\u003e\u003cbr/\u003eIf you are passionate about the Customer Experience; you think big; and you want to contribute to the operational excellence of Amazon data centers then this may be the challenge you’ve been looking for!\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eEach day you will interact with different teams responsible for all aspects of the data centers. You will prioritize your activities to support data center capacity availability and safety focusing on the actions that are most impactful. You will have the opportunity to work on projects locally and globally.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e \u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003e#DCCD_AMER\u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"874ddfc0-1771-4f5a-ad48-aeca93218a77","id_icims":"3139899","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3139899/data-center-project-manager-us-west-cpi","job_schedule_type":"full-time","location":"US, CA, Santa Clara","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Santa Clara\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Santa Clara\",\"coordinates\":\"37.3558,-121.95512\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Santa Clara, California, USA\",\"location\":\"US, CA, Santa Clara\",\"region\":\"CA\",\"buildingCodeList\":[\"SFO21\"],\"normalizedCityName\":\"Santa Clara\"}"],"normalized_location":"Santa Clara, California, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"December  9, 2025","preferred_qualifications":"- BA/BS in Engineering, Project Management, Construction Management or similar Technical focus\u003cbr/\u003e- 3+ years experience in the technical field of power distribution and data center mechanical cooling systems\u003cbr/\u003e- Demonstrated ability to understand and discuss technical concepts, manage trade-offs, incorporate feedback, and evaluate opportunistic new ideas with a variety of internal and external stakeholders\u003cbr/\u003e- Significant experience successfully delivering results in a fast paced, dynamic environment\u003cbr/\u003e- Proven track record for being detail-oriented with a demonstrated ability to self-motivate and follow-through on projects\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Santa Clara - 110,400.00 - 191,200.00 USD annually","primary_search_label":"aws.team-program-management-primary","source_system":"JobCreator","state":"CA","title":"Data Center Project Manager, US-West CPI","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3139899/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-program-management-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of senior level leadership support, or 3+ years of Amazon experience\u003cbr/\u003e- High school or equivalent diploma\u003cbr/\u003e- Experience with Microsoft Office products and applications","business_category":"retail","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Prime Air Drone Delivery Program is looking for an Executive Assistant who wants to work in a fast-paced, exciting, and growing organization. We are looking for someone to support two Directors on our Prime Air team in Seattle, Washington.\u003cbr/\u003e\u003cbr/\u003eHow do you get items to customers quickly, cost-effectively, and—most importantly—safely, in less than an hour? And how do you do it in a way that can scale? Our teams of hundreds of scientists, engineers, aerospace professionals, and futurists have been working hard to do just that! We are delivering to customers, and are excited for what’s to come. Check out more information about Prime Air on the About Amazon blog (https://www.aboutamazon.com/news/transportation/amazon-prime-air-delivery-drone-reveal-photos).\u003cbr/\u003e\u003cbr/\u003eIf you are seeking an iterative environment where you can drive innovation, apply state-of-the-art technologies to solve real world delivery challenges, and provide benefits to customers, Prime Air is the place for you.\u003cbr/\u003e\u003cbr/\u003eThis Executive Assistant will be responsible for handling confidential information and maintaining professionalism in dealing with senior executives. Role responsibilities include managing multiple complex calendars, planning and organizing events of all sizes, and coordinating domestic and international travel. The Executive Assistant also has the opportunity to take on additional tasks for improvement projects to understand and improve the business cadence, mechanisms/processes, and team morale, feedback, and communication.  This candidate will help build a positive team environment and establish working relationships inside and outside of the group.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Management of complex calendar and scheduling to support teams in multiple locations\u003cbr/\u003e- Manage domestic and international travel\u003cbr/\u003e- Manage expense report coordination and submission\u003cbr/\u003e- Organize, execute, and assist with team activities (staff meeting agendas, all-hands meetings, off-sites, and team social events)\u003cbr/\u003e- Track and ensure the timely completion of critical tasks and action  with follow-up. as a liaison for direct reports\u003cbr/\u003e- Work closely with the leadership team, program managers, recruiting, and other Executive Assistants to provide support to the organization\u003cbr/\u003e- Help to develop \u0026 maintain new mechanisms within the team\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThe successful candidate must be able to communicate well with a positive team environment and take swift, effective action while proactively solving complex problems with little to no guidance. The position requires the ability to work successfully within a fast-paced team environment, build effective working relationships, maintain a comprehensive awareness of the organization and become the “go-to” person for support activities. Ability to handle confidential information and maintaining professionalism in dealing with Leadership Team Members.\u003cbr/\u003e\u003cbr/\u003eWe have a great location south of downtown Seattle — a fantastic facility, gym, dedicated parking garage with no fees, coffee shop, and cafe.","department_cost_center":null,"description_short":"Amazon Prime Air Drone Delivery Program is looking for an Executive Assistant who wants to work in a fast-paced, exciting, and growing organization. We are looking for someone to support two Directors","display_distance":null,"id":"5b29dd91-1484-4017-80c1-2b8ac5e99cde","id_icims":"3136603","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Administrative Support","job_function_id":null,"job_path":"/en/jobs/3136603/executive-assistant-amazon-prime-air","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA109\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"December  3, 2025","preferred_qualifications":"- Experience leading process improvements\u003cbr/\u003e- Experience in a fast-paced, high-tech company\u003cbr/\u003e- Experience designing processes to maximize efficiency\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 82,700.00 - 129,800.00 USD annually","primary_search_label":"retail.team-global-prime-air","source_system":"JobCreator","state":"WA","title":"Executive Assistant , Amazon Prime Air ","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3136603/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-prime-air","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 4+ years of Information Technology (IT) experience, or Bachelor's degree in computer science, engineering, mathematics or equivalent\u003cbr/\u003e- 2+ years of people management experience\u003cbr/\u003e- 2+ years of operations and on-call support for data center facilities, mission critical plants, or production facilities experience","business_category":"aws","city":"New Carlisle","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Manage a team that maintains cloud infrastructure for global data center operations!\u003cbr/\u003eAWS is looking for technology managers with experience in people management, strong technical understanding and the drive and vision to take AWS Data Center Operations to the next level. The successful candidate will have experience creating/devising strategies, mentoring people at all levels, sponsoring projects, and proposing technical solutions. This position involves leading teams in hardware and network diagnostics followed by physical repair and includes participation in an on-call rotation.\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe successful candidate will be operationally responsible for a Data Center. Some high-level responsibilities include:\u003cbr/\u003e- Prioritize and assign trouble tickets to data center technicians and operators\u003cbr/\u003e- Manage the performance of a diverse team(s) of data center operation professionals with varying skills across different locations\u003cbr/\u003e- Developing Career Paths for the employees and to make updates in our internal tools.\u003cbr/\u003e- Recruit and train data technicians to ensure appropriate staffing levels\u003cbr/\u003e- Ensure effective and efficient management of day to day data center operations including queue management, 7/24 shift arrangement and hardware logistics\u003cbr/\u003e- Fast learn or act as the subject matter expert across all aspects in data center operations\u003cbr/\u003e- Ensure all operational KPIs and metrics are being measured and met\u003cbr/\u003e- Inspire and guide improvement in team process, technology innovation and automation\u003cbr/\u003e- Manage Large Scale Events (outages) and act as the call leader\u003cbr/\u003e- Manage and improve the work-flows and through-put for data centers operations\u003cbr/\u003e- Recommend, document, and oversee policies and procedures to meet industry best practices and to meet required SLAs \u003cbr/\u003e - Maintain the on-call schedule coordinating absence and vacations\u003cbr/\u003e- Be passionate about the quality and quantity of services being provided, and continuously strive to improve our Customer Experience\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational.\u003cbr/\u003e\u003cbr/\u003eEssential Requirements:\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAmazon Web Services (AWS) is a fast paced technology company and a leader in the world of data centers. The position will help ensure overall availability and reliability to meet or exceed defined service levels of data center operations. We are currently expanding our infrastructure management team and are looking for technology managers with experience in people management, strong technical understanding and the drive and vision to take AWS Data Center Operations to the next level. \u003cbr/\u003e\u003cbr/\u003eThe successful candidate will have experience creating/devising strategies, mentoring people in all levels, sponsoring projects and proposing technical solutions. This position involves leading teams in hardware and network diagnostics followed by physical repair and includes participation in an on-call rotation. All candidates should be willing to work both independently and managing their teams effectively. Work prioritization, organizational skills, effective communication, and the ability to react quickly are critical to being successful. In addition to strong knowledge in Data Centers, hardware and network repair, candidates will create documentation, innovate solutions, participate in site-level project work, and fix complex problems within the Data Center Space. This team works in an environment that operates 24/7.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.","department_cost_center":null,"description_short":"Manage a team that maintains cloud infrastructure for global data center operations!AWS is looking for technology managers with experience in people management, strong technical understanding and the drive","display_distance":null,"id":"2c23d954-5bf3-44ec-a372-aa15d74dcb9c","id_icims":"3153344","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3153344/data-center-operations-manager-nights","job_schedule_type":"full-time","location":"US, IN, New Carlisle","locations":["{\"normalizedStateName\":\"Indiana\",\"normalizedCountryCode\":\"USA\",\"city\":\"New Carlisle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, IN, New Carlisle\",\"coordinates\":\"41.70584,-86.51309\",\"normalizedCountyName\":\"St Joseph\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New Carlisle, Indiana, USA\",\"location\":\"US, IN, New Carlisle\",\"region\":\"IN\",\"buildingCodeList\":[\"SBN100\"],\"normalizedCityName\":\"New Carlisle\"}"],"normalized_location":"New Carlisle, Indiana, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"January  6, 2026","preferred_qualifications":"- 2+ years of computer hardware experience, including troubleshooting and repairing experience\u003cbr/\u003e- Experience in technical writing in a relevant field\u003cbr/\u003e- certification in an applicable field like A+, Net+, Sec+, CCNA, LPIC, Linux+, AWS certification, or A+ or CND (Certified Network Defender) or Network+ or Security+\u003cbr/\u003e- Experience with system management tools and client/server environments\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $70,700/year in our lowest geographic market up to $158,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"IN","title":"Data Center Operations Manager, Nights","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3153344/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in engineering, statistics or business, or Bachelor's degree and 5+ years of quantitative role (engineering, process re-engineering, quality assurance) experience\u003cbr/\u003e- 3+ years of finance or a related analytical field experience\u003cbr/\u003e- 3+ years of applying key financial performance indicators (KPIs) to analyses experience\u003cbr/\u003e- 2+ years of identifying, leading, and executing opportunities to improve, automate, standardize or simplify finance or business tools and processes experience\u003cbr/\u003e- 3+ years of advanced proficiency in Excel (pivots, lookups, etc.) experience","business_category":"finance","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Finance is all about the numbers…unless you work at Amazon; it’s knowing the numbers and so much more! Enthusiasm and energy help us deliver new ideas, and solutions. Do you view problems as treasures, and are you willing to dive deep to develop those solutions and deliver results? Will you seek to challenge the status quo, and accept that your ideas and mechanisms may be tested daily? At Amazon, we move with purpose and speed, and this requires we work with a dynamic network of Operations, HR, Tech and Retail partners. Our Sr Finance Analyst work with multiple stakeholders, they help others understand financial decisions and are *the* trusted business advisor. They employ every facet of data and communication to ensure our partners and our leaders have the most up to date and reliable information to help them make the best possible decision. Come teach us a few things, and we’ll teach you a few things as we navigate the most customer-centric company on Earth.\u003cbr/\u003e\u003cbr/\u003eIn this position you will be part of the team responsible for leading budgeting exercises throughout the year. To help you ramp, you will start owning standardization and plan deep dives, you will support our transition to Gen/Agentic AI utilization, and will then take ownership of budget input drivers.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Support planning processes with various stakeholders across HQ and Field Finance\u003cbr/\u003e- Deliver Deep Dives and provide insights before leadership reviews, manage communication with stakeholders and monitor closure of follow-up items\u003cbr/\u003e- Drive standardization and automation implementations to improve the overall planning function\u003cbr/\u003e- Responsible for strengthening controllership, bringing financial transparency, reducing defects, and driving improvements in operational cost.\u003cbr/\u003e- Work with data source providers and technology teams to ensure that key decision data is accurate, automated and timely.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour day begins by aligning input requirements with various stakeholders across the organization. You'll spend time modeling these inputs to generate sensible financial impacts and working collaboratively with business partners to build compelling narratives for senior leadership. As challenges arise, you'll analyze data quickly to understand repercussions and prioritize actions that will drive decisions steering the direction of the business. Throughout the day, you'll navigate between strategic thinking and detailed analysis, always focused on delivering insights that create value.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur team is collaborative and knowledgeable, currently based in different cities across the US. We work in a supportive environment where expertise is shared freely and innovation is encouraged. There are numerous opportunities to improve the status quo by working with stakeholders across the USCF network, implementing better processes, and driving meaningful change through financial analysis and planning.\u003cbr/\u003e\u003cbr/\u003eIf you're looking for a good challenge where you can make a significant impact through financial expertise and analytical thinking, this is it. Our team values those who can think strategically, communicate effectively, and bring fresh perspectives to complex business problems.","department_cost_center":null,"description_short":"Finance is all about the numbers…unless you work at Amazon; it’s knowing the numbers and so much more! Enthusiasm and energy help us deliver new ideas, and solutions. Do you view problems as treasures,","display_distance":null,"id":"6fc63697-66d6-45e1-b75e-13ca4d41b9c7","id_icims":"3168098","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/Planning","job_function_id":null,"job_path":"/en/jobs/3168098/senior-finance-analyst-nacf-ww-ops-finance-cf-support","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA82\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"January 27, 2026","preferred_qualifications":"- Experience working with large-scale data mining and reporting tools (examples: SQL, MS Access, Essbase, Cognos) and other financial systems (examples: Oracle, SAP, Lawson, JD Edwards)\u003cbr/\u003e- 2+ years of identifying incomplete or inaccurate data, identifying the root cause and creating/implementing an escalation plan experience\u003cbr/\u003e- 2+ years of data interpretation and analysis to influence stakeholders experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Bellevue - 82,700.00 - 117,100.00 USD annually","primary_search_label":"finance.team-consumer","source_system":"JobCreator","state":"WA","title":"Senior Finance Analyst, NACF, WW Ops Finance - CF Support","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3168098/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-consumer","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 4+ years of Information Technology (IT) experience, or Bachelor's degree in computer science, engineering, mathematics or equivalent\u003cbr/\u003e- 2+ years of people management experience\u003cbr/\u003e- 2+ years of operations and on-call support for data center facilities, mission critical plants, or production facilities experience","business_category":"aws","city":"New Carlisle","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Manage a team that maintains cloud infrastructure for global data center operations! \u003cbr/\u003eAWS is looking for technology managers with experience in people management, strong technical understanding and the drive and vision to take AWS Data Center Operations to the next level. The successful candidate will have experience creating/devising strategies, mentoring people at all levels, sponsoring projects, and proposing technical solutions. This position involves leading teams in hardware and network diagnostics followed by physical repair and includes participation in an on-call rotation. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe successful candidate will be operationally responsible for a Data Center. Some high-level responsibilities include:\u003cbr/\u003e- Prioritize and assign trouble tickets to data center technicians and operators\u003cbr/\u003e- Manage the performance of a diverse team(s) of data center operation professionals with varying skills across different locations\u003cbr/\u003e- Developing Career Paths for the employees and to make updates in our internal tools.\u003cbr/\u003e- Recruit and train data technicians to ensure appropriate staffing levels\u003cbr/\u003e- Ensure effective and efficient management of day to day data center operations including queue management, 7/24 shift arrangement and hardware logistics\u003cbr/\u003e- Fast learn or act as the subject matter expert across all aspects in data center operations\u003cbr/\u003e- Ensure all operational KPIs and metrics are being measured and met\u003cbr/\u003e- Inspire and guide improvement in team process, technology innovation and automation\u003cbr/\u003e- Manage Large Scale Events (outages) and act as the call leader\u003cbr/\u003e- Manage and improve the work-flows and through-put for data centers operations\u003cbr/\u003e- Recommend, document, and oversee policies and procedures to meet industry best practices and to meet required SLAs \u003cbr/\u003e - Maintain the on-call schedule coordinating absence and vacations\u003cbr/\u003e- Be passionate about the quality and quantity of services being provided, and continuously strive to improve our Customer Experience\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAmazon Web Services (AWS) is a fast paced technology company and a leader in the world of data centers. The position will help ensure overall availability and reliability to meet or exceed defined service levels of data center operations. We are currently expanding our infrastructure management team and are looking for technology managers with experience in people management, strong technical understanding and the drive and vision to take AWS Data Center Operations to the next level. \u003cbr/\u003e\u003cbr/\u003eThe successful candidate will have experience creating/devising strategies, mentoring people in all levels, sponsoring projects and proposing technical solutions. This position involves leading teams in hardware and network diagnostics followed by physical repair and includes participation in an on-call rotation. All candidates should be willing to work both independently and managing their teams effectively. Work prioritization, organizational skills, effective communication, and the ability to react quickly are critical to being successful. In addition to strong knowledge in Data Centers, hardware and network repair, candidates will create documentation, innovate solutions, participate in site-level project work, and fix complex problems within the Data Center Space. This team works in an environment that operates 24/7.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Manage a team that maintains cloud infrastructure for global data center operations! AWS is looking for technology managers with experience in people management, strong technical understanding and the","display_distance":null,"id":"83a3a1c6-6448-444b-82a3-3ca469e56669","id_icims":"3153335","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3153335/data-center-operations-manager-nights","job_schedule_type":"full-time","location":"US, IN, New Carlisle","locations":["{\"normalizedStateName\":\"Indiana\",\"normalizedCountryCode\":\"USA\",\"city\":\"New Carlisle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, IN, New Carlisle\",\"coordinates\":\"41.70584,-86.51309\",\"normalizedCountyName\":\"St Joseph\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New Carlisle, Indiana, USA\",\"location\":\"US, IN, New Carlisle\",\"region\":\"IN\",\"buildingCodeList\":[\"SBN101\"],\"normalizedCityName\":\"New Carlisle\"}"],"normalized_location":"New Carlisle, Indiana, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"January  6, 2026","preferred_qualifications":"- 2+ years of computer hardware experience, including troubleshooting and repairing experience\u003cbr/\u003e- Experience in technical writing in a relevant field\u003cbr/\u003e- certification in an applicable field like A+, Net+, Sec+, CCNA, LPIC, Linux+, AWS certification, or A+ or CND (Certified Network Defender) or Network+ or Security+\u003cbr/\u003e- Experience with system management tools and client/server environments\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $70,700/year in our lowest geographic market up to $158,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"IN","title":"Data Center Operations Manager, Nights","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3153335/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}