{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 6+ years of team management experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Experience owning/driving roadmap strategy and definition\u003cbr/\u003e- Experience with feature delivery and tradeoffs of a product","business_category":"aws","city":"Bellevue","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eWe're looking for an experienced Senior Manager, Product Management to join our AWS Boost team and lead the development of our unified data center operations service. In this role, you'll own the end-to-end product lifecycle for technical features that impact thousands of data center technicians and the global AWS infrastructure they maintain.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate combines deep technical knowledge of data center operations with strong business acumen. You should be comfortable diving deep into technical architectures while maintaining a clear focus on improving efficiency, safety, and reliability in our data centers. You'll need to effectively influence across organizations like Data Center Operations (DCO), Data Center Engineering (DCE), and AWS Service Teams to build consensus on complex technical decisions, and drive execution through multiple engineering teams.\u003cbr/\u003e\u003cbr/\u003eThis role offers the opportunity to: 1/ Drive strategy and execution for AWS Boost, 2/Work with the latest technologies that power the backbone of AWS infrastructure, 3/ Make decisions that directly impact technician experience and operational efficiency, 4/ Influence the direction of significant technical investments in data center automation, and 5/ Build and launch features used by thousands of technicians across our global data center footprint\u003cbr/\u003e\u003cbr/\u003eIf you're excited about solving complex technical challenges in data center operations, driving innovation in infrastructure management, and delivering exceptional experiences for our technicians, we want to hear from you.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eProduct Strategy \u0026 Vision: You will define and own the product strategy, vision, and roadmap for AWS Boost, and drive product discussions with executives and stakeholders regarding vision, goals, and tenets. You will contribute to operational planning and business reviews (OP1/QBR/MBR), and make data-driven decisions to influence technical priorities and business strategy.\u003cbr/\u003e\u003cbr/\u003eTechnical Leadership: You will partner with engineering teams to evaluate the technical feasibility and architectural decisions of product design, assess the impact of emerging technologies on product features and use cases, and identify/address technical limitations that affect product scale, performance, and/or innovation.\u003cbr/\u003e\u003cbr/\u003eCustomer Focus \u0026 Execution: You will work backwards from customer needs to define clear product requirements, lead market research and usability studies to validate product decisions, drive constructive dialogue between business stakeholders and engineering teams, and make smart trade-offs between time, effort, and features. \u003cbr/\u003e\u003cbr/\u003eProcess \u0026 Communication: You will create clear product documentation including PRFAQs, specifications, and strategic narratives. Your team will develop product materials and training content, establish/simplify processes to ensure the product meets customer needs, and create mechanisms for measuring and reporting product performance.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour morning kicks off with a rush of excitement as you check the AWS Boost dashboard and discover your team's latest workflow update has slashed completion times by 3 minutes across thousands of daily operations - a win worth celebrating with your team during stand-up. The day accelerates as you bounce between feedback sessions with technicians testing your latest features, white-boarding integration solutions with the Workforce Management team, and diving into a technical architecture discussion where your distributed systems knowledge helps solve a thorny integration challenge that's been stumping even your principal engineers.\u003cbr/\u003e\u003cbr/\u003eBy afternoon, you're analyzing usage data that reveals surprising mobile adoption patterns in newer facilities - an insight that immediately reshapes your roadmap priorities - before confidently presenting to senior leadership how your work planning feature will reduce unsellable time by 8% across the global AWS infrastructure. Just as you're wrapping up plans for tomorrow's data center site visit (where you'll get to don safety gear and observe the Parts Removal workflow in action), a Slack message pops up from a technician in Singapore thanking your team for making their work \"actually enjoyable for once\" - the perfect end to a day where your decisions directly impact how thousands of people maintain the digital infrastructure powering much of the world's internet.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Boost maximizes the capacity which is available online to our customers at the least amount of operational expenditure while protecting our operations teams and customers from safety, security, availability, and compliance risks. Data center technicians use Boost to discover, plan, and execute work. They also learn about, and acquire new skills that increase the scope of work they can perform. Data center managers come to Boost to monitor, prioritize, assign, and audit work. AWS Service Owners come to Boost to request work and receive feedback on its progress towards completion. They want capacity available and (back) in service quickly, safely, and frugally. Our services drive this outcome by matching incoming requests with the ideal set of instructions, allocating the needed materials, and providing Data Center Operators with the tooling needed to plan, schedule, and audit the work. Procedures performed using our technology generate predictable, repeatable outcomes that builders use to baseline workflows for continuous improvement and increase systematic control of processes through automation.\u003cbr/\u003e\u003cbr/\u003eAbout AWS\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"961c5abf-a1d1-4c15-8254-cbb53c5180bc","id_icims":"3176957","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Product Management - Technical","job_function_id":null,"job_path":"/en/jobs/3176957/senior-manager-product-management-aws-boost","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA112\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":["aws.team-ais","aws.team-product-program-management","aws.team-product-and-program-management"],"posted_date":"February  9, 2026","preferred_qualifications":"- Experience delivering consumer software products and services in a high growth environment\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Bellevue - 197,900.00 - 267,800.00 USD annually","primary_search_label":"aws.team-product-management-primary","source_system":"JobCreator","state":"WA","title":"Senior Manager, Product Management, AWS Boost","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3176957/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-product-management-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of tax, finance or a related analytical field experience\u003cbr/\u003e- 5+ years of multiple finance and accounting roles experience\u003cbr/\u003e- 6+ years of applying key financial performance indicators (KPIs) to analyses experience\u003cbr/\u003e- 6+ years of building financial and operational reports/data sets that inform business decision-making experience\u003cbr/\u003e- 6+ years of creating process improvements with automation and analysis experience\u003cbr/\u003e- Bachelor's degree","business_category":"finance","city":"Mexico City","company_name":"Servicios Comerciales Amazon Mexico S. de R.L. de C.V.","country_code":"MEX","description":"Are you passionate around implementing new Regulatory Changes in a highly dynamic and complex environment such as Latin America? Have you partnered with many cross-functional teams to influence process improvements to increase efficiency and reduce waste? If so, the Finance Operations team is the place for you. The Finance Operations organization works with every part of Amazon to provide procure-to-pay, revenue-to-receipt, real-estate and facilities, operations accounting and operations excellence services with the highest level of controllership at the lowest cost to the company. We provide the backbone systems and operational processes which completely, accurately, and validly pay Amazon’s suppliers, invoice our customers and report financial results.\u003cbr/\u003e\u003cbr/\u003eThis role will be a key member of the Finance Operations Business Partnership (BP) team supporting Amazon's Latin America business to ensure correct implementation of regulatory changes for the Accounts Payable, Accounts Receivable and Payroll areas. You will be a key player of a team comprised of high performing operations excellence and finance professionals to drive process design for correct implementation of regulatory initiatives across the region, implement change management program with vendors to ensure smooth regulatory launches that avoid impact to vendors and to Finance Operations. In this team, you will thrive in a challenging and fast-paced environment and be part of an atmosphere of constant improvement. This role interacts deeply with Stores and Stores Finance teams, Tax, Accounting and Service Center. \u003cbr/\u003e\u003cbr/\u003eTo succeed, you must possess a strong passion for solving complex problems, set high standards,  engage deeply with diverse business partners, and earn trust using fact and data. In addition, the successful candidate will demonstrate strong interpersonal and communication skills with multiple business partners and senior leaders across geographies. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tWork cross-organizationally and functionally to identify key opportunities in process, technical, and human interfaces and develop and implement plans to correctly implement regulatory changes in Latin America.\u003cbr/\u003e•\tIdentify risk level to current processes within Finance Operations, collaborating and building relationships with system and business owners globally to drive end-to-end improvements. \u003cbr/\u003e•\tMinimize risk exposure derived from regulatory changes in Latin America region, ensuring proper automation to for long-term goals achievement.\u003cbr/\u003e•\tEstablish a regular cadence of engagement with  Finance Operations Service Centers and our many business partners, ensuring process excellence with the highest degree of controllership.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eInclusive team culture\u003cbr/\u003e\u003cbr/\u003eAt Amazon we embrace our differences and we are committed to furthering our culture of inclusion. We host annual and ongoing learning experiences. Amazon’s culture of inclusion is reinforced within our 14 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.\u003cbr/\u003e\u003cbr/\u003eWork Life Balance\u003cbr/\u003e\u003cbr/\u003eWe believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfillment. We offer flexibility in working hours and encourage you to find your own balance between your work and personal lives.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003e\u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded professional. ","department_cost_center":null,"description_short":"Are you passionate around implementing new Regulatory Changes in a highly dynamic and complex environment such as Latin America? Have you partnered with many cross-functional teams to influence process","display_distance":null,"id":"515b016d-9cfa-42ad-acf9-ae7f335f6207","id_icims":"3157298","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/Planning","job_function_id":null,"job_path":"/en/jobs/3157298/manager-business-partnership-finance-operations-latam-compliance","job_schedule_type":"full-time","location":"MX, DIF, Mexico City","locations":["{\"normalizedStateName\":\"Mexico City\",\"normalizedCountryCode\":\"MEX\",\"city\":\"Mexico City\",\"countryIso3a\":\"MEX\",\"countryIso2a\":\"MX\",\"locationNonStemming\":\"Mexico, DIF, Mexico City\",\"coordinates\":\"19.43195,-99.13315\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Mexico\",\"normalizedLocation\":\"Mexico City, Mexico City, MEX\",\"location\":\"MX, DIF, Mexico City\",\"region\":\"DIF\",\"buildingCodeList\":[\"MEX16\"],\"normalizedCityName\":\"Mexico City\"}"],"normalized_location":"Mexico City, Mexico City, MEX","optional_search_labels":[],"posted_date":"January 12, 2026","preferred_qualifications":"- 6+ years of identifying incomplete or inaccurate data, identifying the root cause and creating/implementing an escalation plan experience\u003cbr/\u003e- 6+ years of solving complex business challenges by delivering accurate and timely financial models, analysis, and recommendations that have a proven impact on business (e.g., financial savings, operational improvements, or customer benefits) experience\u003cbr/\u003e- 4+ years of participating in continuous improvement projects in your team to scale and improve controllership with measurable results experience\u003cbr/\u003e- Experience delivering forecasting, budgeting, and variance analysis, and data interpretation of results\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-finops","source_system":"JobCreator","state":"DIF","title":"Manager, Business Partnership, Finance Operations, LATAM Compliance","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3157298/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-finops","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in supply chain, business, engineering, finance or related technical or quantitative field\u003cbr/\u003e- 5+ years of program or project management experience\u003cbr/\u003e- Experience using data and metrics to determine and drive improvements\u003cbr/\u003e- Experience owning program strategy, end to end delivery, and communicating results to senior leadership\u003cbr/\u003e- Knowledge of Excel at an intermediate level (e.g., pivot tables \u0026 charts, multiple criteria lookups, nested logical/IF formulas, data cleansing, array formulas, etc.)","business_category":"transportation-and-logistics","city":"Nashville","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Are you passionate about transforming the future of delivery operations? Join our team to lead innovative initiatives that revolutionize how we serve our customers through innovative fulfillment solutions. You'll drive strategic projects that shape the future of rapid delivery services while collaborating with diverse teams across the organization.\u003cbr/\u003e\u003cbr/\u003eSub-Same Day Direct (SSD-D) is looking for a Sr. Program Manager with a delivery record and proven program management experience to own and execute strategic, cross-functional operations and technology projects for our faster than Same Day operations. Robust understanding of fulfillment operations including under-the-roof processes, inventory flows, and long-term roadmaps will help develop new innovations. This role will play a critical role in the expansion of the sub-same day direct program. It requires a high-level of ownership for end-to-end process, the ability to think outside of the box, willingness to disrupt the current processes to create a new process, the ability to design sustainable solutions and influence stakeholders. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Leading cross-functional teams across NACF (North America Customer Fulfillment), AR (Amazon Robotics), and R2L (Rural and Rapid Logistics) to plan, organize, and execute complex projects to achieve 2025 variable cost goals \u003cbr/\u003e- Defining and owning the network waterfall for under-the-roof (UTR) efficiency initiatives \u003cbr/\u003e- Creating weekly network TPH performance vs plan reporting and contribution to change automation\u003cbr/\u003e- Analyzing data across UTR functions to establish input metrics and best practices for improving UTR efficiency. \u003cbr/\u003e- Partnering with NACF and AR stakeholders to create accountability mechanisms for continuous improvement\u003cbr/\u003e\u003cbr/\u003eThe Sr. Program Manager will also demonstrate: \u003cbr/\u003e- Confidence operating in a highly ambiguous and iterative business space\u003cbr/\u003e- High attention to detail including proven ability to manage multiple, competing priorities simultaneously\u003cbr/\u003e- Willingness to challenge and influence big leaders\u003cbr/\u003e- Ability to think strategically and execute methodically\u003cbr/\u003e- Ability to work in a fast-paced environment where continuous innovation is desired\u003cbr/\u003e- Demonstrated analytical and quantitative skills and ability to use hard data and metrics to back up assumptions and develop business cases\u003cbr/\u003e- Ability to clearly communicate data insights to others\u003cbr/\u003e- Travel expectations are 20% \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are a dynamic team focused on developing and implementing solutions for our fulfillment operations. Our mission is to continuously enhance customer experience through innovative delivery solutions. We value collaboration, creative problem-solving, and data-driven decision making.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eYou'll collaborate with cross-functional teams to identify opportunities for operational improvements, analyze complex data sets, and develop innovative solutions. You'll participate in strategy sessions, lead project implementations, and present insights to stakeholders. Your work will directly impact millions of customer experiences.","department_cost_center":null,"description_short":"Are you passionate about transforming the future of delivery operations? Join our team to lead innovative initiatives that revolutionize how we serve our customers through innovative fulfillment solutions.","display_distance":null,"id":"236c28f9-2ab1-431e-89e4-1d12f44705bd","id_icims":"3170138","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Program Management","job_function_id":null,"job_path":"/en/jobs/3170138/sr-program-manager-ssd-direct","job_schedule_type":"full-time","location":"US, TN, Nashville","locations":["{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Nashville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Nashville\",\"coordinates\":\"36.16792,-86.77798\",\"normalizedCountyName\":\"Davidson\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Nashville, Tennessee, USA\",\"location\":\"US, TN, Nashville\",\"region\":\"TN\",\"buildingCodeList\":[\"BNA12\"],\"normalizedCityName\":\"Nashville\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA82\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Nashville, Tennessee, USA","optional_search_labels":[],"posted_date":"January 30, 2026","preferred_qualifications":"- Master's degree, or MBA in business, operations, human resources, adult education, organizational development, instructional design or related field\u003cbr/\u003e- 2+ years of driving process improvements experience\u003cbr/\u003e- Experience with SQL\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TN, Nashville - 104,100.00 - 155,400.00 USD annually\u003cbr/\u003eUSA, WA, Bellevue - 115,600.00 - 160,000.00 USD annually","primary_search_label":"transportation-and-logistics.team-na-operations","source_system":"JobCreator","state":"TN","title":"Sr Program Manager, SSD-Direct","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3170138/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-na-operations","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of building machine learning models for business application experience\u003cbr/\u003e- PhD, or Master's degree and 3+ years of applied research experience\u003cbr/\u003e- Knowledge of programming languages such as C/C++, Python, Java or Perl\u003cbr/\u003e- Experience programming in Java, C++, Python or related language\u003cbr/\u003e- Experience with neural deep learning methods and machine learning\u003cbr/\u003e- Experience with GenAI model training and tuning","business_category":"advertising","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Advertising is one of Amazon's fastest growing and most profitable businesses. Amazon's advertising portfolio helps merchants, retail vendors, and brand owners succeed via native advertising, which grows incremental sales of their products sold through Amazon. The primary goals are to help shoppers discover new products they love, be the most efficient way for advertisers to meet their business objectives, and build a sustainable business that continuously innovates on behalf of customers. Our products and solutions are strategically important to enable our Retail and Marketplace businesses to drive long-term growth. We deliver billions of ad impressions and millions of clicks and break fresh ground in product and technical innovations every day! The Creative X team within Amazon Advertising time aims to democratize access to high-quality creatives (text, audio, images, videos) by building AI-driven solutions for advertisers. To accomplish this, we are investing in latent-diffusion models, large language models (LLM), generative audio (music and speech synthesis), computer vision (CV), reinforced learning (RL) and related methods. You will be part of a close-knit team of applied scientists and product managers who are highly collaborative and at the top of their respective fields. We are looking for talented Applied Scientists who have a proven record of developing Generative AI science at the highest standards of innovation, and experience working and delivering product-ready code, are adept at a variety of skills, especially with LLMs, generative audio, computer vision, latent diffusion or related foundational models that will accelerate our plans to generate high-quality creatives on behalf of advertisers. Every member of the team is expected to build customer (advertiser) facing features, contribute to the collaborative spirit within the team, publish, patent, and bring cutting edge research to raise the bar within the team.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThis role is focused on Generative Video and related Science to develop and produce generative imagery and videos. You must have deep technical experience working with methods and technologies related to GenAI. A strong developing machine learning background is preferred, in addition to experience building GenAI applications and research. You will develop core models that will be the foundational of the core advertising-facing tools that we are launching. You will conduct literature reviews to stay on the cutting edge of the field. You will regularly engage with product managers, who will partner with you to productize your work. As Sr Applied Scientist on this team, you will: \u003cbr/\u003e•\tDrive end-to-end GenAI projects that have a high degree of ambiguity, scale and complexity.\u003cbr/\u003e•\tBuild Machine Learning models, perform proof-of-concept, experiment, optimize, and deploy your models into production; work closely with software engineers to assist in productionizing your ML models.\u003cbr/\u003e•\tPerform hands-on analysis and modeling of enormous data sets to develop insights that increase traffic monetization and merchandise sales, without compromising the shopper experience.\u003cbr/\u003e•\tRun A/B experiments, gather data, and perform statistical analysis.\u003cbr/\u003e•\tEstablish scalable, efficient, automated processes for large-scale data analysis, machine-learning model development, model validation and serving.\u003cbr/\u003e•\tIdentify and action data collection and labelling in conjunction with team members.\u003cbr/\u003e•\tResearch new and innovative machine learning approaches.\u003cbr/\u003e•\tMentor and help recruit Applied Scientists to the team.\u003cbr/\u003e•\tPresent results and explain methods to senior leadership.\u003cbr/\u003e•\tWillingness to publish research at internal and external top scientific venues.\u003cbr/\u003e•\tWrite and pursue IP submissions.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAmazon is investing heavily in building a world-class advertising business. This team defines and delivers a collection of advertising products that drive discovery and sales. Our solutions generate billions in revenue and drive long-term growth for Amazon’s Retail and Marketplace businesses. We deliver billions of ad impressions, millions of clicks daily, and break fresh ground to create world-class products. We are a highly motivated, collaborative, and fun-loving team with an entrepreneurial spirit - with a broad mandate to experiment and innovate.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003e•\tThe team is a growing team of applied scientists and product leaders. We reside in the Creative X organization, which focuses on creating products for advertisers that will improve the quality of the creatives within Amazon Ads. We are open to hiring candidates to work out of one of the following locations: USA (Seattle)\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Advertising is one of Amazon's fastest growing and most profitable businesses. Amazon's advertising portfolio helps merchants, retail vendors, and brand owners succeed via native advertising, which","display_distance":null,"id":"6cf024f9-ef41-48cc-ba8b-46627c7f69bf","id_icims":"2739153","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/2739153/sr-applied-scientist-genai-video-creativex","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA40\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["advertising.team-applied-science"],"posted_date":"August 20, 2024","preferred_qualifications":"- Advanced degree in Computer Science, Mathematics, Statistics, Economics, or related quantitative field.\u003cbr/\u003e- Published relevant research work in academic conferences or industry circles.\u003cbr/\u003e- Experience in building large-scale machine-learning models and infra for online recommendation, ads ranking, personalization, or search, etc.\u003cbr/\u003e- Effective verbal and written communication skills with non-technical and technical audiences.\u003cbr/\u003e- Experience working with large real-world data sets and building scalable models from big data.\u003cbr/\u003e- Thinks strategically, but stays on top of tactical execution.\u003cbr/\u003e- Exhibits excellent business judgment; balances business, product, and technology very well.\u003cbr/\u003e- Experience in computational advertising.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 167,100.00 - 226,100.00 USD annually","primary_search_label":"advertising.team-amazon-ads","source_system":"JobCreator","state":"WA","title":"Sr Applied Scientist GenAI Video, CreativeX","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/2739153/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-ads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"retail","city":"Vancouver","company_name":"Amazon Development Centre Canada ULC","country_code":"CAN","description":"Are you passionate about building innovative, world-class customer experiences that delight Amazon shoppers around the globe? As a Software Development Engineer II on our WW Deals and Promotions team in Vancouver, you'll have the opportunity to do just that.\u003cbr/\u003e\u003cbr/\u003eIn this exciting role, you'll contribute to designing and developing the systems that power Amazon's entire promotions ecosystem - from the deals and discounts customers discover, to the seamless purchase experiences they enjoy. Your work will directly shape how millions of customers interact with and take advantage of our most popular offers, across every touchpoint of their shopping journey.\u003cbr/\u003e\u003cbr/\u003eYou'll collaborate closely with product managers to translate innovative promotions features into robust, scalable technical solutions. And you'll work alongside a talented team of engineers to ensure these mission-critical systems operate with rock-solid reliability, performance, and security.\u003cbr/\u003e\u003cbr/\u003eYou'll also have opportunities to mentor junior engineers, provide feedback to improve code quality and maintainability, and identify ways to evolve the promotions platform. If you have 3+ years of professional software development experience, a passion for solving complex problems, and a drive to create delightful customer experiences, we want to hear from you.\u003cbr/\u003e\u003cbr/\u003eJoin us in Vancouver and play a pivotal role in shaping the future of Amazon's global promotions ecosystem. Together, we'll deliver world-class experiences that keep customers coming delighted.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eIn this role, you will:\u003cbr/\u003e\u003cbr/\u003e* Design, build, and deploy scalable, low-latency services to support the deals and promotions experience\u003cbr/\u003e* Collaborate closely with product managers, designers, and other engineers to translate customer and business requirements into robust technical solutions\u003cbr/\u003e* Contribute to the operational excellence of the team's services, participate in on-call rotations, and improve system performance and reliability\u003cbr/\u003e* Set a high standard for code quality, maintainability, and development best practices through your own work and code reviews\u003cbr/\u003e* Mentor junior engineers and share your knowledge to help the team continuously improve\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eTo be successful, you'll need:\u003cbr/\u003e\u003cbr/\u003e* 3+ years of non-internship professional software development experience\u003cbr/\u003e* Expertise in designing and building high-performance, scalable services and APIs\u003cbr/\u003e* Strong proficiency in at least one major programming language (e.g. Java, Python, C++, etc.)\u003cbr/\u003e* Experience with distributed systems, microservices architecture, and cloud infrastructure\u003cbr/\u003e* A passion for solving complex, ambiguous problems and delivering innovative customer experiences\u003cbr/\u003e* Excellent communication skills to collaborate effectively with cross-functional partners","department_cost_center":null,"description_short":"Are you passionate about building innovative, world-class customer experiences that delight Amazon shoppers around the globe? As a Software Development Engineer II on our WW Deals and Promotions team in","display_distance":null,"id":"5c92cc5a-2b01-4efd-82d1-2039a73888c0","id_icims":"3127741","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3127741/software-development-engineer-ww-deals-promotions","job_schedule_type":"full-time","location":"CA, BC, Vancouver","locations":["{\"normalizedStateName\":\"British Columbia\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Vancouver\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, BC, Vancouver\",\"coordinates\":\"49.26038,-123.11336\",\"normalizedCountyName\":\"Metro Vancouver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Vancouver, British Columbia, CAN\",\"location\":\"CA, BC, Vancouver\",\"region\":\"BC\",\"buildingCodeList\":[\"YVR14\"],\"normalizedCityName\":\"Vancouver\"}"],"normalized_location":"Vancouver, British Columbia, CAN","optional_search_labels":[],"posted_date":"November 17, 2025","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eThe base salary for this position ranges from $114,800/year up to $191,800/year. Salary is based on a number of factors and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. Applicants should apply via our internal or external career site.","primary_search_label":"retail.no-team-listed","source_system":"JobCreator","state":"BC","title":"Software Development Engineer, WW Deals \u0026 Promotions","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3127741/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 1+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- 3+ years of Object Oriented Design experience","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon Leo will serve people and organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eYou will design, craft, and deploy reliable embedded software for large quantity of consumer electronic products. Leo is breaking new ground with every device we design, and you will be an integral part of bringing this family of products to customers.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement: Due to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e· Develop embedded software for terrestrial devices within the Leo system.\u003cbr/\u003e· Participate in all phases of SDLC including requirements gathering, design, code, test, and code/test coverage.\u003cbr/\u003e· Developing embedded software in assembly, C, C++, Rust or other languages\u003cbr/\u003e· Have experience with real-time embedded software philosophies and practices\u003cbr/\u003e· Have expertise working and developing in a Linux environment\u003cbr/\u003e· Review schematics, logic analyzer, and embedded software trouble-shooting techniques.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs part of our BSP software engineering team, you will design and implement embedded software used in the Leo products. You will work in a collaborative environment with teams inside and outside of Amazon. You will craft your software from requirements, designs, code, test, to product deployment. You need to be flexible and responsive to changing priority issues.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Leo Customer Terminal Software Team supports the devices that connect our customers to the Leo network. We provide software for both applications and the underlying Linux system. We work hand in hand with hardware, product and operations teams to deliver a great experience for our customers.","department_cost_center":null,"description_short":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to","display_distance":null,"id":"5f84dd87-cafb-44e1-aa95-bf65cbd70eea","id_icims":"3154772","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3154772/software-dev-engineer-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA114\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":[],"posted_date":"January  7, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Redmond - 143,700.00 - 194,400.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Software Dev Engineer, Amazon Leo","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3154772/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"alexa-and-amazon-devices","city":"Austin","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is an initiative to launch a constellation of Low Earth Orbit satellites that will provide low-latency, high-speed broadband connectivity to unserved and underserved communities around the world. As a Embedded Software Engineer you will be a part of the team participating in the definition and implementation of the communication software architecture of Amazon Leo’s broadband wireless modem. You will participate in all phases of physical layer software development, from architecture design, through requirements, implementation, test, and operational support. This is a unique opportunity to innovate and define novel wireless technology with few legacy constraints. The team develops the communication system of Leo and validates overall performance within key metrics such as throughput, latency, system availability, packet loss etc.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Develop embedded software in assembly, C, and C++ in a real-time operating system environment for broadband satellite communication modem systems.\u003cbr/\u003e- Work closely with ASIC, communication systems and software teams to support system bring-ups, end-to-end integration, and testing. \u003cbr/\u003e- Ability to adapt design and test activities based on current HW/SW capabilities delivered by the development teams.\u003cbr/\u003e- Support end-to-end testing using lab equipment such as Vector Signal Generators and Analyzers, Packet Generators, Channel Emulators. Contribute to development-test bring up procedures with Linux, Python, bash scripting etc.\u003cbr/\u003e- Support operations and maintenance using telemetry to validate link performance over key indicators such as throughput, latency, etc.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs part of our software engineering team, you will design and implement software to deploy on Leo satellites in R\u0026D and commercial operation. You will also develop tests and debug capabilities to validate implementations on ground and on orbit. You will work in a collaborative environment with teams in hardware development, software development and network operations. You need to be flexible and responsive to fast changing priorities and issues.","department_cost_center":null,"description_short":"Amazon Leo is an initiative to launch a constellation of Low Earth Orbit satellites that will provide low-latency, high-speed broadband connectivity to unserved and underserved communities around the world.","display_distance":null,"id":"8d7056e6-3a3a-45f9-886f-1a40a33e417f","id_icims":"3163715","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3163715/embedded-sw-engineer-wireless-systems","job_schedule_type":"full-time","location":"US, TX, Austin","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS13\"],\"normalizedCityName\":\"Austin\"}"],"normalized_location":"Austin, Texas, USA","optional_search_labels":[],"posted_date":"January 21, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Austin - 143,700.00 - 194,400.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"TX","title":"Embedded SW Engineer, Wireless Systems ","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3163715/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon Leo will serve people and organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- You will work with multiple cross functional teams to gather requirements, design, develop, deploy, and operate it across solution pipelines.\u003cbr/\u003e- You will collaborate and lead initiatives across multiple teams to build networking functions on AWS cloud infrastructure and set best practices for software development processes.\u003cbr/\u003e- You will lead teams, develop code, build CI/CD pipelines, test automation, and dashboards for monitoring health of systems and data pipelines.\u003cbr/\u003e- You will develop and mentor junior and new team members.\u003cbr/\u003e- You will engineer and build solutions which are required for provisioning, address management, packet inspection and dynamic traffic management for Internet service providers.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eA SDE in Leo Network Services is responsible for designing, developing, testing, deploying, and operating services that enable broadband networks systems worldwide. We write code, debug, and create the world’s most innovative products. We work in collaboration with other teams for designing and delivering scalable, flexible, low latency, and high throughput network functions. We develop flexible and cost-effective solutions in support of connecting and peering with public and private networks. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eLeo Network’s goal to connect users around the world, is a commitment to not just establish networks but to connect customers to services. These services enable customer terminals and applications the ability to interface with the larger world. Our services come into focus for each Leo subscriber at activation from address assignment and name resolution to secure and programmable network functions. The Network Services team walks backward from end-user’s perspective as we design and develop network functions that serve their unique asks.","department_cost_center":null,"description_short":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to","display_distance":null,"id":"9205dc99-c4e0-489d-aa02-990534961b11","id_icims":"3155387","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3155387/sr-software-development-engineer-leo-network-services","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA114\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":[],"posted_date":"January  8, 2026","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- Knowledge of professional software engineering \u0026 best practices for full software development life cycle, including coding standards, software architectures, code reviews, source control management, continuous deployments, testing, and operational excellence\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Redmond - 168,100.00 - 227,400.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Sr. Software Development Engineer, Leo Network Services","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3155387/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"Position Requirements:\u003cbr/\u003e\u003cbr/\u003eBachelor's degree or foreign equivalent degree in Computer Science, Engineering, Business Administration, Mathematics, Economics, or a related field and two years of experience in the job offered or a related occupation. Must have one year of experience in the following skill(s): experience in product, program, or project management; leading cross-functional teams in delivery of major new products or services; and experience with Supply Chain and Inventory Management.#0000","business_category":"no-business-category","city":"Seattle","company_name":"Amazon.com Services LLC - A57","country_code":"USA","description":"MULTIPLE POSITIONS AVAILABLE\u003cbr/\u003e\u003cbr/\u003eEmployer: AMAZON.COM SERVICES LLC\u003cbr/\u003eOffered Position: Product Manager II\u003cbr/\u003eJob Location: Seattle, Washington\u003cbr/\u003eJob Number: AMZ9442277\u003cbr/\u003e\u003cbr/\u003ePosition Responsibilities:\u003cbr/\u003e\u003cbr/\u003eDrive inventory efficiency through the identification and resolution of overstock and understock defects to support optimal CX. Develop actionable insights that relentlessly provide a better customer experience and hold U.S. supply chain, operations, and retail functions accountable for improving their outcomes. Work with Operations, Category Leaders, In-Stock Managers, Engineering, Transportation experts, SCOT Functions, Product and Finance partners to provide solutions. Establish and lead inventory efficiency improvement through programmatic and system solutions across multiple teams. Mine and analyze data for metrics and decision support on improving inventory health. Develop new insights and tools to understand the intent of the customer, and create 3-5 year roadmaps for scalable solutions to improve inventory efficiency.\u003cbr/\u003e\u003cbr/\u003ePosition Requirements:\u003cbr/\u003e\u003cbr/\u003eBachelor's degree or foreign equivalent degree in Computer Science, Engineering, Business Administration, Mathematics, Economics, or a related field and two years of experience in the job offered or a related occupation. Must have one year of experience in the following skill(s): experience in product, program, or project management; leading cross-functional teams in delivery of major new products or services; and experience with Supply Chain and Inventory Management.\u003cbr/\u003e\u003cbr/\u003eAmazon.com is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation.\u003cbr/\u003e\u003cbr/\u003e40 hours / week, 8:00am-5:00pm, Salary Range $116,300/year to $160,000/year.\u003cbr/\u003e\u003cbr/\u003eAmazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, visit:\u003cbr/\u003ehttps://www.aboutamazon.com/workplace/employee-benefits.#0000","department_cost_center":null,"description_short":"MULTIPLE POSITIONS AVAILABLEEmployer: AMAZON.COM SERVICES LLCOffered Position: Product Manager IIJob Location: Seattle, WashingtonJob Number: AMZ9442277Position Responsibilities:Drive inventory efficiency","display_distance":null,"id":"64a5f1bf-d823-494f-b266-01b5e6919c91","id_icims":"3160184","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Product Management","job_function_id":null,"job_path":"/en/jobs/3160184/product-manager-ii-amz9442277","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA40\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"January 15, 2026","preferred_qualifications":"Please see job description and the position requirements above.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 116,300.00 - 160,000.00 USD annually","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"WA","title":"Product Manager II - AMZ9442277","university_job":null,"updated_time":"21 minutes","url_next_step":"https://account.amazon.com/jobs/3160184/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of experience in cloud architecture and implementation\u003cbr/\u003e- Bachelor's degree in Computer Science, Engineering, related field, or equivalent experience\u003cbr/\u003e- 3+ year(s) of experience in IT security, compliance, or risk management\u003cbr/\u003e- 5+ years experience in technology automation, implementation, integration, and/or deployment","business_category":"aws","city":"Vancouver","company_name":"Amazon Web Services Canada, Inc.","country_code":"CAN","description":"The Amazon Web Services Professional Services (AWS ProServe) team is seeking a skilled Senior Delivery Consultant to join our Cloud Security team. As a Senior Security Consultant, you’ll work closely with customers to design, implement, and automate solutions in AWS to protect customer assets, enable customer security teams to operate more effectively, and ensure customers don’t accept unnecessary risk. You will work in fast-paced, complex projects that focus on delivering transformative business and security outcomes for customers globally. The ideal candidate is a highly skilled technical security professional with the ability to coach and guide executive security and cloud leaders in their journey, addressing topics such as security strategy and optimizing cloud security operations while being able to dive deep into AWS security technology.  Along the way, you’ll be expected to invent, extend, and adapt technology to tailor solutions to customer needs as well as coach and mentor junior consultants to enable their success.\u003cbr/\u003eThe AWS Professional Services organization is a global team of experts that help customers realize their desired business outcomes when using the AWS Cloud. We work together with customer teams and the AWS Partner Network (APN) to execute enterprise cloud computing initiatives. Our team provides assistance through a collection of offerings which help customers achieve specific outcomes related to enterprise cloud adoption. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries.\u003cbr/\u003e\u003cbr/\u003eJob # 10042\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs an experienced technology professional, you will be expected to: \u003cbr/\u003e1. Act as the technical leader for customer engagements and/or the security workstreams of engagements, leading teams of consultants,\u003cbr/\u003e2. Lead internal initiatives to deliver quantifiable impact\u003cbr/\u003e3. Develop strategic relationships with internal and external leaders \u003cbr/\u003e4. Design and implement complex, scalable, and secure AWS solutions tailored to customer needs \u003cbr/\u003e5. Enable and engage delivery partners in project delivery\u003cbr/\u003e6. Provide mentorship and coaching to develop others\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Global Services includes experts from across AWS who help our customers design, build, operate, and secure their cloud environments. Customers innovate with AWS Professional Services, upskill with AWS Training and Certification, optimize with AWS Support and Managed Services, and meet objectives with AWS Security Assurance Services. Our expertise and emerging technologies include AWS Partners, AWS Sovereign Cloud, AWS International Product, and the Generative AI Innovation Center. You’ll join a diverse team of technical experts in dozens of countries who help customers achieve more with the AWS cloud. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences: AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job below, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003eInclusive Team Culture - Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness. \u003cbr/\u003eMentorship \u0026 Career Growth - We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003eWork/Life Balance - We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e","department_cost_center":null,"description_short":"The Amazon Web Services Professional Services (AWS ProServe) team is seeking a skilled Senior Delivery Consultant to join our Cloud Security team. As a Senior Security Consultant, you’ll work closely with","display_distance":null,"id":"febe9f3d-6cd1-4525-9cad-e91331c103a4","id_icims":"3055205","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"Professional Services","job_function_id":null,"job_path":"/en/jobs/3055205/senior-delivery-consultant-cloud-security-namer","job_schedule_type":"full-time","location":"CA, BC, Vancouver","locations":["{\"normalizedStateName\":\"British Columbia\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Vancouver\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, BC, Vancouver\",\"coordinates\":\"49.26038,-123.11336\",\"normalizedCountyName\":\"Metro Vancouver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Vancouver, British Columbia, CAN\",\"location\":\"CA, BC, Vancouver\",\"region\":\"BC\",\"buildingCodeList\":[\"YVR26\"],\"normalizedCityName\":\"Vancouver\"}"],"normalized_location":"Vancouver, British Columbia, CAN","optional_search_labels":[],"posted_date":"August  9, 2025","preferred_qualifications":"- AWS experience preferred, with proficiency in a wide range of AWS services (e.g. EC2, S3, RDS, Lambda, IAM, VPC, CloudFormation)\u003cbr/\u003e- AWS Professional level certifications (e.g. Solutions Architect Professional, DevOps Engineer Professional) preferred\u003cbr/\u003e- Experience with automation and scripting (e.g. Terraform, Python)\u003cbr/\u003e- Knowledge of security and compliance standards (e.g. HIPAA, GDPR)\u003cbr/\u003e- Strong communication skills with the ability to explain technical concepts to both technical and non-technical audiences\u003cbr/\u003e- Work experience in any of the following industries: financial services (banking, capital markets, payments, insurance, or other segments), automotive, telecommunications, healthcare, life sciences, energy, media \u0026 entertainment, or manufacturing.\u003cbr/\u003e- Hands-on technical expertise in building security capabilities in code, deploying infrastructure as code, and implementing enterprise security solutions (e.g. WAF, IPS, Anti-DDOS, SIEM)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(34, 34, 34)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. As a total compensation company, Amazon's package may include other elements such as sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon offers comprehensive benefits including health insurance (medical, dental, vision, prescription, basic life \u0026amp; AD\u0026amp;D insurance), Registered Retirement Savings Plan (RRSP), Deferred Profit Sharing Plan (DPSP), paid time off, and other resources to improve health and well-being. We thank all applicants for their interest, however only those interviewed will be advised as to hiring status.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eCAN, BC, Vancouver - 126,000.00 - 210,400.00 CAD annually","primary_search_label":"aws.team-pro-serv","source_system":"JobCreator","state":"BC","title":"Senior Delivery Consultant - Cloud Security, NAMER","university_job":null,"updated_time":"21 minutes","url_next_step":"https://account.amazon.com/jobs/3055205/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-pro-serv","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}