{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 3+ years of engineering team management experience\u003cbr/\u003e- 7+ years of engineering experience\u003cbr/\u003e- 8+ years of leading the definition and development of multi tier web services experience\u003cbr/\u003e- Knowledge of engineering practices and patterns for the full software/hardware/networks development life cycle, including coding standards, code reviews, source control management, build processes, testing, certification, and livesite operations\u003cbr/\u003e- Experience partnering with product or program management teams","business_category":"ecp","city":"Dublin","company_name":"Amazon Development Centre Ireland Limited","country_code":"IRL","description":"Do you want to ensure a delightful shopping experience for millions of Amazon.com (http://amazon.com/) customers everyday? \u003cbr/\u003eThe Intelligent Cloud Hosting (ICON) team is looking for a Software Development Manager who is passionate to work on the development of innovative software products which will help boost engineers productivity in Amazon, for improving services’ posture towards security, availability, efficiency, compliance and maintainability. We aim to eliminate vast quantities of undifferentiated and often tedious work for Amazon development teams - our opportunity for impact to tens of thousands of developers is enormous.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs a Software Development Manager in the ICON team, you will be working on the development of next generation managed hosting platform technologies. You will lead the design, implementation, and successful delivery of large-scale, critical, or difficult software efforts involving a significant amount of work. You will be influencing your team’s technical and business strategy by making insightful contributions to team priorities and approach. You will work side-by-side and collaborate with strategic technical stakeholders and customers at both the senior leadership and operational levels to develop new products and that meet the needs of the Amazon e-Commerce platform. You will partner with multiple teams to come up with novel ways to make our retail website more secure and available for Amazon customers. You will solve complex yet fun challenges by looking at the big picture while diving deep.\u003cbr/\u003e\u003cbr/\u003eThe right candidate will possess proven software engineering skills, with experience creating and launching large distributed systems with the help of a team. You are expected to be versatile, able to thrive in a dynamic, entrepreneurial environment and eager to lead/mentor engineers. You are comfortable managing competing priorities and are able to bring order to ambiguous scenarios. Maturity, impeccable judgment, and the ability to influence and lead are essential to success in this role. You are data-driven and analytical. You can clearly \u0026 effectively communicate (written as well as verbally) across organizations and up to senior leadership.\u003cbr/\u003eThe Dublin team consists of System and Software Development Engineers and an Applied Scientist, so you will have access to all the skills you need to produce all round solutions.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e• Deliver high-impact, high-visibility projects that are used by thousands of Amazon Retail services, driving career advancement.\u003cbr/\u003e• Invent processes, tools, and technology to force multiply the effect of your contributions across many organizations.\u003cbr/\u003e• Be responsible for owning, scoping, leading and delivering projects and experiments end-to-end, leveraging statistical evaluation, pattern recognition, and machine learning.\u003cbr/\u003e• Have the ability to dive deep into a wide variety of problems and technologies to guide the right decisions for the products and the customers you will support.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe ICON team hosts Amazon websites and backend platform services that power the customer experience. We abstract and centralize the management from service teams, bring agility to business processes, and operate 100s of Tier-1 services behalf of our internal customers. ICON is an early adopter of Amazon’s product offerings and automates the management and operational activities on behalf of developers to strengthen services’ posture towards security, availability, and efficiency so that service developers can innovate on behalf of Amazon’s end customers. The ICON team is located within the Intelligent Control (ICC) organization who owns connecting our worldwide websites and other consumer experiences such as Kindle, Amazon Video, and Alexa to the internet, as well as ensuring the highest level of availability, security and privacy of the web services that power the experience we deliver to our customers worldwide.","department_cost_center":null,"description_short":"Do you want to ensure a delightful shopping experience for millions of Amazon.com (http://amazon.com/) customers everyday? The Intelligent Cloud Hosting (ICON) team is looking for a Software Development","display_distance":null,"id":"52230c97-56a8-42d1-9128-caa85154d479","id_icims":"3145580","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3145580/software-development-manager-icon","job_schedule_type":"full-time","location":"IE, D, Dublin","locations":["{\"normalizedCountryCode\":\"IRL\",\"city\":\"Dublin\",\"countryIso3a\":\"IRL\",\"countryIso2a\":\"IE\",\"locationNonStemming\":\"Ireland, D, Dublin\",\"coordinates\":\"53.34807,-6.24827\",\"normalizedCountyName\":\"County Dublin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Ireland\",\"normalizedLocation\":\"Dublin, IRL\",\"location\":\"IE, D, Dublin\",\"region\":\"D\",\"buildingCodeList\":[\"DUB14\"],\"normalizedCityName\":\"Dublin\"}"],"normalized_location":"Dublin, IRL","optional_search_labels":[],"posted_date":"December 18, 2025","preferred_qualifications":"- Experience in communicating with users, other technical teams, and senior leadership to collect requirements, describe software product features, technical designs, and product strategy\u003cbr/\u003e- Experience in recruiting, hiring, mentoring/coaching and managing teams of Software Engineers to improve their skills, and make them more effective, product software engineers\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"ecp.engine","source_system":"JobCreator","state":"D","title":"Software Development Manager, ICON","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3145580/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"engine","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Currently enrolled in vocational training as Fachinformatiker (IT Specialist) or comparable training program, minimum in 2nd year of training\u003cbr/\u003e- Interest in IT and cloud technologies\u003cbr/\u003e- Willingness to learn new things and work in a team\u003cbr/\u003e- Openness to various areas of responsibility\u003cbr/\u003e- Internship duration: 12 months, Start: March 2026","business_category":"aws","city":"Munich","company_name":"AWS EMEA SARL (Germany Branch) - H13","country_code":"DEU","description":"THIS ROLE IS OPEN TO STUDENTS FROM BBW ABENSBERG SEEKING AN INTERNSHIP WITH A START DATE FROM MARCH 2026 - FEBRUARY 2027.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAWS Global Sales drives cloud adoption worldwide, enabling customers of all sizes to innovate and expand in the cloud. Our team empowers every customer to grow by providing tailored service, cutting-edge technology, and unwavering support. We dive deep to understand each customer's unique challenges and develop innovative solutions that accelerate their success. With this customer-focused approach, we have built the world's most widely used cloud platform. Join us and help us grow.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs an IT Intern at AWS, you will have the opportunity to gain practical experience in the IT world and contribute to real projects. You'll support the team with daily IT tasks, learn about various cloud technologies, and assist with the documentation and preparation of technical information. The role also includes collaboration on customer projects, where you will gain insights into working with companies across different sectors and understand how AWS solutions support customers in their digital transformation. You will be accompanied and supported by experienced mentors who will individually address your learning needs. The internship enables you to develop new skills, contribute your own strengths, and learn in an inclusive environment that values diversity and respects individual working styles.\u003cbr/\u003eThis internship is part of the AWS team in Germany, where you will work internally on projects across various AWS organizations and with companies throughout Germany.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all the qualifications and skills listed in the job description, we encourage you to apply. Whether your career is just beginning, has taken a non-traditional path, or includes alternative experiences, don't let that stop you from applying.\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world's most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and have never stopped innovating - that's why customers, from the most successful startups to Global 500 companies, trust our robust range of products and services to drive their business forward.\u003cbr/\u003eWork-Life Balance\u003cbr/\u003eWe value a balanced work-life harmony. Professional success should never come at the expense of personal sacrifices. That's why we strive for flexibility as part of our work culture. When we feel supported at work and at home, there's nothing we can't achieve.\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it's in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empowers us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to continually embrace our uniqueness.\u003cbr/\u003eMentoring and Career Growth\u003cbr/\u003eWe constantly raise the bar for our performance as we strive to become the world's best employer. That's why you'll find countless opportunities for knowledge sharing, mentoring, and other career-enhancing resources that support you in developing into a better professional.\u003cbr/\u003e","department_cost_center":null,"description_short":"THIS ROLE IS OPEN TO STUDENTS FROM BBW ABENSBERG SEEKING AN INTERNSHIP WITH A START DATE FROM MARCH 2026 - FEBRUARY 2027.AWS Global Sales drives cloud adoption worldwide, enabling customers of all sizes","display_distance":null,"id":"c7ff17ad-fcb1-4cec-9847-f69476bf544d","id_icims":"3133651","is_intern":null,"is_manager":null,"job_category":"Solutions Architect","job_family":"Solution Architect","job_function_id":null,"job_path":"/en/jobs/3133651/neurodiverse-it-internship-for-bbw-abensberg-solution-architect-and-partner-field-emea","job_schedule_type":"full-time","location":"DE, BY, Munich","locations":["{\"normalizedStateName\":\"Bavaria\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Munich\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, BY, Munich\",\"coordinates\":\"48.13641,11.57754\",\"normalizedCountyName\":\"Munich\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Munich, Bavaria, DEU\",\"location\":\"DE, BY, Munich\",\"region\":\"BY\",\"buildingCodeList\":[\"MUC14\"],\"normalizedCityName\":\"Munich\"}"],"normalized_location":"Munich, Bavaria, DEU","optional_search_labels":[],"posted_date":"November 27, 2025","preferred_qualifications":"- German and English language skills\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-solutions-architect-primary","source_system":"JobCreator","state":"BY","title":"Neurodiverse IT Internship for BBW ABENSBERG , Solution Architect and Partner Field EMEA","university_job":null,"updated_time":"19 minutes","url_next_step":"https://account.amazon.com/jobs/3133651/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-solutions-architect-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- •\tMust be 18 years of age or older\u003cbr/\u003e- •\tEducation Requirements (must meet one):\u003cbr/\u003e- o\tCurrently enrolled in Bachelor's degree or above in Computer Science, Computer Engineering, Data Science, Information Systems, or related STEM fields [degrees can be updated based on regional variations]\u003cbr/\u003e- o\tCompleted Bachelor's or Graduate degree in specified fields\u003cbr/\u003e- •\tDemonstrated experience with at least one general-purpose programming language such as Java, Python, C++, C#, Go, Rust, or TypeScript\u003cbr/\u003e- •\tDemonstrated experience one or more of the following:\u003cbr/\u003e- o\tData structures implementation\u003cbr/\u003e- o\tBasic algorithm development\u003cbr/\u003e- o\tObject-oriented design principles\u003cbr/\u003e- •\tExperience with AI/ML technologies","business_category":"studentprograms","city":"London","company_name":"Amazon Business EU SARL (UK) - H91","country_code":"GBR","description":"Do you want to solve real customer problems through innovative technology? Do you enjoy working on scalable services in a collaborative team environment? Do you want to see your code directly impact millions of customers worldwide?\u003cbr/\u003eAt Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. Customer obsession is part of our company DNA, which has made us one of the world's most beloved brands.\u003cbr/\u003eOur Software Development Engineer (SDE) interns use modern technology to solve complex problems while seeing their work's impact first-hand. The challenges SDE interns solve at Amazon are meaningful and influence millions of customers, sellers, and products globally. We seek individuals passionate about creating new products, features, and services while managing ambiguity in an environment where development cycles are measured in weeks, not years. \u003cbr/\u003eAt Amazon, we believe in ownership at every level. As an SDE intern, you'll own the entire lifecycle of your code - from design through deployment and ongoing operations. This ownership mindset, combined with our commitment to operational excellence, ensures we deliver the highest quality solutions for our customers.\u003cbr/\u003eWe're looking for curious minds who think big and want to define tomorrow's technology. At Amazon, you'll grow into the high-impact engineer you know you can be, supported by a culture of learning and mentorship. Every day brings exciting new challenges and opportunities for personal growth.\u003cbr/\u003e\u003cbr/\u003eAmazon internships across all seasons are full-time positions, and interns should expect to work in office, Monday-Friday, up to 40 hours per week typically between 8am-5pm. Specific team norms around working hours will be communicated by your manager. Interns should not have conflicts such as classes or other employment during the Amazon work-day. Applicants should have a minimum of one quarter/semester/trimester remaining in their studies after their internship concludes.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tCollaborate and communicate effectively with experienced cross-disciplinary Amazonians to design, build, and operate innovative products and services that delight our customers, while participating in technical discussions to drive solutions forward.\u003cbr/\u003e•\tDesign and develop scalable solutions using cloud-native architectures and microservices in a large distributed computing environment.\u003cbr/\u003e•\tParticipate in code reviews and contribute to technical documentation.\u003cbr/\u003e•\tBuild and maintain resilient distributed systems that are scalable, fault-tolerant, and cost-effective.\u003cbr/\u003e•\tLeverage and contribute to the development of GenAI and AI-powered tools to enhance development productivity while staying current with emerging technologies. \u003cbr/\u003e•\tWrite clean, maintainable code following best practices and design patterns.\u003cbr/\u003e•\tWork in an agile environment practicing CI/CD principles while participating in operational responsibilities including on-call duties.\u003cbr/\u003e•\tDemonstrate operational excellence through monitoring, troubleshooting, and resolving production issues.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs an intern, you will be matched to a manager and a mentor and will have the opportunity to influence the evolution of Amazon technology and lead critical projects early in your career. \u003cbr/\u003e\u003cbr/\u003eThe team requires an internship duration of 3 to 6 months.\u003cbr/\u003e\u003cbr/\u003eIn addition to working on an impactful project, you will have the opportunity to engage with Amazonians for both personal and professional development, expand your network, and participate in activities with other interns throughout your internship. No matter the location of your internship, we give you the tools to own your project and learn in a real-world setting.\u003cbr/\u003e","department_cost_center":null,"description_short":"Do you want to solve real customer problems through innovative technology? Do you enjoy working on scalable services in a collaborative team environment? Do you want to see your code directly impact millions","display_distance":null,"id":"7ff76beb-cd95-4428-96dc-d6498ae1d9fe","id_icims":"3130532","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3130532/software-dev-intern-ai-machine-learning","job_schedule_type":"full-time","location":"GB, London","locations":["{\"normalizedStateName\":\"England\",\"normalizedCountryCode\":\"GBR\",\"city\":\"London\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, London\",\"coordinates\":\"51.50643,-0.12719\",\"normalizedCountyName\":\"London\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"London, England, GBR\",\"location\":\"GB, London\",\"region\":\"\",\"buildingCodeList\":[\"LHR16\"],\"normalizedCityName\":\"London\"}","{\"normalizedStateName\":\"England\",\"normalizedCountryCode\":\"GBR\",\"city\":\"Cambridge\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, Cambridge\",\"coordinates\":\"52.20992,0.11161\",\"normalizedCountyName\":\"Cambridgeshire\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"Cambridge, England, GBR\",\"location\":\"GB, Cambridge\",\"region\":\"\",\"buildingCodeList\":[\"CBG10\"],\"normalizedCityName\":\"Cambridge\"}"],"normalized_location":"London, England, GBR","optional_search_labels":[],"posted_date":"November 21, 2025","preferred_qualifications":"- •\tExperience in GenAI and Agent service development using LLM/VLM.\u003cbr/\u003e- •\tPrevious technical internship(s) or demonstrated project experience\u003cbr/\u003e- •\tExperience with one or more of the following:\u003cbr/\u003e- o\tAI tools for development productivity\u003cbr/\u003e- o\tCloud platforms (preferably AWS)\u003cbr/\u003e- o\tDatabase systems (SQL and NoSQL)\u003cbr/\u003e- o\tContributing to open-source projects\u003cbr/\u003e- o\tVersion control systems\u003cbr/\u003e- o\tDebugging and troubleshooting complex systems\u003cbr/\u003e- •\tStrong problem-solving and analytical skills\u003cbr/\u003e- •\tExcellent written and verbal communication skills\u003cbr/\u003e- •\tDemonstrated ability to learn and adapt to new technologies quickly\u003cbr/\u003e- •\tBasic understanding of software development lifecycle (SDLC)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"studentprograms.team-internships-for-students","source_system":"JobCreator","state":null,"title":"Software Dev Intern - AI / Machine Learning","university_job":null,"updated_time":"22 minutes","url_next_step":"https://account.amazon.com/jobs/3130532/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-internships-for-students","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree, or experience in a relevant field\u003cbr/\u003e- Experience in making and/or responding to law enforcement requests\u003cbr/\u003e- cloud certification like AWS Cloud Practitioner or AWS Solutions Architect - Associate\u003cbr/\u003e- This role requires you to be a national of an EU member state","business_category":"amazon-security","city":"Dublin","company_name":"Amazon Web Services EMEA SARL (Irish Branch)","country_code":"IRL","description":"The Amazon Security team is searching for a motivated individual to assist the Law Enforcement Information Program with processing information and data requests received from law enforcement. You will be responsible for working closely with the Legal Department to respond to law enforcement requests (e.g., subpoenas, search warrants) received from government agencies located in the EU, US, and worldwide. We are seeking a talented individual who can contribute to this critical function as the company continues to grow and scale around the world.\u003cbr/\u003e\u003cbr/\u003eYour principal duty is to help make sure that requests are processed accurately, professionally and, expeditiously, all while ensuring the privacy and security of business and customer information in accordance with applicable laws and with AS's internal policies and procedures. This role requires high judgment, and experience dealing with challenging and ambiguous situations.\u003cbr/\u003e\u003cbr/\u003eThis role requires a strong ability to operate asynchronously: Because law enforcement requests are global in scope, you must be able to interface effectively with the attorneys and other technical and non-technical personnel, many of whom will be globally distributed. The team itself is also globally distributed; ideal candidates are those who can excel at independent, team-centric operations.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Evaluate and respond accurately to law enforcement requests in a manner consistent with the privacy and security of business and customer information, in accordance with applicable laws and with Amazon Security' various policies and procedures\u003cbr/\u003e- Utilize a combination of manual and automated tools to compile information potentially responsive to a particular law enforcement request\u003cbr/\u003e- Communicate verbally and in writing with the attorneys and other internal partners, service teams and stakeholders\u003cbr/\u003e- Coordinate with multi-team partners to resolve requests and improve policy, procedures, and tooling\u003cbr/\u003e- Assist in the identification of patterns and trends that might be evident from the processing of certain law enforcement requests\u003cbr/\u003e- Assist with the delivery of program metrics and provide input for metrics improvement and overall program process improvement initiatives\u003cbr/\u003e- Identify and develop solutions that drive efficiency gains, reduce pain-points and delays, or reduce manual effort in completing team priorities and workstreams. This may include basic scripting (e.g., Python), GenAI use, or similar tools and platforms.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout Amazon Security  \u003cbr/\u003e\u003cbr/\u003eDiverse Experiences  \u003cbr/\u003eAmazon Security values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy Amazon Security?  \u003cbr/\u003eAt Amazon, security is central to maintaining customer trust and delivering delightful customer experiences. Our organization is responsible for creating and maintaining a high bar for security across all of Amazon’s products and services. We offer talented security professionals the chance to accelerate their careers with opportunities to build experience in a wide variety of areas including cloud, devices, retail, entertainment, healthcare, operations, and physical stores.\u003cbr/\u003e \u003cbr/\u003eInclusive Team Culture  \u003cbr/\u003eIn Amazon Security, it’s in our nature to learn and be curious. Ongoing DEI events and learning experiences inspire us to continue learning and to embrace our uniqueness. Addressing the toughest security challenges requires that we seek out and celebrate a diversity of ideas, perspectives, and voices.\u003cbr/\u003e\u003cbr/\u003eTraining \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, training, and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance  \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.","department_cost_center":null,"description_short":"The Amazon Security team is searching for a motivated individual to assist the Law Enforcement Information Program with processing information and data requests received from law enforcement. You will","display_distance":null,"id":"2f7b260f-03d4-43bf-8a99-2451bb7f1d41","id_icims":"3166343","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"Security Industry Specialist","job_function_id":null,"job_path":"/en/jobs/3166343/security-information-specialist-law-enforcement-information-program","job_schedule_type":"full-time","location":"IE, D, Dublin","locations":["{\"normalizedCountryCode\":\"IRL\",\"city\":\"Dublin\",\"countryIso3a\":\"IRL\",\"countryIso2a\":\"IE\",\"locationNonStemming\":\"Ireland, D, Dublin\",\"coordinates\":\"53.34807,-6.24827\",\"normalizedCountyName\":\"County Dublin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Ireland\",\"normalizedLocation\":\"Dublin, IRL\",\"location\":\"IE, D, Dublin\",\"region\":\"D\",\"buildingCodeList\":[\"DUB12\"],\"normalizedCityName\":\"Dublin\"}"],"normalized_location":"Dublin, IRL","optional_search_labels":[],"posted_date":"January 26, 2026","preferred_qualifications":"- Knowledge of at least one data-focused technology tool, such as Python, SQL, Alteryx, Amazon QuickSight, or similar\u003cbr/\u003e- Experience working with customers with a passion for delivering exceptional service, or experience that includes strong analytical skills, attention to detail, and effective communication abilities\u003cbr/\u003e- Can work proactively and independently, meet deadlines, and deliver on projects and tasks\u003cbr/\u003e- Experience taking ownership and driving resolution on escalated customer issues\u003cbr/\u003e- Knowledge of core internet technologies, including DHCP, DNS, mail transport, TCP/IP, and network file systems\u003cbr/\u003e- Knowledge of security and compliance standards including HIPAA and GDPR\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-security.no-team-list","source_system":"JobCreator","state":"D","title":"Security Information Specialist, Law Enforcement Information Program","university_job":null,"updated_time":"23 minutes","url_next_step":"https://account.amazon.com/jobs/3166343/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-list","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- 2+ years of sales or account management experience\u003cbr/\u003e- 2+ years of digital advertising and client facing roles experience\u003cbr/\u003e- Experience with Excel\u003cbr/\u003e- Experience analyzing data and best practices to assess performance drivers","business_category":"retail","city":"Bengaluru","company_name":"ADCI - BLR 14 SEZ - F07","country_code":"IND","description":"We are seeking a passionate, experienced and analytical business professional based in India. The Account Manager will be primarily responsible for 1) managing vendors at scale; 2) improving business terms and developing the marketing and promotion strategy at scale; 3) driving the top and bottom line of the business while working closely with South Africa teams to drive operational improvements; and 4) own vendor relationship to drive vendor self-sufficiency in long-term. The candidate should have experience in analyzing opportunities for systematic improvements in business management function and building good processes and standard operating procedures to drive process-improvements. Candidate should be comfortable managing multiple responsibilities within a fast-paced environment and preferably with experience in e-commerce.\u003cbr/\u003e\u003cbr/\u003eThe successful Account Manager:\u003cbr/\u003e\u003cbr/\u003eManages day to day business relationship, and proactively and autonomously negotiates costs, promotional opportunities, and other business inputs.\u003cbr/\u003eConducts pricing and ROI analysis and makes recommendations for initiatives that optimize profit margin.\u003cbr/\u003ePossess a good understanding of internal and external variables that impact the business.\u003cbr/\u003eUses data to identify trends, opportunities and risks and translate those insights into actions to drive long-term growth.\u003cbr/\u003eIdentifies opportunities for systematic process improvement and drives those improvements at scale.","department_cost_center":null,"description_short":"We are seeking a passionate, experienced and analytical business professional based in India. The Account Manager will be primarily responsible for 1) managing vendors at scale; 2) improving business terms","display_distance":null,"id":"f152b20e-e51f-4123-a796-6b3b9637e51d","id_icims":"3167223","is_intern":null,"is_manager":null,"job_category":"Buying, Planning, \u0026 Instock Management","job_family":"Account Management","job_function_id":null,"job_path":"/en/jobs/3167223/retail-account-manager-mass-vendor-relations","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR14\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"January 27, 2026","preferred_qualifications":"- Experience analyzing key open issues and resolution metrics for each of the managed accounts\u003cbr/\u003e- Experience in relationship management within technology, start-ups, or SaaS Platforms\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"retail.team-vendor-systems-experiences","source_system":"JobCreator","state":"KA","title":"Retail Account Manager, Mass Vendor Relations","university_job":null,"updated_time":"27 minutes","url_next_step":"https://account.amazon.com/jobs/3167223/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-vendor-systems-experiences","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Speak, write, and read fluently in Arabic\u003cbr/\u003e- Speak, write, and read fluently in English","business_category":"fulfillment-ops","city":"As Sulay","company_name":"Afaq - Warehouse Branch","country_code":"SAU","description":"Amazon.com strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online. By giving customers more of what they want - low prices, vast selection, and convenience - Amazon.com continues to grow and evolve as a world-class e-commerce platform. Amazon's evolution from Web site to e-commerce partner to development platform is driven by the spirit of innovation that is part of the company's DNA. The world's brightest technology minds come to Amazon.com to research and develop technology that improves the lives of shoppers and sellers around the world.\u003cbr/\u003e\u003cbr/\u003eAmazon Worldwide Operations is the underlying fulfillment and customer service engine that ensures Amazon creates the same consistent, world-class customer experience every time. We are looking for high-potential, flexible, innovative, and forward-thinking professionals to join our External Fulfillment team. Are you ready to drive high-visibility, strategic, revenue-generating projects as well as leverage Lean methodologies to lead Operational process improvement initiatives? Are you equally comfortable digging into business requirements as you are drilling into architecture and design with development teams? Join the External Fulfillment team as a City Manager.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e1. Monitor operations of the assigned sites and suggest \u0026 deploy improvements\u003cbr/\u003e2. Identify useful data accumulated from multiple sources and take necessary actions\u003cbr/\u003e3. Foresee implications based on current data and trends\u003cbr/\u003e4. Be organized and prompt in notifying the situation, problem solve and recur prevention\u003cbr/\u003e5. Serve as a liaison between the internal and external stakeholders keeping in mind the objectives, limits, conformance and information privacy\u003cbr/\u003e6. Train \u0026 direct associates for action and conformance of norms \u0026 practices\u003cbr/\u003e7. Audit the sites for various operational conformances, restrictions and norms\u003cbr/\u003e8. Conduct audits on based on SOPs, analyze data and propose features focusing on improving the Seller experience\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs City Manager, you will be responsible for monitoring multiple sites from operations and compliance point of view. You will be working with multiple internal and external stakeholders to achieve Adherence to Amazon Standards and operations metrics. With customer obsession and a high sense of ownership, you will utilize your skills to identify patterns and any disruptions in it. You should be able to dive deep, scrutinize details and foresee data implications. You must be flexible to work weekends and/or overnight shifts regularly and to travel to sites for launch, set up, support, audit and monitor operations.\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon.com strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online. By giving customers more of what they want - low prices, vast","display_distance":null,"id":"c2ffc3cf-96be-40c3-bbf2-ced0a09ec63d","id_icims":"3182463","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Administrative Support","job_function_id":null,"job_path":"/en/jobs/3182463/city-manager-external-fulfillment","job_schedule_type":"full-time","location":"SA, As Sulay","locations":["{\"normalizedCountryCode\":\"SAU\",\"city\":\"As Sulay\",\"countryIso3a\":\"SAU\",\"countryIso2a\":\"SA\",\"locationNonStemming\":\"Saudi Arabia, As Sulay\",\"coordinates\":\"24.68208,46.68723\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Saudi Arabia\",\"normalizedLocation\":\"SAU\",\"location\":\"SA, As Sulay\",\"region\":\"\",\"buildingCodeList\":[\"RUH12\"]}"],"normalized_location":"SAU","optional_search_labels":[],"posted_date":"February 17, 2026","preferred_qualifications":"- Bachelor's degree\u003cbr/\u003e- Knowledge of city topography and road network\u003cbr/\u003e- Experience completing complex tasks quickly with little to no guidance and react with appropriate urgency to situations that require a quick turnaround\u003cbr/\u003e- Experience in an operational role\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-global-specialty-fulfillment","source_system":"JobCreator","state":null,"title":"City Manager, External Fulfillment","university_job":null,"updated_time":"27 minutes","url_next_step":"https://account.amazon.com/jobs/3182463/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-specialty-fulfillment","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 7+ years of conducting workplace risk investigations experience\u003cbr/\u003e- Experience in conducting workplace risk investigations\u003cbr/\u003e- Experience leveraging technology to drive process improvements\u003cbr/\u003e- Experience managing direct reports\u003cbr/\u003e- Bachelor's degree or equivalent","business_category":"eu3p_marketplace","city":"Bangalore","company_name":"ADCI - BLR - DTA - I99","country_code":"IND","description":"In EU, we continue to observe an unprecedented wave of legislation that impacts Selling Partner (SP) experience, constrains selection and jeopardizes growth. This increases the complexity and cost of selling in EU and makes compliance the primary barrier to SP launches in the region.\u003cbr/\u003e\u003cbr/\u003eAs a Derisking Manager in EU3P Compliance programs - you execute plans to scale tax or trade compliance program across EU and UK. You will partner with organizations to (1) define the seller experience to increase compliance, (2) shape the risk appetite for executive leadership, (3) implement the seller enforcement and regain strategy for EU and UK marketplaces, and (4) implement and drive simplification initiatives\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate is motivated and agile, with strong project management skills. This opportunity requires excellent troubleshooting, stakeholder management and communication skills. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- execute the seller experience plan together with product management \u003cbr/\u003e- shape the risk appetite for executive leadership,\u003cbr/\u003e- implement the seller enforcement and regain strategy for EU and UK marketplaces including reporting mechanisms,\u003cbr/\u003e- implement and drive simplification initiatives based on customer or team feedback \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eEU 3P Compliance is a business team that works at the intersection of \u003cbr/\u003e1) sellers - helping them to comply with requirements\u003cbr/\u003e2) amazon - reducing financial exposure and risks  that we are facing\u003cbr/\u003e3) authorities - partnering to support their needs in a business friendly way","department_cost_center":null,"description_short":"In EU, we continue to observe an unprecedented wave of legislation that impacts Selling Partner (SP) experience, constrains selection and jeopardizes growth. This increases the complexity and cost of selling","display_distance":null,"id":"7159ac66-dd2b-4c5a-b061-d68230d8e54b","id_icims":"3182455","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Risk Family","job_function_id":null,"job_path":"/en/jobs/3182455/senior-de-risking-manager-tax-compliance-eu-3p-seller-services","job_schedule_type":"full-time","location":"IN, KA, Bangalore","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bangalore\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bangalore\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bangalore\",\"region\":\"KA\",\"buildingCodeList\":[\"YSUI\",\"YESN\",\"WBL7\",\"YSUT\",\"TBR5\",\"FBLG\",\"QSAS\",\"QSAH\",\"ZSDS\",\"PBL4\",\"TBP8\",\"TBX7\",\"HBL6\",\"WBLB\",\"YSE5\",\"TBY2\",\"RSBM\",\"QSAL\",\"TBAA1\",\"QRRR\",\"YSUX\",\"TBS7\",\"YSF7\",\"WBLQ\",\"QSCT\",\"ZSEF\",\"RSBB\",\"RSO2\",\"QSBU\",\"BLR73\",\"TBW5\",\"BLU46\",\"WBLM\",\"YSE1\",\"BLU43\",\"HBL2\",\"WSAA\",\"YEYT\",\"FKPB\",\"YSFF\",\"RSAK\",\"TBS4\",\"BLR47\",\"YSIT\",\"YSUB\",\"TBY6\",\"ZSE8\",\"WBLI\",\"HBB42\",\"RSA4\",\"DPYN\",\"WBLT\",\"FBLO\",\"QSAD\",\"FBLN\",\"BLT01\",\"ZSEC\",\"TBS3\",\"UBL9\",\"TBR2\",\"IRYI\",\"QSAE\",\"YSYR\",\"TBY5\",\"BLR32\",\"TBP5\",\"YSYJ\",\"QSAP\",\"HBL3\",\"BLU47\",\"YESJ\",\"UBLE\",\"YSFM\",\"YSUL\",\"BLR81\",\"YSL2\",\"WBAA\",\"BLR48\",\"PNR3\",\"YSYK\",\"BLU42\",\"QSBV\",\"WBA6\",\"YEYS\",\"WBA5\",\"MYQ2\",\"QSHS\",\"HBB91\",\"BLR52\",\"RSBL\",\"BLU80\",\"TBT2\",\"UBL2\",\"YESC\",\"WBLU\",\"TBP4\",\"TBR6\",\"TBN1\",\"TBW4\",\"BLR53\",\"KSZB\",\"YSE6\",\"YSUJ\",\"PBL5\",\"QSBB\",\"WBL6\",\"SBLD\",\"FBLH\",\"WBLC\",\"BLU49\",\"UBL3\",\"FBLJ\",\"YSIS\",\"YESD\",\"XSAA\",\"TBR4\",\"YSNZ\",\"YESM\",\"WBLE\",\"HSS40\",\"WBLN\",\"TBW6\",\"KEZM\",\"YESK\",\"QSAX\",\"YSUQ\",\"BLR57\",\"RSBN\",\"BLR88\",\"TBT1\",\"TBR8\",\"HBE5\",\"TBN3\",\"WBA1\",\"YSDY\",\"YZZ3\",\"YSUH\",\"SBLZ\",\"YZZ6\",\"WBL2\",\"FBLL\",\"BRU92\",\"YSUO\",\"TBQ8\",\"TBW9\",\"TBX2\",\"YZZK\",\"WBA3\",\"QSAZ\",\"BLR93\",\"TBR1\",\"KERX\",\"YSL6\",\"WBLS\",\"QSAN\",\"TBX4\",\"BLT4\",\"TBT6\",\"QSAB\",\"ZSEA\",\"TBY9\",\"YEWD\",\"ZSDT\",\"WBL4\",\"WBLL\",\"HBB40\",\"YSE3\",\"YSIU\",\"TBS6\",\"YSF8\",\"KELI\",\"YSUV\",\"UBL41\",\"BLR4\",\"RSBI\",\"FBL2\",\"XBLB\",\"BRU46\",\"YESF\",\"YEW8\",\"YSYT\",\"UBL5\",\"TBC7\",\"YEXP\",\"TBN8\",\"BRU91\",\"QSAU\",\"QSBA\",\"BLR54\",\"RSBK\",\"XSBZ\",\"PKHS\",\"TBX9\",\"YEW0\",\"YSIR\",\"YSFD\",\"BLX2\",\"QSCG\",\"BLU41\",\"YESP\",\"TBR7\",\"KELQ\",\"FBL3\",\"BLR83\",\"TBW3\",\"ZSEH\",\"YESE\",\"QSMU\",\"MYQ1\",\"BLR50\",\"RSBG\",\"TBX5\",\"ZSDU\",\"TBP6\",\"YSYL\",\"TBY4\",\"QSBE\",\"SBLA\",\"RSA6\",\"RSA3\",\"WBLD\",\"YZZB\",\"BLR262\",\"WBL5\",\"FBLI\",\"YSL4\",\"BLU91\",\"WBA7\",\"BLR8\",\"BLR257\",\"YSDZ\",\"WBL1\",\"UBLC\",\"ZSED\",\"TBP3\",\"YSUN\",\"ZSE9\",\"UBL7\",\"TBY7\",\"SMA3\",\"YESH\",\"HBB43\",\"YSE0\",\"WBLV\",\"FBLM\",\"KEZ4\",\"TBQ9\",\"YEW4\",\"WBLH\",\"BRD40\",\"BLR80\",\"ZSEE\",\"BLR91\",\"YSF6\",\"TBX1\",\"BLR87\",\"QSBP\",\"BLU48\",\"TBS2\",\"TBW7\",\"YEYR\",\"YSYE\",\"YSL3\",\"BLROTH\",\"QSAQ\",\"WBAB\",\"HBL4\",\"BLR49\",\"YSUG\",\"BLNX\",\"XSAB\",\"TBX6\",\"FKPC\",\"YSUS\",\"YESO\",\"YSF5\",\"TBS9\",\"YEXA\",\"BLR58\",\"YESI\",\"BLR7\",\"KSLD\",\"BLR33\",\"QSBD\",\"PBL3\",\"UBL8\",\"TBR3\",\"YEXS\",\"BLR84\",\"BNG93\",\"TBT3\",\"FKPA\",\"YSFE\",\"YSO0\",\"RSBJ\",\"YESB\",\"TBX8\",\"YSUU\",\"TBP9\",\"TBY1\",\"QSAT\",\"KSLP\",\"WBM1\",\"WBLP\",\"QSAK\",\"WBLY\",\"BLR72\",\"YSYD\",\"BLR86\",\"XSAJ\",\"QSAR\",\"BLR5\",\"TBZ1\",\"RSBA\",\"KSLL\",\"YEY5\",\"BLR51\",\"QSDH\",\"QRRS\",\"YZZT\",\"RSBH\",\"TBW8\",\"WBA4\",\"TBT7\",\"ZSIJ\",\"HBL5\",\"BLU40\",\"YSE4\",\"BLR82\",\"BLR999\",\"FBLF\",\"YEYQ\",\"BLR41\",\"YSL5\",\"BLR92\",\"BLU45\",\"PNLE\",\"UBLZ\",\"IRXF\",\"TBA11\",\"SBLT\",\"BLR46\",\"TBX3\",\"WBA2\",\"TBQ7\",\"QSBR\",\"YSUD\",\"UBL6\",\"PBL1\",\"BLU88\",\"TBP2\",\"HBB41\",\"TBN9\",\"ZSEB\",\"BLU93\",\"TBY8\",\"SMA4\",\"BLT02\",\"HBM7\",\"WBLK\",\"YESG\",\"YSYG\",\"QSAY\",\"FBLP\",\"TBY3\",\"WBLF\",\"BLR140\",\"ZSEG\",\"YSDX\",\"QSAM\",\"RSA7\",\"BLR263\",\"BLX1\",\"RSAJ\",\"FBLK\",\"BLT3\",\"RSBO\",\"YSNY\",\"YESL\",\"BLR74\",\"TBT5\",\"TBN2\",\"BRU40\",\"BLR200\",\"WBLR\",\"SBLC\",\"TBP7\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"February 17, 2026","preferred_qualifications":"- 7+ years of customer-facing environment experience\u003cbr/\u003e- CPA, CMA, CISA, CIA or equivalent risk, audit, or compliance credentials\u003cbr/\u003e- Lean Six Sigma Green Belt or Black Belt certification\u003cbr/\u003e- Knowledge of Microsoft Office including Outlook, Word, and Excel\u003cbr/\u003e- Experience working in a customer-facing environment\u003cbr/\u003e- Experience with physical security control and surveillance systems\u003cbr/\u003e- Master's degree or equivalent\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"eu3p_marketplace.team-eu-sellerservices","source_system":"JobCreator","state":"KA","title":"Senior De-risking Manager, Tax Compliance - EU 3P (Seller Services)","university_job":null,"updated_time":"30 minutes","url_next_step":"https://account.amazon.com/jobs/3182455/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-eu-sellerservices","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"• Fluent in written and spoken Polish\u003cbr/\u003e• Bachelor’s degree in engineering or science-based discipline. \u003cbr/\u003e• Experience in facilities management, including both hard and soft services. \u003cbr/\u003e• Vendor management in large and complex 24/7 operational facilities. \u003cbr/\u003e• Experience of managing services across multiple sites and countries. \u003cbr/\u003e• Experience with change management and process standardization. \u003cbr/\u003e• Strong problem-solving skills and innovative thinking to enhance customer experience and address challenges in facility management. \u003cbr/\u003e• Data analysis including high proficiency in Excel. \u003cbr/\u003e• English business proficiency \u003cbr/\u003e• Ability to travel up to 50%.","business_category":"fulfillment-ops","city":"Warsaw","company_name":"Amazon Fulfillment Poland sp. z o.o. - D15","country_code":"POL","description":"Amazon is seeking a Regional Facilities Manager (RFM) to join our expanding Global Facility Management Team (GFM) as part of the growing Global Reliability Central Team (GRCT) in Reliability Maintenance Engineering (RME). The RFM will play a crucial role in overseeing operational facility services during Amazon's rapid growth and technological innovation.\u003cbr/\u003e\u003cbr/\u003eThe Amazon RME team maintains and optimizes technologies ranging from large, modern, purpose-built warehouses utilizing robotics and high-volume conveyance all the way through the value chain to small, high speed warehouses placed as close to our customers as possible.\u003cbr/\u003e\u003cbr/\u003eThe GFM team focuses on ensuring that all Amazon buildings adhere to the highest standards in both hard and soft services. The primary goal is to guarantee reliability, minimize downtime, and ensure compliance across our facilities in collaboration with local RME teams.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will play a crucial role to ensure that base building maintenance and soft services meet our standards across the network, guaranteeing compliance, safety, minimal downtime, and developing projects to innovate and optimize while monitoring total cost of ownership (TCO).\u003cbr/\u003e\u003cbr/\u003e• Provide tools for local teams to manage the performance of soft and hard services.\u003cbr/\u003e• Provide technical leadership and mentoring to local teams.\u003cbr/\u003e• Act as an escalation point for safety, quality service, and downtime incidents.\u003cbr/\u003e• Act as technical vendor manager to govern vendors and ensure continued high performance, including measuring KPIs and SLAs.\u003cbr/\u003e• Collaborate with key stakeholders, including Field RME, Procurement, and Finance.\u003cbr/\u003e• Dive Deep into service and asset performance data to identify opportunities for improvement.\u003cbr/\u003e• Support the rollout of initiatives to improve services, e.g. process changes, technology deployments, sustainability initiatives.\u003cbr/\u003e• Develop and lead pilots to improve services ahead of regional rollouts.\u003cbr/\u003e• Collaborate with launching sites to ensure facility services are secured in a timely manner.\u003cbr/\u003e• Effectively manage many complex projects and tasks simultaneously while exerting influence and fostering relationships across various organizational levels, including senior leadership.\u003cbr/\u003e• Developing and managing relationships with internal and external stakeholders.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eThe minimum base pay salary for this position is listed below. As a total compensation company, Amazon's package may include further pay components such as a sign on payment and the eligibility to participate in a restricted stock unit scheme operated independently by Amazon.com Inc. in USA. Your recruiting team will share final base pay and any applicable total compensation elements depending on skills and requirements.\u003cbr/\u003e\u003cbr/\u003eCompany discretionary, supplementary benefits apply subject to further terms, including pension plans, health insurance, life and disability insurance, business travel insurance, MultiSport card, employee discount code and program (EDC/Extras), commuter benefits where applicable, and the Employee Assistance Program (private and confidential counselling and referral service to support health and well-being).\u003cbr/\u003e\u003cbr/\u003eThe minimum base pay for this position is PLN 11492 monthly. Amazon reserves the right to offer a higher base salary, depending on the candidate's skills, competencies, and experience.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eGlobal Facilities Management team is part of Central RME and responsible of the centralized management of the facility services across CF and ATS, expanding also to AMZL.\u003cbr/\u003eWithin the team there are various teams, including facility management experts, base building planners and global standards and compliance.","department_cost_center":null,"description_short":"Amazon is seeking a Regional Facilities Manager (RFM) to join our expanding Global Facility Management Team (GFM) as part of the growing Global Reliability Central Team (GRCT) in Reliability Maintenance","display_distance":null,"id":"62ef2be4-3e53-49d1-ae3d-baf0c19177f7","id_icims":"3088383","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3088383/regional-facilities-manager-global-facility-management-bxm-rme-central","job_schedule_type":"full-time","location":"PL, Warsaw","locations":["{\"normalizedStateName\":\"Woj. Mazowieckie\",\"normalizedCountryCode\":\"POL\",\"city\":\"Warsaw\",\"countryIso3a\":\"POL\",\"countryIso2a\":\"PL\",\"locationNonStemming\":\"Poland, Warsaw\",\"coordinates\":\"52.2356,21.01037\",\"normalizedCountyName\":\"Warsaw\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Poland\",\"normalizedLocation\":\"Warsaw, Woj. Mazowieckie, POL\",\"location\":\"PL, Warsaw\",\"region\":\"\",\"buildingCodeList\":[\"WAW90\",\"WAW13\",\"WAW01\",\"WAW50\",\"WAW800\",\"WAW051\",\"DPW1\",\"WAW15\"],\"normalizedCityName\":\"Warsaw\"}"],"normalized_location":"Warsaw, Woj. Mazowieckie, POL","optional_search_labels":[],"posted_date":"September 19, 2025","preferred_qualifications":"• Excellent communication and interpersonal skills to effectively collaborate with team members, customers, and stakeholders. \u003cbr/\u003e• A collaborative mindset with the ability to work seamlessly within a team-oriented environment. \u003cbr/\u003e• Implementation and management of Reliability Centered Maintenance (RCM) programs. \u003cbr/\u003e• Implementation of vendor-based maintenance solutions to drive safety and reliability. \u003cbr/\u003e• Participation in design review processes to drive equipment standards for safety and reliability. \u003cbr/\u003e• Knowledge of distribution supply chain processes and businesses. \u003cbr/\u003e• Ability to communicate (written \u0026 verbal) in Polish at CEFR Level B2 or higher. \u003cbr/\u003e• Knowledge of CMMS (Computerized Maintenance Management System) programs. \u003cbr/\u003e• Certified Facility Manager, AssocRICS or MRICS, via either IFMA or RICS.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":null,"title":"Regional Facilities Manager, Global Facility Management, BXM - RME Central","university_job":null,"updated_time":"30 minutes","url_next_step":"https://account.amazon.com/jobs/3088383/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Architecture, Construction Management, Engineering, or a related field\u003cbr/\u003e- Project management, construction or engineering background - gained via internships or relevant professional experience\u003cbr/\u003e- Construction market experience/knowledge in one or more EU countries\u003cbr/\u003e- Ability to Learn and Be Curious, motivation, willingness to grow and develop within the team\u003cbr/\u003e- Fluency in English, both written and spoken","business_category":"studentprograms","city":"London","company_name":"Amazon UK Services Ltd.","country_code":"GBR","description":"Amazon opened its virtual doors in 1995 and strives to be the world’s most customer-centric company, where customers can find and discover anything they might want to buy online. The successful candidate will be a key part of the operations team and will be responsible for project managing new Amazon Fulfillment Centers planning, design and construction.\u003cbr/\u003eThis will include the extension of existing facilities and any new sites. The Construction Manager will play an integral role in the development and implementation of the EU network infrastructure. This role will analyze and evaluate different facility scenarios and build-out designs. In addition, this candidate has to support the standardization of the technical and facility related processes and systems. This opportunity combines construction engineering, planning, project management, facilities management, and contract management. It requires a person who can show proven ability in the planning and design, and project management / control of new and the enhancement of existing facility buildings.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eOverseeing construction engineering, planning, and design for Amazon Fulfillment Centers and other new or expansion projects\u003cbr/\u003e    Project support on new fulfillment network buildings and additional capacity requirements within existing European Fulfillment Centers\u003cbr/\u003e    Construction engineering design on new and remodel projects\u003cbr/\u003e    Preparation of reports, specifications, technical analysis to fully define the design requirements, equipment and services required\u003cbr/\u003e    Survey facilities, develop and document a procedures to audit the facility, provide evaluations and analysis, and recommend solutions to facility infrastructure, safety and security problems involving facilities and people\u003cbr/\u003e    Negotiation of contracts with vendors and present formal documentation for approval when required\u003cbr/\u003e    Ensuring that contracts are fit for purpose, cost effective and incorporate appropriate Service Level Agreements\u003cbr/\u003e    Overall site management, coordination, planning, specification of business proposals and coordination of subcontractors\u003cbr/\u003e    Team with others on due diligence evaluation of new opportunities\u003cbr/\u003e    Coach and guide all project teams (sub-contractors, maintenance engineers and commissioning engineers) throughout the full project life cycle\u003cbr/\u003e    Ensure that contracted resources deliver work to meet duration and quality targets, addressing and ensuring the correction of under-performance issues\u003cbr/\u003e    Audit contractors to check that the skills and competences of contract labor are appropriate to need, and they are fit to undertake the work on which they will be deployed\u003cbr/\u003e    Inform contractors of projected changes in resource or work demand so that they can take appropriate action\u003cbr/\u003e    Establish and operate the information systems necessary for effective scheduling and recording of contract work\u003cbr/\u003e    Support contractors’ work and help them to achieve higher performance levels.\u003cbr/\u003e    Share on best practices with team members.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eOverseeing construction engineering, planning, and design for Amazon Fulfillment Centers and other new or expansion projects\u003cbr/\u003e    Project support on new fulfillment network buildings and additional capacity requirements within existing European Fulfillment Centers\u003cbr/\u003e    Construction engineering design on new and remodel projects\u003cbr/\u003e    Preparation of reports, specifications, technical analysis to fully define the design requirements, equipment and services required\u003cbr/\u003e    Survey facilities, develop and document a procedures to audit the facility, provide evaluations and analysis, and recommend solutions to facility infrastructure, safety and security problems involving facilities and people\u003cbr/\u003e    Negotiation of contracts with vendors and present formal documentation for approval when required\u003cbr/\u003e    Ensuring that contracts are fit for purpose, cost effective and incorporate appropriate Service Level Agreements\u003cbr/\u003e    Overall site management, coordination, planning, specification of business proposals and coordination of subcontractors\u003cbr/\u003e    Team with others on due diligence evaluation of new opportunities\u003cbr/\u003e    Coach and guide all project teams (sub-contractors, maintenance engineers and commissioning engineers) throughout the full project life cycle\u003cbr/\u003e    Ensure that contracted resources deliver work to meet duration and quality targets, addressing and ensuring the correction of under-performance issues\u003cbr/\u003e    Audit contractors to check that the skills and competences of contract labor are appropriate to need, and they are fit to undertake the work on which they will be deployed\u003cbr/\u003e    Inform contractors of projected changes in resource or work demand so that they can take appropriate action\u003cbr/\u003e    Establish and operate the information systems necessary for effective scheduling and recording of contract work\u003cbr/\u003e    Support contractors’ work and help them to achieve higher performance levels.\u003cbr/\u003e    Share on best practices with team members.","department_cost_center":null,"description_short":"Amazon opened its virtual doors in 1995 and strives to be the world’s most customer-centric company, where customers can find and discover anything they might want to buy online. The successful candidate","display_distance":null,"id":"9c0f379b-8578-452a-aa71-e783b9da7b53","id_icims":"3182461","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3182461/construction-manager","job_schedule_type":"full-time","location":"GB, London","locations":["{\"normalizedStateName\":\"England\",\"normalizedCountryCode\":\"GBR\",\"city\":\"London\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, London\",\"coordinates\":\"51.50643,-0.12719\",\"normalizedCountyName\":\"London\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"London, England, GBR\",\"location\":\"GB, London\",\"region\":\"\",\"buildingCodeList\":[\"LHR139\"],\"normalizedCityName\":\"London\"}"],"normalized_location":"London, England, GBR","optional_search_labels":[],"posted_date":"February 17, 2026","preferred_qualifications":"- MRICS / RIBA qualified, or Country equivalent Chartered Engineer or Country equivalent Experience of Six Sigma and Lean analytical techniques is a plus\u003cbr/\u003e- Project Management experience from design phase through implementation and operation is an asset\u003cbr/\u003e- Experience negotiating construction, procurement and labor contracts in EU is a plus\u003cbr/\u003e- Other languages such as French, Polish, German, Arabic are considered preferred qualification\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"studentprograms.team-jobs-for-grads","source_system":"JobCreator","state":null,"title":"Construction Manager","university_job":null,"updated_time":"30 minutes","url_next_step":"https://account.amazon.com/jobs/3182461/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-jobs-for-grads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor’s Degree\u003cbr/\u003e- Fluency in English and Turkish\u003cbr/\u003e- Professional (non-internship) experience in Marketing, Sales, Buying, Project Management, Supply Chain or Consulting.\u003cbr/\u003e- Knowledge in MS Office programs (e.g. Excel, PowerPoint)","business_category":"retail","city":"Istanbul","company_name":"Amazon Turkey Perakende Hizmetleri Limited Sirketi","country_code":"TUR","description":"At Amazon we’re on the lookout for the curious, those who think big and accept challenges, willing to come build the future with us.\u003cbr/\u003e\u003cbr/\u003eAmazon Vendor Services (AVS) is a paid Business-to-Business (B2B) service that aims to help strategic brands partner with Amazon to grow their business.\u003cbr/\u003e\u003cbr/\u003eAs a Brand Specialist, you will gain 360-degree exposure to all areas of e-commerce at Amazon Türkiye, owning the relationship with your brand and structuring with them a short and long term strategy oriented at brand’s growth and Customer Satisfaction. You will act as consultant driving selection and promotional activities, monitor and work on success metrics on a daily basis, and ensure the brand’s experience of the AVS demonstrates our customer obsession. \u003cbr/\u003e\u003cbr/\u003eFurthermore, you will be working together with different stakeholders to implement new ideas and processes within Amazon Türkiye \u0026 Europe, such as (Product) Category Management, Supply Chain management, Finance and Marketing; developing your skills and future career.\u003cbr/\u003e\u003cbr/\u003eCould you embrace the challenge of being a Brand Specialist at Amazon? Are you looking for a diverse and international environment? Amazon offers you the chance to build up your own network on a European level by participating in community events such as team activities or by joining some of our affinity groups. Being a Brand Specialist is the starting point to accelerating your professional growth within a global leader in e-commerce. \u003cbr/\u003e\u003cbr/\u003eCome build the future with us!\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Core Service: Use your knowledge in deep data analytics to identify Türkiye industry opportunities and provide recommendations to improve overall business performance through the use of Amazon programs to drive long term benefit.\u003cbr/\u003e- Availability \u0026 Operational Excellence: Drive EU Supply Chain operational excellence initiatives by reducing costs, defects, lead times, and by managing stock in our fulfilment centre.\u003cbr/\u003e- Promotion \u0026 Funding: Provide recommendations for the brand’s marketing and advertising campaigns to promote new products, increase traffic and improve conversion. Plan, implement and manage promotional activities for Amazon events such as Prime Day where you will help your brands to generate sales. On top of that, you will drive brand weeks with you vendors and work closely with Amazon Advertising to explore further marketing opportunities we have.\u003cbr/\u003e- Selection \u0026 IDQ: Help grow selection by managing the launch of new products and improving discoverability. You will identify product gaps, onboard the new products and be responsible for the ramp up of these products, as well as improve the customer journey on Amazon (i.e.: performing walk the store session, competitor benchmarking, create enhanced content on detail pages).\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eInterested in what a day in life of a Brand Specialist looks like? Check out the following videos to gain more insight into the role and team:\u003cbr/\u003e\u003cbr/\u003e1) Brand Specialists at Amazon - Jump Right In: https://www.youtube.com/watch?v=C4wafOkhayA\u003cbr/\u003e2) Brand Specialists at Amazon. What do they do? https://www.youtube.com/watch?v=fYaySG_trNY","department_cost_center":null,"description_short":"At Amazon we’re on the lookout for the curious, those who think big and accept challenges, willing to come build the future with us.Amazon Vendor Services (AVS) is a paid Business-to-Business (B2B) service","display_distance":null,"id":"46166dcc-983a-4b2b-aa41-49a2c3db25f7","id_icims":"3160164","is_intern":null,"is_manager":null,"job_category":"Buying, Planning, \u0026 Instock Management","job_family":"Buying/Planning","job_function_id":null,"job_path":"/en/jobs/3160164/brand-specialist-amazon-vendor-services-avs","job_schedule_type":"full-time","location":"TR, Istanbul","locations":["{\"normalizedCountryCode\":\"TUR\",\"city\":\"Istanbul\",\"countryIso3a\":\"TUR\",\"countryIso2a\":\"TR\",\"locationNonStemming\":\"Turkey, Istanbul\",\"coordinates\":\"41.06201,28.98877\",\"normalizedCountyName\":\"Istanbul\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Türkiye\",\"normalizedLocation\":\"Istanbul, TUR\",\"location\":\"TR, Istanbul\",\"region\":\"\",\"buildingCodeList\":[\"IST11\"],\"normalizedCityName\":\"Istanbul\"}"],"normalized_location":"Istanbul, TUR","optional_search_labels":[],"posted_date":"January 15, 2026","preferred_qualifications":"- Master's Degree\u003cbr/\u003e- Strong business acumen and analytical skills\u003cbr/\u003e- Knowledge of a third language\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"retail.team-avs","source_system":"JobCreator","state":null,"title":"Brand Specialist, Amazon Vendor Services (AVS)","university_job":null,"updated_time":"31 minutes","url_next_step":"https://account.amazon.com/jobs/3160164/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-avs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}