{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"Position Requirements:\u003cbr/\u003e\u003cbr/\u003eBachelor’s degree or foreign equivalent degree in Networking, Information Technology, Computer Science or a related field and two years of experience in the job offered or a related occupation. Must have one year of experience in the following skill(s): (1) configuring, managing, and troubleshooting large-scale systems, including cloud virtualization, distributed networks, and co-location; (2) providing Linux or Windows Operating System support; and (3) deploying and troubleshooting LAN, VPN, Firewalls, DNS, TCP/IP, IPsec and IDS/IPS systems.#0000","business_category":"no-business-category","city":"San Diego","company_name":"Amazon Web Services, Inc. - A97","country_code":"USA","description":"MULTIPLE POSITIONS AVAILABLE\u003cbr/\u003e\u003cbr/\u003eEmployer: \t\tAMAZON WEB SERVICES, INC.\u003cbr/\u003eOffered Position: \tSupport Engineer II-Ext\u003cbr/\u003eJob Location: \t\tSan Diego, California\u003cbr/\u003eJob Number: \t\tAMZ9658218\u003cbr/\u003e\u003cbr/\u003ePosition Responsibilities:\u003cbr/\u003e\u003cbr/\u003eProvide technical support, including fielding and handling customer issues via phone, chat, and email. Apply advanced troubleshooting techniques to provide unique solutions for critical, highly complex, customer problems that span multiple AWS services. Work with development teams to establish and improve end-to-end service support. Drive customer communication during critical events. Write tutorials, how-to videos, and other technical articles for the AWS customer community and internal training. Assist customers on a wide variety of topics, including AWS cloud architecture, migration and troubleshooting complex performance issues. Mentor junior support engineers.\u003cbr/\u003e\u003cbr/\u003e40 hours / week, 8:00am-5:00pm, Salary Range $95,600/year to $160,000/year. \u003cbr/\u003e\u003cbr/\u003eAmazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, visit:\u003cbr/\u003ehttps://www.aboutamazon.com/workplace/employee-benefits.\u003cbr/\u003e\u003cbr/\u003eAmazon.com is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation.#0000","department_cost_center":null,"description_short":"MULTIPLE POSITIONS AVAILABLEEmployer: \t\tAMAZON WEB SERVICES, INC.Offered Position: \tSupport Engineer II-ExtJob Location: \t\tSan Diego, CaliforniaJob Number: \t\tAMZ9658218Position Responsibilities:Provide","display_distance":null,"id":"ab4aa54d-4951-488c-846e-8f1bf012858f","id_icims":"3164109","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Support Engineering","job_function_id":null,"job_path":"/en/jobs/3164109/support-engineer-ii-ext-amz9658218","job_schedule_type":"full-time","location":"US, CA, San Diego","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Diego\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Diego\",\"coordinates\":\"32.71568,-117.16171\",\"normalizedCountyName\":\"San Diego\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Diego, California, USA\",\"location\":\"US, CA, San Diego\",\"region\":\"CA\",\"buildingCodeList\":[\"SAN13\"],\"normalizedCityName\":\"San Diego\"}"],"normalized_location":"San Diego, California, USA","optional_search_labels":[],"posted_date":"January 22, 2026","preferred_qualifications":"Please see job description and the position requirements above.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"CA","title":"Support Engineer II-Ext - AMZ9658218","university_job":null,"updated_time":"2 minutes","url_next_step":"https://account.amazon.com/jobs/3164109/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of tax, finance or a related analytical field experience\u003cbr/\u003e- Bachelor's degree in finance, accounting or related field, or Bachelor's degree and 5+ years of building financial and operational reports/data sets that inform business decision-making experience","business_category":"finance","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Elevate Financial Strategy at the Forefront of Global Entertainment\u003cbr/\u003e\u003cbr/\u003eWe're seeking a strategic financial leader who will transform data into insights that drive Amazon Prime Video's international growth. In this pivotal role, you'll craft compelling financial narratives that shape critical business decisions and illuminate the path forward for our global entertainment platform.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003e-    Serve as the primary financial partner for Prime Video International, delivering comprehensive financial insights and support\u003cbr/\u003e-    Develop sophisticated, data-driven financial analyses that illuminate business performance and strategic opportunities\u003cbr/\u003e-    Consolidate and articulate financial performance across diverse international teams\u003cbr/\u003e -   Collaborate with cross-functional teams to identify process improvements and technological innovations\u003cbr/\u003e-    Lead comprehensive financial reviews and strategic initiatives with precision and creativity\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour day will be a dynamic blend of financial analysis, strategic collaboration, and innovative problem-solving. You'll dive deep into complex financial landscapes, translating intricate data into clear, actionable insights that empower our leadership team to make informed decisions.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe are a collaborative and forward-thinking finance team dedicated to supporting Prime Video's global expansion. Our work directly impacts how millions of customers experience entertainment worldwide, creating meaningful connections through storytelling and technology.","department_cost_center":null,"description_short":"Elevate Financial Strategy at the Forefront of Global EntertainmentWe're seeking a strategic financial leader who will transform data into insights that drive Amazon Prime Video's international growth.","display_distance":null,"id":"9889e18c-7bef-4191-b3b1-e3de55f3f8bf","id_icims":"3088492","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/Planning","job_function_id":null,"job_path":"/en/jobs/3088492/pvi-fp-a-finance-manager-prime-video-international-fp-a","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA40\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"September 19, 2025","preferred_qualifications":"- 6+ years of identifying incomplete or inaccurate data, identifying the root cause and creating/implementing an escalation plan experience\u003cbr/\u003e- 6+ years of solving complex business challenges by delivering accurate and timely financial models, analysis, and recommendations that have a proven impact on business (e.g., financial savings, operational improvements, or customer benefits) experience\u003cbr/\u003e- MBA, or CPA\u003cbr/\u003e- Knowledge of SQL/ETL\u003cbr/\u003e- Experience working with large-scale data mining and reporting tools (examples: SQL, MS Access, Essbase, Cognos) and other financial systems (examples: Oracle, SAP, Lawson, JD Edwards)\u003cbr/\u003e- Experience delivering forecasting, budgeting, and variance analysis, and data interpretation of results\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $85,900/year in our lowest geographic market up to $179,500/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"finance.team-gmac","source_system":"JobCreator","state":"WA","title":"PVI FP\u0026A Finance Manager, Prime Video International FP\u0026A","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3088492/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-gmac","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of engineering, installation, or startup/commissioning of electrical and mechanical systems experience\u003cbr/\u003e- Bachelor's degree in Electrical Engineering or a related field\u003cbr/\u003e- NETA or ASHRAE certification or commissioning specific education courses\u003cbr/\u003e- Knowledge of critical data center mechanical and electrical equipment\u003cbr/\u003e- Knowledge of Microsoft Office including Outlook, Word, and Excel\u003cbr/\u003e- Experience with the design, construction, operation, or maintenance of mission critical facilities, especially data centers","business_category":"aws","city":"Louisa","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAWS is looking for a dynamic Commissioning Engineer. It is the responsibility of all Amazonians to have alignment with our leadership principles and demonstrate these at the highest level. \u003cbr/\u003e\u003cbr/\u003eThe responsibilities of the ACx Commissioning Engineer (CxE) include, but are not limited to, oversight and coordination of multi-discipline division of work related to design review and commissioning of Amazon critical infrastructure for new construction and special projects. The CxE is responsible for supporting vendors, contractors, and other teams involved in the construction and commissioning of various systems including medium and low voltage power systems, Generators, UPS, HVAC, Chilled Water, BMS, and EPMS systems. They shall provide multi-discipline input into the scheduling, test script development, designing, and planning of projects. In addition, the CxE will be required to develop and review electrical and mechanical component and integrated systems testing along with other commissioning documents to ensure they are compliant with the basis of design, specification, industry standards and sequence of operations. It is the CxE responsibility to ensure that all commissioning procedures follow the appropriate safety practices and policies. CxE is responsible for auditing commissioning activities continuously to ensure compliance with environmental, quality, and safety requirements. The CxE proactively communicates with the ACx Regional Manager and the ACx team to ensure that the applicable test documents are created and executed in accordance with all commissioning requirements. This individual will be responsible for comprehensive weekly reporting of status of all ongoing projects, lessons learned, and program improvements to continually improve the quality of our program. This position will include coverage of multiple inflight projects and tight schedules. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003ePhysical Requirements\u003cbr/\u003e- Walk job sites in uneven terrain\u003cbr/\u003e- Work at heights and from ladders\u003cbr/\u003e- Regularly walk, use hands and fingers, reach with hands and arms, stoop, kneel, crouch or crawl\u003cbr/\u003e- Lift and/or move up to 49 pounds; and participate in group lifts for 50 pounds or more\u003cbr/\u003e- Carry objects weighing up to 49 pounds for short distances\u003cbr/\u003e- Work shifts longer than eight hours in duration with potential for night and weekends\u003cbr/\u003e- Perform physical tasks throughout the day without becoming overly tired\u003cbr/\u003e- Ability to manipulate small wires and objects easily\u003cbr/\u003e- Work in a noisy environment\u003cbr/\u003e- Work in environments that are colder or hotter than a normal office environment\u003cbr/\u003e\u003cbr/\u003eAdditional Job Requirements\u003cbr/\u003e- Ability to relocate or commute daily to Fredricksburg, VA area. \u003cbr/\u003e- Ability and willingness to travel domestic and internationally for up to 50% of the year. Typical travel is 20%.\u003cbr/\u003e- Required to provide personal transportation for meetings and job visits away from the office; reimbursed.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003e#DCCD_AMER","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"39abbb58-6645-48ff-83a9-9e4d3afc33a0","id_icims":"3175269","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Infrastructure Eng","job_function_id":null,"job_path":"/en/jobs/3175269/commissioning-engineer-aws-infrastructure-services","job_schedule_type":"full-time","location":"US, VA, Louisa","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Louisa\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Louisa\",\"coordinates\":\"38.02576,-78.00401\",\"normalizedCountyName\":\"Louisa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Louisa, Virginia, USA\",\"location\":\"US, VA, Louisa\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD550\"],\"normalizedCityName\":\"Louisa\"}"],"normalized_location":"Louisa, Virginia, USA","optional_search_labels":["aws.team-dc","aws.team-ais","military"],"posted_date":"February  5, 2026","preferred_qualifications":"- Knowledge of building codes and regulations for your region\u003cbr/\u003e- Knowledge of commercial or industrial power systems or mechanical systems\u003cbr/\u003e- Experience carrying design concepts through exploration, development, and into deployment or mass production\u003cbr/\u003e- Experience using a variety of web-based and other software tools for calculation and data processing\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Louisa - 96,600.00 - 160,000.00 USD annually","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"VA","title":"Commissioning Engineer, AWS Infrastructure Services","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3175269/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language\u003cbr/\u003e- Fundamentals of Machine learning models, their architecture, training and inference lifecycles along with work experience on some optimizations for improving the model performance.","business_category":"aws","city":"Seattle","company_name":"Amazon Development Center U.S., Inc.","country_code":"USA","description":"AWS Neuron is the complete software stack for the AWS Inferentia and Trainium cloud-scale machine\u003cbr/\u003elearning accelerators. This role is for a senior software engineer in the Machine Learning Inference Applications team. This role is responsible for development and performance optimization of core building blocks of LLM Inference - Attention, MLP, Quantization, Speculative Decoding, Mixture of Experts, etc.\u003cbr/\u003e\u003cbr/\u003eThe team works side by side with chip architects, compiler engineers and runtime engineers to deliver performance and accuracy on Neuron devices across a range of models such as Llama 3.3 70B, 3.1 405B, DBRX, Mixtral, and so on.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eResponsibilities of this role include adapting latest research in LLM optimization to Neuron chips to extract best performance from both open source as well as internally developed models. Working across teams and organizations is key.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge-sharing and mentorship. Our senior members enjoy one-on-one mentoring and thorough, but kind, code reviews. We care about your career growth and strive to assign projects that help our team members develop your engineering expertise so you feel empowered to take on more complex tasks in the future.","department_cost_center":null,"description_short":"AWS Neuron is the complete software stack for the AWS Inferentia and Trainium cloud-scale machinelearning accelerators. This role is for a senior software engineer in the Machine Learning Inference Applications","display_distance":null,"id":"bc724e5b-6383-496c-96c1-0874bc7d43bd","id_icims":"3183357","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3183357/software-engineer-ai-ml-aws-neuron-inference","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA42\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["aws.team-annapurna-labs","aws.team-utility-computing"],"posted_date":"February 17, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- Hands-on experience with PyTorch or Jax - preferably involving developing and deploying LLMs in production on GPUs, Neuron, TPU or other AI acceleration hardware.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 143,700.00 - 194,400.00 USD annually","primary_search_label":"aws.team-machine-learning-primary","source_system":"JobCreator","state":"WA","title":"Software Engineer-AI/ML, AWS Neuron Inference","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3183357/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-machine-learning-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in engineering or equivalent\u003cbr/\u003e- Experience implementing scalable compliance solutions (technology, procedures, processes, etc.) in a regulated environment\u003cbr/\u003e- Experience in hardware design and validation of components, subsystems and systems\u003cbr/\u003e- Experience managing project delivery\u003cbr/\u003e- Experience effectively communicating complex concepts through written and verbal communication","business_category":"amazon-security","city":"Seattle","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Amazon Web Services (AWS) is looking for a certifications compliance specialist to help drive implementation of a compliance-focused hardware certification program for data center hardware, globally.  This program will support AWS’s product compliance function covering hundreds of internal use data center and customer-focused hardware products. The program will encompass global certifications for product safety, electromagnetic compatibility (EMC), radio frequency (RF), energy efficiency, and restricted substances. The international certifications program will develop and implment defensible certification strategies, partner with suppliers to deploy certification strategy, and own the end to end management of global certification status of products through out the product lifecyle. The certifications program will interface with the compliance engineering team, hardware development and business teams, supply chain and logistics, equipment suppliers, third party test labs and certification agencies,\u003cbr/\u003e   \u003cbr/\u003eYou will report to the Senior Manager, Product Compliance Operations and be part of the product compliance function within AWS’s Global Trade and Product Compliance team (GTPC) that ensures that all equipment procured for use in AWS data centers, as well as equipment sold or provided to customers, satisfies global regulatory requirements.  \u003cbr/\u003e \u003cbr/\u003eAWS is at the forefront of providing a broad set of global cloud-based services including AI/ML, compute, storage, databases, networking, and enterprise applications, to help organizations move faster, lower IT costs, and scale. You will be a part of a dynamic business within Amazon.com, and one of the world’s fastest growing and evolving companies, with a team of exceptionally talented, bright and innovative people. GTPC is responsible for ensuring that the infrastructure equipment necessary to support the AWS services are imported/exported in a compliant manner across the multiple countries where AWS operates and will expand, including all product certification/safety regulations. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e1. Drive implementation of a compliance-focused hardware certifications program.\u003cbr/\u003e2. Build programs for sustained operational execution and build stakeholder relationships.\u003cbr/\u003e2. Collect, validate, and evidence of compliance at the product and country level across a large portfolio of hardware products. Provide real-time compliance status of equipment to key business partners.\u003cbr/\u003e3. Manage relationships with test labs and certification agencies, including contracting and budget.\u003cbr/\u003e4. Track certification expiration and manage renewal of certifications.\u003cbr/\u003e5. Design and drive scalable processes within a Quality Management System (QMS) to ensure consistent compliance with product regulatory requirements around the world. \u003cbr/\u003e6. Partner with key stakeholders to help define program strategy, project plans, and manage technology implementations.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon Security values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy Amazon Security?\u003cbr/\u003eAt Amazon, security is central to maintaining customer trust and delivering delightful customer experiences. Our organization is responsible for creating and maintaining a high bar for security across all of Amazon’s products and services. We offer talented security professionals the chance to accelerate their careers with opportunities to build experience in a wide variety of areas including cloud, devices, retail, entertainment, healthcare, operations, and physical stores.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eIn Amazon Security, it’s in our nature to learn and be curious. Ongoing DEI events and learning experiences inspire us to continue learning and to embrace our uniqueness. Addressing the toughest security challenges requires that we seek out and celebrate a diversity of ideas, perspectives, and voices.\u003cbr/\u003e\u003cbr/\u003eTraining \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, training, and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.","department_cost_center":null,"description_short":"Amazon Web Services (AWS) is looking for a certifications compliance specialist to help drive implementation of a compliance-focused hardware certification program for data center hardware, globally. ","display_distance":null,"id":"2bad0b0b-eff9-48c1-ab9e-db84d93e1d81","id_icims":"3182260","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Security Industry Specialist","job_function_id":null,"job_path":"/en/jobs/3182260/international-certifications-specialist-aws-compliance-security-assurance","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sunnyvale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Sunnyvale\",\"coordinates\":\"37.37188,-122.03751\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sunnyvale, California, USA\",\"location\":\"US, CA, Sunnyvale\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC13\"],\"normalizedCityName\":\"Sunnyvale\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA33\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February 17, 2026","preferred_qualifications":"- Knowledge of statutory compliance requirements\u003cbr/\u003e- Experience in technical support, or experience that includes strong analytical skills, attention to detail, and effective communication abilities\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Sunnyvale - 112,200.00 - 196,300.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 102,000.00 - 178,400.00 USD annually","primary_search_label":"amazon-security.team-aws-security","source_system":"JobCreator","state":"WA","title":"International Certifications Specialist, AWS Compliance \u0026 Security Assurance","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3182260/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-aws-security","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- Experience owning/driving roadmap strategy and definition\u003cbr/\u003e- Experience with feature delivery and tradeoffs of a product\u003cbr/\u003e- Experience technical product management","business_category":"advertising","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Advertising operates at the intersection of eCommerce and advertising, offering a rich array of digital display advertising solutions with the goal of helping our customers find and discover anything they want to buy. We help advertisers of all types to reach Amazon customers on Amazon.com, across our other owned and operated sites, on other high quality sites across the web, and on millions of mobile devices. We improve campaign performance for all advertisers through improved creative personalization. If you’re interested in joining a rapidly growing team working to build a unique, world-class advertising product with a relentless focus on the customer, you’ve come to the right place.\u003cbr/\u003e\u003cbr/\u003eYou love learning and building, operate independently, and demonstrate a willingness to roll up your sleeves and dive deep. As a Principal Product Manager – Tech, you will define and execute all aspects of product development and go to market strategies for our AI powered creative optimization product.\u003cbr/\u003e\u003cbr/\u003eYou will be working with a team of product managers, scientists, UX designers, and software engineers to build, test, launch, measure, and iterate on the features that optimizes the creative experience of display ads. You can excel when faced with ambiguity, have high judgement, and are able to balance technical limitations and customer experience to drive strategic value for the business. Successful candidates will enjoy working in a collaborative, analytical, and fast-paced environment and are comfortable interacting with highly technical cross-functional teams. Candidates will have experience with personalization and a track record of developing AI driven products.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eDriving the vision, roadmap, and external positioning for creative personalization. To be successful, the PM must balance the needs of advertisers and internal stakeholders, invent new ways to solve customer problems, and think big to align business and tech teams on the vision for the next generation of personalization.\u003cbr/\u003e\u003cbr/\u003e· Lead cross-functional tech teams to execute on product plans and deliver results\u003cbr/\u003e· Drive executive reviews and alignment for your plans\u003cbr/\u003e· Collaborate closely with stakeholders throughout Amazon to obtain buy-in for product initiations\u003cbr/\u003e· Partner with engineering to take features from conception to launch\u003cbr/\u003e· Analyze and act on business metrics and data to grow the business\u003cbr/\u003e· Leverage consumer insights, advertiser feedback, and competitive intelligence reports to inform product decisions\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur team, CreativeX Optimization, empowers advertisers to personalize the visual experience of their ads in real time. We apply advanced machine learning and generative AI to help advertisers build, identify, and understand what ad creatives work with their audiences. We develop customized CTR and CVR prediction models to help advertisers efficiently connect with shoppers across the web. We utilize generative models to understand shopper preferences across text, images, and videos. We have a broad mandate to experiment and innovate, as we seek to leapfrog the competition and impact billions of impressions daily.","department_cost_center":null,"description_short":"Amazon Advertising operates at the intersection of eCommerce and advertising, offering a rich array of digital display advertising solutions with the goal of helping our customers find and discover anything","display_distance":null,"id":"ce25355a-bc16-46ec-8907-dabe07916bb1","id_icims":"3112224","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Product Management - Technical","job_function_id":null,"job_path":"/en/jobs/3112224/principal-product-manager-technical-creative-x-rapid","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA40\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK36\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["advertising.team-product-management"],"posted_date":"October 20, 2025","preferred_qualifications":"- Experience working directly with Engineers on product enhancements\u003cbr/\u003e- Experience in project management methodologies, business analysis, or process improvement\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, New York - 197,900.00 - 267,800.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 179,900.00 - 243,400.00 USD annually","primary_search_label":"advertising.team-amazon-ads","source_system":"JobCreator","state":"WA","title":"Principal Product Manager Technical, Creative X - RAPID","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3112224/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-ads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- Experience owning/driving roadmap strategy and definition\u003cbr/\u003e- Experience with feature delivery and tradeoffs of a product\u003cbr/\u003e- Experience technical product management","business_category":"advertising","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The generative AI team in Creative X team (Amazon Ads) aims to democratize access to high-quality ad creatives (images, videos, etc.) by building generative AI-driven solutions for advertisers. To accomplish this, we are investing in text-to-image, text-to-video, text-to-text, and agentic AI models that will allow advertisers to generate high quality, performant creative in moments. The cutting-edge capabilities and user experiences we develop will be deployed for use by advertisers and agencies within the Ads Console and have a large scale impact on the business.\u003cbr/\u003e\u003cbr/\u003eWe are seeking an experienced principal product manager (technical) who is adept at a variety of skills; especially in working with science, dev, and design teams. The right candidate will have a strong interest and aptitude in learning generative AI science, have a track record of working with science teams and inventing/launching zero-to-one products, and a keen eye for creative quality and world class user experiences. They need to have a high degree of interest in building next gen experiences that have the potential to reshape how advertisers invent creatives. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs a product leader on the AI Gen team, you will:\u003cbr/\u003e\u003cbr/\u003e- Own the vision and strategy for building prototyping for AI generated creative products and features\u003cbr/\u003e- Write documents that work backwards from customer and advertiser needs\u003cbr/\u003e- Dive deep into competitive and existing Amazon creative offerings\u003cbr/\u003e- Partner effectively with other leaders in product, design, engineering, science and business intelligence to influence priorities and drive alignment\u003cbr/\u003e- Plan and deliver on executive level goals to deliver proof of concept prototypes\u003cbr/\u003e- Exhibit excellent judgment on how to prioritize between emerging technologies and existing ones for right sized features, architectural improvements and revenue entitlement\u003cbr/\u003e- Monitor project execution and ensuring that the delivery is to the appropriate levels of quality and in line with target dates\u003cbr/\u003e- If you have an entrepreneurial spirit, know how to deliver, are technical, highly innovative and long for the opportunity to build pioneering solutions to challenging problems, we’d love to talk to you!\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eDay-to-day, the Gen AI product leader will:\u003cbr/\u003e\u003cbr/\u003e- Meet 1x1 with scientists to prototype and review new concepts\u003cbr/\u003e- Partner with internal stakeholders to develop a vision for generative AI\u003cbr/\u003e- Prepare shaping documents, BRDs, PR FAQs, and other artifacts\u003cbr/\u003e- Deep dive voice-of-the-customer feedback and quality benchmark results\u003cbr/\u003e- Review publications for new developments","department_cost_center":null,"description_short":"The generative AI team in Creative X team (Amazon Ads) aims to democratize access to high-quality ad creatives (images, videos, etc.) by building generative AI-driven solutions for advertisers. To accomplish","display_distance":null,"id":"10c0cf9f-456b-487a-9bab-02cdc6b541b6","id_icims":"3171780","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Product Management - Technical","job_function_id":null,"job_path":"/en/jobs/3171780/principal-product-manager-gen-ai-creative","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA40\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["advertising.team-product-management"],"posted_date":"February  2, 2026","preferred_qualifications":"- Experience working directly with Engineers on product enhancements\u003cbr/\u003e- Experience in project management methodologies, business analysis, or process improvement\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 179,900.00 - 243,400.00 USD annually","primary_search_label":"advertising.team-amazon-ads","source_system":"JobCreator","state":"WA","title":"Principal Product Manager, Gen AI, Creative","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3171780/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-ads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- PhD, or Master's degree and 4+ years of science, technology, engineering or related field experience\u003cbr/\u003e- 3+ years of building models for business application experience\u003cbr/\u003e- Experience programming in Java, C++, Python or related language\u003cbr/\u003e- Relevant industry applied research experience in operations research, optimization, ML/AI, statistics, or an equivalent field","business_category":"operations","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The Amazon Fulfillment Technologies (AFT) Science team is seeking an exceptional Applied Scientist with strong operations research and optimization expertise to develop production solutions for one of the most complex systems in the world: Amazon's Fulfillment Network.\u003cbr/\u003e\u003cbr/\u003eAt AFT Science, we design, build, and deploy optimization, statistics, machine learning, and GenAI/LLM solutions that power production systems running across Amazon Fulfillment Centers worldwide. We tackle a wide range of challenges throughout the network, including labor planning and staffing, pick scheduling, stow guidance, and capacity risk management. Our mission is to develop innovative, scalable, and reliable science-driven production solutions that exceed the published state of the art, enabling systems to run optimally and continuously (from every few minutes to every few hours) across our large-scale network.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs an Applied Scientist, you will collaborate with scientists, software engineers, product managers, and operations leaders to develop optimization-driven solutions that directly impact process efficiency and associate experience in the fulfillment network.\u003cbr/\u003e\u003cbr/\u003eYour key responsibilities include:\u003cbr/\u003e- Develop deep understanding and domain knowledge of operational processes, system architecture, and business requirements\u003cbr/\u003e- Dive deep into data and code to identify opportunities for continuous improvement and disruptive new approaches\u003cbr/\u003e- Design and develop scalable mathematical models for production systems to derive optimal or near-optimal solutions for existing and emerging challenges\u003cbr/\u003e- Create prototypes and simulations for agile experimentation of proposed solutions\u003cbr/\u003e- Advocate for technical solutions with business stakeholders, engineering teams, and senior leadership\u003cbr/\u003e- Partner with software engineers to integrate prototypes into production systems\u003cbr/\u003e- Design and execute experiments to test new or incremental solutions launched in production\u003cbr/\u003e- Build and monitor metrics to track solution performance and business impact\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Fulfillment Technology (AFT) designs, develops, and operates end-to-end fulfillment technology solutions for all Amazon Fulfillment Centers (FCs). We harmonize the physical and virtual worlds so Amazon customers can get what they want, when they want it.\u003cbr/\u003e\u003cbr/\u003eThe AFT Science team brings expertise in operations research, optimization, statistics, machine learning, and GenAI/LLM, combined with deep domain knowledge of operational processes within FCs and their unique challenges. We prioritize advancements that support AFT tech teams and focus areas rather than specific fields of research or individual business partners. We influence each stage of innovation from inception to deployment, which includes both developing novel solutions and improving existing approaches. Our production systems rely on a diverse set of technologies, and our teams invest in multiple specialties as the needs of each focus area evolve.","department_cost_center":null,"description_short":"The Amazon Fulfillment Technologies (AFT) Science team is seeking an exceptional Applied Scientist with strong operations research and optimization expertise to develop production solutions for one of","display_distance":null,"id":"8e1164ac-7955-432d-b642-aa57bb1a9f86","id_icims":"3178358","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3178358/applied-scientist-ii-amazon-fulfillment-technology-aft-science","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA112\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"February 11, 2026","preferred_qualifications":"- Experience in data analysis and leveraging analytics to make decisions\u003cbr/\u003e- PhD with industry applied research experience and expertise in Operations Research, Optimization, ML/AI, Statistics, or an equivalent field\u003cbr/\u003e- Experience with labor planning and staffing optimization problems\u003cbr/\u003e- Proven track record of translating research into production systems and deploying production-grade code\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Bellevue - 142,800.00 - 193,200.00 USD annually","primary_search_label":"operations.team-amazon-fulfillment-technology","source_system":"JobCreator","state":"WA","title":"Applied Scientist II, Amazon Fulfillment Technology (AFT) Science","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3178358/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-fulfillment-technology","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- 8+ years of technical product or program management experience\u003cbr/\u003e- 2+ years of end to end product delivery experience\u003cbr/\u003e- Experience owning/driving roadmap strategy and definition\u003cbr/\u003e- Experience with feature delivery and tradeoffs of a product\u003cbr/\u003e- Experience leading engineering discussions around technology decisions and strategy related to a product","business_category":"advertising","city":"New York","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Do you want to lead a once-in-a-generation transformation, and make ads CX exciting and impactful? At Amazon Ads, we are looking for a strong technical product leader to reinvent ad creatives, as GenAI drastically lowers the barriers to producing quality creative assets. More and more, the smaller advertisers will easily develop lifestyle images and videos to tell their story. The larger advertisers will have a wealth of creative assets that they can customize and assemble to best fit their campaign tactics. In this new world of creative abundance, Amazon has a unique opportunity to lead the ad industry with advanced creative solutions that help advertisers meet their full funnel objectives, with personalized creatives that adapt to where customers are on their journey, from awareness to consideration to purchase.\u003cbr/\u003e\u003cbr/\u003eWe are seeking a Principal PM-T, Ad Creatives to lead product strategy, development, and execution for advertiser creative setup. In this role, you will own a strategic charter for the future of creative formats that leverages AI and dynamic creative optimization, while supporting automation. You will partner with cross-functional teams—including engineering, design, science, analytics, sales, and marketing—to develop innovative creative products that empower advertisers and enhance consumer engagement.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Define and execute product vision and strategy for your ad creatives charter, balancing advertiser needs, customer experience, and business impact.\u003cbr/\u003e* Lead the end-to-end product lifecycle, from ideation and roadmap development to launch, optimization, and scaling.\u003cbr/\u003e* Drive innovation in AI-powered creative solutions, automation tools, and ad formats.\u003cbr/\u003e* Collaborate closely with engineering and design teams to develop intuitive, scalable, and high-performing ad creative products.\u003cbr/\u003e* Partner with science teams to develop new AI-driven capabilities that optimize the creative experience.\u003cbr/\u003e* Work with analytics teams to ensure creative effectiveness is measured and continuously optimized.\u003cbr/\u003e* Partner with sales and marketing, and account management teams to educate and enable advertisers on creative best practices and solutions.\u003cbr/\u003e* Stay ahead of industry trends, competitor offerings, and emerging technologies in digital advertising, creative automation, and ad formats.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy Join Us?\u003cbr/\u003e* Be at the forefront of ad creative innovation and shape the future of digital advertising.\u003cbr/\u003e* Work with a world-class team of product leaders, engineers, designers and scientists.\u003cbr/\u003e* Opportunity to influence billions of ad impressions and create meaningful advertiser and consumer impact.","department_cost_center":null,"description_short":"Do you want to lead a once-in-a-generation transformation, and make ads CX exciting and impactful? At Amazon Ads, we are looking for a strong technical product leader to reinvent ad creatives, as GenAI","display_distance":null,"id":"160a2848-ef5e-44cb-93ea-de8ab1189dcf","id_icims":"3183358","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Product Management - Technical","job_function_id":null,"job_path":"/en/jobs/3183358/principal-pmt-ad-creatives","job_schedule_type":"full-time","location":"US, NY, New York","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA40\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK36\"],\"normalizedCityName\":\"New York\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Santa Monica\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Santa Monica\",\"coordinates\":\"34.01158,-118.49227\",\"normalizedCountyName\":\"Los Angeles\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Santa Monica, California, USA\",\"location\":\"US, CA, Santa Monica\",\"region\":\"CA\",\"buildingCodeList\":[\"LAX10\"],\"normalizedCityName\":\"Santa Monica\"}"],"normalized_location":"New York, New York, USA","optional_search_labels":["advertising.team-project-program-management"],"posted_date":"February 17, 2026","preferred_qualifications":"- Experience working directly with Engineers on product enhancements\u003cbr/\u003e- Experience in project management methodologies, business analysis, or process improvement\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Santa Monica - 179,900.00 - 243,400.00 USD annually\u003cbr/\u003eUSA, NY, New York - 197,900.00 - 267,800.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 179,900.00 - 243,400.00 USD annually","primary_search_label":"advertising.team-amazon-ads","source_system":"JobCreator","state":"NY","title":"Principal PMT, Ad Creatives","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3183358/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-ads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Business Administration, Finance, Economics, Computer Science, Engineering, or related field\u003cbr/\u003e- Experience with sales CRM tools such as Salesforce or similar software\u003cbr/\u003e- Experience defining, refining and implementing sales processes, procedures and policies or equivalent\u003cbr/\u003e- 5+ years of prior sales compensation experience - Experience with sales ICM tools such as Varicent, Xactly, or similar software\u003cbr/\u003e- 5+ years of prior sales compensation experience - Experience with sales ICM tools such as Varicent, Xactly, or similar software","business_category":"aws","city":"Dallas","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"We are seeking a talented Sales Compensation Analyst to join the Business Unit Operations team supporting AGS AMER Sales Teams. Reporting into the AGS AMER Sales Compensation Manager, you will partner with the AGS AMER sales and operational leaders to ensure the accurate, timely and equitable delivery of sales compensation plans as well as providing analytical insights to assist in evaluating the effectiveness of our sales compensation models. You will be the subject matter expert for sales compensation within AGS AMER, resolving queries from the field and delivering impactful training and enablement to our rapidly expanding commercial \u0026 operations teams. \u003cbr/\u003e\u003cbr/\u003eThe successful candidate will be a motivated fast learner with high attention to detail and structured in their approach. They will be able to manage multiple assignments and requests/processes concurrently, prioritizing accordingly, and delivering timely results. They will be able to collaborate effectively with internal end-users and cross-functional teams to ideate and implement simple, scalable solutions to complex problems at a high standard. They are passionate about data, developing and owning standardized process improvements, automation and optimizing scalable central processes. Deep operational, analytical and interpersonal skills will make them a critical partner to business and operations leaders, identifying gaps in process and removing barriers to execution. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Ensure the accurate, timely and equitable delivery of sales compensation plans and payments. \u003cbr/\u003e• Develop a deep understanding of sales compensation policy, systems and reporting tools in order to effectively drive resolution of issues, meet sales compensation SLAs and provide actionable insights for your business and operations partners. \u003cbr/\u003e• Forge strong cross-functional relationships to influence change, accelerate adoption and grow our capacity faster than the growth of the business. \u003cbr/\u003e• Partner with leadership to set objective targets aligned to positive business and customer outcomes. \u003cbr/\u003e• Provide ongoing sales compensation training and enablement to business users and operations. \u003cbr/\u003e• Proactively identify and implement operational processes and/or reporting that simplify, standardize and enable operational excellence. \u003cbr/\u003e• Manage and execute SPIF programs to drive performance on immediate business priorities. \u003cbr/\u003e• Present OTE and performance analysis to sales leadership on a quarterly basis.\u003cbr/\u003e• Provide sales compensation thought leadership and generate solutions formulated on data. \u003cbr/\u003e• Retrieve and analyze data using Excel, Salesforce.com, Tableau and other data/BI tools/platforms.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eAbout Sales, Marketing and Global Services (SMGS)\u003cbr/\u003e\u003cbr/\u003eAWS Sales, Marketing, and Global Services (SMGS) is responsible for driving revenue, adoption, and growth from the largest and fastest growing small- and mid-market accounts to enterprise-level customers including public sector.","department_cost_center":null,"description_short":"We are seeking a talented Sales Compensation Analyst to join the Business Unit Operations team supporting AGS AMER Sales Teams. Reporting into the AGS AMER Sales Compensation Manager, you will partner","display_distance":null,"id":"35bd4382-5cba-4f9f-8765-93a033de85d8","id_icims":"3189217","is_intern":null,"is_manager":null,"job_category":"Corporate Operations","job_family":"Sales Operations Job Family","job_function_id":null,"job_path":"/en/jobs/3189217/sales-compensation-analyst-smgs-ops-global-sales-compensation","job_schedule_type":"full-time","location":"US, TX, Dallas","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Boston\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Boston\",\"coordinates\":\"42.35866,-71.05674\",\"normalizedCountyName\":\"Suffolk\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Boston, Massachusetts, USA\",\"location\":\"US, MA, Boston\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS21R\"],\"normalizedCityName\":\"Boston\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA44\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS17\"],\"normalizedCityName\":\"Arlington\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Dallas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Dallas\",\"coordinates\":\"32.77823,-96.7951\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Dallas, Texas, USA\",\"location\":\"US, TX, Dallas\",\"region\":\"TX\",\"buildingCodeList\":[\"DFW11\"],\"normalizedCityName\":\"Dallas\"}"],"normalized_location":"Dallas, Texas, USA","optional_search_labels":[],"posted_date":"February 25, 2026","preferred_qualifications":"- 5+ years of finance, business management and sales operations experience\u003cbr/\u003e- Experience working within a high-growth, technology company\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Denver - 88,100.00 - 154,100.00 USD annually\u003cbr/\u003eUSA, TX, Dallas - 88,100.00 - 154,100.00 USD annually\u003cbr/\u003eUSA, VA, Arlington - 88,100.00 - 154,100.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 88,100.00 - 154,100.00 USD annually","primary_search_label":"aws.team-no-matching-primary-label-listed","source_system":"JobCreator","state":"TX","title":"Sales Compensation Analyst, SMGS Ops, Global Sales Compensation","university_job":null,"updated_time":"19 minutes","url_next_step":"https://account.amazon.com/jobs/3189217/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-no-matching-primary-label-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}