{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Bachelor's degree in Electrical or Mechanical Engineering or related field.\u003cbr/\u003e- Hands-on experience with high-speed technologies (e.g., PCIe, Ethernet, Serdes, Switches).\u003cbr/\u003e- Strong fundamentals in signal integrity, including channel loss, crosstalk, impedance, and return loss.\u003cbr/\u003e- Proficiency in mechanical and electrical CAD tools (e.g., Creo, SolidWorks, Allegro).\u003cbr/\u003e- Excellent written and verbal communication skills.\u003cbr/\u003e- Ability to work cross functionally with SW team to define and implement diagnostics for hardware validation at component, interface, and system level\u003cbr/\u003e- Work with ODMs, component suppliers and internal design teams on cross-boundary triaging, debugging, and resolving issues.\u003cbr/\u003e- Hands-on lab equipment skills (VNA, Realtime scope, Sampling scope and its accessories) for electrical validation and characterization.\u003cbr/\u003e- Scripting skills to automate tests, logs parsing and data collection.\u003cbr/\u003e- Strong technical communication skills (verbal and written) to interface with cross-functional technical leads within and/or outside of the organization.","business_category":"aws","city":"Tel Aviv","company_name":"Annapurna Labs Ltd.","country_code":"ISR","description":"\u003cbr/\u003eAnnapurna Labs (our organization within AWS UC) designs silicon and software that accelerates innovation. Customers choose us to create cloud solutions that solve challenges that were unimaginable a short time ago—even yesterday. Our custom chips, accelerators, and software stacks enable us to take on technical challenges that have never been seen before, and deliver results that help our customers change the world.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eWe are seeking a Sr. Hardware Design Engineer with role in the definition, design and validation of AWS next generation ML Chips, Cards and server integration. As a senior member of our hardware team, you will have the outstanding and meaningful opportunity to participate in the design and execution of all System (controllers, connectivity), High speed (PCIe, Ethernet), board design, layout, testability and manufacturing, production testing and fleet deployment, with the goal of creating and customized platforms that fit within AWS datacenter’s world leading technology.\u003cbr/\u003eAs a member of the Machine Learning Acceleration team you’ll be responsible for the design and optimization of hardware in our data centers. You’ll provide leadership in the application of new technologies to large scale server deployments in a continuous effort to deliver a world-class customer experience. This is a fast-paced, intellectually challenging position, and you’ll work with thought leaders in multiple technology areas. You’ll have high standards for yourself and everyone you work with, and you’ll be constantly looking for ways to improve your products performance, quality and cost. We’re changing an industry, and we want individuals who are ready for this challenge and want to reach beyond what is possible today.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003eUtility Computing (UC)\u003cbr/\u003eAWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (IoT), Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for their cloud services.\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e","department_cost_center":null,"description_short":"Annapurna Labs (our organization within AWS UC) designs silicon and software that accelerates innovation. Customers choose us to create cloud solutions that solve challenges that were unimaginable a short","display_distance":null,"id":"97b6ab55-77f4-4a51-bf0e-47777c597fe3","id_icims":"3161607","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"Cloud Hardware Development","job_function_id":null,"job_path":"/en/jobs/3161607/sr-hardware-engineer-board-design-annapurna-ml-il","job_schedule_type":"full-time","location":"IL, Tel Aviv","locations":["{\"normalizedStateName\":\"Tel Aviv\",\"normalizedCountryCode\":\"ISR\",\"city\":\"Tel Aviv\",\"countryIso3a\":\"ISR\",\"countryIso2a\":\"IL\",\"locationNonStemming\":\"Israel, Tel Aviv\",\"coordinates\":\"32.08556,34.78953\",\"normalizedCountyName\":\"Tel Aviv\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Israel\",\"normalizedLocation\":\"Tel Aviv-Yafo, Tel Aviv, ISR\",\"location\":\"IL, Tel Aviv\",\"region\":\"\",\"buildingCodeList\":[\"TLV14A\"],\"normalizedCityName\":\"Tel Aviv-Yafo\"}"],"normalized_location":"Tel Aviv-Yafo, Tel Aviv, ISR","optional_search_labels":["aws.team-annapurna-labs"],"posted_date":"January 19, 2026","preferred_qualifications":"- Experience with Server HW designs, Design validation, Production tests and signal integrity of high speed interfaces.\u003cbr/\u003e- Knowledge of the product development cycle from concept to mass production.\u003cbr/\u003e- Strong analytical capabilities\u003cbr/\u003e- The ability to work independently and drive tasks from start to completion\u003cbr/\u003e- Experience with server (x86 / ARM) design or architecture\u003cbr/\u003e- knowledge with PCIe interface Gen4 or above, both Electrical and Functional at the chip level and at the PCB level.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-hardware-development-primary","source_system":"JobCreator","state":null,"title":"Sr. Hardware Engineer, Board Design, Annapurna ML-IL","university_job":null,"updated_time":"3 minutes","url_next_step":"https://account.amazon.com/jobs/3161607/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-hardware-development-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 1+ years of software development engineer or related occupational experience\u003cbr/\u003e- 1+ years of designing and developing large-scale, multi-tiered, multi-threaded, embedded or distributed software applications, tools, systems, and services using: C#, C++, Java, or Perl experience\u003cbr/\u003e- 1+ years of Object Oriented Design experience\u003cbr/\u003e- Bachelor's degree or foreign equivalent in Computer Science, Engineering, Mathematics, or a related field\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"aws","city":"Seattle","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eJoin Shield, AWS's defense team within Perimeter Protection. We stand at the forefront of protecting AWS infrastructure and millions of customers from sophisticated attacks across the internet. Our mission is critical: safeguard the cloud infrastructure that powers a significant portion of the modern internet.\u003cbr/\u003e\u003cbr/\u003eWhat Makes This Role Exciting:\u003cbr/\u003e\u003cbr/\u003eInternet-Scale Impact: Process and protect traffic representing a substantial portion of global internet activity. The systems you build will defend some of the world's most critical infrastructure.\u003cbr/\u003e\u003cbr/\u003eScaling Challenges: Work on problems that few engineering teams ever encounter. Handle traffic volumes and attack patterns that push the boundaries of distributed systems design.\u003cbr/\u003e\u003cbr/\u003eCreative Problem Solving: Operate in an ambiguous, fast-moving space where the threat landscape evolves daily. Your creativity and adaptability will be your greatest assets as you design solutions for attacks that don't exist yet.\u003cbr/\u003e\u003cbr/\u003eHigh-Stakes Engineering: Balance competing priorities - massive scale, rapid iteration, effective mitigation - while ensuring customer traffic flows safely and reliably. Every decision matters.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Design the future of AWS security architecture\u003cbr/\u003e- This position isn't about maintaining existing systems, it's about architecting the next generation of protection mechanisms that will defend AWS and its customers for years to come\u003cbr/\u003e- You'll be working on existing and greenfield projects that will shape how we detect, mitigate, and prevent attacks at unprecedented scale and in real-time\u003cbr/\u003e- Members of the team work closely across research and DDoS response teams, to build the solutions to stop Layer 3/4 and Layer 7 attacks more effectively","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"028a1133-b25f-483d-bfd4-f277474246f7","id_icims":"3165052","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3165052/software-dev-engineer-shield","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA58\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"January 22, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 143,700.00 - 194,400.00 USD annually","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"WA","title":"Software Dev Engineer, Shield","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3165052/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 10+ years of design experience\u003cbr/\u003e- Have an available online portfolio\u003cbr/\u003e- Portfolio or work samples demonstrating strong brand thinking, visual craft, and system-level design\u003cbr/\u003e- Strong understanding of the end-to-end creative process, from concept through execution\u003cbr/\u003e- Experience managing multiple projects with varying scopes and deadlines\u003cbr/\u003e- Proficiency in Adobe Creative Suite (Photoshop, Illustrator, InDesign), Figma, and related design tools\u003cbr/\u003e- Solid understanding of production best practices for still, video, and motion design\u003cbr/\u003e- Proficient in AI tools for concepting","business_category":"alexa-and-amazon-devices","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The creative organization is driven by a bold, singular purpose: to create brand work that doesn’t just meet expectations but defines them. We aim to set a world-class standard for craft, clarity, and taste, especially when the challenge is complex or the constraints are real.\u003cbr/\u003eWe believe great brands are built through obsessive attention to detail, cohesive systems, and thoughtful storytelling across every touchpoint. Every decision—from typography to motion, from layout to imagery—matters. At Amazon Devices and Services, this pursuit requires courage, resilience, and a deep commitment to craft. We partner closely across Product, GTM, PR, and UX teams to elevate the brand experience and reveal the magic, care, and invention behind every product we design. As a Senior Brand Designer, you will play a critical role in shaping and evolving brand expression across a broad range of mediums, helping ensure consistency, quality, and creative excellence at scale.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tBring 10+ years of brand and visual design experience, with a strong ability to create and evolve cohesive brand systems across digital, on-site, motion, print, and experiential media.\u003cbr/\u003e•\tDesign high-impact brand work that balances concept, craft, and clarity—while pushing creative boundaries in service of the brand.\u003cbr/\u003e•\tTranslate complex ideas and product stories into simple, compelling visual narratives.\u003cbr/\u003e•\tContribute to the development, evolution, and stewardship of brand guidelines and design systems.\u003cbr/\u003e•\tCollaborate closely with creative partners, marketers, product teams, and leadership to deliver thoughtful, on-brand solutions.\u003cbr/\u003e•\tProvide clear, constructive feedback and help guide creative development to maintain a high bar for quality and consistency.\u003cbr/\u003e•\tStay deeply curious about design, culture, and emerging tools, technologies, and trends—and apply that knowledge to your work.\u003cbr/\u003e•\tPresent work confidently, articulate design rationale, engage in healthy debate, and incorporate feedback with intention.\u003cbr/\u003e•\tManage multiple projects simultaneously, balancing speed, quality, and attention to detail.\u003cbr/\u003e•\tMaintain strong organizational practices to ensure work is documented, accessible, and shareable across teams.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe creative organization thrives on a singular, bold purpose: to craft work that isn’t just exceptional, but world-class—a benchmark for excellence. We are relentless in this pursuit, especially when the odds are stacked against us. Our foundation is a commitment to craft and a dedication to ensuring every piece of creative work embodies a consistent, breathtaking aesthetic quality. We don’t meet expectations, we exist to define them. Details aren't just details—they're the difference between good and great. We obsess over these nuances with passion and precision.\u003cbr/\u003eWhile this pursuit is challenging at Amazon, we remain relentless alongside our partners and collaborators in bringing an elevated sense of taste to every detail. We do this because we know that excellence demands courage, resilience, and an unrelenting commitment to vision.\u003cbr/\u003e\u003cbr/\u003eOur mission is clear: to inspire our customers by revealing the magic, love, and thoughtful invention infused into every product signed, Amazon Devices and Services.","department_cost_center":null,"description_short":"The creative organization is driven by a bold, singular purpose: to create brand work that doesn’t just meet expectations but defines them. We aim to set a world-class standard for craft, clarity, and","display_distance":null,"id":"bfb08733-b4cc-423f-ba24-544dafa9c99c","id_icims":"3175939","is_intern":null,"is_manager":null,"job_category":"Design","job_family":"Design","job_function_id":null,"job_path":"/en/jobs/3175939/sr-brand-designer-iii-device-brand-studio","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA41\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK14\"],\"normalizedCityName\":\"New York\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Santa Monica\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Santa Monica\",\"coordinates\":\"34.01158,-118.49227\",\"normalizedCountyName\":\"Los Angeles\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Santa Monica, California, USA\",\"location\":\"US, CA, Santa Monica\",\"region\":\"CA\",\"buildingCodeList\":[\"LAX78\"],\"normalizedCityName\":\"Santa Monica\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February  6, 2026","preferred_qualifications":"- Curiosity and enthusiasm for Amazon Devices, AI, and the broader technology landscape\u003cbr/\u003e- Portfolio experience showcasing brand work for tech products, services, or subscriptions\u003cbr/\u003e- Experience contributing to or maintaining design systems at scale\u003cbr/\u003e- Familiarity with content management systems\u003cbr/\u003e- Ability to work independently, troubleshoot creative or process challenges, and drive work forward\u003cbr/\u003e- Strong communication and presentation skills, with the ability to thoughtfully defend design decisions to leadership\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Santa Monica - 141,000.00 - 190,700.00 USD annually\u003cbr/\u003eUSA, NY, New York - 155,400.00 - 210,300.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 141,000.00 - 190,700.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-devices-sales-and-marketing","source_system":"JobCreator","state":"WA","title":"Sr. Brand Designer III, Device Brand Studio","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3175939/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-devices-sales-and-marketing","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Supply Chain, Business, Engineering, Finance, or a related technical field\u003cbr/\u003e- Experience with data analysis tools such as Advanced Excel, SQL, Tableau, Python\u003cbr/\u003e- 5+ years of procurement, supply chain, inventory management, contract management, lease administration or operations experience\u003cbr/\u003e- Knowledge of supply chain management concepts - forecasting, planning, sourcing, optimization and logistics or equivalent","business_category":"alexa-and-amazon-devices","city":"Sunnyvale","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Lab126 is an inventive research and development company that designs and engineers high-profile consumer electronics. Lab126 began in 2004 as a subsidiary of Amazon.com, Inc., originally creating the best-selling Kindle family of products. Since then, we have produced innovated devices like Fire tablets, Fire TV, and Amazon Echo. What will you help us create?\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe Supply Planning Manager is responsible for all internal and external activities related to supply planning from production forecasts to finished good delivery. To succeed in this role, you need to be data driven, business oriented, cost conscious, and customer-centric. In this role, you will:\u003cbr/\u003e- Create and maintain a production schedule using the capacity plan, material constraints, and demand as inputs.\u003cbr/\u003e- Analyze demand changes to ensure supply aligns with demand requirements.\u003cbr/\u003e- Drive solutions to reduce and eliminate any short or long term gaps in supply plans.\u003cbr/\u003e- Lead and facilitate meetings with global manufacturing partners, as required, to reduce and eliminate shortages.\u003cbr/\u003e- Clearly communicate our manufacturing partner's current production status to senior/executive stakeholders.\u003cbr/\u003e- Develop production strategies for new production introductions (NPI) through end of life (EOL) that balances supply and demand.\u003cbr/\u003e- Responsible for short/long-term planning to drive manufacturing investment decisions.\u003cbr/\u003e- Clearly communicate supply and demand strategies to senior/executive stakeholders.\u003cbr/\u003e- Monitor and report supply chain costs.\u003cbr/\u003e- Be responsible for supply planning reporting generation and distribution.\u003cbr/\u003e- Identify opportunities to improve the planning process and drive projects to completion.\u003cbr/\u003e- This role may require some travel.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eSupply Planning Managers are responsible for production planning and order fulfillment for Amazon Devices. They are connected in the planning process throughout a product’s entire lifecycle, from New Product Introduction (NPI) to End of Manufacturing (EOM).\u003cbr/\u003e\u003cbr/\u003eA typical week starts by understanding week-over- week demand changes and how that impacts the business’s ability to balance supply to demand. You will analyze planned versus actual production as inputs change and will communicate supply and operations constraints to cross-functional stakeholders and executives. You will anticipate stocking levels based on demand strategies, create and implement risk mitigation strategies to eliminate supply chain disruptions and drive decisions based on costs using data and inputs from cross-functional teams.\u003cbr/\u003e\u003cbr/\u003eYour weekly planning deliverables will drive capacity decisions and component purchases upstream to suppliers and set the production strategy with Amazon’s electronic manufacturing suppliers.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Devices Global Supply Planning (GSP) team’s mission is to deliver excellent service to our customers, inspire change through flawless execution, value trust, equity, and recognition of our colleagues, and focus on delivering high impact improvements to processes, capabilities, and efficiency to fuel the Amazon Flywheel.\u003cbr/\u003e\u003cbr/\u003eIf you are interested in supply chain planning and execution, you may be a fit for the Supply Planning Manager role. You will be a central part of the Supply Planning team that plans how Amazon Devices are made and delivered to customer hands.","department_cost_center":null,"description_short":"Amazon Lab126 is an inventive research and development company that designs and engineers high-profile consumer electronics. Lab126 began in 2004 as a subsidiary of Amazon.com, Inc., originally creating","display_distance":null,"id":"96ff9dee-58ed-41a2-b000-efe6b682ae03","id_icims":"3144185","is_intern":null,"is_manager":null,"job_category":"Buying, Planning, \u0026 Instock Management","job_family":"Internal Procurement","job_function_id":null,"job_path":"/en/jobs/3144185/planning-manager-planning","job_schedule_type":"full-time","location":"US, CA, Sunnyvale","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sunnyvale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Sunnyvale\",\"coordinates\":\"37.37188,-122.03751\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sunnyvale, California, USA\",\"location\":\"US, CA, Sunnyvale\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC31\"],\"normalizedCityName\":\"Sunnyvale\"}"],"normalized_location":"Sunnyvale, California, USA","optional_search_labels":["military-spouse","alexa-and-amazon-devices.team-operations-job-family","military"],"posted_date":"December 16, 2025","preferred_qualifications":"- Master's degree in Business Administration, Finance, Economics, Computer Science, or a related field\u003cbr/\u003e- 4+ years of program, project, product management, or leading a product implementation process experience\u003cbr/\u003e- Experience in global supply chain management, managing cross-functional teams in a fast-paced consumer electronics product company\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $71,500/year in our lowest geographic market up to $153,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"alexa-and-amazon-devices.team-operations-and-supply-chain","source_system":"JobCreator","state":"CA","title":"Planning Manager, Planning","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3144185/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-operations-and-supply-chain","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- 3+ years of increasing responsibilities in WHS and/or environmental programs in manufacturing, production, or service operations\u003cbr/\u003e- 3+ years of increasing responsibilities in people and performance management, or 2+ years of Amazon Safety (blue badge/FTE) experience","business_category":"fulfillment-and-operations","city":"Chesterfield","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We're seeking a dedicated Workplace Health \u0026 Safety (WHS) Manager to join our mission of creating the world's safest work environment. This role offers an exciting opportunity to directly impact associate well being while driving operational excellence.\u003cbr/\u003e\u003cbr/\u003eAs a WHS Manager, you'll be the site's safety champion, leading our Global WHS Program implementation. You'll combine hands-on safety management with strategic thinking to protect our most valuable asset – our people. Your role bridges the gap between safety requirements and operational success, requiring both technical expertise and strong interpersonal skills. Working closely with Operations leadership, you'll drive safety initiatives that make a real difference. You'll conduct comprehensive risk assessments, analyze safety data, and implement practical solutions that protect associates while supporting productivity. Your ability to build relationships and influence positive change will be essential as you help shape our safety culture. You'll lead safety compliance efforts, conduct thorough site audits, and analyze incident trends to target improvements where they matter most. Managing our first aid program and emergency response capabilities, you'll ensure immediate care is always available. Your analytical skills will transform safety data into actionable insights, while your leadership abilities will help engage associates in our safety mission.\u003cbr/\u003e\u003cbr/\u003eCore Impact Areas:\u003cbr/\u003eSafety Leadership \u0026 Innovation - Transform safety culture through leadership and innovative solutions. Drive continuous improvement initiatives that set new benchmarks in workplace safety. Leverage technology and data analytics to drive preventive safety measures that protect our associates while enhancing operational excellence. Develop leadership plans, communicate expectations, and drive initiatives to create a safe work environment. Measure performance against WHS policies, analyze metrics, and conduct site audits to address non-compliance issues. \u003cbr/\u003e\u003cbr/\u003eStrategic Partnership \u0026 Influence - Build partnerships with Operations leadership to integrate safety into every aspect of our business. Use compelling data analysis and risk insights to influence positive change and drive strategic decision-making. Establish yourself as a trusted advisor who balances safety excellence with operational demands. Oversee recordkeeping, workplace organization, and WHS training programs. \u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements include: \u003cbr/\u003e- Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Stand/walk for up to 12 hours during shifts\u003cbr/\u003e- Work in an environment where the noise level varies \u003cbr/\u003e- Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e- Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e- Maintain effective care delivery in emergencies and assist emergency response at the site\u003cbr/\u003e\u003cbr/\u003eFor those that do not have an adult First Aid, CPR, AED certification from the American Heart Association or American Red Cross, must obtain within 3 weeks of start date.\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We're seeking","display_distance":null,"id":"ec5eb7b2-4cfd-401e-9309-eff4eef45536","id_icims":"3180917","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3180917/site-ehs-manager-ii","job_schedule_type":"full-time","location":"US, MO, Chesterfield","locations":["{\"normalizedStateName\":\"Missouri\",\"normalizedCountryCode\":\"USA\",\"city\":\"Chesterfield\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MO, Chesterfield\",\"coordinates\":\"38.65407,-90.55193\",\"normalizedCountyName\":\"St Louis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Chesterfield, Missouri, USA\",\"location\":\"US, MO, Chesterfield\",\"region\":\"MO\",\"buildingCodeList\":[\"SLN1\"],\"normalizedCityName\":\"Chesterfield\"}","{\"normalizedStateName\":\"Missouri\",\"normalizedCountryCode\":\"USA\",\"city\":\"CHESTERFIELD\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MO, CHESTERFIELD\",\"coordinates\":\"38.65407,-90.55193\",\"normalizedCountyName\":\"St Louis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Chesterfield, Missouri, USA\",\"location\":\"US, MO, CHESTERFIELD\",\"region\":\"MO\",\"buildingCodeList\":[\"SLN1\"],\"normalizedCityName\":\"Chesterfield\"}"],"normalized_location":"Chesterfield, Missouri, USA","optional_search_labels":[],"posted_date":"February 13, 2026","preferred_qualifications":"- Experience in Distribution Center or Manufacturing EHS with mix of exempt and non-exempt employees at a site of at least 250 people\u003cbr/\u003e- Master's degree\u003cbr/\u003e- Experience implementing lean principles and process improvement in an operational environment\u003cbr/\u003e- Experience in a fast paced, dynamic organization\u003cbr/\u003e- Certified Safety Professional\u003cbr/\u003e- Excellent written and verbal communication skills, including comfort interfacing with site leader\u003cbr/\u003e- Ability to develop and implement department goals and strategies\u003cbr/\u003e- Strong analytical skills with demonstrated problem solving ability\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MO, CHESTERFIELD - 70,100.00 - 105,200.00 USD annually","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"MO","title":"Site EHS Manager II","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3180917/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of experience working as a Post Production Coordinator or equivalent vendor experience in episodic television or film production\u003cbr/\u003e- Strong writing skills with ability to create clear, detailed documentation including cost reports, delivery schedules, and production summaries\u003cbr/\u003e- Technological fluency and comfort with digital media systems such as Flow Capture, PIX, Frame.io, and Airtable for asset management and collaboration\u003cbr/\u003e- Proficiency with communication and collaboration tools including Slack and Zoom for coordinating with Internal Stakeholder\u003cbr/\u003e- Exceptional organizational skills and attention to detail when managing multiple series budgets, vendor contracts, and delivery timelines simultaneously","business_category":"entertainment","city":"Culver City","company_name":"Amazon.com Services LLC - A57","country_code":"USA","description":"Amazon Studios is seeking a detail-oriented Post Production Coordinator to support our Scripted Episodic Series team. This role is integral to the Amazon Originals Post Production Management team, working on acclaimed series including 'Fallout,' 'The Summer I Turned Pretty,' 'Overcompensating,' 'Hazbin Hotel', and many more. The ideal candidate will bring strong organizational skills, technological fluency, and an enthusiastic team-oriented approach to managing the complex workflows on some of Prime Videos largest series.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tComplete and maintain detailed summary documents tracking post production progress across multiple series\u003cbr/\u003e•\tOrganize and track post-production budgets, bids, schedules, production documents, and vendor information\u003cbr/\u003e•\tLearn and maintain cost-tracking systems to ensure accurate financial oversight\u003cbr/\u003e•\tCoordinate regularly with production, development, localization, mastering, and technology department teams\u003cbr/\u003e•\tCollaborate with internal content security department on asset protection protocols\u003cbr/\u003e•\tEngage with marketing, public relations, and Prime Video team members to support launch initiatives\u003cbr/\u003e•\tBuild and maintain effective working relationships across internal and external stakeholders\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a Post Production Coordinator, you'll be at the center of our fast-paced production environment. Your day might include updating schedule trackers for multiple series, coordinating with show side post teams to manage dailies and cut turnovers. Troubleshooting delivery issues with vendors, scheduling and attending cross-functional meetings with creative and technical teams. You'll juggle multiple priorities while maintaining a concrete grasp of team objectives, ensuring that every detail—from file specifications to delivery schedules—is tracked and communicated effectively. Your organizational skills and proactive communication will keep projects moving smoothly from editorial through final delivery to Prime Video.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe US Scripted Post Production team guides the dailies, editorial and finishing process for Amazon MGM Studios' largest series. From our Culver City base, we manage over 35 live-action and animated series annually. Our team of 6 Post Executives and 3 Coordinators steers each project from Pre-Greenlight through Launch on Prime Video.\u003cbr/\u003eWe collaborate closely with Production, Creative, Localization, Delivery, and Marketing teams throughout the entire process. We establish budgets, supervise hiring for editorial teams and finishing vendors, and maintain delivery schedules. In partnership with showrunners, producers, and production teams worldwide, we uphold exceptional standards for creative and technical excellence. The department coordinates with editorial facilities, picture finishing houses, sound stages, and quality control teams, ensuring all series uphold Prime Originals high quality bar. \u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Studios is seeking a detail-oriented Post Production Coordinator to support our Scripted Episodic Series team. This role is integral to the Amazon Originals Post Production Management team, working","display_distance":null,"id":"b65f8627-5e29-4e34-b4ca-207564f4f16e","id_icims":"3136372","is_intern":null,"is_manager":null,"job_category":"Marketing \u0026 PR","job_family":"Entertainment and Studio","job_function_id":null,"job_path":"/en/jobs/3136372/post-coordinator-us-scripted-scripted-series-post-production","job_schedule_type":"full-time","location":"US, CA, Culver City","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Culver City\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Culver City\",\"coordinates\":\"34.02202,-118.39589\",\"normalizedCountyName\":\"Los Angeles\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Culver City, California, USA\",\"location\":\"US, CA, Culver City\",\"region\":\"CA\",\"buildingCodeList\":[\"LAX35\",\"LAX21\",\"LAX56\",\"LAX81\",\"AMZ1\",\"LAX22\",\"LAX94\",\"ONM99\",\"LAX96\",\"LAX75\",\"DFX7\",\"LAX47\",\"DLX9\",\"LAX76\",\"MAG2\",\"LAX84\",\"LAX18\"],\"normalizedCityName\":\"Culver City\"}"],"normalized_location":"Culver City, California, USA","optional_search_labels":[],"posted_date":"December  3, 2025","preferred_qualifications":"- •\tExperience in various television/film post production environments including editorial, picture finishing houses, and sound stages\u003cbr/\u003e- •\tExperience with a variety of digital media workflows including dailies, deliverables, color grading pipelines, sound mixing, and final delivery specifications\u003cbr/\u003e- •\tKnowledge of wide array of media asset types and technical specifications including file formats, codecs, resolution standards, and Prime Video's delivery requirements\u003cbr/\u003e- •\tAbility to work independently as well as contribute successfully to cross-functional teams including Production, Creative, Localization, Delivery, and Marketing departments\u003cbr/\u003e- •\tCommon sense, great judgment, and a good sense of humor\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Culver City - 26.00 - 47.00 USD hourly","primary_search_label":"entertainment.team-amazonstudios","source_system":"JobCreator","state":"CA","title":"Post Coordinator, US Scripted, Scripted Series Post Production","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3136372/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazonstudios","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- Work 40 hours/week, and overtime as required\u003cbr/\u003e- - Capacidade de levantar aproximadamente 18kg, ficar em pé/caminhar por até 8 horas e ser capaz de empurrar, puxar, agachar e alcançar produtos com ou sem a utilização de ferramentas;\u003cbr/\u003e- - Flexiblidade para atuação em diferentes área/atividade.","business_category":"aws","city":"Sao Paulo","company_name":"A100 ROW Servicos De Dados Brasil Ltda.","country_code":"BRA","description":"Vaga exclusiva para profissionais com deficiência (PCD)\u003cbr/\u003e\u003cbr/\u003eFaça parte da maior operação de computação em nuvem do mundo. A Amazon Web Services está buscando pessoas brilhantes, motivadas e engajadas para ocupar a posição de Especialista em Logística de Data Center. A pessoa ideal tem conhecimento em operações logísticas (movimentação de materiais), possui forte ética de trabalho, atenção aos detalhes, capacidade de multitarefa e opera em um ambiente complexo de ritmo rápido, a fim de cumprir prazos e manter o compromisso com a excelência operacional.\u003cbr/\u003e\u003cbr/\u003e• Separação de mercadorias\u003cbr/\u003e• Controle de estoque\u003cbr/\u003e• Ajudante de carga e descarga\u003cbr/\u003e• Movimentação e armazenagem de materiais\u003cbr/\u003e• Emissão de declaração\u003cbr/\u003e• Conferência de encomendas\u003cbr/\u003e• Expedição de materiais\u003cbr/\u003e• Organização e conservação de produtos\u003cbr/\u003e• Preparo, confecção e distribuição de materiais, componentes e equipamentos\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eEsta posição analisa o estoque do data center, as remessas de entrada e a demanda contínua para garantir que níveis de estoque adequados. Ajuda a criar planos para otimizar o fluxo de peças ao longo de seu ciclo de vida, faz o rastreamento de estoque e analisa seu movimento. Também trabalha em estreita colaboração com outras pessoas da equipe para atender às necessidades com rapidez e precisão. Atua com as equipes de compras e engenharia de hardware para interagir diretamente com fornecedores para processar RMAs e receber substituições. Comunica-se regularmente de forma contínua com fornecedores para resolver problemas e ajudar a entender nossos requisitos de negócios.\u003cbr/\u003e\u003cbr/\u003eDiversidade, Equidade e Inclusão\u003cbr/\u003e\u003cbr/\u003eA Amazon Web Services Brasil valoriza a Diversidade, Equidade e Inclusão (DE\u0026I) em todas as nossas posições de trabalho, e por isso atuamos com intencionalidade para que nosso ambiente interno reflita a pluralidade dos mercados em que atuamos e clientes que atendemos.\u003cbr/\u003e\u003cbr/\u003eNo Brasil , estruturamos um Comitê de Diversidade, Equidade e Inclusão composto por representantes de áreas e cargos diferentes pois entendemos que essa agenda precisa de diferentes perspectivas e vivências múltiplas. Nossa liderança é engajada e entende cada dia mais o seu papel na disseminação e prática dos nossos príncipios de liderança, com objetivo de sermos “a melhor empresa para se trabalhar do mundo”. Sabemos da nossa responsabilidade e necessidade de mudança e somos conscientes de que “ Sucesso e crescimento trazem grandes responsabilidades”. Nossos grupos de afinidade são formados por pessoas voluntárias de diferentes unidades de negócio e são parte ativa na definição das estratégias de DE\u0026I. Além disso, atuam como embaixadores dessa agenda e vão te apoiar desde o Day 1. Lembre-se “it´s always Day 1”. Os grupos estão organizados nas seguintes frentes: BEN - Black Employee Network, Women@Amazon, Glamazon (LGBTQIA+) e Pessoa com Deficiência.\u003cbr/\u003e\u003cbr/\u003eSe você quiser solicitar uma acomodação para a entrevista ou o processo de integração, avise seu recrutador(a) e ele(a) o conectará à nossa equipe de acomodação.\u003cbr/\u003e\u003cbr/\u003eMentoria e Crescimento profissional\u003cbr/\u003e\u003cbr/\u003eNossa equipe é dedicada a apoiar as pessoas recém contratadas. Temos uma equipe com ampla variedade de níveis de experiência e cargos, e estamos construindo um ambiente que celebra o compartilhamento de conhecimento e a mentoria. Nós nos preocupamos com o crescimento de sua carreira e nos esforçamos para atribuir projetos que contribuam para que cada pessoa da equipe se desenvolva e possa liderar iniciativas mais complexas no futuro.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs responsabilidades incluem tarefas manuais, como montagem, endereçamento, estampagem e organização do envio de mercadorias e materiais. Auxiliar na programação diária de entregas e coletas. Lidar com remessas recebidas, manter registros precisos de todas as mercadorias que entram e saem da empresa.\u003cbr/\u003e\u003cbr/\u003eTambém será responsável pela entrada precisa de dados no sistema, pelo faturamento associado à cadeia de suprimentos do inventário e trabalharará com contas à pagar para reconciliar discrepâncias em faturas.\u003cbr/\u003e\u003cbr/\u003eAinda mergulhará profundamente nos dados para entender tudo sobre o ciclo de vida dos ativos do data center. Manterá painéis de métricas atualizados e criará relatórios para fornecedores internos e externos, conforme necessário.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Vaga exclusiva para profissionais com deficiência (PCD)Faça parte da maior operação de computação em nuvem do mundo. A Amazon Web Services está buscando pessoas brilhantes, motivadas e engajadas para ocupar","display_distance":null,"id":"628d4341-582f-4002-b582-bc2758d22f51","id_icims":"3088170","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Data Center Materials","job_function_id":null,"job_path":"/en/jobs/3088170/especialista-em-logistica-vaga-exclusiva-para-profissionais-com-deficiencia-pcd","job_schedule_type":"full-time","location":"BR, SP, Sao Paulo","locations":["{\"normalizedStateName\":\"Sao Paulo\",\"normalizedCountryCode\":\"BRA\",\"city\":\"Sao Paulo\",\"countryIso3a\":\"BRA\",\"countryIso2a\":\"BR\",\"locationNonStemming\":\"Brazil, SP, Sao Paulo\",\"coordinates\":\"-23.56283,-46.65474\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Brazil\",\"normalizedLocation\":\"Sao Paulo, Sao Paulo, BRA\",\"location\":\"BR, SP, Sao Paulo\",\"region\":\"SP\",\"buildingCodeList\":[\"GRU1\"],\"normalizedCityName\":\"Sao Paulo\"}"],"normalized_location":"Sao Paulo, Sao Paulo, BRA","optional_search_labels":[],"posted_date":"September 18, 2025","preferred_qualifications":"- Experience with Microsoft Office products and applications\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-it-services","source_system":"JobCreator","state":"SP","title":"Especialista em Logística - Vaga exclusiva para profissionais com deficiência (PCD)","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3088170/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-it-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"consumerpayments","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"Welcome to join a fast-growing team breaking new grounds at Amazon. We are looking for Software Development Engineers to join our Family. If you can Think Big, Dive Deep and are curious to Learn, you have our DNA and we need you.\u003cbr/\u003e\u003cbr/\u003eAmazon B2B Payments and Lending (ABPL) revolutionizes financial services for businesses of all sizes, anywhere in the world, enabling them to delight their customers and make a positive impact to the communities they serve. We never stop innovating to earn their trust by leveraging our scale, insights, and technology, and raise the bar with simple, secure, and seamless solutions.\u003cbr/\u003e\u003cbr/\u003eTo support our mission, we are expanding our Engineering, Operations, Research, Finance, Product Management, Marketing and Data teams. We are working together to extend the global reach of Payments and Lending and launch the next generation of products and customer experiences.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs a Software Development Engineer:\u003cbr/\u003e\u003cbr/\u003e- You will be responsible for design, development, testing, deploying, delivering and support the large-scale, multi-tiered, distributed software applications and tools that serve Amazon Business Customers.\u003cbr/\u003e- You will work as full-stack engineers building end to end experiences on Front-end, UI, UX frameworks / Back-end, REST APIs, leveraging a wide array of AWS services including EC2, S3, API Gateway, Workflow service, Step Function, DynamoDB, Lambda and infra-as-code.\u003cbr/\u003e- You will be responsible for estimating efforts, plan implementation, roll out across systems and  operations.","department_cost_center":null,"description_short":"Welcome to join a fast-growing team breaking new grounds at Amazon. We are looking for Software Development Engineers to join our Family. If you can Think Big, Dive Deep and are curious to Learn, you have","display_distance":null,"id":"7ba1be23-925a-4686-b572-2ef14cd2d5ce","id_icims":"3180993","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3180993/software-development-engineer-ii-amazon-b2b-payments-and-lending-abpl","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR26\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"February 13, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"consumerpayments.no-team-listed","source_system":"JobCreator","state":"KA","title":"Software Development Engineer II, Amazon B2B Payments and Lending (ABPL)","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3180993/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 3+ years of Video Games Industry (supporting title Development, Release, or Live Ops) experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"consumerpayments","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"Want to participate in building the next generation of online payment system that supports numerous countries and payment methods? We are seeking talented software engineers to join one of the fastest growing areas in Amazon’s e-commerce services platform. \u003cbr/\u003eWe want to move all the money in the world! We deliver game-changing financial processing power for the some of the world’s largest technology platforms including Amazon.com, Amazon Kindle, and Amazon Web Services.\u003cbr/\u003eWe build systems that process payments at an unprecedented scale, with accuracy, speed, and mission-critical availability. We innovate to improve customer experience across the globe, with support for currency choice, in-store payments, pay on delivery, credit and debit payments, seller disbursements, gift cards, and many new exciting and challenging ideas are in the works.\u003cbr/\u003eThe Amazon Payments Platform processes millions of transactions every day across numerous countries and payment methods. Over 100 million customers and merchants send tens of billions of dollars moving at light-speed through our systems annually. Come challenge yourself in our team-oriented atmosphere, and watch yourself grow with one of the fastest growing areas of the Amazon e-commerce services platform.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eDefine, design, and implement multi-tier distributed software applications.\u003cbr/\u003eEstimate engineering effort, plan implementation, and rollout system changes that meet requirements for functionality, performance, scalability, reliability, and adherence to development goals and principles.\u003cbr/\u003eMust be able to independently design code and test major features, as well as work jointly with other team members to deliver complex changes.\u003cbr/\u003eMust be able to effectively collaborate in a fast paced environment with multiple teams in a large organization (software development, QA, Project/Release Management, Build and Release, etc.,).\u003cbr/\u003eProvide on-call production support for payment platform applications","department_cost_center":null,"description_short":"Want to participate in building the next generation of online payment system that supports numerous countries and payment methods? We are seeking talented software engineers to join one of the fastest","display_distance":null,"id":"d28fa85d-2479-4f41-bdda-14dcc552dcb7","id_icims":"3180995","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3180995/software-development-engineer-ii-amazon-payments","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR26\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"February 13, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"consumerpayments.no-team-listed","source_system":"JobCreator","state":"KA","title":"Software Development Engineer II, Amazon Payments","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3180995/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- 2+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of designing or architecting (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 2+ years of administrative experience in networking, storage systems, operating systems and hands-on systems engineering experience\u003cbr/\u003e- Knowledge of systems engineering fundamentals (networking, storage, operating systems)\u003cbr/\u003e- Experience programming with at least one modern language such as C++, C#, Java, Python, Golang, PowerShell, Ruby","business_category":"ecp","city":"San Jose","company_name":"Amazon Support Services Costa Rica SRL","country_code":"CRI","description":"Amazon’s Intelligent Cloud Hosting (ICON) Team is looking for a System Development Engineer to join our team in San José, Costa Rica.\u003cbr/\u003e\u003cbr/\u003eWho are we? We host Amazon’s websites.  That includes all of Amazon’s global marketplaces and partner portals, and all of Amazon’s consumer experiences like Kindle, Alexa, Amazon Video, Mobile Application; Physical Stores, Luna....  Not only we help deliver the html that delights our customers, we make sure that all underlying transactions are processed error-free. This includes payments, tax, contracts, returns, inventory, and notifications; and brand new experiences that have never been done before.  \u003cbr/\u003e\u003cbr/\u003eIn short, we perform cloud infrastructure management at the biggest scale in the known universe.  We also look good doing it.  \u003cbr/\u003e \u003cbr/\u003eWe’re a diverse international team made up of engineers, developers, administrators and managers.  We’re obsessed with operational quality, security, reducing cost, increasing availability and keeping the largest eCommerce infrastructure purring.   \u003cbr/\u003e \u003cbr/\u003eOur team has offices in Seattle, New York, Dublin, San Jose, Sydney and Bangalore.\u003cbr/\u003e \u003cbr/\u003eWe’re looking for a Systems Development Engineer who is inventive, who understands operational excellence, and can work to scale.  \u003cbr/\u003e\u003cbr/\u003eA big part of our job is creating and updating strategic SRE tool-kit built on AWS technology.  We use these tools across Amazon to deploy, monitor and operate the hundreds of thousands of services that power our highly distributed architecture.  Our tools include orchestration, predictive analytics, monitoring, problem diagnosis and automated repair.  These let us deploy configurations that intelligently manage how traffic flows through our highly distributed architecture to our delighted customers.\u003cbr/\u003e      \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• We do almost everything in Linux. We’re looking for people who are not just hobbyists, but people who’ve tweaked their favorite distro to get things working just the way they like them.\u003cbr/\u003e• We need people with a solid grasp of networking fundamentals. This includes experience with load balancers, switches, and routers.\u003cbr/\u003e• We need people who can design, implement, maintain and deploy components that solve problems in a complex ecosystem. We work in lots of different languages (not limited to, but most often Python and Java). It is more important to us that you understand coding in the context of working in distributed systems and/or widely scaled web applications.\u003cbr/\u003e• We need people with strong written and verbal communication skills and an ability to communicate effectively with both technical and non-technical individuals.\u003cbr/\u003e• We want to work with people whose passion for problem solving goes hand-in-glove with their debugging and troubleshooting skills.\u003cbr/\u003e• We need people with an ability to self-motivate and follow-through on projects. To us, that means being detail oriented, passionate, and delivering results.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe own connecting Amazon worldwide websites and other consumer experiences such as Kindle, Amazon Video, and Alexa to the internet, as well as ensuring the highest level of availability, security and privacy of the web services that power the experience we deliver to our customers worldwide. We abstract, centralize and optimize the infrastructure management from individual service teams and operate 120+ Tier-1 services on behalf of teams in the Worldwide Consumer org. We own the routing layer built on top of AWS technology that connects traffic at low latency and protects the web services against malicious robot and DDoS attacks. ","department_cost_center":null,"description_short":"Amazon’s Intelligent Cloud Hosting (ICON) Team is looking for a System Development Engineer to join our team in San José, Costa Rica.Who are we? We host Amazon’s websites.  That includes all of Amazon’s","display_distance":null,"id":"0ee2d3d3-9e66-485a-beed-ba61b8958fac","id_icims":"3086629","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"System Development Engineering","job_function_id":null,"job_path":"/en/jobs/3086629/system-development-engineer-ii-intelligent-cloud-hosting-icon","job_schedule_type":"full-time","location":"CR, San Jose","locations":["{\"normalizedStateName\":\"San Jose\",\"normalizedCountryCode\":\"CRI\",\"city\":\"San Jose\",\"countryIso3a\":\"CRI\",\"countryIso2a\":\"CR\",\"locationNonStemming\":\"Costa Rica, San Jose\",\"coordinates\":\"9.92975,-84.08569\",\"normalizedCountyName\":\"San Jose\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Costa Rica\",\"normalizedLocation\":\"San Jose, San Jose, CRI\",\"location\":\"CR, San Jose\",\"region\":\"\",\"buildingCodeList\":[\"SJO11\"],\"normalizedCityName\":\"San Jose\"}"],"normalized_location":"San Jose, San Jose, CRI","optional_search_labels":["icc.team-seattle"],"posted_date":"September 17, 2025","preferred_qualifications":"- Knowledge of and proficiency in the use of Python and/or Java\u003cbr/\u003e- Knowledge of best practices for software deployment\u003cbr/\u003e- Experience with infrastructure management\u003cbr/\u003e- Experience with eCommerce retail website(s)\u003cbr/\u003e- Detail-oriented, passionate, and able to deliver results\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"ecp.team-intelligent-cloud-control","source_system":"JobCreator","state":null,"title":"System Development Engineer II, Intelligent Cloud Hosting (ICON)","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3086629/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-intelligent-cloud-control","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}