{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- Professional Electrical or Mechanical Certification (National Craft Certificate (NCC), Registered Electrical Contractor (REC), or equivalent)","business_category":"aws","city":"Dublin","company_name":"Amazon Data Services Ireland Limited","country_code":"IRL","description":"We are currently seeking a Data Center Operations Electrical/Mechanical/Control Technician to join our Engineering Oprerations Team. \u003cbr/\u003e\u003cbr/\u003eThe successful candidate will oversee the operation and maintenance of the electrical and mechanical infrastructure for Data Centers (DC) in Amazon Web Services (AWS) Cloud regions. Our technicians are operating and maintaining AWS DCs’ world-class mechanical and electrical infrastructure. In addition to technical operations and maintenance, the successful candidate will oversee facility operations and ensure the implementation of safety procedures.\u003cbr/\u003e\u003cbr/\u003eThe role requires a motivated, self-managed individual who demonstrates initiative and proactively seeks solutions to problems while striving for operational excellence. The work follows a process-oriented approach: the individual needs a strong willingness to learn new processes and adapt to rapidly changing operational scenarios with conflicting priorities.\u003cbr/\u003e\u003cbr/\u003eThe successful candidate will be part of the Engineering and Facilities team and will be responsible for; maintaining availability for customers; ensuring maintenance and operation of technical infrastructure; and the upkeep and operation of the DC facility.\u003cbr/\u003e \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Assisting in the operation, and maintenance of all, mechanical, Electrical and HVAC equipment within the Data Center/Facility.\u003cbr/\u003e-  Develop work plan for emergency repair of critical assets.\u003cbr/\u003e- Troubleshooting of all mechanical, electrical, HVAC systems, \u003cbr/\u003e- Operate under minimal supervision.\u003cbr/\u003e- Create and close Work Orders with appropriate data, to include labor hours, equipment maintenance, and parts used into asset management system\u003cbr/\u003e- Maintain changes in state in Mission Critical infrastructure in support of corrective/ preventive maintenance\u003cbr/\u003e- Testing: Test quality, performance, safety, and reliability of products, equipment, processes\u003cbr/\u003e- Act as a front line responder for hands-on electrical and mechanical equipment troubleshooting. This equipment includes, but is not limited to, AHU’s, chillers, cooling towers, chemical treatment systems, pumps, motors, VFD’s, and building automation systems.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. ","department_cost_center":null,"description_short":"We are currently seeking a Data Center Operations Electrical/Mechanical/Control Technician to join our Engineering Oprerations Team. The successful candidate will oversee the operation and maintenance","display_distance":null,"id":"7a851506-8e36-43e8-9e29-afd4caf6c832","id_icims":"2946138","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/2946138/mechanical-engineering-technician-non-shift-dub-mechanical-team","job_schedule_type":"full-time","location":"IE, D, Dublin","locations":["{\"normalizedCountryCode\":\"IRL\",\"city\":\"Dublin\",\"countryIso3a\":\"IRL\",\"countryIso2a\":\"IE\",\"locationNonStemming\":\"Ireland, D, Dublin\",\"coordinates\":\"53.34807,-6.24827\",\"normalizedCountyName\":\"County Dublin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Ireland\",\"normalizedLocation\":\"Dublin, IRL\",\"location\":\"IE, D, Dublin\",\"region\":\"D\",\"buildingCodeList\":[\"DUB52\"],\"normalizedCityName\":\"Dublin\"}"],"normalized_location":"Dublin, IRL","optional_search_labels":["aws.team-ais","aws.team-dc","aws.team-adc-infra-optional","aws.team-ireland-optional"],"posted_date":"April  4, 2025","preferred_qualifications":"- Experience in data center engineering\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"D","title":"Mechanical Engineering Technician  (Non-Shift), DUB Mechanical Team","university_job":null,"updated_time":"1 minute","url_next_step":"https://account.amazon.com/jobs/2946138/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of customer-facing environment, warehousing, logistics or manufacturing experience","business_category":"fulfillment-ops","city":"Coimbatore","company_name":"ASSPL - Tamil Nadu - D31","country_code":"IND","description":"At Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Team leads for our transportation team. Amazon is one of the most recognizable brand names in the world and we distribute millions of products each year to our loyal customers\u003cbr/\u003e\u003cbr/\u003eWe're seeking a Channel Team lead for our Delivery Station. In this role you will be responsible for End-end operations with stake holders at our DS and support the DS site lead in performance management and driving the operational plan.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eEssential Functions\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003eDefining , building and executing the delivery process from delivery station to customer address\u003cbr/\u003e\u003cbr/\u003eEngage closely with the delivery team including associates, developing and maintaining a highly motivated and performance driven team.\u003cbr/\u003e\u003cbr/\u003eContinuously improve the delivery process and attain a sustained level of delivery performance, through process and training improvements. Initiates improvements to enhance quality standards, reduce waste, and eliminate unnecessary work.\u003cbr/\u003e\u003cbr/\u003eAnalysis of the data reports to identify performance bottlenecks and improve performance\u003cbr/\u003e\u003cbr/\u003eEssential Skills\u003cbr/\u003eStrong leadership capabilities and people management skills - Ability to work under pressure situations\u003cbr/\u003e\u003cbr/\u003eGood communication skills. Ability to communicate and explain to individuals \u0026 the team, what needs to be achieved for the Delivery Center /Amazon to achieve its objectives. Listening skills: Gains input and commitment from all involved in delivering their specific part.\u003cbr/\u003e\u003cbr/\u003eStrong Bias for great customer service: Engage the Team in developing their understanding of Customer Experience and knowledge of what Customers actually needs/expects.\u003cbr/\u003eHigh Ownership: Follows through to ensure the delivery of changes/solutions/services that fulfill the Customer’s needs.\u003cbr/\u003e\u003cbr/\u003eAnalytical Skills: Effectively analyze and interpret information, identifying \u0026 validating the key facts, including reviewing alternatives to determine advantages and associated risks.\u003cbr/\u003eRelated skills : Background on marketing, End-end sales, Experiences with people management and basic data analytical skills.\u003cbr/\u003eInternal job description\u003cbr/\u003e\u003cbr/\u003eLoop competencies\u003cbr/\u003e--\u003cbr/\u003eBasic qualifications\u003cbr/\u003e\u003cbr/\u003e- Experience in customer-facing environment, warehousing, logistics or manufacturing\u003cbr/\u003ePreferred qualifications\u003cbr/\u003e\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"At Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Team leads for our transportation team.","display_distance":null,"id":"5a54daf9-34da-4bf9-9188-9f4b4e32fc63","id_icims":"3167295","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3167295/team-lead-amzl-team-lead","job_schedule_type":"full-time","location":"IN, TN, Coimbatore","locations":["{\"normalizedStateName\":\"Tamil Nadu\",\"normalizedCountryCode\":\"IND\",\"city\":\"Coimbatore\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TN, Coimbatore\",\"coordinates\":\"10.99415,76.9663\",\"normalizedCountyName\":\"Coimbatore\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Coimbatore, Tamil Nadu, IND\",\"location\":\"IN, TN, Coimbatore\",\"region\":\"TN\",\"buildingCodeList\":[\"PTJ40\"],\"normalizedCityName\":\"Coimbatore\"}"],"normalized_location":"Coimbatore, Tamil Nadu, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"January 27, 2026","preferred_qualifications":"- Bachelor's degree\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"TN","title":"Team Lead - AMZL , Team Lead ","university_job":null,"updated_time":"25 minutes","url_next_step":"https://account.amazon.com/jobs/3167295/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience with Microsoft Office products and applications","business_category":"transportation-and-logistics","city":"Ghaziabad","company_name":"ASSPL - Uttar Pradesh - D37","country_code":"IND","description":"At Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Team leads for our transportation team. Amazon is one of the most recognizable brand names in the world and we distribute millions of products each year to our loyal customers\u003cbr/\u003e\u003cbr/\u003eWe're seeking a Team lead for our Delivery center. In this role you will be responsible for shift operations at our DCs and support the DC manager in performance management and driving the operational plan.\u003cbr/\u003e\u003cbr/\u003eTitle: Team Lead\u003cbr/\u003eLocation: Ghaziabad\u003cbr/\u003e\u003cbr/\u003eEssential Functions\u003cbr/\u003e\u003cbr/\u003e-Job Description · Account Identification \u0026 Acquisition: Market mapping and Identification of potential retail stores for time bound Acquisition, induction and onboarding of new accounts (I.H.S stores) in the assigned territory.\u003cbr/\u003e· Account Management: Managing and driving the growth of the Channel partners/stores’ business with Amazon. Build and execute on a strategic account plan that delivers on key business opportunities for the stores and Amazon.\u003cbr/\u003e· Field Visits: Visiting targeted number of stores on a daily/weekly/monthly basis.\u003cbr/\u003e· Training: Deliver training \u0026 coaching of Amazon processes, products, operating model and SOPs.\u003cbr/\u003e· Work on the ground to enable network with new product launches and partner with the operations and other teams.\u003cbr/\u003e· Reporting: Maintaining \u0026 publishing routine reporting on the stores current performance \u0026 business with Amazon. Publish recommendations and action plans based on data. Reporting the overall Network Health in the assigned territory.\u003cbr/\u003e· Team Management: Building and managing a multi-layer team and manage performance through on-the job coaching and mentoring. Driving team of associates for managing their targets.\u003cbr/\u003e· Set proper expectations, provide clear status communications, and manage relationships with the acquired/assigned stores for a mutual growth.\u003cbr/\u003e· Work with Stores/channel partners to improve operational aspects of their business in providing a great delivery experience and consistently enhance efficiency.\u003cbr/\u003e· Enhance Engagement with accounts to improve business and increase retention.\u003cbr/\u003e· Drive stores against goals (Volume, FTR and other key metrics).\u003cbr/\u003e· Handling day to day operational escalations and be available to round the clock to manage the issues.\u003cbr/\u003e· Internal/External Stake holder management.\u003cbr/\u003e· Support station operations and/or customer deliveries.\u003cbr/\u003eEssential Skills\u003cbr/\u003e - Strong leadership capabilities and people management skills\u003cbr/\u003e - Ability to work under pressure situations\u003cbr/\u003e - Ability to work in ambiguous situations\u003cbr/\u003e - Good communication skills. Ability to communicate and explain to individuals \u0026 the team, what needs to be achieved for the Delivery Center /Amazon to achieve its objectives. Listening skills: Gains input and commitment from all involved in delivering their specific part.\u003cbr/\u003e - Strong Bias for great customer service: Engage the Team in developing their understanding of Customer Experience and knowledge of what Customers actually needs/expects.\u003cbr/\u003e - High Ownership: Follows through to ensure the delivery of changes/solutions/services that fulfill the Customer’s needs.\u003cbr/\u003eAnalytical Skills: Effectively analyze and interpret information, identifying \u0026 validating the key facts, including reviewing alternatives to determine advantages and associated risks.","department_cost_center":null,"description_short":"At Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Team leads for our transportation team.","display_distance":null,"id":"e823fad8-edb8-4f80-be44-7402d659e4d4","id_icims":"3159860","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3159860/team-lead","job_schedule_type":"full-time","location":"IN, UP, Ghaziabad","locations":["{\"normalizedStateName\":\"Uttar Pradesh\",\"normalizedCountryCode\":\"IND\",\"city\":\"Ghaziabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, UP, Ghaziabad\",\"coordinates\":\"28.67815,77.40863\",\"normalizedCountyName\":\"Ghaziabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Ghaziabad, Uttar Pradesh, IND\",\"location\":\"IN, UP, Ghaziabad\",\"region\":\"UP\",\"buildingCodeList\":[\"NCT8\"],\"normalizedCityName\":\"Ghaziabad\"}"],"normalized_location":"Ghaziabad, Uttar Pradesh, IND","optional_search_labels":[],"posted_date":"January 15, 2026","preferred_qualifications":"- Bachelor's degree\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-amzl","source_system":"JobCreator","state":"UP","title":"Team Lead","university_job":null,"updated_time":"26 minutes","url_next_step":"https://account.amazon.com/jobs/3159860/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amzl","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- Speak, write, and read fluently in English\u003cbr/\u003e- Experience with Microsoft Office products and applications","business_category":"fulfillment-and-operations","city":"Hyderabad","company_name":"ASSPL - Telangana - D82","country_code":"IND","description":"Job summary\u003cbr/\u003eAt Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Team leads for our transportation team. Amazon is one of the most recognizable brand names in the world and we distribute millions of products each year to our loyal customers\u003cbr/\u003e\u003cbr/\u003eWe're seeking a Team lead for our Delivery center. In this role you will be responsible for shift operations at our DCs and support the DC manager in performance management and driving the operational plan.\u003cbr/\u003e\u003cbr/\u003eTitle:Team Lead\u003cbr/\u003eLocation: Hyderabad .\u003cbr/\u003e\u003cbr/\u003e Essential Functions\u003cbr/\u003e\u003cbr/\u003e-Job Description\u003cbr/\u003e· Training: Deliver training \u0026 coaching of Amazon processes, products, operating model and SOP to Associates.\u003cbr/\u003e· Work on the ground to enable network with new product launches and partner with the operations and other teams.\u003cbr/\u003e· Reporting: Maintaining \u0026 publishing routine reporting on the current performance \u0026 business with Amazon. Publish recommendations and action plans based on data. Reporting the overall Network Health in the assigned territory.\u003cbr/\u003e· Team Management: Building and managing a multi-layer team and manage performance through on-the job coaching and mentoring. Driving team of associates for managing their targets.\u003cbr/\u003e· Set proper expectations, provide clear status communications, and manage relationships with the associates.\u003cbr/\u003e· Work with process associates \u0026 station team to improve operational aspects of their business in providing a great delivery experience and consistently enhance efficiency.\u003cbr/\u003e· Handling day to day operational escalations and be available to round the clock to manage the issues.\u003cbr/\u003e· Internal/External Stake holder management.\u003cbr/\u003e· Support station operations and/or customer deliveries.\u003cbr/\u003eEssential Skills\u003cbr/\u003e\u003cbr/\u003e    Strong leadership capabilities and people management skills\u003cbr/\u003e    Ability to work under pressure situations\u003cbr/\u003e    Ability to work in ambiguous situations\u003cbr/\u003e    Good communication skills. Ability to communicate and explain to individuals \u0026 the team, what needs to be achieved for the Delivery Center /Amazon to achieve its objectives. Listening skills: Gains input and commitment from all involved in delivering their specific part.\u003cbr/\u003e    Strong Bias for great customer service: Engage the Team in developing their understanding of Customer Experience and knowledge of what Customers actually needs/expects.\u003cbr/\u003e    High Ownership: Follows through to ensure the delivery of changes/solutions/services that fulfill the Customer’s needs.\u003cbr/\u003e\u003cbr/\u003eAnalytical Skills: Effectively analyze and interpret information, identifying \u0026 validating the key facts, including reviewing alternatives to determine advantages and associated risks.","department_cost_center":null,"description_short":"Job summaryAt Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Team leads for our transportation","display_distance":null,"id":"6c86971c-97f8-4a83-8d89-a079cee510cd","id_icims":"3148181","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Administrative Support","job_function_id":null,"job_path":"/en/jobs/3148181/team-lead-supply-chain-transportation-management","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD47\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":["amazon-operations.quality-emea"],"posted_date":"December 23, 2025","preferred_qualifications":"- MBA\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-last-mile-delivery","source_system":"JobCreator","state":"TS","title":"Team Lead, Supply Chain/Transportation Management","university_job":null,"updated_time":"29 minutes","url_next_step":"https://account.amazon.com/jobs/3148181/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-delivery","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in Data Center Engineering Operations, with a deep understanding of electrical and mechanical data center infrastructure\u003cbr/\u003e- Knowledge of mechanical or electrical systems design\u003cbr/\u003e- Experience working with a queue of requests with Service Level Agreements (SLA) and accuracy targets against Standard Operating Procedures (SOP)","business_category":"aws","city":"Dublin","company_name":"Amazon Data Services Ireland Limited","country_code":"IRL","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eThe Data Center Global Services organization is looking for an individual with proven and tested leadership skills to help bring to fruition a newly developed Facilities Operations Center. The Facility Operations Center is responsible for 24X7 monitoring of the data center’s physical infrastructure and will serve as a facilitator for all Large Scale Events. This team will ensure that the customer experience will be optimal and gratifying by way of consistency, reliability and attention to detail.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will need to have an understanding of data center IT Infrastructure and data center Facilities infrastructure and how the two entities co-exist. The successful candidate will be responsible for providing assistance and support to the onsite team. The position will help ensure overall availability and reliability to meet or exceed defined service levels. Qualified candidates must also have experience functioning in a large-scale data center and have demonstrated and displayed the ability to think outside of the box. This skill is essential, as the candidate will assist with aligning the Facility Operations Center with the larger objectives of other business and peer organizations. You will need to play a role with growing the team to a standard of operational excellence.\u003cbr/\u003e\u003cbr/\u003eIf you are passionate about the Customer Experience; you think and act globally; and you want to contribute to the operational excellence of Amazon Data Centers, then this may be the challenge you’ve been looking for!\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eMonitors the global data center Amazon facilities infrastructure platform\u003cbr/\u003eServes as a Point of Contact for internal and external teams\u003cbr/\u003eAssists with the development of communication and escalation protocols designed to improve the team’s performance\u003cbr/\u003eContributes to outage post mortem analysis\u003cbr/\u003eEnsures records are updated in a timely manner\u003cbr/\u003eAssists with coordination and communication during emergency recovery efforts\u003cbr/\u003eAssists with the development of tools that will enhance the team’s performance\u003cbr/\u003eAbility to support a 24X7 environment (This is shift work which may require that you work weekends and holidays)\u003cbr/\u003eInternal job description\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"1681227a-3de3-43fe-8209-1beefb8ae1f3","id_icims":"3155700","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3155700/facility-operations-center-eng-facilities-operation-center","job_schedule_type":"full-time","location":"IE, D, Dublin","locations":["{\"normalizedCountryCode\":\"IRL\",\"city\":\"Dublin\",\"countryIso3a\":\"IRL\",\"countryIso2a\":\"IE\",\"locationNonStemming\":\"Ireland, D, Dublin\",\"coordinates\":\"53.34807,-6.24827\",\"normalizedCountyName\":\"County Dublin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Ireland\",\"normalizedLocation\":\"Dublin, IRL\",\"location\":\"IE, D, Dublin\",\"region\":\"D\",\"buildingCodeList\":[\"DUB50\"],\"normalizedCityName\":\"Dublin\"}"],"normalized_location":"Dublin, IRL","optional_search_labels":[],"posted_date":"January  9, 2026","preferred_qualifications":"- Preferred qualifications\u003cbr/\u003e- - 3+ years' experience working in a large scale Data center\u003cbr/\u003e- - 3+ years’ experience in a NOC (Network Operations Centre) or similar\u003cbr/\u003e- - 3+ years' experience in Data Center Engineering / Operations environment\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"D","title":"Facility Operations Center Eng, Facilities Operation Center","university_job":null,"updated_time":"33 minutes","url_next_step":"https://account.amazon.com/jobs/3155700/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- You have the ability to simplify and convey intricate ideas, making them easily digestible for diverse audiences","business_category":"fulfillment-ops","city":"Cairo","company_name":"Souq.com for E-Commerce LLC","country_code":"EGY","description":"Lead real-time flow, capacity, and risk management across Amazon’s AMET Fulfilment Center network, directly impacting customer promise and delivery speed at scale. \u003cbr/\u003e\u003cbr/\u003eAs a Central Flow Lead, you operate at the center of network operations, making high-impact decisions that move millions of customer orders from click to ship. You own end-to-end flow across multiple sites, partnering with Fulfilment Centers and regional teams to balance demand, protect capacity, and manage risk. The role provides direct exposure to network-level decision-making and the opportunity to shape how flow is standardized and scaled across AMET.\u003cbr/\u003e\u003cbr/\u003e- Operate as the primary flow and risk escalation point for multiple FCs\u003cbr/\u003e- Drive real-time planning, workload balancing, and customer promise protection\u003cbr/\u003e- Influence network-wide metrics, planning discipline, and operational standards\u003cbr/\u003e- Work at the intersection of data, execution, and leadership in a 24/7 operation\u003cbr/\u003e\u003cbr/\u003eThis is an ideal role for candidates who enjoy ownership, complex problem-solving, and making visible impact in a highly interconnected operational environment.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Own end-to-end flow management across the AMET Fulfilment Center network, acting as the primary interface between Central Flow and site operations\u003cbr/\u003e- Drive real-time capacity, workload, and risk management to protect customer promise and delivery performance\u003cbr/\u003e- Develop, execute, and continuously refine network-level flow plans in partnership with FC leadership and regional stakeholders\u003cbr/\u003e- Identify planning, execution, and capacity gaps through data-driven analysis and lead corrective actions\u003cbr/\u003e- Lead operational escalations during capacity constraints, disruptions, or demand spikes, coordinating mitigation and recovery plans\u003cbr/\u003e- Define, track, and influence key performance metrics, including planning adherence, backlog health, and site-level KPIs\u003cbr/\u003e- Partner cross-functionally to standardize flow processes, improve planning discipline, and reduce operational variability\u003cbr/\u003e- Contribute to documentation, training, and knowledge-sharing to scale best practices across the AMET network\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eA Central Flow Lead starts the day by reviewing network health across AMET Fulfilment Centers, including volumes, backlog, capacity, and performance versus plan. Using flow and planning tools, you identify risks early and align with FC teams on required adjustments.\u003cbr/\u003eOutside of live operations, you focus on deep dives and continuous improvement—analyzing trends, closing planning gaps, and helping standardize flow practices across the network.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAMET Central Flow is responsible for orchestrating real-time flow, capacity, and risk management across the AMET Fulfilment Center network. The team partners closely with FCs and regional stakeholders to protect customer promise, improve planning discipline, and reduce operational variability.\u003cbr/\u003e\u003cbr/\u003eOperating with a strong Day 1 mindset, the team combines real-time data, operational insight, and continuous improvement to drive scalable, standardized flow across the network—creating visible impact every day.","department_cost_center":null,"description_short":"Lead real-time flow, capacity, and risk management across Amazon’s AMET Fulfilment Center network, directly impacting customer promise and delivery speed at scale. As a Central Flow Lead, you operate at","display_distance":null,"id":"31de0e62-08a6-4708-b879-b52cbab601e4","id_icims":"3172624","is_intern":null,"is_manager":null,"job_category":"Fulfillment / Warehouse Associate","job_family":"Administrative Support","job_function_id":null,"job_path":"/en/jobs/3172624/central-flow-lead-fulfillment-center","job_schedule_type":"full-time","location":"EG, Cairo","locations":["{\"normalizedCountryCode\":\"EGY\",\"city\":\"Cairo\",\"countryIso3a\":\"EGY\",\"countryIso2a\":\"EG\",\"locationNonStemming\":\"Egypt, Cairo\",\"coordinates\":\"30.04427,31.23525\",\"normalizedCountyName\":\"Cairo\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Egypt\",\"normalizedLocation\":\"Cairo, EGY\",\"location\":\"EG, Cairo\",\"region\":\"\",\"buildingCodeList\":[\"SPX5\"],\"normalizedCityName\":\"Cairo\"}"],"normalized_location":"Cairo, EGY","optional_search_labels":[],"posted_date":"February  3, 2026","preferred_qualifications":"- Basic knowledge or interest in learning programming languages\u003cbr/\u003e- Experience of collaborating with customers or stakeholders to drive business objectives and deliver results\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-tal3nt-priority","source_system":"JobCreator","state":null,"title":"Central Flow Lead, Fulfillment Center","university_job":null,"updated_time":"35 minutes","url_next_step":"https://account.amazon.com/jobs/3172624/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-tal3nt-priority","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of sales experience\u003cbr/\u003e- Bachelor's degree","business_category":"transportation-and-logistics","city":"Ahmedabad","company_name":"ASSPL - Gujarat - D34","country_code":"IND","description":"At Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Team leads for our transportation team. Amazon is one of the most recognizable brand names in the world and we distribute millions of products each year to our loyal customers . \u003cbr/\u003e\u003cbr/\u003eWe're seeking a Team lead for our Delivery center. In this role you will be responsible for shift operations at our DCs and support the DC manager in performance management and driving the operational plan.\u003cbr/\u003e\u003cbr/\u003eTitle: Channel Team Lead\u003cbr/\u003eLocation: Vadodara, Gujarat\u003cbr/\u003e\u003cbr/\u003e  Essential Functions \u003cbr/\u003e\u003cbr/\u003e-Job Description  ·         Account Identification \u0026 Acquisition:  Market mapping and Identification of potential retail stores for time  bound Acquisition, induction and onboarding of new accounts (I.H.S  stores) in the assigned territory. \u003cbr/\u003e  ·         Account Management: Managing and  driving the growth of the Channel partners/stores’ business with Amazon.  Build and execute on a strategic account plan that delivers on key  business opportunities for the stores and Amazon. \u003cbr/\u003e  ·         Field Visits: Visiting targeted number of stores on a daily/weekly/monthly basis. \u003cbr/\u003e  ·         Training: Deliver training \u0026 coaching of Amazon processes, products, operating model and SOPs. \u003cbr/\u003e  ·         Work on the ground to enable network with new product launches and partner with the operations and other teams. \u003cbr/\u003e  ·         Reporting: Maintaining \u0026 publishing  routine reporting on the stores current performance \u0026 business with  Amazon. Publish recommendations and action plans based on data.  Reporting the overall Network Health in the assigned territory. \u003cbr/\u003e  ·         Team Management: Building and managing a  multi-layer team and manage performance through on-the job coaching and  mentoring. Driving team of associates for managing their targets. \u003cbr/\u003e  ·         Set proper expectations, provide clear status  communications, and manage relationships with the acquired/assigned  stores for a mutual growth. \u003cbr/\u003e  ·         Work with Stores/channel partners to improve operational  aspects of their business in providing a great delivery experience and  consistently enhance efficiency. \u003cbr/\u003e  ·         Enhance Engagement with accounts to improve business and increase retention. \u003cbr/\u003e  ·         Drive stores against goals (Volume, FTR and other key metrics). \u003cbr/\u003e  ·         Handling day to day operational escalations and be available to round the clock to manage the issues. \u003cbr/\u003e  ·         Internal/External Stake holder management. \u003cbr/\u003e  ·         Support station operations and/or customer deliveries. \u003cbr/\u003eEssential Skills\u003cbr/\u003e     - Strong leadership capabilities and people management      skills\u003cbr/\u003e   - Ability to work under pressure situations\u003cbr/\u003e   - Ability to work in ambiguous situations \u003cbr/\u003e   - Good communication skills. Ability to communicate and      explain to individuals \u0026 the team, what needs to be achieved for the      Delivery Center /Amazon to achieve its objectives. Listening skills: Gains      input and commitment from all involved in delivering their specific part.\u003cbr/\u003e   - Strong Bias for great customer service: Engage the Team      in developing their understanding of Customer Experience and knowledge of      what Customers actually needs/expects.\u003cbr/\u003e   - High Ownership: Follows through to ensure the delivery      of changes/solutions/services that fulfill the Customer’s needs.\u003cbr/\u003e   Analytical Skills: Effectively analyse and interpret information, identifying \u0026 validating the key facts, including reviewing alternatives to determine advantages and associated risks.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eGood in communication skill, People management , Stake holder management , Data analysis \u0026 Expert in Microsoft Excel.  \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eDaily report to be share to Stake holder \u0026 Daily Performance tracking to manage \u0026 drive growth of External Delivery Service Providers within Amazon and responsible for all aspects of last mile operations i.e sourcing, contracting, monitoring of performance, and planning of capacity.","department_cost_center":null,"description_short":"At Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Team leads for our transportation team.","display_distance":null,"id":"76d9cf90-5af6-455b-8295-d5c2bbe484d1","id_icims":"3143678","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Sales/Account Management","job_function_id":null,"job_path":"/en/jobs/3143678/channel-team-lead-atspl-gj","job_schedule_type":"full-time","location":"IN, GJ, Ahmedabad","locations":["{\"normalizedStateName\":\"Gujarat\",\"normalizedCountryCode\":\"IND\",\"city\":\"Ahmedabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, GJ, Ahmedabad\",\"coordinates\":\"23.02778,72.60032\",\"normalizedCountyName\":\"Ahmedabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Ahmedabad, Gujarat, IND\",\"location\":\"IN, GJ, Ahmedabad\",\"region\":\"GJ\",\"buildingCodeList\":[\"GNN86\"],\"normalizedCityName\":\"Ahmedabad\"}"],"normalized_location":"Ahmedabad, Gujarat, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"December 16, 2025","preferred_qualifications":"- Experience in written and verbal communication skills to communicate with technical and non-technical audiences, including senior leadership\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-last-mile-delivery","source_system":"JobCreator","state":"GJ","title":"Channel Team Lead, ATSPL - GJ","university_job":null,"updated_time":"36 minutes","url_next_step":"https://account.amazon.com/jobs/3143678/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-delivery","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree","business_category":"fulfillment-and-operations","city":"Nanded","company_name":"ASSPL - Maharashtra - C32","country_code":"IND","description":"At Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Team leads for our transportation team. Amazon is one of the most recognizable brand names in the world and we distribute millions of products each year to our loyal customers\u003cbr/\u003e\u003cbr/\u003eWe're seeking a Team lead for our Delivery center. In this role you will be responsible for shift operations at our DCs and support the DC manager in performance management and driving the operational plan.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eEssential Functions\u003cbr/\u003eDefining , building and executing the delivery process from delivery station to customer address\u003cbr/\u003e\u003cbr/\u003eEnsure enough bandwidth in territorial delivery team to ensure peak time delivery management\u003cbr/\u003e\u003cbr/\u003eEngage closely with the delivery team including associates, developing and maintaining a highly motivated and performance driven team.\u003cbr/\u003e\u003cbr/\u003eContinuously improve the delivery process and attain a sustained level of delivery performance, through process and training improvements. Initiates improvements to enhance quality standards, reduce waste, and eliminate unnecessary work.\u003cbr/\u003e\u003cbr/\u003eAnalysis of the data reports to identify performance bottlenecks and improve performance\u003cbr/\u003e\u003cbr/\u003eImplement the formal process control and process improvement mechanisms such as Kaizen\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eStrong leadership capabilities and people management skills - Ability to work under pressure situations\u003cbr/\u003e\u003cbr/\u003eAbility to work in ambiguous situations\u003cbr/\u003e\u003cbr/\u003eGood communication skills. Ability to communicate and explain to individuals \u0026 the team, what needs to be achieved for the Delivery Center /Amazon to achieve its objectives. Listening skills: Gains input and commitment from all involved in delivering their specific part.\u003cbr/\u003e\u003cbr/\u003eStrong Bias for great customer service: Engage the Team in developing their understanding of Customer Experience and knowledge of what Customers actually needs/expects.\u003cbr/\u003e\u003cbr/\u003eHigh Ownership: Follows through to ensure the delivery of changes/solutions/services that fulfill the Customer’s needs.\u003cbr/\u003e\u003cbr/\u003eAnalytical Skills: Effectively analyse and interpret information, identifying \u0026 validating the key facts, including reviewing alternatives to determine advantages and associated risks.","department_cost_center":null,"description_short":"At Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Team leads for our transportation team.","display_distance":null,"id":"c96487cc-8c1b-4be1-8a2b-ff5b98f393c8","id_icims":"3142611","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Sales/Account Management","job_function_id":null,"job_path":"/en/jobs/3142611/channel-team-lead-amzl-atspl","job_schedule_type":"full-time","location":"IN, MH, Nanded","locations":["{\"normalizedStateName\":\"Maharashtra\",\"normalizedCountryCode\":\"IND\",\"city\":\"Nanded\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, MH, Nanded\",\"coordinates\":\"19.15571,77.31096\",\"normalizedCountyName\":\"Nanded\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Nanded, Maharashtra, IND\",\"location\":\"IN, MH, Nanded\",\"region\":\"MH\",\"buildingCodeList\":[\"NED40\",\"NAN40\"],\"normalizedCityName\":\"Nanded\"}"],"normalized_location":"Nanded, Maharashtra, IND","optional_search_labels":[],"posted_date":"December 15, 2025","preferred_qualifications":"- 2+ years of sales experience\u003cbr/\u003e- Bachelor's degree in marketing, communications, business, or equivalent\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-last-mile-delivery","source_system":"JobCreator","state":"MH","title":"Channel Team Lead - AMZL , ATSPL","university_job":null,"updated_time":"36 minutes","url_next_step":"https://account.amazon.com/jobs/3142611/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-delivery","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Conoscenza avanzata dell’italiano, scritto e parlato.\u003cbr/\u003e- Vasta esperienza nell’analisi dei dati in un contesto professionale e nell’utilizzo di tali indicatori per l’individuazione di problemi.\u003cbr/\u003e- Buona padronanza del pacchetto MS Office (Word, Excel, Outlook) in contesti di uso professionale.","business_category":"fulfillment-ops-team","city":"Pisa","company_name":"Amazon Italia Transport Srl","country_code":"ITA","description":"Il team Operations è il cuore pulsante di Amazon ed è grazie al suo operato impeccabile che riusciamo a elaborare e spedire gli ordini ai nostri clienti in tempi record. Nel ruolo di Operations Lead/Supervisor avrai l’opportunità di toccare con mano l’interazione tra le diverse componenti delle nostre attività operative, contribuendo in prima persona a garantirne un funzionamento efficiente.\u003cbr/\u003eSarai il punto di riferimento per i colleghi durante il turno di lavoro e li aiuterai a seguire i processi introdotti dai manager. Il ruolo prevede una forte componente pratica: avrai la possibilità di acquisire esperienza nell’utilizzo di strumenti e sistemi da cui dipende il successo della nostra attività. \u003cbr/\u003e\u003cbr/\u003eIl lavoro si svolge su turni: mattina, pomeriggio e notte.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e - Misurare e monitorare i flussi di lavoro e le performance del sito, nonché fornire rilevanti informazioni ai manager di prima linea per garantire l’eccellenza operativa in tutti i turni.\u003cbr/\u003e- Supportare e formare il personale affinché assicuri un servizio d’eccellenza e supervisionarlo nello svolgimento delle mansioni quotidiane.\u003cbr/\u003e- Supportare l’Area/Shift Manager nell’ambito di progetti per migliorare i processi, creare un ambiente di lavoro sicuro e aumentare il coinvolgimento del personale. \u003cbr/\u003e- Collaborare con altri reparti per individuare soluzioni tese a risolvere problematiche frequenti o soddisfare le necessità, laddove la produttività è cruciale.\u003cbr/\u003e- Analizzare i dati per identificare piani volti all’ottimizzazione della sicurezza, qualità e produttività. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eIl tuo lavoro di Operations Lead/Supervisor si svolgerà in uno dei nostri siti operativi. Affiancherai l’Area/Shift Manager nell’esecuzione del piano per il turno. Le mansioni di cui ti occuperai spazieranno dall’organizzazione delle riunioni di inizio turno con il team al monitoraggio delle procedure, per assicurare che tutti rispettino le norme di sicurezza, i processi di qualità e le priorità della giornata.\u003cbr/\u003eSegnalerai eventuali criticità ai manager, ma talvolta sarai tu la figura più senior durante un turno e spetterà a te fornire le indicazioni per portare a termine ogni incarico. A volte affiancherai l’Area/Shift Manager nella definizione dei turni, in modo da assicurare la presenza di personale a sufficienza anche nei periodi di massima attività.","department_cost_center":null,"description_short":"Il team Operations è il cuore pulsante di Amazon ed è grazie al suo operato impeccabile che riusciamo a elaborare e spedire gli ordini ai nostri clienti in tempi record. Nel ruolo di Operations Lead/Supervisor","display_distance":null,"id":"8c38b824-b221-4f24-9be9-46edc1d0925c","id_icims":"3172627","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3172627/operations-supervisor","job_schedule_type":"full-time","location":"IT, PI, Pisa","locations":["{\"normalizedStateName\":\"Tuscany\",\"normalizedCountryCode\":\"ITA\",\"city\":\"Pisa\",\"countryIso3a\":\"ITA\",\"countryIso2a\":\"IT\",\"locationNonStemming\":\"Italy, PI, Pisa\",\"coordinates\":\"43.70996,10.39945\",\"normalizedCountyName\":\"Pisa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Italy\",\"normalizedLocation\":\"Pisa, Tuscany, ITA\",\"location\":\"IT, PI, Pisa\",\"region\":\"PI\",\"buildingCodeList\":[\"DTC2\"],\"normalizedCityName\":\"Pisa\"}"],"normalized_location":"Pisa, Tuscany, ITA","optional_search_labels":[],"posted_date":"February  3, 2026","preferred_qualifications":"- Le qualifiche preferenziali non sono requisiti obbligatori per candidarsi a una posizione in Amazon. Se possiedi tutte le qualifiche richieste di cui sopra, non esitare a inviarci la tua candidatura: saremo felici di esaminarla!\u003cbr/\u003e- Esperienza nella gestione degli stakeholder e nella creazione e nel mantenimento di rapporti professionali.\u003cbr/\u003e- Esperienza in un contesto operativo, ad esempio di tipo logistico, vendita al dettaglio, settore alberghiero o hospitality, o customer service.\u003cbr/\u003e- Buona padronanza della lingua inglese.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops-team.fulfillment-associates","source_system":"JobCreator","state":"PI","title":"Operations Supervisor","university_job":null,"updated_time":"37 minutes","url_next_step":"https://account.amazon.com/jobs/3172627/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"fulfillment-associates","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of data engineering experience\u003cbr/\u003e- Experience with SQL\u003cbr/\u003e- Experience with data modeling, warehousing and building ETL pipelines\u003cbr/\u003e- Experience with one or more query language (e.g., SQL, PL/SQL, DDL, MDX, HiveQL, SparkSQL, Scala)\u003cbr/\u003e- Experience with one or more scripting language (e.g., Python, KornShell)","business_category":"transportation-and-logistics","city":"Hyderabad","company_name":"ADCI HYD 13 SEZ","country_code":"IND","description":"Join ShipTech Analytics (STA) as a Data Engineer to build the data and analytics backbone powering Amazon's global transportation network. You'll contribute to our vision of building an intelligent, autonomous, and scalable performance management and decision support system across Amazon Transportation.\u003cbr/\u003e\u003cbr/\u003eAs a Data Engineer I, you'll work on building standardized data solutions that empower operations teams worldwide. You'll develop both near-real-time (NRT) streaming pipelines and batch processing pipelines that deliver critical insights for decision-making. You'll also build data tools that enable self-service analytics and automate operational tasks, while contributing to innovative AI-powered solutions delivering automated insights across the transportation network.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Design and build scalable near-real-time (NRT) streaming and batch data pipelines supporting Amazon's global transportation network.\u003cbr/\u003e- Build data products and data tools that streamline the complete data lifecycle including data ingestion, processing, backfill, storage, vending, and operational support modules.\u003cbr/\u003e- Partner closely with stakeholders across operations and analytics teams to understand requirements, design solutions, and deliver datasets and data tools that enable faster, more informed decision-making\u003cbr/\u003e- Own data quality and implement enhancements for datasets that enable operational excellence and improve customer experience\u003cbr/\u003e- Collaborate with cross-functional teams to standardize analytics capabilities and build AI-powered automation\u003cbr/\u003e- Leverage AWS cloud technologies to transform raw data into actionable metrics\u003cbr/\u003e- Drive continuous improvement through code reviews, design discussions, operational best practices, and security compliance\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou work backwards from what stakeholders need, clarifying ambiguities  and building data products and tools. Throughout the day, you're writing code for data pipelines and building tools that handle ingestion, processing, storage, and vending alongside software engineers.\u003cbr/\u003eSome days you're in design discussions about data infrastructure, pipelines and tools.\u003cbr/\u003e\u003cbr/\u003eBeyond coding, you're documenting datasets, tools and runbooks, and participating in code reviews. When oncall, you monitor the pipeline health.\u003cbr/\u003eWhat makes the role interesting is the variety - you're partnering with stakeholders, TPMs, SDEs building scalable data pipelines and tools that directly affect how Amazon's transportation network operates.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eShipTech Analytics serves as the data and analytics backbone for Amazon's global transportation network. The team builds standardized data solutions that streamline analytics and enable faster decision-making for operations teams worldwide. Team members collaborate with cross-functional partners to deliver data products and tools.\u003cbr/\u003e\u003cbr/\u003eThe team is modernizing systems, building near-real-time architectures, and building AI-powered automation. Team members have opportunities to mentor others, prototype new ideas , and shape the future of the data analytics. The team values collaboration across geographies with members in multiple locations working together to serve global operations.","department_cost_center":null,"description_short":"Join ShipTech Analytics (STA) as a Data Engineer to build the data and analytics backbone powering Amazon's global transportation network. You'll contribute to our vision of building an intelligent, autonomous,","display_distance":null,"id":"6de3f761-6194-49e2-b8a3-1a0fd3585197","id_icims":"3168245","is_intern":null,"is_manager":null,"job_category":"Business Intelligence","job_family":"Data Engineering","job_function_id":null,"job_path":"/en/jobs/3168245/data-engineer-shiptech-analytics","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD13\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":[],"posted_date":"January 28, 2026","preferred_qualifications":"- Experience with big data technologies such as: Hadoop, Hive, Spark, EMR\u003cbr/\u003e- Experience with any ETL tool like, Informatica, ODI, SSIS, BODI, Datastage, etc.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-ats-tech","source_system":"JobCreator","state":"TS","title":"Data Engineer, ShipTech Analytics","university_job":null,"updated_time":"38 minutes","url_next_step":"https://account.amazon.com/jobs/3168245/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-ats-tech","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}