{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"A completed Bachelor’s degree in Architecture, Engineering, Construction Management or\u003cbr/\u003ecomparable field\u003cbr/\u003e• 5+ years as an Architect, Engineer, Construction Manager, or other Construction\u003cbr/\u003erelated disciplines\u003cbr/\u003e• 5+ years project management experience from design phase through implementation and\u003cbr/\u003eoperation\u003cbr/\u003e• 5+ years negotiating construction, procurement and labor contracts\u003cbr/\u003e• 5+ years familiarization with AutoCAD and/or Building Information Modeling (BIM), as well as\u003cbr/\u003escheduling software (Primavera, MS Project, or similar)","business_category":"operations","city":"Toronto","company_name":"Amazon Canada Fulfillment Services, ULC","country_code":"CAN","description":"As a Construction Manager, you are a customer obsessed leader in the Amazon construction\u003cbr/\u003eprocess. In this role, you play an integral part in the implementation of the facility network infrastructure;\u003cbr/\u003eincluding sortation centers, delivery stations, and auxiliary buildings that support those facilities. The\u003cbr/\u003econstruction projects include new builds, retrofits, and expansions. You are required to perform detailed\u003cbr/\u003edeep dive reviews of job budgets and schedules to identify and resolve any discrepancies, including\u003cbr/\u003einformation in contractor bid packages. You will partner with internal customers and external\u003cbr/\u003estakeholders to earn their trust and engage as a team to deliver results. You must ensure information is\u003cbr/\u003ecommunicated to internal and external stakeholders in an effective and timely manner. Some key\u003cbr/\u003ecompetencies of this position include; insist on the highest standards, ensure contracted resources deliver\u003cbr/\u003ework that meets duration and quality targets, coach developers, design engineers, contractors during the\u003cbr/\u003eproject duration, seek better ways to serve Amazon customers, influence internal stakeholders while\u003cbr/\u003eholding them accountable for their actions, ensure all internal and external team members maintain\u003cbr/\u003eproposed schedules and budgets, help to invent and simplify innovative solutions that allow for improved\u003cbr/\u003eprocesses and results, while working on multiple projects in various locations. This opportunity combines\u003cbr/\u003econstruction, engineering, planning, project management, facilities management, and contract\u003cbr/\u003emanagement. The  Construction Manager position includes approximately 60% travel in North\u003cbr/\u003eAmerica\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eSupervise the implementation and management of Amazon’s safety programs and standards with\u003cbr/\u003ethe entire internal and external project team\u003cbr/\u003e• Manage multiple projects simultaneously\u003cbr/\u003e• Ensure that the skills and competencies of contract labor are appropriate to need and fit to\u003cbr/\u003eundertake the work\u003cbr/\u003e• Operate independently in the assigned role and region; interacting with leadership and\u003cbr/\u003estakeholders to resolve issues\u003cbr/\u003e• Comprehensive budget and schedule tracking and cashflow forecasting.\u003cbr/\u003e• Identify and solve for factors that may impede a successful project hand-over to Amazon\u003cbr/\u003estakeholders while striving for frugality and accomplishing more with less\u003cbr/\u003e• Interface and coordinate with the authorities that have jurisdiction (AHJ) on projects to maintain\u003cbr/\u003eregulatory compliance and seamless job execution\u003cbr/\u003e• Advise on the impact of changes in schedule, costs, and permitting.\u003cbr/\u003e• Maintain internal and external stakeholders up-to-date on pertinent information through\u003cbr/\u003ecomprehensive and timely written and oral communication\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eEach day you will act as an owner at Amazon to ensure the safe, on-time and in-budget execution of Amazon\u003cbr/\u003econstruction projects. Daily tasks may be comprised of:\u003cbr/\u003e• Site management: coordination with contractors on projected changes and project status\u003cbr/\u003e• Ensure contractors are meeting contractual obligations\u003cbr/\u003e• Seek sustainable, environmentally-friendly solutions throughout the construction process while\u003cbr/\u003eimplementing Amazon’s environmentally friendly building practices\u003cbr/\u003e• Utilize Amazon information systems to record and update schedule, budget, and other key\u003cbr/\u003edevelopments\u003cbr/\u003e• Negotiate contract terms with vendors while driving partners to meet or exceed agreed-to\u003cbr/\u003eschedules and budgets\u003cbr/\u003e• Participate in weekly Architect, Owner, and Contractor (AOC) meetings and provide input on root\u003cbr/\u003ecauses and corrective actions\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eBenefits Summary: \u003cbr/\u003eAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include:\u003cbr/\u003e\u003cbr/\u003e1. Medical, Dental, and Vision Coverage\u003cbr/\u003e2. Maternity and Parental Leave Options\u003cbr/\u003e3. Paid Time Off (PTO)\u003cbr/\u003e4. RRSP\u003cbr/\u003e\u003cbr/\u003eIf you are not sure that every qualification on the list above describes you exactly, we'd still love to hear from you! At Amazon, we value people with unique backgrounds, experiences, and skillsets. If you’re passionate about this role and want to make an impact on a global scale, please apply!\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAt Amazon, we are all Employee Owners who leverage unique opportunities through design review,\u003cbr/\u003econstruction bidding, construction execution, and final hand-off to our customers. We are a diverse,\u003cbr/\u003eupbeat, creative, team of engineers and managers working to develop the innovative physical assets our\u003cbr/\u003eCustomers expect and striving to be the Earth’s best employer","department_cost_center":null,"description_short":"As a Construction Manager, you are a customer obsessed leader in the Amazon constructionprocess. In this role, you play an integral part in the implementation of the facility network infrastructure;including","display_distance":null,"id":"a760b0f9-f6c8-440d-8b9a-9b7c2576e53c","id_icims":"3114340","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3114340/construction-manager-transportation-engineering-services-canada","job_schedule_type":"full-time","location":"CA, ON, Toronto","locations":["{\"normalizedStateName\":\"Ontario\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Toronto\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, ON, Toronto\",\"coordinates\":\"43.64869,-79.38544\",\"normalizedCountyName\":\"Toronto\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Toronto, Ontario, CAN\",\"location\":\"CA, ON, Toronto\",\"region\":\"ON\",\"buildingCodeList\":[\"YYZ14\"],\"normalizedCityName\":\"Toronto\"}"],"normalized_location":"Toronto, Ontario, CAN","optional_search_labels":["canada-corporate-stores"],"posted_date":"October 23, 2025","preferred_qualifications":"Experience with at least two disciplines within the construction industry, which could consist of\u003cbr/\u003eGeneral Contracting, Owner’s Representation, Commercial Development, or Engineering \u0026\u003cbr/\u003eDesign, or similar. Demonstrated success in communicating project requirements to various\u003cbr/\u003eaudiences (e.g. senior management, peers, public officials, vendors, etc.) Experience inclusive of facilities manager or similar and demonstrated capability in the planning,\u003cbr/\u003edesign review \u0026 implementation, and project management / control of new structures \u0026 the\u003cbr/\u003eenhancement of existing facility buildings\u003cbr/\u003e• Experience in program management of concurrent projects\u003cbr/\u003e• Project Management accreditation (PMP® or similar)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(34, 34, 34)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. As a total compensation company, Amazon's package may include other elements such as sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon offers comprehensive benefits including health insurance (medical, dental, vision, prescription, basic life \u0026amp; AD\u0026amp;D insurance), Registered Retirement Savings Plan (RRSP), Deferred Profit Sharing Plan (DPSP), paid time off, and other resources to improve health and well-being. We thank all applicants for their interest, however only those interviewed will be advised as to hiring status.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eCAN, ON, Toronto - 97,500.00 - 131,900.00 CAD annually","primary_search_label":"operations.team-transportation-engineering-services","source_system":"JobCreator","state":"ON","title":"Construction Manager, Transportation Engineering Services Canada ","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3114340/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-transportation-engineering-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of customer service experience\u003cbr/\u003e- Speak, write, and read fluently in English\u003cbr/\u003e- Experience with Microsoft Office products and applications\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- Experience in payments or e-commerce","business_category":"no-business-category","city":"Hyderabad","company_name":"ADCI HYD 20 SEZ","country_code":"IND","description":"Fraud Prevention will be responsible for a wide range of duties related to the investigation and Elimination of online ecommerce risk. They will have experience in the ecommerce payments space, previous trust and safety experience and experience succeeding in a customer-driven workplace. Investigators will be analytical and capable of succeeding in a fast-paced team environment. These Investigator position relies on excellent judgment to plan and accomplish goals and will work under very limited supervision of the Manager. Excellent individual problem-solving and analytical skills are used to authenticate customers and complex transactions. Nearly all decisions are expected to be made independently with little to no guidance and a high degree of accuracy. SPR Investigator will be required to engage in frequent written and verbal communication with department management, risk analysts, risk engineers and other associates to accomplish goals. Productivity and quality assurance will be evaluated along with the overall contribution to the development of the department.\u003cbr/\u003e\u003cbr/\u003eRoles and Responsibilities:\u003cbr/\u003eThis includes, but is not limited to:\u003cbr/\u003e•\tResearches and evaluates facts surrounding seller transactions\u003cbr/\u003e•\tTakes appropriate action on investigated transactions based on established standard operation procedure and tools\u003cbr/\u003e•\tDocuments their actions by providing detailed annotations\u003cbr/\u003e•\tCommunicates with external customers via phone or email during the investigation process\u003cbr/\u003e•\tCommunicates with internal customers and peers in person, via email, annotations and phone during and following the investigation process\u003cbr/\u003e•\tUnderstand the issue and make best use of the available resources to resolve it\u003cbr/\u003e•\tSystematically escalate problems or variance in the information to the relevant owners/ teams according to processes and standard\u003cbr/\u003e•\tCommunicate with internal and external stakeholders\u003cbr/\u003e•\tUnderstand performance metrics to create analysis for driving business goals\u003cbr/\u003e•\tMeet predetermined and assigned productivity targets and quality standards\u003cbr/\u003e\u003cbr/\u003eBasic Qualifications\u003cbr/\u003e•\tEducation Qualification: Graduate in any discipline\u003cbr/\u003e•\tWork Experience: 0 to 4 years\u003cbr/\u003e•\tCommunication Skills- Excellent communication skills (written and spoken) English language\u003cbr/\u003e•\tAbility to handle and interpret large sets of data\u003cbr/\u003e•\tDemonstrated ability to work in a team in a very dynamic environment\u003cbr/\u003e\u003cbr/\u003ePreferred Qualifications\u003cbr/\u003e•\tDemonstrated problem solving and analytical skills\u003cbr/\u003e•\tProven ability to work productively and efficiently in an independent setting\u003cbr/\u003e•\tProven ability to clearly communicate with managers and associates at all levels\u003cbr/\u003e•\tGlobal perspective and solid understanding of business objectives\u003cbr/\u003e•\tExcellent attention to detail and work with the highest level of accuracy\u003cbr/\u003e\u003cbr/\u003eAdditional Information:\u003cbr/\u003eShifts: Rotational (it is a 24*7 shift environment and shifts are rotational - changes every 3-4 months')\u003cbr/\u003e\u003cbr/\u003eWeekly Off: Rotational two- day off (it is a 5-day working week with 2 days off. The off days changes every 3-4 months)\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe mission of Fraud Prevention is to build trust with all its Customers \u0026 Partners - Buyers, Brands, Vendors, Sellers, and Employees - in reality and perception. Scaling through technology, analytics \u0026 science and inverting the curve on headcount \u0026 cost growth. Being a center of excellence that develops technology, science, and processes to achieve our goals in a fashion that is scalable, decoupled and easily leveraged across Amazon and externally.","department_cost_center":null,"description_short":"Fraud Prevention will be responsible for a wide range of duties related to the investigation and Elimination of online ecommerce risk. They will have experience in the ecommerce payments space, previous","display_distance":null,"id":"e692245e-66e3-446a-916e-96447c61dd3d","id_icims":"3168872","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Investigation","job_function_id":null,"job_path":"/en/jobs/3168872/investigation-specialist-fraud-prevention-operation","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD20\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":[],"posted_date":"February  9, 2026","preferred_qualifications":"- NA\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"TS","title":"Investigation Specialist, Fraud Prevention Operation","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3168872/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of program or project management experience\u003cbr/\u003e- Experience using data and metrics to determine and drive improvements\u003cbr/\u003e- Experience owning program strategy, end to end delivery, and communicating results to senior leadership\u003cbr/\u003e- Business level of english","business_category":"fulfillment-and-operations","city":"Tokyo","company_name":"Amazon Japan G.K.","country_code":"JPN","description":"Description\u003cbr/\u003eAre you excited to drive high-visibility, strategic logistics and technology solutions? Amazon Extra Large (AMXL) Japan is looking for a Sr Program Manager who continuously engages across business, technical and operational teams to deliver bigger smiles for our customers.\u2028\u2028At Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is one of the most recognizable brand names in the world and we distribute millions of products each year to our loyal customers. Amazon has great opportunities to pursue a career as a leader in Operations Planning \u0026 Management. We know that learning through experience is what transforms talented people into great leaders. Our roles are designed to accelerate the growth of leaders through challenging field experiences that stretch individual capability. Our operations environment presents the candidates with great challenges in dealing with front line management, and driving scalable and continuous improvements across our Fulfillment Centers, Supply Chain \u0026 Transportation execution teams.\u2028\u2028As a Senior Program Manager, short term planner, you will be the subject matter expert in gathering and forecasting demand from customers, running capacity analysis, transportation planning, inventory management, inventory health, running simulation and scenarios for leadership, and synchronizing our supply and demand over the 13 week to 52 week horizon in order to meet our customer's needs. You will be a part of the Supply Chain team, leading small and medium term planning, engaging with leadership on getting it approved, and reviewing the plan vs actual, highlighting and mitigating risks on the way to see your work impact real world business and end customer satisfaction.\u2028\u2028[More Information]\u2028・Department: Last Mile (AMZL)\u2028・Job: Program / Project Management\u2028・Location: Tokyo Office\u2028\u2028Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, visit https://www.amazon.jobs/disability/jp\u2028\u2028オペレーション部門のDEIの取り組み（Japanese Only）\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities\u2028- Manage the short and medium term capacity, inventory, transport, inventory and peak planning for the AMXL JP network\u2028- Work in partnership with operations, SCM, product teams to set optimal network plans and transportation choices to meet on-time delivery goals\u2028- Define a vision and plan to deliver it driving continuous delivery customer experience improvement by collaborating with stakeholders on design of new solutions that enhance business performance and achieve established quality and efficiency goals\u2028- Inspect demand forecasts, capacity plans critically and challenge assumptions from business teams\u2028- Plan, develop, implement and evaluate processes for capacity management from inventory to the customers home\u2028- Understand and manage supply chain risks to minimize on-time delivery impact\u2028- Support critical relationships with internal and external business partners\u2028- Interface with external carriers and internal carrier managers to improve capacity planning accuracy\u2028- Provide high quality inputs and garner alignment with finance and leadership teams using a combination of in-person meetings, well written data backed documents, detailed business models or presentations\u2028- Identify and evaluate potential risks/obstacles within both internal and external business environment with minimal direction\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou attend daily business reviews and understand whats happening to key network metrics. You spend time with strategy \u0026 ops teams to find ways to meet customer expectations. You write quality documents that seek to plan, inform \u0026 align internal stakeholders. You challenge the status quo and drive data based decision making within your team. You take business trips within and outside Japan as required to build your skills and network or test your plans and assumptions. Additionally, you are always ready to jump in and take charge when problems and challenges emerge.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Extra Large (AMXL) JP team is a single threaded organization that owns Amazon's end-to-end Heavy \u0026 Bulky (H\u0026B) logistics network with our willing and equally customer obsessed partners, offering shipping, service \u0026 support for consumers and companies in a safe, reliable, seamless, standardized, and sustainable way that surprises and delights our customers. Our delivery partners are experienced in H\u0026B deliveries, providing special handling services such as Room of Choice Delivery, Installation/Assembly and Recycling/Haul-Away.\u2028\u2028Our team is made up of a diverse group of individuals across operations, supply chain, tech, finance, planning, customer experience, business intelligence and program management that work closely and collaboratively across Amazon to constantly improve and scale our operations, always insisting on the highest standards and obsessing over delivering bigger smiles for our customers.","department_cost_center":null,"description_short":"DescriptionAre you excited to drive high-visibility, strategic logistics and technology solutions? Amazon Extra Large (AMXL) Japan is looking for a Sr Program Manager who continuously engages across business,","display_distance":null,"id":"50d02f65-1f38-4cee-bdf0-4f2abde7861d","id_icims":"3177477","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Program Management","job_function_id":null,"job_path":"/en/jobs/3177477/senior-program-manager-amxl-jp","job_schedule_type":"full-time","location":"JP, 13, Tokyo","locations":["{\"normalizedStateName\":\"Tokyo\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Tokyo\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, 13, Tokyo\",\"coordinates\":\"35.68946,139.69172\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Tokyo, JPN\",\"location\":\"JP, 13, Tokyo\",\"region\":\"13\",\"buildingCodeList\":[\"HND21\"]}"],"normalized_location":"Tokyo, JPN","optional_search_labels":["ajgk.team-jp-sr.position-optional"],"posted_date":"February 10, 2026","preferred_qualifications":"- Master's degree, or MBA in business, operations, human resources, adult education, organizational development, instructional design or related field\u003cbr/\u003e- 2+ years of driving process improvements experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-last-mile-delivery","source_system":"JobCreator","state":"13","title":"Senior Program Manager, AMXL JP","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3177477/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-delivery","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"\u003cfont face=\"Calibri, sans-serif\"\u003e\u003cspan style=\"font-size: 14.6667px;\"\u003e--\u003c/span\u003e\u003c/font\u003e","business_category":"fulfillment-and-operations","city":"Wenden","company_name":"Amazon Deutschland W32 Transport GmbH","country_code":"DEU","description":"--","department_cost_center":null,"description_short":"--","display_distance":null,"id":"a0Rar0000020KDhEAM","id_icims":"SF250121461","is_intern":null,"is_manager":null,"job_category":"Fulfillment / Warehouse Associate","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/SF250121461/sortiermitarbeiter-m-w-d-57482-wenden","job_schedule_type":"full-time","location":"DE, NW, Wenden","locations":["{\"normalizedStateName\":\"North-Rhine-Westphalia\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Wenden\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, NW, Wenden\",\"coordinates\":\"50.9663,7.87176\",\"normalizedCountyName\":\"Olpe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Wenden, North-Rhine-Westphalia, DEU\",\"location\":\"DE, NW, Wenden\",\"region\":\"NW\",\"buildingCodeList\":[],\"normalizedCityName\":\"Wenden\"}"],"normalized_location":"Wenden, North-Rhine-Westphalia, DEU","optional_search_labels":["hvh-fulfillment-and-operations"],"posted_date":"January 19, 2026","preferred_qualifications":null,"primary_search_label":null,"source_system":"HVH","state":"NW","title":"Sortiermitarbeiter (m/w/d) - 57482 Wenden","university_job":null,"updated_time":"15 minutes","url_next_step":"https://hvr-amazon.my.site.com/JobDetails?reqid=a0Rar0000020KDhEAM\u0026isapply=1","team":{"id":null,"business_category_id":null,"identifier":null,"label":null,"created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"\u003cfont face=\"Calibri, sans-serif\"\u003e\u003cspan style=\"font-size: 14.6667px;\"\u003e--\u003c/span\u003e\u003c/font\u003e","business_category":"fulfillment-and-operations","city":"Hannover","company_name":"Amazon Deutschland N11 Transport GmbH","country_code":"DEU","description":"--","department_cost_center":null,"description_short":"--","display_distance":null,"id":"a0Rar0000020KDEEA2","id_icims":"SF250121432","is_intern":null,"is_manager":null,"job_category":"Fulfillment / Warehouse Associate","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/SF250121432/sortiermitarbeiter-m-w-d-31319-sehnde","job_schedule_type":"full-time","location":"DE, NI, Hannover","locations":["{\"normalizedStateName\":\"Lower-Saxony\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Hannover\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, NI, Hannover\",\"coordinates\":\"52.37227,9.73815\",\"normalizedCountyName\":\"Hanover\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Hanover, Lower-Saxony, DEU\",\"location\":\"DE, NI, Hannover\",\"region\":\"NI\",\"buildingCodeList\":[],\"normalizedCityName\":\"Hanover\"}"],"normalized_location":"Hanover, Lower-Saxony, DEU","optional_search_labels":["hvh-fulfillment-and-operations"],"posted_date":"January 22, 2026","preferred_qualifications":null,"primary_search_label":null,"source_system":"HVH","state":"NI","title":"Sortiermitarbeiter (m/w/d) - 31319 Sehnde","university_job":null,"updated_time":"16 minutes","url_next_step":"https://hvr-amazon.my.site.com/JobDetails?reqid=a0Rar0000020KDEEA2\u0026isapply=1","team":{"id":null,"business_category_id":null,"identifier":null,"label":null,"created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"international-stores","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"Are you a driven Software Development Engineer who wants to have a direct impact on customers and the team? Do you enjoy building flexible, performant and extensible solutions for complex financial and risk problems? As a Software Development Engineer on Amazon Lending, you will lead designing and building systems to support our  financial products. In this role you will work closely with a talented team of software engineers, product managers, and UX designers to build financial products. You will accelerate Lending team's expansion by scaling systems to handle increasing workloads. You will simplify the complexities of partner onboarding, product management and risk assessment through analysis and system design.\u003cbr/\u003e\u003cbr/\u003eAmazon Lending is passionate about helping third party sellers on Amazon grow their business. Since inception, we have provided access to capital for small and medium sized businesses. \u003cbr/\u003e\u003cbr/\u003eWe are a fast-paced development team, using agile methodologies and SOA design patterns. We encourage innovation and expect engineers to take a high level of ownership throughout the software life cycle. We minimize the bureaucracy and focus on giving developers time to develop. Alongside of building new products and services, we are constantly looking to enhance our existing systems by improving performance and refactoring for reuse. There are numerous opportunities to design scalable architectures.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Define, design, and implement multi-tier distributed software applications.\u003cbr/\u003e- Estimate engineering effort, plan implementation, and rollout system changes that meet requirements for functionality, performance, scalability, reliability, and adherence to development goals and principles.\u003cbr/\u003e- Must be able to independently design code and test major features, as well as work jointly with other team members to deliver complex changes.\u003cbr/\u003e- Must be able to effectively collaborate in a fast paced environment with multiple teams in a large organization (software development, QA, Project/Release Management, Build and Rele\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are a fast-paced development team, using agile methodologies to deliver incrementally with each two-week sprint. We build predominantly in java using a blend of server and serverless based architectures. We are a full stack development organization owning internally and externally facing UI stacks as well as multiple services. We invest heavily in automation in both testing and deployment to reduce time to market and scale our operations. We allocate time for learning and experimentation through learning days and hackathons and provide plenty of opportunities to work along-side senior engineers. We share our knowledge through weekly learning sessions and monthly tech talks. We constantly seek to innovate new approaches to system design and make our applications faster and more flexible by monitoring system performance and prototyping new ideas.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe offer a fun, inclusive, environment to work in with a strong team identity and culture, and a clear mission to help small businesses grow and thrive. We encourage innovation and a high level of ownership throughout the software life cycle.","department_cost_center":null,"description_short":"Are you a driven Software Development Engineer who wants to have a direct impact on customers and the team? Do you enjoy building flexible, performant and extensible solutions for complex financial and","display_distance":null,"id":"64f0efb6-8b24-4209-91dc-9041739509fe","id_icims":"3179698","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3179698/software-development-engineer-amazon-lending","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR26\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"February 12, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"international-stores.team-amazon-payments","source_system":"JobCreator","state":"KA","title":"Software Development Engineer , Amazon Lending","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3179698/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-payments","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Master's or higher degree in a relevant field (Computational Linguistics or equivalent field with computational analysis)\u003cbr/\u003e- 2+ years experience in computational linguistics or language data processing or AI data creation\u003cbr/\u003e- Experience with language data annotation systems and other forms of data markup\u003cbr/\u003e- Proficient with scripting languages, such as Python\u003cbr/\u003e- Experience working with speech, text, and multimodal data in multiple languages\u003cbr/\u003e- Excellent communication, strong organizational skills and very detailed oriented\u003cbr/\u003e- Comfortable working in a fast paced, highly collaborative, dynamic work environment","business_category":"amazon-artificial-general-intelligence","city":"Hyderabad","company_name":"ADCI HYD 16 SEZ","country_code":"IND","description":"The Amazon Artificial General Intelligence (AGI) Data Services organization is responsible for developing diverse datasets to train and evaluate the Amazon AI models. We are looking for Language Engineers to join our science and engineering team to support the development of complex, multimodal datasets, using a range of approaches including synthetic data generation, model-supported data generation, and human-in-the-loop data collections. \u003cbr/\u003e\u003cbr/\u003eYou will play a critical role in driving innovation and advancing the state-of-the-art in evaluating and training AI models. You will work closely with cross-functional teams, including product managers, engineers, and data scientists to ensure that our AI systems are best in class.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Design complex data collections with human participants in response to science needs: author instructions, define and implement quality targets and mechanisms, provide day-to-day coordination of data collection efforts (including planning, scheduling, and reporting), and be responsible for the final deliverables \u003cbr/\u003e- Design and conduct complex data creation tasks using synthetic and model-based data generation methods, following state-of-the-art approaches\u003cbr/\u003e- Analyze and extract insights from large amounts of data \u003cbr/\u003e- Build tools or tool prototypes for data analysis or data creation, using Python or another scripting language\u003cbr/\u003e- Use modeling tools to bootstrap or test new AI functionalities \u003cbr/\u003e- Collaborate with scientists, software engineers, and other data creators to evaluate performance of AI models \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon strives to be the world’s most customer-centric company, where customers can research and purchase anything they might want online or offline. We set big goals and are looking for people who can help us reach and exceed them. The AGI organization provides AI capabilities for a variety of Amazon products and searches. We provide secure, flexible, cost effective, and high-quality data development services to our customers, that enables them to build advanced ML models.","department_cost_center":null,"description_short":"The Amazon Artificial General Intelligence (AGI) Data Services organization is responsible for developing diverse datasets to train and evaluate the Amazon AI models. We are looking for Language Engineers","display_distance":null,"id":"e740d9ff-d31a-4287-93a2-06b52f98f5fd","id_icims":"3145654","is_intern":null,"is_manager":null,"job_category":"Data Science","job_family":"Language Engineer","job_function_id":null,"job_path":"/en/jobs/3145654/language-engineer-artificial-general-intelligence-data-services","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD16\"],\"normalizedCityName\":\"Hyderabad\"}","{\"normalizedStateName\":\"Tamil Nadu\",\"normalizedCountryCode\":\"IND\",\"city\":\"Chennai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TN, Chennai\",\"coordinates\":\"13.08404,80.28274\",\"normalizedCountyName\":\"Chennai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Chennai, Tamil Nadu, IND\",\"location\":\"IN, TN, Chennai\",\"region\":\"TN\",\"buildingCodeList\":[\"MAA12\"],\"normalizedCityName\":\"Chennai\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":["amazon.artificial-intelligence"],"posted_date":"December 18, 2025","preferred_qualifications":"- PhD in Computational Linguistics (or equivalent field with computational emphasis)\u003cbr/\u003e- Expertise in bootstrapping AI data collections for quickly evolving requirements\u003cbr/\u003e- Extensive experience working with speech, text, and multimodal data in multiple languages\u003cbr/\u003e- Experience in data creation for complex agentic workflows\u003cbr/\u003e- Practical experience with Machine Learning\u003cbr/\u003e- Familiarity with technical concepts such as APIs\u003cbr/\u003e- Practical knowledge of version control and agile development\u003cbr/\u003e- Familiarity with database queries and data analysis processes (SQL, R, Matlab, etc.)\u003cbr/\u003e- Willingness to support several projects at one time, and to accept reprioritization as necessary\u003cbr/\u003e- Able to think creatively and possess strong analytical and problem solving skills\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":"TS","title":"Language Engineer, Artificial General Intelligence - Data Services","university_job":null,"updated_time":"21 minutes","url_next_step":"https://account.amazon.com/jobs/3145654/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of building models for business application experience\u003cbr/\u003e- PhD, or Master's degree and 4+ years of CS, CE, ML or related field experience\u003cbr/\u003e- Experience in patents or publications at top-tier peer-reviewed conferences or journals\u003cbr/\u003e- Experience programming in Java, C++, Python or related language\u003cbr/\u003e- Experience in any of the following areas: algorithms and data structures, parsing, numerical optimization, data mining, parallel and distributed computing, high-performance computing","business_category":"aws","city":"Santa Clara","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Web Services (AWS) is assembling an elite team of world-class scientists and engineers to pioneer the next generation of AI-driven development tools. Join the Amazon Kiro LLM-Training team and help create groundbreaking generative AI technologies including Kiro IDE and Amazon Q Developer that are transforming the software development landscape.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs a key member of our team, you'll be at the forefront of innovation, where cutting-edge research meets real-world application:\u003cbr/\u003e- Push the boundaries of reinforcement learning and post-training methodologies for large language models specialized in code intelligence\u003cbr/\u003e- Invent and implement state-of-the-art machine learning solutions that operate at unprecedented Amazon scale\u003cbr/\u003e- Deploy revolutionary products that directly impact the daily workflows of millions of developers worldwide\u003cbr/\u003e- Break new ground in AI and machine learning, challenging what's possible in intelligent code assistance\u003cbr/\u003e- Publish and present your pioneering work at premier ML and NLP conferences (NeurIPS, ICML, ICLR , ACL, EMNLP)\u003cbr/\u003e- Accelerate innovation by working directly with customers to rapidly transition research breakthroughs into production systems\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe AWS Developer Agents and Experiences (DAE) team is reimagining the builder experience through generative AI and foundation models. We're leveraging the latest advances in AI to transform how engineers work from IDE environments to web-based tools and services, empowering developers to tackle projects of any scale with unprecedented efficiency.\u003cbr/\u003e\u003cbr/\u003eBroadly, AWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS. Within AWS UC, Amazon Dedicated Cloud (ADC) roles engage with AWS customers who require specialized security solutions for their cloud services.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eHybrid Work\u003cbr/\u003eWe value innovation and recognize this sometimes requires uninterrupted time to focus on a build. We also value in-person collaboration and time spent face-to-face. Our team affords employees options to work in the office every day or in a flexible, hybrid work model near one of our U.S. Amazon offices.","department_cost_center":null,"description_short":"Amazon Web Services (AWS) is assembling an elite team of world-class scientists and engineers to pioneer the next generation of AI-driven development tools. Join the Amazon Kiro LLM-Training team and help","display_distance":null,"id":"18476e38-9ee9-4bbe-ba35-baf00dcabb00","id_icims":"3161403","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3161403/applied-scientist-llm-code-agents-kiro-science","job_schedule_type":"full-time","location":"US, CA, Santa Clara","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Santa Clara\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Santa Clara\",\"coordinates\":\"37.3558,-121.95512\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Santa Clara, California, USA\",\"location\":\"US, CA, Santa Clara\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC25\"],\"normalizedCityName\":\"Santa Clara\"}"],"normalized_location":"Santa Clara, California, USA","optional_search_labels":["aws.team-generative-ai"],"posted_date":"January 17, 2026","preferred_qualifications":"- Experience using Unix/Linux\u003cbr/\u003e- Experience in professional software development\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Santa Clara - 171,600.00 - 222,200.00 USD annually","primary_search_label":"aws.team-machine-learning-primary","source_system":"JobCreator","state":"CA","title":"Applied Scientist, LLM Code Agents, Kiro Science","university_job":null,"updated_time":"23 minutes","url_next_step":"https://account.amazon.com/jobs/3161403/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-machine-learning-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of employee and performance management experience\u003cbr/\u003e- 3+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- Bachelor's degree or equivalent","business_category":"operations","city":"Riyadh","company_name":"Afaq - Warehouse Branch","country_code":"SAU","description":"Who we are:\u003cbr/\u003e\u003cbr/\u003eAmazon is focused on ensuring its associates can work in a safe, quality focused environment. Our learning teams are responsible for delivering and providing high quality safety compliance, process and on-boarding training to ensure that our associates are set up for success.\u003cbr/\u003eThe learning business partner is a member of the leadership team within a fulfillment center and is focused on managing the learning needs of all employees. They must have the ability and initiative to understand the business needs, analyse issues and influence solutions/outcomes. This is a team player who not only leverages his/her own team to respond effectively to a variety of training scenarios, but is able to work closely with a central AMET team to effectively prioritize and deploy training programs based on customer need – from training processes at scale to ongoing leader development.\u003cbr/\u003e\u003cbr/\u003eAn Amazon Fulfillment Center (FC) is a dynamic and challenging environment. You will be very close to the action and spend time on the warehouse floor with the teams who make our FCs great. Developing our people is at the heart of what we do and is needed now more than ever as we are experiencing rapid growth and we plan to keep on growing.\u003cbr/\u003e\u003cbr/\u003eOverall responsibilities include:\u003cbr/\u003e\u003cbr/\u003e* Leading and developing a team of Learning Associates and a Learning Specialist\u003cbr/\u003e\u003cbr/\u003e* End-to-end ownership of the associate and leader training programs at site: from needs analysis stage, to management and execution of training\u003cbr/\u003e\u003cbr/\u003e* Leading groups of learning professionals from across the AMET to identify and share best practice\u003cbr/\u003e\u003cbr/\u003e* Planning, developing and evaluating all training initiatives, in collaboration with the senior team and Amazon’s central leadership function.\u003cbr/\u003e\u003cbr/\u003e* Proactively identifying and deploying training/coaching solutions to address quality and productivity requirements within the FC\u003cbr/\u003e\u003cbr/\u003e* Identifying and aligning individual leadership development plans, building a catalogue of learning content according to business needs and facilitating delivery and completion of training\u003cbr/\u003e\u003cbr/\u003e* Providing coaching and feedback on leadership related topics both in 121s and facilitated workshops to identify leadership, coaching and management skill development opportunities.\u003cbr/\u003e\u003cbr/\u003e* Understanding of Warehouse operations is required, to ensure efficient and effective support is provided to Operations. \u003cbr/\u003e\u003cbr/\u003e* Responsible for ensuring full safety compliance is met \u003cbr/\u003e\u003cbr/\u003e* Analyze and understand data to suggest improvements for training and operations. \u003cbr/\u003e\u003cbr/\u003e* Track and communicate Learning Department goals, assignments and progress locally and at a network level. \u003cbr/\u003e\u003cbr/\u003e*  Create, manage and update training content and associate compliance audits. \u003cbr/\u003e\u003cbr/\u003e* Ability to adapt well to fast-paced environments with changing circumstances, direction, and strategy.\u003cbr/\u003e\u003cbr/\u003e* Ability to prioritize, manage and complete projects with tight deadlines.\u003cbr/\u003e\u003cbr/\u003e* Desire to thrive in a dynamic, growing environment\u003cbr/\u003e\u003cbr/\u003e* Partner with Country level leaders to implement efficient and effective training solutions. \u003cbr/\u003e\u003cbr/\u003e* Participate in daily, weekly and monthly senior meetings. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eCheck out this you tube video for a virtual Amazon Tour. \u003cbr/\u003e\u003cbr/\u003ehttps://www.youtube.com/watch?v=UAKPoAn2cB0\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Experience of managing a team with a focus on career development and succession planning\u003cbr/\u003e\u003cbr/\u003e* Confidence in analysing and interpreting a range of performance metrics combined with advanced Excel skills\u003cbr/\u003e\u003cbr/\u003e* Ability to influence and engage multiple stakeholders across all levels of the business\u003cbr/\u003e\u003cbr/\u003e* Actively seeks opportunities to positively impact beyond the area of responsibility\u003cbr/\u003e\u003cbr/\u003e* Ability to work in fast-paced ambiguous environments, adapting quickly to changing circumstances, processes and priorities.\u003cbr/\u003e\u003cbr/\u003e* Ability and initiative to understand the business needs, analyse issues and drive solutions","department_cost_center":null,"description_short":"Who we are:Amazon is focused on ensuring its associates can work in a safe, quality focused environment. Our learning teams are responsible for delivering and providing high quality safety compliance,","display_distance":null,"id":"881a52f3-e537-4179-bcdb-27917a1eb1bd","id_icims":"3177664","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3177664/senior-learning-operations-manager-saudi-nationals-only-fulfillment-center","job_schedule_type":"full-time","location":"SA, Riyadh","locations":["{\"normalizedCountryCode\":\"SAU\",\"city\":\"Riyadh\",\"countryIso3a\":\"SAU\",\"countryIso2a\":\"SA\",\"locationNonStemming\":\"Saudi Arabia, Riyadh\",\"coordinates\":\"24.68208,46.68723\",\"normalizedCountyName\":\"Riyadh\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Saudi Arabia\",\"normalizedLocation\":\"Riyadh, SAU\",\"location\":\"SA, Riyadh\",\"region\":\"\",\"buildingCodeList\":[\"RUH8\"],\"normalizedCityName\":\"Riyadh\"}"],"normalized_location":"Riyadh, SAU","optional_search_labels":[],"posted_date":"February 10, 2026","preferred_qualifications":"- Experience in operations management\u003cbr/\u003e- Experience with process improvement and stakeholder management\u003cbr/\u003e- Master's degree in a related field\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"operations.team-learning-development","source_system":"JobCreator","state":null,"title":"Senior Learning Operations Manager (Saudi Nationals Only), Fulfillment Center ","university_job":null,"updated_time":"25 minutes","url_next_step":"https://account.amazon.com/jobs/3177664/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-learning-development","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- 5+ years of program or project management experience\u003cbr/\u003e- 5+ years of defining and implementing process improvement initiatives using data and metrics experience","business_category":"fulfillment-ops","city":"Johannesburg","company_name":"Amazon Commercial Services (South Africa) (Pty) Ltd - N09","country_code":"ZAF","description":"At Amazon, we pioneer.\u003cbr/\u003eWe also treat every single day like it’s day one. And we never sit still while we do it.\u003cbr/\u003eAre you up for crafting solutions and solving tomorrow’s problems today?\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAmazon is looking for a talented leader who will manage our fulfillment centers (FC) operated by Third Party Logistics (3PL) providers in South Africa. The leader will be responsible for managing the relationship with and providing direction to 3PL providers, launching 3PL FC’s, managing the performance of fulfillment operations, and continuously driving improvement on customer experiences and cost structure with 3PL providers.\u003cbr/\u003eThis leadership position plays a key role in shaping Amazon’s operation by developing the fulfillment strategy and managing the long-term relationship between Amazon and our 3PL providers. In this context, the leader will be working closely with our 3PL providers and internal stakeholders such as Supply Chain, Transportation, and Consumer teams on a regular basis, and working with cross-functional leaders globally to drive various initiatives and programs. The leader will be accountable for dealing with challenging operational issues that will require a deep analysis of fulfillment operations, and for innovating and implementing solutions that will influence the short and long-term operations.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Develop and manage the business relationships with 3PL carriers, spanning optimization and resolution of operational issues to supporting commercial and contractual negotiations.\u003cbr/\u003e    - Manage the performance of 3PL FC providers, including but not limited to safety, customer experience, quality, and cost.\u003cbr/\u003e    - Partner with cross-functional teams such as Finance and Analytics to develop reports and mechanism to manage operational and financial performance on a daily basis.\u003cbr/\u003e    - Work with Supply Chain and Capacity Planning to plan and secure capacity with 3PL providers.\u003cbr/\u003e    - Partner with / leverage other internal tech and non-tech resources to improve fulfillment capabilities and performance; facilitate system development and adoption with 3PL providers and internal teams.\u003cbr/\u003e    - Drive continuous improvement initiatives with 3PL providers and internal teams to provide best in class fulfillment experience and cost structure.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eSouth Africa Operations are a small, but mighty team powering our vision to be the most loved e-commerce store in South Africa by delighting customers with the best, locally-relevant fulfillment experience. We get stuff done upholding Amazon's Day 1 culture. We are committed to developing our employees. We invent in our communities and innovate continuously. When we fail, we do so quickly, learn and iterate.","department_cost_center":null,"description_short":"At Amazon, we pioneer.We also treat every single day like it’s day one. And we never sit still while we do it.Are you up for crafting solutions and solving tomorrow’s problems today?Amazon is looking for","display_distance":null,"id":"30ff45d0-8fe7-44f0-a022-5dd30170f946","id_icims":"3183538","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3183538/3pl-operations-manager-za-operations","job_schedule_type":"full-time","location":"ZA, Johannesburg","locations":["{\"normalizedStateName\":\"Gauteng\",\"normalizedCountryCode\":\"ZAF\",\"city\":\"Johannesburg\",\"countryIso3a\":\"ZAF\",\"countryIso2a\":\"ZA\",\"locationNonStemming\":\"South Africa, Johannesburg\",\"coordinates\":\"-26.20495,28.03995\",\"normalizedCountyName\":\"Johannesburg\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"South Africa\",\"normalizedLocation\":\"Johannesburg, Gauteng, ZAF\",\"location\":\"ZA, Johannesburg\",\"region\":\"\",\"buildingCodeList\":[\"XZA1\"],\"normalizedCityName\":\"Johannesburg\"}"],"normalized_location":"Johannesburg, Gauteng, ZAF","optional_search_labels":[],"posted_date":"February 18, 2026","preferred_qualifications":"- Bachelor's degree in business, engineering, operations, supply chain, transportation logistics\u003cbr/\u003e- 5+ years of driving end to end delivery, and communicating results to senior leadership experience\u003cbr/\u003e- Experience in stakeholder management, dealing with multiple stakeholders at varied levels of the organization\u003cbr/\u003e- Experience managing third party resources on a regional/national scale\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer, and we value your passion to discover, invent, simplify and build. We welcome applications from all members of society irrespective of age, sex, disability, sexual orientation, race, religion or belief. Amazon is strongly committed to diversity within its community and especially welcomes applications from South African citizens who are members of designated groups who may contribute to Employment Equity within the workplace and the further diversification of ideas. In this regard, the relevant laws and principles associated with Employment Equity will be considered when appointing potential candidates. We are required by law to verify your ability to work lawfully in South Africa. Amazon requires that you submit a copy of either your identity document or your passport and any applicable work permit if you are a foreign national, along with an updated curriculum vitae.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-global-specialty-fulfillment","source_system":"JobCreator","state":null,"title":"3PL Operations Manager, ZA Operations","university_job":null,"updated_time":"26 minutes","url_next_step":"https://account.amazon.com/jobs/3183538/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-specialty-fulfillment","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}