{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 5+ years of program or project management experience\u003cbr/\u003e- Experience using data and metrics to determine and drive improvements\u003cbr/\u003e- Experience owning program strategy, end to end delivery, and communicating results to senior leadership\u003cbr/\u003e- Bachelor's degree or equivalent","business_category":"aws","city":"Canton","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Amazon Web Services (AWS) is one of Amazon’s fastest growing businesses, serving millions of customers in more than 190 countries, reshaping the way global enterprises consume information technology, and powering the developers who are building the next generation of leading global firms.\u003cbr/\u003e\u003cbr/\u003eWe are looking for an experienced program manager with a background that includes project management to join our operations team and focus on building the future of onboarding and training for new builders who work in AWS Data Centers. In this role, you will report directly into the local business leadership team and take general direction from a global onboarding program. The ideal candidate will have experience with training management, be a highly organized self-starter with a strong bias for action, be able to work through ambiguity, and have the ability to lead with informal authority. This position will innovate how we design, build, deliver, and measure onboarding and training, which will improve the experience for new AWS Data Center Community builders around the world.\u003cbr/\u003e\u003cbr/\u003eThe scope of role encompasses program management of capital expense (CAPEX) and/or operational expense (OPEX) projects within data center operations. The scope of projects will include but not be limited to the improvement of electrical, mechanical, fire detection, building improvements, vendor (partner) management, and cluster wide maintenance coordination. An understanding of these systems is necessary, as the individual will be expected to identify areas for improvement as well as act on data provided from other teams and organizations.\u003cbr/\u003e\u003cbr/\u003eSuccessful candidates are natural self-starters who possess the ability to design, develop and deploy innovative solutions to address operational challenges while driving these solutions to completion. This role requires both independent contribution as well as the ability to work within multi-disciplinary teams (internal operations, engineering, legal, finance, procurement, environmental/health/safety, etc.). This individual has strong communication skills, is organized and thrive in ambiguity.  \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Manage requirements, budget, design, and implementation of assigned projects\u003cbr/\u003e- Assess annual maintenance program requirements and build a rolling 18 month project forecast\u003cbr/\u003e- Facilitate creation of SOWs with partner teams to be included in contract documents including RFQ/RFPs, change order controls, purchase orders, and invoicing.\u003cbr/\u003e- Evaluate performance and work product of on-site partners and escalate issues through Amazon leadership.\u003cbr/\u003e- Identify and communicate needs for design improvements.\u003cbr/\u003e- Monitor and enforce project schedules and quality with, operational teams, cross functional amazon team members, and partners.\u003cbr/\u003e- Lead and coordinate design and execution efforts between internal teams and outside partners including equipment specifications, material flow, process design, and site layout.\u003cbr/\u003e- Evaluate project risks and issues and propose actionable resolutions.\u003cbr/\u003e- Build strong working relationships with data center leadership teams across multiple sites as well as other internal stakeholders (operations, finance, safety, security, legal, procurement).\u003cbr/\u003e- General knowledge of data center operations and facility management.\u003cbr/\u003e- Track record for being detail-oriented with a demonstrated ability to self-motivate and follow-through on projects\u003cbr/\u003e- Ability to follow accurate and complete support procedures, system documentation, and issue tracking entries.\u003cbr/\u003e- Proactively and continually improve your level of knowledge about data center relevant technologies. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"Amazon Web Services (AWS) is one of Amazon’s fastest growing businesses, serving millions of customers in more than 190 countries, reshaping the way global enterprises consume information technology, and","display_distance":null,"id":"12eefc46-1197-4d1b-90c3-4a8fc2d58027","id_icims":"3144800","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3144800/data-center-program-manager-data-center-engineering-operation","job_schedule_type":"full-time","location":"US, MS, Canton","locations":["{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Canton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Canton\",\"coordinates\":\"32.61258,-90.03472\",\"normalizedCountyName\":\"Madison\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Canton, Mississippi, USA\",\"location\":\"US, MS, Canton\",\"region\":\"MS\",\"buildingCodeList\":[\"JAN100\"],\"normalizedCityName\":\"Canton\"}"],"normalized_location":"Canton, Mississippi, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"December 17, 2025","preferred_qualifications":"- 2+ years of process improvement procedures experience\u003cbr/\u003e- Master's degree, or MBA in business, operations, human resources, adult education, organizational development, instructional design or related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MS, Canton - 32.00 - 57.00 USD hourly","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"MS","title":"Data Center Program Manager, Data Center Engineering Operation ","university_job":null,"updated_time":"1 minute","url_next_step":"https://account.amazon.com/jobs/3144800/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of people management and team development experience\u003cbr/\u003e- 5+ years of engineering work managing large-scale services experience\u003cbr/\u003e- Experience maintaining SLAs through the implementation of proactive issue detection and reporting\u003cbr/\u003e- High school or equivalent diploma","business_category":"aws","city":"Canton","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support the operations of some of the world’s most state-of-the-art data centers. Our Data Center Engineering Operations team maintain and operate our critical infrastructure systems so that they are prepared to stand up against any situation.\u003cbr/\u003e\u003cbr/\u003eAWS has the world’s largest cloud computing portfolio. As an Amazonian you will work in some of the most sophisticated, safe, and secure data centers in the world. Our Facility Managers help keep them that way by working with the brightest minds from around the globe to help test and implement the newest technology and work practices to meet the demands of a changing market.\u003cbr/\u003e\u003cbr/\u003eWe have a passion for learning and evolving, it’s how we have helped define ourselves as leaders in the industry. Let’s work hard, have fun, and make history!\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Oversee all aspects of the data center’s critical physical infrastructure. Maintain high availability and performance while ensuring that all work performed within the site is done to high quality without impact to internal/external customers and maintain service level agreements.\u003cbr/\u003e- Manage on-site teams of 24x7 shift technicians, sub-contractors and vendors ensuring that all work performed is in accordance with established practices, procedures and safety protocols.\u003cbr/\u003e- Drive safety and security culture and compliance within the team\u003cbr/\u003e- Hire, coach, and promote team members. Responsible for team's career development and performance management\u003cbr/\u003e- Promotes healthy team culture and peak morale\u003cbr/\u003e- Effectively and efficiently manage the operations budget and expenditures.\u003cbr/\u003e- Engage in improvement projects, often requiring reaching out to a variety of support teams, and drive them from conception to completion.\u003cbr/\u003e- Act as an escalation point for all facilities-related issues. Oversee operation and management of routine and emergency services on a variety of critical systems such as: switchgear, generators, UPS systems, power distribution equipment, chillers, cooling towers, computer room air handlers, building monitoring systems, etc.\u003cbr/\u003e- Utilize root cause analysis and troubleshooting/problem solving skills\u003cbr/\u003e- Respond to out-of-hours emergency calls.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e- May assist in the build out of new facilities and assist in projects to increase current facility efficiency\u003cbr/\u003e- Utilize Microsoft Excel, Word, Outlook and other basic administrative tools to perform day to day tasks\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are seeking a Data Center Facility Manager to serve as a technical resource and leader within Amazon data centers. The position will help ensure overall availability and reliability to meet or exceed defined service levels of data center operations. The Data Center Facility Manager will oversee operations and management of technicians responsible for routine and emergency services on a variety of critical systems such as: switch gear, generators, UPS systems, power distribution equipment, chillers, cooling towers, computer room air handlers, building monitoring systems, etc. They will assist in maintaining a high reliability and performance while keeping operating costs in facilities at a minimum. This equipment supports mission-critical servers and must maintain better than 99.999% uptime.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e","department_cost_center":null,"description_short":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support the operations of some of the world’s most state-of-the-art data","display_distance":null,"id":"626a5078-cfde-419a-ae17-a5171a9e1fb6","id_icims":"3144801","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3144801/data-center-facility-manager-data-center-engineering-operation","job_schedule_type":"full-time","location":"US, MS, Canton","locations":["{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Canton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Canton\",\"coordinates\":\"32.61258,-90.03472\",\"normalizedCountyName\":\"Madison\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Canton, Mississippi, USA\",\"location\":\"US, MS, Canton\",\"region\":\"MS\",\"buildingCodeList\":[\"JAN200\"],\"normalizedCityName\":\"Canton\"}"],"normalized_location":"Canton, Mississippi, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"December 17, 2025","preferred_qualifications":"- 3+ years of work in a management position with 5 or more direct reports experience\u003cbr/\u003e- 5+ years of work in data centers with an emphasis on building and equipment operation experience\u003cbr/\u003e- Bachelor's degree in Electrical Engineering, Mechanical Engineering, or a related field\u003cbr/\u003e- Knowledge of the electrical and mechanical systems involved in critical data center operations including systems such as feeders, transformers, generators, switchgear, UPS systems, ATS units, PDU units, chillers, pumps, air handling units, and CRAC units\u003cbr/\u003e- Experience in a management position with 5 or more direct reports\u003cbr/\u003e- Experience working in data centers with an emphasis on building and equipment operation\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MS, Canton - 119,400.00 - 178,300.00 USD annually","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"MS","title":"Data Center Facility Manager, Data Center Engineering Operation ","university_job":null,"updated_time":"2 minutes","url_next_step":"https://account.amazon.com/jobs/3144801/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of people management and team development experience\u003cbr/\u003e- 5+ years of engineering work managing large-scale services experience\u003cbr/\u003e- Experience maintaining SLAs through the implementation of proactive issue detection and reporting\u003cbr/\u003e- High school or equivalent","business_category":"aws","city":"Canton","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support the operations of some of the world’s most state-of-the-art data centers. Our Data Center Engineering Operations team maintain and operate our critical infrastructure systems so that they are prepared to stand up against any situation.\u003cbr/\u003e\u003cbr/\u003eAWS has the world’s largest cloud computing portfolio. As an Amazonian you will work in some of the most sophisticated, safe, and secure data centers in the world. Our Facility Managers help keep them that way by working with the brightest minds from around the globe to help test and implement the newest technology and work practices to meet the demands of a changing market.\u003cbr/\u003e\u003cbr/\u003eWe have a passion for learning and evolving, it’s how we have helped define ourselves as leaders in the industry. Let’s work hard, have fun, and make history!\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Oversee all aspects of the data center’s critical physical infrastructure. Maintain high availability and performance while ensuring that all work performed within the site is done to high quality without impact to internal/external customers and maintain service level agreements.\u003cbr/\u003e- Manage on-site teams of 24x7 shift technicians, sub-contractors and vendors ensuring that all work performed is in accordance with established practices, procedures and safety protocols.\u003cbr/\u003e- Drive safety and security culture and compliance within the team\u003cbr/\u003e- Hire, coach, and promote team members. Responsible for team's career development and performance management\u003cbr/\u003e- Promotes healthy team culture and peak morale\u003cbr/\u003e- Effectively and efficiently manage the operations budget and expenditures.\u003cbr/\u003e- Engage in improvement projects, often requiring reaching out to a variety of support teams, and drive them from conception to completion.\u003cbr/\u003e- Act as an escalation point for all facilities-related issues. Oversee operation and management of routine and emergency services on a variety of critical systems such as: switchgear, generators, UPS systems, power distribution equipment, chillers, cooling towers, computer room air handlers, building monitoring systems, etc.\u003cbr/\u003e- Utilize root cause analysis and troubleshooting/problem solving skills\u003cbr/\u003e- Respond to out-of-hours emergency calls.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e- May assist in the build out of new facilities and assist in projects to increase current facility efficiency\u003cbr/\u003e- Utilize Microsoft Excel, Word, Outlook and other basic administrative tools to perform day to day tasks\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are seeking a Data Center Facility Manager to serve as a technical resource and leader within Amazon data centers. The position will help ensure overall availability and reliability to meet or exceed defined service levels of data center operations. The Data Center Facility Manager will oversee operations and management of technicians responsible for routine and emergency services on a variety of critical systems such as: switch gear, generators, UPS systems, power distribution equipment, chillers, cooling towers, computer room air handlers, building monitoring systems, etc. They will assist in maintaining a high reliability and performance while keeping operating costs in facilities at a minimum. This equipment supports mission-critical servers and must maintain better than 99.999% uptime.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e","department_cost_center":null,"description_short":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support the operations of some of the world’s most state-of-the-art data","display_distance":null,"id":"d8343408-e473-4748-bb40-dfe17cd14180","id_icims":"3150789","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3150789/data-center-facility-manager-data-center-engineering-operation","job_schedule_type":"full-time","location":"US, MS, Canton","locations":["{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Canton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Canton\",\"coordinates\":\"32.61258,-90.03472\",\"normalizedCountyName\":\"Madison\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Canton, Mississippi, USA\",\"location\":\"US, MS, Canton\",\"region\":\"MS\",\"buildingCodeList\":[\"JAN200\"],\"normalizedCityName\":\"Canton\"}"],"normalized_location":"Canton, Mississippi, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"December 31, 2025","preferred_qualifications":"- 3+ years of work in a management position with 5 or more direct reports experience\u003cbr/\u003e- 5+ years of work in data centers with an emphasis on building and equipment operation experience\u003cbr/\u003e- Bachelor's degree in Electrical Engineering, Mechanical Engineering, or a related field\u003cbr/\u003e- Knowledge of the electrical and mechanical systems involved in critical data center operations including systems such as feeders, transformers, generators, switchgear, UPS systems, ATS units, PDU units, chillers, pumps, air handling units, and CRAC units\u003cbr/\u003e- Experience in a management position with 5 or more direct reports\u003cbr/\u003e- Experience working in data centers with an emphasis on building and equipment operation\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MS, Canton - 119,400.00 - 178,300.00 USD annually","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"MS","title":"Data Center Facility Manager, Data Center Engineering Operation ","university_job":null,"updated_time":"3 minutes","url_next_step":"https://account.amazon.com/jobs/3150789/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent\u003cbr/\u003e- Experience in compliance, audit or risk management\u003cbr/\u003e- Knowledge of Microsoft Office products and applications at an advanced level\u003cbr/\u003e- Experience in the contact center or business process outsourcing industry","business_category":"amazon-customer-service","city":"Seattle","company_name":"Amazon.com Services LLC - A57","country_code":"USA","description":"We are seeking a dynamic and experienced senior leader to spearhead our third-party governance, risk, and compliance management initiatives. This pivotal role will shape and execute strategies that protect customer trust while enabling operations across our global network of outsourced contact centers. You will partner with diverse stakeholders across vendors, security, compliance, engineering, legal, vendor management and policy teams to maintain and improve our organization’s risk posture, bring workstreams together and represent risk management programs to senior leadership.\u003cbr/\u003e\u003cbr/\u003eWe’re looking for a strategic thinker with deep technical expertise in risk and compliance, exceptional stakeholder management skills, and the ability to drive complex programs to completion. The ideal candidate is a self-starter comfortable with novel challenges, able to transform complex information into actionable plans, and skilled at building consensus across global stakeholders. Strong communication skills are essential, as this role requires engaging with leadership at all levels.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Manage complex risk programs across multiple internal and external organizations\u003cbr/\u003e- Provide oversight to the security operations program for first- and third-party infrastructure, own Shepherd and inspection goals for GO (Vendor InfoSec assessments, CS Compliance audits)\u003cbr/\u003e- Inform the design of, negotiate and implement comprehensive security policies for third-party vendors\u003cbr/\u003e- Drive continuous improvement of Amazon's and vendors' security posture through bottom-up and top-down programs\u003cbr/\u003e- Drive technical requirements, design, and delivery planning for security initiatives; this includes audit and assessments programs as well as Amazon owned systems and tools\u003cbr/\u003e- Lead resolution of finding disputes, events and escalations related to security and compliance; guide technical deep dives when needed\u003cbr/\u003e- Implement data-driven risk management strategies across the global network and own key success metrics\u003cbr/\u003e- Create and own scalable solutions for policy management, incl. exceptions, and posture tracking\u003cbr/\u003e- Drive simplification and automation initiatives to streamline workflows, eliminate redundancies, and scale risk management capabilities across the global network\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon's Customer Service Global Outsourcing organization (GO) manages Amazon’s contact center outsourcing relationships worldwide, overseeing location strategy, vendor relationships, and service delivery for all Amazon Stores. Our team builds and maintains a vendor network that delivers exceptional customer experiences while optimizing costs, increasing operational flexibility, and maintaining rigorous security standards.","department_cost_center":null,"description_short":"We are seeking a dynamic and experienced senior leader to spearhead our third-party governance, risk, and compliance management initiatives. This pivotal role will shape and execute strategies that protect","display_distance":null,"id":"111124e5-7800-4b44-b5c1-03369bc8d620","id_icims":"3154708","is_intern":null,"is_manager":null,"job_category":"Customer Service","job_family":"Risk Family","job_function_id":null,"job_path":"/en/jobs/3154708/sr-risk-manager-global-outsourcing-amazon-customer-service","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA29\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"January  7, 2026","preferred_qualifications":"- Experience leveraging technology and implementing lean principles / Six Sigma methodologies to drive process improvements or equivalent\u003cbr/\u003e- Master's degree or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 121,200.00 - 163,900.00 USD annually","primary_search_label":"amazon-customer-service.no-team-listed","source_system":"JobCreator","state":"WA","title":"Sr. Risk Manager – Global Outsourcing, Amazon Customer Service","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3154708/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience with network hardware: copper and optical fiber cabling, switches, routers\u003cbr/\u003e- 18+ months of experience in data center or critical environment or similar technical roles: Computer Hardware Repair, Infrastructure Cabling, Network Deployment, Data Center Operations\u003cbr/\u003e- 18+ months of experience with fiber handling and fiber installation processes","business_category":"aws","city":"Mesa","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Transform network infrastructure by joining our dynamic team! You'll be at the forefront of developing innovative solutions that drive network stability and scalability, using your technical expertise to create automated systems that power global technological advancement. \u003cbr/\u003e \u003cbr/\u003eNetwork Install Technicians will collaborate with cross-functional teams, troubleshoot complex technical scenarios, and implement strategic solutions that keep our network running seamlessly. Expect to engage in hands-on technical work that requires creativity, precision, and a passion for technological innovation. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Moving and implementing large enterprise equipment \u003cbr/\u003e\u003cbr/\u003e- Installing Fiber and Copper cabling and patching cabling between equipment \u003cbr/\u003e\u003cbr/\u003e- Ensuring proper safety and security standards are maintained during cabling and rack installation, \u003cbr/\u003e\u003cbr/\u003e- Following well established hardware installation procedures and break-fix activities \u003cbr/\u003e\u003cbr/\u003e- Safely using material handling tools and equipment \u003cbr/\u003e\u003cbr/\u003e- Traveling within and outside of the regional work area is required. \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e\u003cbr/\u003e- All physical requirements are expected with reasonable accommodations: \u003cbr/\u003e\u003cbr/\u003e- Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds \u003cbr/\u003e\u003cbr/\u003e- Ability to work in an environment that operates 24/7 with an ability to participate in primary responder rotation and provide after-hours support as needed \u003cbr/\u003e\u003cbr/\u003e- Working in cramped and/or elevated and/or noisy environments \u003cbr/\u003e\u003cbr/\u003e- Bending, lifting, stretching, reaching, standing and walking for up to 8+ hours a day \u003cbr/\u003e\u003cbr/\u003e- Ascending and descending ladders, stairs, and gangways safely and without limitation \u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Transform network infrastructure by joining our dynamic team! You'll be at the forefront of developing innovative solutions that drive network stability and scalability, using your technical expertise","display_distance":null,"id":"dac4dead-bc1e-4a0e-850d-1980cac94868","id_icims":"3153487","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3153487/network-installation-technician","job_schedule_type":"full-time","location":"US, AZ, Mesa","locations":["{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Mesa\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Mesa\",\"coordinates\":\"33.41704,-111.83146\",\"normalizedCountyName\":\"Maricopa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Mesa, Arizona, USA\",\"location\":\"US, AZ, Mesa\",\"region\":\"AZ\",\"buildingCodeList\":[\"PHX53\"],\"normalizedCityName\":\"Mesa\"}"],"normalized_location":"Mesa, Arizona, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"January  6, 2026","preferred_qualifications":"- Experience in a data center or other critical environment\u003cbr/\u003e- Bachelor's degree or equivalent professional or military experience in an IT-related field (e.g. computer science, network engineering, etc.)\u003cbr/\u003e- Certifications in a relevant field (CCENT, Network+, CCNA)\u003cbr/\u003e- Behavioral interviewing and hiring experience\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, AZ, Mesa - 29.00 - 52.00 USD hourly","primary_search_label":"aws.team-it-services","source_system":"JobCreator","state":"AZ","title":"Network Installation Technician ","university_job":null,"updated_time":"5 minutes","url_next_step":"https://account.amazon.com/jobs/3153487/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-it-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Wilmington","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Operations Manager. In this role, you will lead and develop a team of salaried and hourly talent. You will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. To achieve this, managers are expected to provide their team with the tools needed for success while driving improvements in productivity and efficiency through data-driven decisions and analytical problem-solving. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e   \u003cbr/\u003e  Our Operation’s workflow has three major components:  First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer.\u003cbr/\u003e \u003cbr/\u003e Key Responsibilities and Job Elements:\u003cbr/\u003e - Support, mentor, and motivate your salaried and hourly workforce\u003cbr/\u003e - Lead large-scope projects with site and regional impact\u003cbr/\u003e - Build and execute productivity plans through forecast reviews, determining productivity requirements, and partnering with other Leaders to load balance \u003cbr/\u003e - Manage safety, quality, productivity, and customer delivery promises \u003cbr/\u003e - Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e - Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e - Stand/walk for up to 12 hours during shifts \u003cbr/\u003e - Work in an environment where the noise level varies and can be loud\u003cbr/\u003e - Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e - Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e   Our fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Operations Managers based on location preference and the business’ current openings.  ","department_cost_center":null,"description_short":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Operations Manager.","display_distance":null,"id":"3dac12c6-eb82-4cc1-b8b4-37214f317a71","id_icims":"3166079","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3166079/operations-manager","job_schedule_type":"full-time","location":"US, NC, Wilmington","locations":["{\"normalizedStateName\":\"North Carolina\",\"normalizedCountryCode\":\"USA\",\"city\":\"Wilmington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NC, Wilmington\",\"coordinates\":\"34.23525,-77.94603\",\"normalizedCountyName\":\"New Hanover\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Wilmington, North Carolina, USA\",\"location\":\"US, NC, Wilmington\",\"region\":\"NC\",\"buildingCodeList\":[\"ILM1\"],\"normalizedCityName\":\"Wilmington\"}"],"normalized_location":"Wilmington, North Carolina, USA","optional_search_labels":[],"posted_date":"January 24, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 2+ salaried employees and 70+ indirect employees\u003cbr/\u003e- Experience scoping, leading, and implementing process improvements through: Lean process, Kaizen, and/or Six Sigma.\u003cbr/\u003e- Demonstrated problem solving skills and analytical skills\u003cbr/\u003e- Excellent customer service skills, communication skills and interpersonal skills\u003cbr/\u003e- Track record of meeting or exceeding department performance goals\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Experience in: military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production, or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NC, Wilmington - 91,000.00 - 136,500.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"NC","title":"Operations Manager","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3166079/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree, or experience in Engineering, Operations, Business Administration, or a related field\u003cbr/\u003e- Experience with Six Sigma tools and Lean techniques\u003cbr/\u003e- 1+ years of project management, including resource planning, managing schedules, reporting project status and prioritizing tasks experience\u003cbr/\u003e- 2+ years of quantitative role (engineering, process re-engineering, quality assurance) experience\u003cbr/\u003e- Experience using data and metrics to measure impact and determine improvements\u003cbr/\u003e- Speak, write, and read fluently in English, and have the ability to take direction in English","business_category":"fulfillment-ops","city":"Mexico City","company_name":"Servicios Comerciales Amazon Mexico S. de R.L. de C.V.","country_code":"MEX","description":"About Amazon\u003cbr/\u003eAt Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is one of the most recognizable brand names in the world and we distribute millions of products each year to our loyal customers. \u003cbr/\u003e \u003cbr/\u003e Amazon Operations \u003cbr/\u003eOperations is at the heart of Amazon business. We are known for our speed, accuracy and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every day. In these key roles, you’ll come in to help us exceed productivity goals and deliver against our customer promises. Our scale is expansive and our presence is growing. Our goal is simple: to offer the world’s greatest selection of products and services with the world’s best customer experience.\u003cbr/\u003e \u003cbr/\u003eThe Role \u003cbr/\u003eAmazon Mexico Fulfillment Operations is seeking a Process Engineer (PE) to work in the ACES (Amazon Customer Excellence Systems) team. \u003cbr/\u003e  \u003cbr/\u003eThe PE team is a group of operational leaders driving process stabilization, standardization and continuous improvement for the Amazon Fulfilment Network. This team is essential to establish best in class network performance across all process paths, accelerate implementation of technological advancements and to strengthen the technical acumen and process knowledge for the operational leaders across the network. As Amazon Mexico continues to rapidly grow and infuse the organization with new talent, we need to ensure the operations teams are equipped with the functional expertise to successfully deliver expected gains for technology advances and network-wide process improvements. The team would drive process control and shifting mean performance with the outcome of minimizing variation between shifts, building and region, to deliver strong OP performance. The team will work closely with other ACES peers, launch teams, operations, engineering and reliability and maintenance (RME) teams to improve the input metrics for each of the process paths by prioritizing and channeling resources to address gaps in these input metrics. This role requires the ability to insist on the highest standards for process execution, interpret data, and lead through influence to deliver meaningful results translating to tangible productivity, efficiency and cost reduction gains across the super region. The individual will be responsible for producing and refining process standards, building on current best practices for physical infrastructure and designing operational procedures that is used across the network and beyond.\u003cbr/\u003e \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e As a Process Engineer, you will be responsible to design initiatives from scratch and drive testing and pilot studies within a strict assigned timelines. This role requires the ability to demonstrate ownership for your initiatives, understand the initiative in detail, and influence to deliver meaningful results translating to tangible productivity and efficiency gains across the entire network. Some of the position’s key responsibilities include: \u003cbr/\u003e   - Evaluate performance objectives and metrics across the      network to proactively identify process improvement opportunities within      your assigned process path\u003cbr/\u003e   - Develop and implement detailed standard operating      procedures to support daily operations within optimized operating window      for each fulfilment process\u003cbr/\u003e   - Partner with operational leaders within ATS, XBorder and Air Operations to execute implementation of process improvements driving stabilization and standardization across the network\u003cbr/\u003e   - Deliver coaching and process path information across   network of operational leaders  as it relates to your respective  process path to support reduction of variation in process standards and  knowledge gaps within network.\u003cbr/\u003e   - Execute, measure and support communication of project  impacts in partnership with the site leaders responsible for day to day operations\u003cbr/\u003e   - Work with cross-functional teams such as Engineering,  Learning and Talent Development and CI to deliver capability development projects\u003cbr/\u003e-  Partner with ACES peers for reviewing critical inputs, new training, best practice sharing, and documentation to drive benchmark performance.\u003cbr/\u003e  \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e- Evaluate performance metrics to proactively identify process improvement opportunities\u003cbr/\u003e- Audit, teach, and drive execution to the benchmark standards\u003cbr/\u003e- Partner with operational leaders to execute standard work and process improvements\u003cbr/\u003e-Collaborate with cross-functional teams to deploy network-wide initiatives\u003cbr/\u003e- Develop and implement KPI reporting for programs and projects\u003cbr/\u003e- Travel up to 50% of the time to various sites across the country\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Customer Excellence System (ACES)\u003cbr/\u003eACES MX Tenets:\u003cbr/\u003e1.- We model the behavior and methods we teach.\u003cbr/\u003e2.- We set our priorities based on Brilliant Basics. When there is a conflict between two of them, a lower level BB may be prioritized only by business decision (i.e., Cost over Quality), considering the initiatives for their long-term benefits.\u003cbr/\u003e3.- We don't assume; we research, dev1elop, document and share standards that build a solid and sustainable foundation for operations, always supported by data.\u003cbr/\u003e4.- We standardize before we innovate (Don't reinvent the wheel!). Innovation is sought when the current standard has been exploited to the maximum. Challenging a standard will never be the same as not following it.\u003cbr/\u003e5.- We value diversity and build inclusive teams as a key factor for standardization and innovation, breaking down organizational silos.\u003cbr/\u003e\u003cbr/\u003eACES MX Vision\u003cbr/\u003eBecome Worldwide Operations reference by driving Operational Excellence\u003cbr/\u003e\u003cbr/\u003eACES MX Mission\u003cbr/\u003ePromote Amazon's culture of innovation and excellence by influencing operations teams to identify, prioritize and deploy scalable mechanisms and solutions to optimize resources and achieve business objectives.\u003cbr/\u003e\u003cbr/\u003eInclusive team culture\u003cbr/\u003eAt Amazon we embrace our differences and we are committed to furthering our culture of inclusion. We host annual and ongoing learning experiences. Amazon’s culture of inclusion is reinforced within our 14 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.\u003cbr/\u003e \u003cbr/\u003eWork Life Balance\u003cbr/\u003eWe believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfillment. We offer flexibility in working hours and encourage you to find your own balance between your work and personal lives.\u003cbr/\u003e \u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded professional.","department_cost_center":null,"description_short":"About AmazonAt Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is one of the most recognizable brand","display_distance":null,"id":"bd7a18d7-5dcf-4ed0-85e4-6ba443290e41","id_icims":"3163486","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3163486/aces-process-engineer-manager-i-amazon-customer-excellence-system-aces","job_schedule_type":"full-time","location":"MX, DIF, Mexico City","locations":["{\"normalizedStateName\":\"Mexico City\",\"normalizedCountryCode\":\"MEX\",\"city\":\"Mexico City\",\"countryIso3a\":\"MEX\",\"countryIso2a\":\"MX\",\"locationNonStemming\":\"Mexico, DIF, Mexico City\",\"coordinates\":\"19.43195,-99.13315\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Mexico\",\"normalizedLocation\":\"Mexico City, Mexico City, MEX\",\"location\":\"MX, DIF, Mexico City\",\"region\":\"DIF\",\"buildingCodeList\":[\"MEX16\"],\"normalizedCityName\":\"Mexico City\"}"],"normalized_location":"Mexico City, Mexico City, MEX","optional_search_labels":["ops.lander-mexico"],"posted_date":"January 21, 2026","preferred_qualifications":"- Lean Six Sigma Green Belt or Black Belt certification\u003cbr/\u003e- - +2 years of Experience with data analysis (including advanced Excel and database analysis)\u003cbr/\u003e- - +2 years of Experience communicating to senior management and customers verbally and in writing\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"DIF","title":"ACES PROCESS ENGINEER, MANAGER I, Amazon Customer Excellence System (ACES)","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3163486/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience with Microsoft Office products and applications\u003cbr/\u003e- High school or equivalent diploma\u003cbr/\u003e- 5+ years of senior level leadership support, or 4+ years of Amazon experience","business_category":"no-business-category","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The Worldwide Amazon Stores organization is seeking an experienced, self-motivated and highly organized Executive Assistant (EA) to support two Directors in the Sub-Same Day (SSD) organization. The EA will work in a fast-paced, exciting, and growing organization supporting the Directors and their teams spread across various parts of USA. SSD is an essential function within the Amazon’s organization and provides a fast, convenient, and ‘delivery in hours’ service to Amazon’s customers. The SSD network is designed and built to fulfill the speed-sensitive products to Amazon’s customers in close proximity and allow for delivery in as little as 5-hours. \u003cbr/\u003e\u003cbr/\u003eThis Executive Assistant will be responsible for handling confidential information and maintaining professionalism in dealing with senior executives. Role responsibilities include managing complex calendars, planning and organizing events of all sizes, and coordinating domestic and international travels. This EA will help build a positive team environment and establish positive working relationships inside and outside of the group. This role requires a strong attention to detail, high judgment, solid organizational skills, and the ability to meet tight deadlines while juggling multiple requests from across the team. \u003cbr/\u003e\u003cbr/\u003eAn important key to your success would be to build and maintain healthy relationships across the organization. A big part of your job will be to understand the organizational structure and strengthen our relationships and collaboration with adjacent teams. So, as you begin to meet people and establish your network it's important to foster strong relationships of trust and cooperation, and to build up a good \"map\" of how the various teams and leaders fit together\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Manage calendar and scheduling to support teams in multiple locations\u003cbr/\u003e* Manage domestic and international travel\u003cbr/\u003e* Manage expense report coordination and submission\u003cbr/\u003e* Organize, execute, and assist with team activities (staff meeting agendas, town-hall meetings, off-sites, and team social events)\u003cbr/\u003e* Ensure the timely completion of critical tasks and follow up on any critical or past due tasks as a liaison for direct reports\u003cbr/\u003e* Work closely with the leadership team, program managers, recruiting, and other Executive Assistants to provide support to the organization\u003cbr/\u003e* Help to develop \u0026 maintain new mechanisms within the team","department_cost_center":null,"description_short":"The Worldwide Amazon Stores organization is seeking an experienced, self-motivated and highly organized Executive Assistant (EA) to support two Directors in the Sub-Same Day (SSD) organization. The EA","display_distance":null,"id":"92fc93e6-aa45-47a9-a612-bf23d731e35c","id_icims":"3178053","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Administrative Support","job_function_id":null,"job_path":"/en/jobs/3178053/executive-assistant-sub-same-day-operations","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA82\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"February 10, 2026","preferred_qualifications":"- Experience leading process improvements\u003cbr/\u003e- Experience in a fast-paced, high-tech company\u003cbr/\u003e- Experience designing processes to maximize efficiency\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Experience working with large global teams\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Bellevue - 82,700.00 - 129,800.00 USD annually","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"WA","title":"Executive Assistant, Sub-Same Day Operations","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3178053/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of people management and team development experience\u003cbr/\u003e- 5+ years of engineering work managing large-scale services experience\u003cbr/\u003e- Experience in people management and team development\u003cbr/\u003e- Experience in engineering work, managing large-scale services\u003cbr/\u003e- Experience owning the operation of a mission-critical team or product\u003cbr/\u003e- High school or equivalent\u003cbr/\u003e- Experience working with KPIs and SLAs","business_category":"aws","city":"Canton","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support the operations of some of the world’s most state-of-the-art data centers. Our Data Center Engineering Operations team maintain and operate our critical infrastructure systems so that they are prepared to stand up against any situation.\u003cbr/\u003e\u003cbr/\u003eAWS has the world’s largest cloud computing portfolio. As an Amazonian you will work in some of the most sophisticated, safe, and secure data centers in the world. Our Facility Managers help keep them that way by working with the brightest minds from around the globe to help test and implement the newest technology and work practices to meet the demands of a changing market.\u003cbr/\u003e\u003cbr/\u003eWe have a passion for learning and evolving, it’s how we have helped define ourselves as leaders in the industry. Let’s work hard, have fun, and make history!\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Oversee all aspects of the data center’s critical physical infrastructure. Maintain high availability and performance while ensuring that all work performed within the site is done to high quality without impact to internal/external customers and maintain service level agreements.\u003cbr/\u003e- Manage on-site teams of 24x7 shift technicians, sub-contractors and vendors ensuring that all work performed is in accordance with established practices, procedures and safety protocols.\u003cbr/\u003e- Drive safety and security culture and compliance within the team\u003cbr/\u003e- Hire, coach, and promote team members. Responsible for team's career development and performance management\u003cbr/\u003e- Promotes healthy team culture and peak morale\u003cbr/\u003e- Effectively and efficiently manage the operations budget and expenditures.\u003cbr/\u003e- Engage in improvement projects, often requiring reaching out to a variety of support teams, and drive them from conception to completion.\u003cbr/\u003e- Act as an escalation point for all facilities-related issues. Oversee operation and management of routine and emergency services on a variety of critical systems such as: switchgear, generators, UPS systems, power distribution equipment, chillers, cooling towers, computer room air handlers, building monitoring systems, etc.\u003cbr/\u003e- Utilize root cause analysis and troubleshooting/problem solving skills\u003cbr/\u003e- Respond to out-of-hours emergency calls.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e- May assist in the build out of new facilities and assist in projects to increase current facility efficiency\u003cbr/\u003e- Utilize Microsoft Excel, Word, Outlook and other basic administrative tools to perform day to day tasks\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are seeking a Data Center Facility Manager to serve as a technical resource and leader within Amazon data centers. The position will help ensure overall availability and reliability to meet or exceed defined service levels of data center operations. The Data Center Facility Manager will oversee operations and management of technicians responsible for routine and emergency services on a variety of critical systems such as: switch gear, generators, UPS systems, power distribution equipment, chillers, cooling towers, computer room air handlers, building monitoring systems, etc. They will assist in maintaining a high reliability and performance while keeping operating costs in facilities at a minimum. This equipment supports mission-critical servers and must maintain better than 99.999% uptime.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e","department_cost_center":null,"description_short":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support the operations of some of the world’s most state-of-the-art data","display_distance":null,"id":"a98db36d-faef-4c7f-8280-ce8151633933","id_icims":"3144526","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3144526/data-center-facility-manager-data-center-engineering-operation","job_schedule_type":"full-time","location":"US, MS, Canton","locations":["{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Canton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Canton\",\"coordinates\":\"32.61258,-90.03472\",\"normalizedCountyName\":\"Madison\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Canton, Mississippi, USA\",\"location\":\"US, MS, Canton\",\"region\":\"MS\",\"buildingCodeList\":[\"JAN200\"],\"normalizedCityName\":\"Canton\"}"],"normalized_location":"Canton, Mississippi, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"December 17, 2025","preferred_qualifications":"- 3+ years of work in a management position with 5 or more direct reports experience\u003cbr/\u003e- 5+ years of work in data centers with an emphasis on building and equipment operation experience\u003cbr/\u003e- Bachelor's degree in Electrical Engineering, Mechanical Engineering, or a related field\u003cbr/\u003e- Knowledge of the electrical and mechanical systems involved in critical data center operations including systems such as feeders, transformers, generators, switchgear, UPS systems, ATS units, PDU units, chillers, pumps, air handling units, and CRAC units\u003cbr/\u003e- Experience in team management with 5 or more direct reports\u003cbr/\u003e- Experience working in data centers with an emphasis on building and equipment operation\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MS, Canton - 119,400.00 - 178,300.00 USD annually","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"MS","title":"Data Center Facility Manager, Data Center Engineering Operation ","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3144526/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent in Business, Program Management, Human Resources, Employment Law, Computer Science, Finance, Computer Information Systems, Engineering, Operations Research or a related field\u003cbr/\u003e- 5+ years of HR, talent acquisition, management consulting, or project/program management experience\u003cbr/\u003e- Experience managing multiple projects and priorities across teams in a fast-paced, deadline-driven environment\u003cbr/\u003e- Experience in verbal and written communication for executive level leaders\u003cbr/\u003e- Proven track record of end-to-end ownership of operational process, change management, and communications.","business_category":"global-corporate","city":"Culver City","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Amazon Entertainment is seeking an experienced HR professional to architect our executive talent strategy for our Entertainment business – where creative-meets-technology-meets business across music, games, podcasts, and other mediums of entertainment. \u003cbr/\u003e\u003cbr/\u003eThis is an opportunity to influence how one of the world's most innovative companies develops its talent for the future. You’ll work directly with our senior Entertainment executives as we go all in with AI and shape the workforce transformation that’s to come.  \u003cbr/\u003e\u003cbr/\u003eThis is not a talent acquisition or recruiting role. Those with experience as an HR Business Partner to senior executives, with strong business acumen, executive coaching expertise, organization design, excellent written and verbal communication skills, and robust project management capabilities often have the right translatable skills to be successful in this role. This person will also be comfortable with presenting regularly with executive and C-suite leaders, with the confidence to facilitate debate with leaders at this level.\u003cbr/\u003e\u003cbr/\u003eThe right person for this role needs to thrive in dealing with a high level of ambiguity and feeling comfortable operating in a space with little direction for solving complex talent and organizational business problems. While we align with existing Amazon timelines on high level core talent activities (e.g., evaluation and assessment, promotions, annual talent reviews), this leader will help evolve our talent processes to fit Entertainment talent needs using creativity to design, build, and manage process execution for our Entertainment executives.\u003cbr/\u003e\u003cbr/\u003eAbout the Business:\u003cbr/\u003eThe role is part of the Amazon People eXperience and Technology (PXT) organization – we build a workplace for Amazonians to invent and deliver on behalf of customers. PXT for Amazon Entertainment supports a portfolio of entertainment businesses that span film, TV, live sports, music, podcasts, games, audiobooks, livestreaming, and other media content. The Entertainment PXT team focuses on the inputs that attract, grow, and retain creative, technical, and business talent at scale. We customize for unique Entertainment business and industry needs where necessary and scale where possible and applicable. Our Entertainment employees deliver world-class products and services for playing, listening, watching, and streaming in an ever-immersive entertainment environment.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThis Executive Talent Lead’s responsibilities include building and continuously evolving Entertainment’s talent reviews and cyclical processes in close partnership with HR Business Partners, business leaders, analytics teams, and central Amazon talent leads. You will be a talent advisor to both business and HR leaders, and ensure we are constantly improving and scaling the services we provide.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate must be a strong systems thinker with strong business acumen, ownership, grit, and drive for results. A successful candidate will have a demonstrated track record of:\u003cbr/\u003e• Talent management execution. Design the overall talent review strategy focused on business-critical talent issues, which includes succession planning, talent development, long term talent planning, organizational reviews (and integrate with diversity and inclusion). Enhance and revisit executive level talent activities (Talent reviews, Career development, organizational capacity planning).\u003cbr/\u003e• Embracing ambiguity, and building structure where processes don’t yet exist. Understand all the connections and integration points through the entire talent management lifecycle, and using your program management expertise to lead the organization through these activities.\u003cbr/\u003e• Communicating with multiple stakeholders with concise, clear written and verbal methods. We are a document-heavy culture, which means we write, a lot, to share our ideas, our proposals, and everything else.\u003cbr/\u003e• Curiosity about your business. Learning your clients’ business, understanding their priorities, and recommending the best talent activities to help them meet their business customer needs.\u003cbr/\u003e• Building relationships and earning trust as a talent expert. Partnering with central team talent leaders, HR business partners, and business leaders and executives.\u003cbr/\u003e• Innovating with both simple yet creative solutions to address talent challenges.\u003cbr/\u003e• Operating with high judgment. There will be a constant flow of work, both tactical and strategic. Determine what gets done first and why, while managing a plan for what to do with everything else.\u003cbr/\u003e• Using research and data to inform your recommendations. We seek to be the most scientific HR organization in the world. We form hypotheses about the best talent management techniques and then set out to prove or disprove them with experiments and careful data collection. We pilot new ideas, measure and seek feedback, iterate and continuously improve.\u003cbr/\u003e• Resourcefulness. If you don’t know it, that’s ok. But you should know where to go for the answer or how to find out.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis leader will quickly earn trust with HR peers, HR senior leaders, and business line leaders, and get deep in understanding specific areas of the Entertainment business. You will build cross-Amazon partnerships with Talent Management peers and within central Amazon PXT and Talent teams. Medium term projects include: leading our organization through talent processes (Q1 is our busiest talent season), evolving approaches to talent management for Entertainment talent, developing relevant internal communications mechanisms, and rethinking and redesigning talent management for professional creatives.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThis Executive Talent Lead will be part of the Entertainment PXT Talent Experience Team. Our purpose is to create and deliver talent programs that help us be Earth’s Best Employer by focusing on the employee experience – from joining Amazon Entertainment, to building connection with each other and our customers, through growing personally and professionally, to being empowered to balance fun, wellness, and learning to sustain a long, fulfilling career with Amazon.","department_cost_center":null,"description_short":"Amazon Entertainment is seeking an experienced HR professional to architect our executive talent strategy for our Entertainment business – where creative-meets-technology-meets business across music, games,","display_distance":null,"id":"2d263d2b-4ce6-4262-a2ed-9e427b4b8ecd","id_icims":"3137987","is_intern":null,"is_manager":null,"job_category":"Human Resources","job_family":"Human Resources","job_function_id":null,"job_path":"/en/jobs/3137987/executive-talent-lead-amazon-entertainment-talent-experience-team","job_schedule_type":"full-time","location":"US, CA, Culver City","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Culver City\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Culver City\",\"coordinates\":\"34.02202,-118.39589\",\"normalizedCountyName\":\"Los Angeles\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Culver City, California, USA\",\"location\":\"US, CA, Culver City\",\"region\":\"CA\",\"buildingCodeList\":[\"LAX35\"],\"normalizedCityName\":\"Culver City\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA43\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Culver City, California, USA","optional_search_labels":["media-entertainment","entertainment.team-games-primegaming","amazon-entertainment.prime-video-applied-science","entertainment.team-music-maple"],"posted_date":"December  5, 2025","preferred_qualifications":"- Knowledge of compensation/total rewards, talent management, performance management, compliance, and organization design and development\u003cbr/\u003e- HR or Talent Development project management experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Culver City - 125,800.00 - 170,200.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 125,800.00 - 170,200.00 USD annually","primary_search_label":"global-corporate.team-hr-for-hr","source_system":"JobCreator","state":"CA","title":"Executive Talent Lead, Amazon Entertainment, Talent Experience Team","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3137987/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-hr-for-hr","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}