{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 1+ years of non-internship professional software development experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"no-business-category","city":"San Luis Obispo","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Come help Amazon create and deploy new technologies to ensure customers get a world class delivery experience! As a Software Development Engineer (SDE), you will be instrumental in helping us create innovative ways to take packages from our fulfillment centers and get them quickly and cost-effectively to the customer.\u003cbr/\u003eAt Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. The focus we have on our customers is why we are one of the world’s most beloved brands – customer obsession is part of our company DNA. Our Software Development Engineers (SDEs) use cutting-edge technology to solve complex problems and get to see the impact of their work first-hand.\u003cbr/\u003eThe challenges SDEs solve for at Amazon are big and influence millions of customers, sellers, and products around the world. We are looking for individuals who are passionate about creating new products, features, and services from scratch while managing ambiguity and the pace of a company where development cycles are measured in weeks, not years. If this sounds interesting to you, apply and come chart your own path at Amazon.","department_cost_center":null,"description_short":"Come help Amazon create and deploy new technologies to ensure customers get a world class delivery experience! As a Software Development Engineer (SDE), you will be instrumental in helping us create innovative","display_distance":null,"id":"bf3e73a5-7a5a-4771-aa39-21aebb1cd145","id_icims":"3185058","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3185058/software-development-engineer","job_schedule_type":"full-time","location":"US, CA, San Luis Obispo","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Luis Obispo\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Luis Obispo\",\"coordinates\":\"35.28579,-120.66275\",\"normalizedCountyName\":\"San Luis Obispo\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Luis Obispo, California, USA\",\"location\":\"US, CA, San Luis Obispo\",\"region\":\"CA\",\"buildingCodeList\":[\"SBP1\"],\"normalizedCityName\":\"San Luis Obispo\"}"],"normalized_location":"San Luis Obispo, California, USA","optional_search_labels":[],"posted_date":"February 19, 2026","preferred_qualifications":"- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, San Luis Obispo - 122,600.00 - 170,000.00 USD annually","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"CA","title":"Software Development Engineer","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3185058/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of technical product or program management experience\u003cbr/\u003e- 7+ years of working directly with engineering teams experience\u003cbr/\u003e- 3+ years of software development experience\u003cbr/\u003e- 5+ years of technical program management working directly with software engineering teams experience\u003cbr/\u003e- Experience managing programs across cross functional teams, building processes and coordinating release schedules","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Commercial Services LLC","country_code":"USA","description":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon Leo will serve people and organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eThe Technical Program Manager will be responsible for field integration testing across all hardware families for LEO's customer terminals. They will play a crucial role in coordinating and owning the triage of daily bug inflows, managing follow up with cross functional stakeholders, and ensuring that our software meets the high standard expected from our customers.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Work with leadership team to set the customer strategy and make appropriate high-judgment trade-offs between features and speed-to-launch.\u003cbr/\u003e- Responsible for field integration test plan and enablement, working to ensure that all teams have what they need to be successful.\u003cbr/\u003e- Proactively track issues and testing efforts and make recommendations on resource and prioritization to ensure high bar of software excellence\u003cbr/\u003e- Anticipate bottlenecks, manage risk and escalations, and balance the business needs versus technical constraints.\u003cbr/\u003e- Anticipate bottlenecks, manage risk and escalations, and balance the business needs versus technical constraints.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement: Due to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe LEO Antenna Systems Product management team supports the devices that connect our customers to the LEO network. We work with engineering to deliver the product hardware and software for both applications and the underlying embedded Linux system. We work hand in hand with hardware, engineering and operations teams to deliver a great experience for our customers.\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to","display_distance":null,"id":"06e76ca7-75d0-4126-ac28-2bc031d32fd9","id_icims":"3120138","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Technical Program Management","job_function_id":null,"job_path":"/en/jobs/3120138/sr-technical-program-manager-leo-antenna-systems","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA125\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":[],"posted_date":"November  3, 2025","preferred_qualifications":"- 5+ years of project management disciplines including scope, schedule, budget, quality, along with risk and critical path management experience\u003cbr/\u003e- Experience managing projects across cross functional teams, building sustainable processes and coordinating release schedules\u003cbr/\u003e- Experience defining KPI's/SLA's used to drive multi-million dollar businesses and reporting to senior leadership\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Redmond - 148,700.00 - 201,200.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Sr. Technical Program Manager, Leo Antenna Systems","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3120138/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of technical infrastructure management experience\u003cbr/\u003e- Experience with varying scenarios of infrastructure builds\u003cbr/\u003e- Knowledge of best practices and emerging technologies, related to infrastructure (i.e. network, data center, hardware, software)\u003cbr/\u003e- 5+ years of experience in core project management disciplines including scope, schedule, budget, quality, along with risk and critical path management","business_category":"aws","city":"Herndon","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e   \u003cbr/\u003eWe’re seeking an experienced Infrastructure Technical Program Manager in Herndon or Arlington, VA to oversee data center build projects in the Northern Virginia region. You will lead cross-functional and technical teams from conceptual design feasibility through requirements, budget, completed design, implementation, testing, and deployment. Along the way, you will use your judgment, negotiation skills, ability to influence without authority, analytical talent, technical aptitude, and leadership to collaborate with a diverse set of stakeholders across multiple time zones, manage capital budgets, eliminate non-value-add activity, design solutions, remove blockers, and find creative ways to accelerate project delivery.\u003cbr/\u003e \u003cbr/\u003eThe candidate must be comfortable managing remote project delivery teams, and possess the ability to facilitate technical whiteboard sessions to troubleshoot project implementation issues, and remove barriers to project success. Being able to stand up cross-functional teams, establish trust with a variety of stakeholders across multiple time zones, manage capital budgets, eliminate non-value-add activity, design solutions, remove blockers, and find creative ways to accelerate project delivery is a must.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will be an exceptionally strong communicator, both written and verbally, and possess experience in tactical project management of highly technical initiatives, as well as strategic program management. They will be able to apply a variety of project management tools, methodologies and techniques for all phases of the project lifecycle and exhibit demonstrated experience in core project management disciplines including scope, schedule, budget, resources, quality and risk management, reporting and metric development/tracking. Experience with MS Project, Asana, Tableau, and systems integration a plus.\u003cbr/\u003e\u003cbr/\u003eThe candidate will work through ambiguity, competing priorities, and be capable of understanding mechanical/electrical engineering concepts. Experience in managing data center infrastructure deployments is a plus. Candidates possessing a background in architecture/design, mechanical/electrical engineering, software/hardware engineering, data center infrastructure/operations, and/or construction, who have transitioned to a program management discipline will have a distinct advantage.\u003cbr/\u003e\u003cbr/\u003e If you enjoy the challenges of deploying highly technical and innovative projects at massive scale, this job is for you!\u003cbr/\u003e  \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e#DCPD_Delivery\u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"7e08f42e-50a0-41e9-831a-07d0021a3970","id_icims":"2940787","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Tech Infrastructure Prgrm Mgmt","job_function_id":null,"job_path":"/en/jobs/2940787/infrastructure-tpm-infra-capacity-delivery","job_schedule_type":"full-time","location":"US, VA, Herndon","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD31\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Herndon, Virginia, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"March 28, 2025","preferred_qualifications":"- Experience with data center builds, especially in a colocation context\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Herndon - 127,100.00 - 171,900.00 USD annually","primary_search_label":"aws.team-program-management-primary","source_system":"JobCreator","state":"VA","title":"Infrastructure TPM, Infra Capacity Delivery","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/2940787/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-program-management-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 4+ years of general contractor and vendor management work (request for proposals, bidding, change orders, quality control, RFI/submittal tracking) associated with construction and project execution experience\u003cbr/\u003e- Bachelor’s degree in Mechanical Engineering, Electrical Engineering, or an equivalent engineering science plus 5+ years of relevant controls experience, OR 10+ years of relevant controls experience in lieu of a degree.\u003cbr/\u003e- 5+ years of experience with industrial controls in critical environment (data center, pharmaceutical, manufacturing, oil \u0026 gas, petrochemical, laboratory, power, water etc.).","business_category":"aws","city":"Dallas","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAs part of the AWS Controls Team, you will work with highly motivated experts and innovators in the data center industry. You will be responsible for innovating, deploying, optimizing, and maintaining the automation systems within the data centers. Automation systems consist of building management system (BMS) and electrical power monitoring system (EPMS). Using Amazon leadership principles, you will develop new processes and standards while innovating in the controls space.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will possess a construction management, mechanical, electrical or technology background that enables them to undertake the challenges of sophisticated controls platforms and a demonstrated ability to think broadly and strategically in aligning building controls and automation with the larger objectives of the business.\u003cbr/\u003e\u003cbr/\u003eThis role requires valid driver’s license and travel domestically and internationally at least 25% of the time.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Travel up to 50%, primarily within Texas.\u003cbr/\u003e•  Manage scope of Building Management System (BMS) and Electrical Power Monitoring System (EPMS) for construction of AWS data centers.\u003cbr/\u003e• Ensure data center controls are deployed in accordance with scope of work (SOW) and specifications.\u003cbr/\u003e• Review and provide feedback on mechanical, electrical, and plumbing (MEP) drawings.\u003cbr/\u003e• Develop controls bill of material (BOM).\u003cbr/\u003e• Manage multiple stakeholder deliverables, requirements and navigate difficult situations.\u003cbr/\u003e• Work under tight project timelines.\u003cbr/\u003e• Financially manage both construction and service contracts.\u003cbr/\u003e• Act in a project sponsor/lead capacity.\u003cbr/\u003e• Provide vendor management.\u003cbr/\u003e• Develop scope of work for site improvement projects.\u003cbr/\u003e• Provide technical assistance and support to internal customers during life cycle of the data center.\u003cbr/\u003e• Perform controls root cause analysis for service of controls for AWS data centers.\u003cbr/\u003e• Schedule and supervise Quarterly maintenance for BMS and EPMS.\u003cbr/\u003e• Review controls sequence of operation and provide feedback to design.\u003cbr/\u003e• Participate in a global on-call schedule.\u003cbr/\u003e• Grow in technical ability by learning a multitude of different automation platforms.\u003cbr/\u003e• Develop building automation controls drawings and wiring diagrams.\u003cbr/\u003e• Size controls valves and damper actuators and select controls devices.\u003cbr/\u003e• Develop and modify control logic programming.\u003cbr/\u003e• Develop and modify graphical user interface.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. \u003cbr/\u003e\u003cbr/\u003e#DCCD_AMER","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"3aa09289-575b-4034-a8f4-153f2c0496c9","id_icims":"3124959","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3124959/data-center-controls-engineer-texas","job_schedule_type":"full-time","location":"US, TX, Dallas","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Dallas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Dallas\",\"coordinates\":\"32.77823,-96.7951\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Dallas, Texas, USA\",\"location\":\"US, TX, Dallas\",\"region\":\"TX\",\"buildingCodeList\":[\"DFW11\"],\"normalizedCityName\":\"Dallas\"}"],"normalized_location":"Dallas, Texas, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"November 12, 2025","preferred_qualifications":"- MS in Engineering (Mechanical, Electrical, Chemical, Controls/Automation)\u003cbr/\u003e- Experience designing, configuring, programming, installing, troubleshooting or servicing HVAC Controls or Electrical SCADA systems application specific controllers, software and networks.\u003cbr/\u003e- Experiencing using common industrial communication protocols (MQTT, BACnet and/or MODBUS).\u003cbr/\u003e- Demonstrated understanding of engineering documentation, electrical and mechanical diagrams, and standard operating procedures.\u003cbr/\u003e- Ability to manage multiple stakeholder deliverables, requirements, and navigate difficult situations.\u003cbr/\u003e- Experience designing data centers or critical MEP infrastructure\u003cbr/\u003e- Registered as a Professional Engineer (PE), or certified Project Management Professional (PMP).\u003cbr/\u003e- Prior AWS/Amazon experience\u003cbr/\u003e- 4+ Yr. Military Service\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $98,700/year in our lowest geographic market up to $210,800/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-it-services","source_system":"JobCreator","state":"TX","title":"Data Center Controls Engineer, Texas","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3124959/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-it-services","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- 1+ years of Microsoft Office products and applications experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- certification from Amazon's Mechatronics and Robotics Apprenticeship Program, or 2+ years of automated conveyor systems and controls experience\u003cbr/\u003e- 2+ years of conducting predictive and preventative maintenance procedures experience\u003cbr/\u003e- 2+ years of reading blueprints and electrical schematics experience\u003cbr/\u003e- 2+ years of demonstrating safety standards experience\u003cbr/\u003e- 2+ years of troubleshooting and diagnostics of material handling equipment (MHE) experience","business_category":"operations","city":"Perrysburg","company_name":"Amazon.com Services LLC - A57","country_code":"USA","description":"About Maintenance at Amazon\u003cbr/\u003e\u003cbr/\u003eOperations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every day. Reliability Maintenance \u0026 Engineering (RME) are the business partners that work tirelessly behind the scenes to make it all happen. We drive continuous improvement and maintain all of the Robotics and Material Handling Equipment (MHE) to ensure our customers are met with the Amazon smile. Come join us on our journey!\u003cbr/\u003e\u003cbr/\u003eAbout the Role\u003cbr/\u003e\u003cbr/\u003eAs a Mechatronics \u0026 Robotics Technician, you will use your skills to support the Operations Maintenance team in repairing and maintaining material handling equipment and pneumatic systems throughout the building. You will have the opportunity to install, maintain, and repair automated packaging and distribution equipment. In addition to developing your skills, you will mentor junior technicians to grow in their roles.\u003cbr/\u003e\u003cbr/\u003eWhat Do We Offer?\u003cbr/\u003e\u003cbr/\u003eAmazon offers competitive compensation packages including comprehensive healthcare benefits starting on Day 1, matching 401(k) program, and up to 20 weeks of paid parental leave. But wait, there is more: We provide lightweight fire-resistant daily wear and composite toe safety shoes for your safety!\u003cbr/\u003e\u003cbr/\u003eHere is what you can expect with the Reliability \u0026 Maintenance Engineering (RME) selection process for Mechatronics \u0026 Robotics Technicians: (Timeframe: Approximately 30-days)\u003cbr/\u003e\u003cbr/\u003eStep 1: Congratulations! You successfully submitted your application! \u003cbr/\u003e\u003cbr/\u003eStep 2: Amazon Recruiting will review your application and invite the most qualified candidate to complete a pre-employment assessment. \u003cbr/\u003e\u003cbr/\u003eStep 3: If you meet the role qualifications, you will receive an invitation from Amazon Recruiting (do-not-reply@criteriacorp.com) to begin your Criteria assessment. You have 5 days to complete. \u003cbr/\u003e\u003cbr/\u003eStep 4: Once you successfully meet the pre-employment assessment requirements, you will be invited to complete a video interview. Your video interview invitation will be from HireVue (interviews@hirevue.com) and you will have 7 days to record your interview.\u003cbr/\u003e\u003cbr/\u003eStep 5: Your video interview will be reviewed by the Amazon Hiring Team and you will be notified of next steps via email within 5 business days. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities include, but are not limited to: \u003cbr/\u003e- You will promote a safe working environment by following all safety procedures \u003cbr/\u003e- You will complete preventative maintenance routines with proper documentation \u003cbr/\u003e- You will troubleshoot electrical and mechanical problems related to all Material Handling Equipment (MHE) which includes belts, motors, photo-eyes, relays, and more \u003cbr/\u003e- You will maintain a positive working relationship across all of the Amazon Operations facility \u003cbr/\u003e- You must be able to move up to 49lbs, stand and walk during shifts lasting up to 12 hours, climb ladders and gangways safely, and without limitation, as well as perform regular bending, lifting, stretching, and reaching both below the waist and above the head\u003cbr/\u003e\u003cbr/\u003ePlease note that while we strive to accommodate employees' preferences for shift assignments, due to operational requirements and scheduling constraints, we cannot guarantee a specific shift assignment.\u003cbr/\u003e","department_cost_center":null,"description_short":"About Maintenance at AmazonOperations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds","display_distance":null,"id":"83d0af62-1744-4233-9387-acd68ad3130b","id_icims":"3160367","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3160367/mechatronics-robotics-tech","job_schedule_type":"full-time","location":"US, OH, Perrysburg","locations":["{\"normalizedStateName\":\"Ohio\",\"normalizedCountryCode\":\"USA\",\"city\":\"Perrysburg\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OH, Perrysburg\",\"coordinates\":\"41.55707,-83.62795\",\"normalizedCountyName\":\"Wood\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Perrysburg, Ohio, USA\",\"location\":\"US, OH, Perrysburg\",\"region\":\"OH\",\"buildingCodeList\":[\"TOL3\"],\"normalizedCityName\":\"Perrysburg\"}"],"normalized_location":"Perrysburg, Ohio, USA","optional_search_labels":[],"posted_date":"January 15, 2026","preferred_qualifications":"- Experience with robotic operation and maintenance\u003cbr/\u003e- 2+ years of electrical and electronic principles experience\u003cbr/\u003e- Associate's degree in Mechnical or Electrical\u003cbr/\u003e- 2+ years of Mechanical or Electrical apprenticeship experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below including the base pay rate plus the highest available shift differential which applies depending on the shift you select. As a total compensation company, you are eligible for additional earnings including overtime pay and performance bonuses. Final pay will be based on factors including shift selection and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, OH, Perrysburg - 31.00 - 33.00 USD hourly","primary_search_label":"operations.team-reliability-maintenance-engineering","source_system":"JobCreator","state":"OH","title":"Mechatronics \u0026 Robotics Tech ","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3160367/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-reliability-maintenance-engineering","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- Bachelor's degree in accounting, finance, business or related field\u003cbr/\u003e- Knowledge of Microsoft Office products and applications at an advanced level\u003cbr/\u003e- Experience working in a large public accounting firm or multi-national corporate tax department","business_category":"finance","city":"Bengaluru","company_name":"ASSPL - Karnataka","country_code":"IND","description":" External Job Description \u003cbr/\u003eOverview: Amazon is seeking a Senior Tax Analyst to focus on India income tax reporting and compliance. This position will be primarily focused on preparing and reviewing local country tax reporting (India direct tax returns \u0026 tax accounting) as well as the international aspects of the US GAAP worldwide income tax provision. In addition, the role includes supporting in tax assessment and litigation.\u003cbr/\u003e\u003cbr/\u003e* Technically strong – good working knowledge of Indian direct tax laws with special focus on  WHT laws and related compliance.\u003cbr/\u003e* Role involves review of tax returns and related filings and should be  well-versed with associated compliance requirements.\u003cbr/\u003e* Candidate is expected to support the team in assessment and litigation. Should be  keen to manage numerous tax notices/ collate information from various  stakeholders within and outside tax team etc. \u003cbr/\u003e* The role would involve dealing with novel tax issues associated with  e-commerce industry, data centers etc. Should be able to monitor changes tax legislation and proactively assess its  impact on the Company.\u003cbr/\u003e* The scope also includes (not limited to):\u003cbr/\u003e    * Prepare and / or review quarterly advance tax computation for various entities and ensuring timely payment of Tax;\u003cbr/\u003e    * Prepare and / or review annual tax computations to support IN GAAP statutory filings for India based entities;\u003cbr/\u003e    * Prepare and / or review monthly/ quarterly tax computations to support US GAAP provision for India based entities and support Amazon’s worldwide US GAAP provision for India based companies;\u003cbr/\u003e    * Supporting statutory audit, tax compliance such Tax audits, Form 3CEB filings etc;\u003cbr/\u003e    * Co-ordination with other teams on various matters related to tax;\u003cbr/\u003e    * Be the SPOC for global processes.\u003cbr/\u003e    * Anticipation of data requirement based on best practices and industry insights. Streamlining data collation for revenue audits. \u003cbr/\u003e    * Identify and drive automation projects.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Role involves review of tax returns and related filings and should be  well-versed with associated compliance requirements.\u003cbr/\u003e* Candidate is expected to support the team in assessment and litigation. Should be  keen to manage numerous tax notices/ collate information from various  stakeholders within and outside tax team etc. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e    * Prepare and / or review quarterly advance tax computation for various entities and ensuring timely payment of Tax;\u003cbr/\u003e    * Prepare and / or review annual tax computations to support IN GAAP statutory filings for India based entities;\u003cbr/\u003e    * Prepare and / or review monthly/ quarterly tax computations to support US GAAP provision for India based entities and support Amazon’s worldwide US GAAP provision for India based companies;\u003cbr/\u003e    * Supporting statutory audit, tax compliance such Tax audits, Form 3CEB filings etc;\u003cbr/\u003e    * Co-ordination with other teams on various matters related to tax;\u003cbr/\u003e    * Be the SPOC for global processes.\u003cbr/\u003e    * Anticipation of data requirement based on best practices and industry insights. Streamlining data collation for revenue audits. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe team is responsible for managing direct tax reporting and compliance requirements for Amazon entities in India. ","department_cost_center":null,"description_short":" External Job Description Overview: Amazon is seeking a Senior Tax Analyst to focus on India income tax reporting and compliance. This position will be primarily focused on preparing and reviewing local","display_distance":null,"id":"32f816e1-e414-47f3-b204-40be3baa8202","id_icims":"3134590","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Tax","job_function_id":null,"job_path":"/en/jobs/3134590/senior-tax-analyst-india-direct-tax-reporting-and-compliance","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR18\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"December  1, 2025","preferred_qualifications":"- 2+ years of maintaining and operating transaction tax calculation software (e.g. Vertex) experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-tax","source_system":"JobCreator","state":"KA","title":"Senior Tax Analyst , India Direct Tax Reporting and Compliance","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3134590/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-tax","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Sparks","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"5e87d1ca-5054-4367-83f3-31dbfe78a5dd","id_icims":"3169293","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3169293/engineering-operations-technician-dcc-communities","job_schedule_type":"full-time","location":"US, NV, Sparks","locations":["{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sparks\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, Sparks\",\"coordinates\":\"39.54115,-119.74832\",\"normalizedCountyName\":\"Washoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sparks, Nevada, USA\",\"location\":\"US, NV, Sparks\",\"region\":\"NV\",\"buildingCodeList\":[\"RNO100\"],\"normalizedCityName\":\"Sparks\"}"],"normalized_location":"Sparks, Nevada, USA","optional_search_labels":["aws.team-ais","aws.team-dc","hourly","military"],"posted_date":"January 29, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Technical (Military/Trade School) training\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NV, Sparks - 31.00 - 55.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"NV","title":"Engineering Operations Technician, DCC Communities ","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3169293/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of Microsoft Office products and applications experience\u003cbr/\u003e- 2+ years of electrical and mechanical experience\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends","business_category":"aws","city":"Sparks","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e- Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"6fbde57a-2466-4876-90b1-40c4f18c82b1","id_icims":"3168283","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3168283/engineering-operations-technician-dcc-communities","job_schedule_type":"full-time","location":"US, NV, Sparks","locations":["{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sparks\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, Sparks\",\"coordinates\":\"39.54115,-119.74832\",\"normalizedCountyName\":\"Washoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sparks, Nevada, USA\",\"location\":\"US, NV, Sparks\",\"region\":\"NV\",\"buildingCodeList\":[\"RNO100\"],\"normalizedCityName\":\"Sparks\"}"],"normalized_location":"Sparks, Nevada, USA","optional_search_labels":["military","aws.team-dc","hourly","aws.team-ais"],"posted_date":"January 28, 2026","preferred_qualifications":"- Experience working in a data center or mission critical facility (example: hospital, military facility, public safety facility, etc.)\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e- Experience with reading and writing procedures, technical documents, and engineering drawings\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NV, Sparks - 36.00 - 63.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"NV","title":"Engineering Operations Technician, DCC Communities ","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3168283/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 10+ years of building and leading large teams and working in matrixed operating structures experience\u003cbr/\u003e- Knowledge of distribution networks and channel P\u0026Ls\u003cbr/\u003e- Bachelor's degree or equivalent\u003cbr/\u003e- Experience working and communicating with multiple stakeholders, C-level executives and cross functional teams or equivalent\u003cbr/\u003e- Experience in strategic thinking about business, enterprise software products, and new technology platforms and architectures or equivalent\u003cbr/\u003e- Experience negotiating VP-level contracts with channel partners and agencies","business_category":"finance","city":"New York","company_name":"Amazon Advertising LLC","country_code":"USA","description":"Amazon Advertising is seeking a strategic leader to transform our approach to partner commercial frameworks and incentives across our global organization. This individual will centralize and optimize our global incentive landscape for our partners organization. The role requires a data-driven approach to analyze and ascribe value to our complete partnership offering - from cash incentives and fee structures to technical resources, service layers, and advertiser benefits that roll up to partner agreements. You will architect a comprehensive commercial strategy that consolidates visibility into all forms of partner investment, establishes consistent frameworks for evaluating and allocating resources, quantifies the full value of Amazon's partner benefits, and drives efficiency while maximizing ROI across our investments in Big 6, independent agencies, and tech partners. This unique position offers an exceptional opportunity to shape the future of Amazon Ads' partner ecosystem through strategic framework development, value-based commercial modeling, and data-driven investment decisions that accelerate growth and innovation.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eStrategic Framework Development\u003cbr/\u003e    * Design comprehensive incentive frameworks combining cash and non-cash strategic levers\u003cbr/\u003e    * Establish consistent evaluation criteria across partner segments (Big 6, independent agency, and tech partners)\u003cbr/\u003e    * Lead competitive landscape analysis to ensure market-leading offerings\u003cbr/\u003e\u003cbr/\u003eProgram Management \u0026 Operations\u003cbr/\u003e    * Develop consolidated view of all incentive programs across Amazon Ads\u003cbr/\u003e    * Drive end-to-end financial governance with Finance teams\u003cbr/\u003e    * Establish program criteria and streamline approval processes\u003cbr/\u003e\u003cbr/\u003eCross-functional Leadership\u003cbr/\u003e    * Work closely with Finance, Agency \u0026 Partner Development teams, Solution Architects, Product, Marketing and Sales GTM teams\u003cbr/\u003e    * Align technical enablement with commercial incentives\u003cbr/\u003e    * Coordinate with Sales leadership and Marketing on strategic priorities\u003cbr/\u003e\u003cbr/\u003eAnalytics \u0026 Optimization\u003cbr/\u003e    * Conduct regular utilization analysis of incentive effectiveness\u003cbr/\u003e    * Develop ROI measurement frameworks\u003cbr/\u003e    * Lead data-driven investment decisions\u003cbr/\u003e    * Build predictive models for partner growth potential\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Advertising is seeking a strategic leader to transform our approach to partner commercial frameworks and incentives across our global organization. This individual will centralize and optimize our","display_distance":null,"id":"107f971b-1e07-4154-9ed2-e828daf9ba8b","id_icims":"3186465","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Business/Merchant Development","job_function_id":null,"job_path":"/en/jobs/3186465/head-of-global-partner-agreements-advertising-sales-finance","job_schedule_type":"full-time","location":"US, NY, New York","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA40\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK19\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"New York, New York, USA","optional_search_labels":[],"posted_date":"February 21, 2026","preferred_qualifications":"- 10+ years of Go-To-Market, Business Development, Sales, or Consulting experience\u003cbr/\u003e- Experience collaborating with cross-functional teams including Marketing, Product Management, Customer Service, Operations, Legal, Finance, and Senior Leadership\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, New York - 213,000.00 - 288,200.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 193,700.00 - 262,000.00 USD annually","primary_search_label":"finance.team-gmac","source_system":"JobCreator","state":"NY","title":"Head of Global Partner Agreements, Advertising Sales Finance","university_job":null,"updated_time":"about 3 hours","url_next_step":"https://account.amazon.com/jobs/3186465/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-gmac","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- 1+ years of Microsoft Office products and applications experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- certification from Amazon's Mechatronics and Robotics Apprenticeship Program, or 2+ years of automated conveyor systems and controls experience\u003cbr/\u003e- 2+ years of conducting predictive and preventative maintenance procedures experience\u003cbr/\u003e- 2+ years of reading blueprints and electrical schematics experience\u003cbr/\u003e- 2+ years of demonstrating safety standards experience\u003cbr/\u003e- 2+ years of troubleshooting and diagnostics of material handling equipment (MHE) experience","business_category":"operations","city":"Aurora","company_name":"Amazon.com Services LLC - A57","country_code":"USA","description":"Application deadline: Feb 26, 2026\u003cbr/\u003e\u003cbr/\u003eAbout Maintenance at Amazon\u003cbr/\u003e\u003cbr/\u003eOperations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every day. Reliability Maintenance \u0026 Engineering (RME) are the business partners that work tirelessly behind the scenes to make it all happen. We drive continuous improvement and maintain all of the Robotics and Material Handling Equipment (MHE) to ensure our customers are met with the Amazon smile. Come join us on our journey!\u003cbr/\u003e\u003cbr/\u003eAbout the Role\u003cbr/\u003e\u003cbr/\u003eAs a Mechatronics \u0026 Robotics Technician, you will use your skills to support the Operations Maintenance team in repairing and maintaining material handling equipment and pneumatic systems throughout the building. You will have the opportunity to install, maintain, and repair automated packaging and distribution equipment. In addition to developing your skills, you will mentor junior technicians to grow in their roles.\u003cbr/\u003e\u003cbr/\u003eWhat Do We Offer?\u003cbr/\u003e\u003cbr/\u003eAmazon offers competitive compensation packages including comprehensive healthcare benefits starting on Day 1, matching 401(k) program, and up to 20 weeks of paid parental leave. But wait, there is more: We provide lightweight fire-resistant daily wear and composite toe safety shoes for your safety!\u003cbr/\u003e\u003cbr/\u003eHere is what you can expect with the Reliability \u0026 Maintenance Engineering (RME) selection process for Mechatronics \u0026 Robotics Technicians: (Timeframe: Approximately 30-days)\u003cbr/\u003e\u003cbr/\u003eStep 1: Congratulations! You successfully submitted your application! \u003cbr/\u003e\u003cbr/\u003eStep 2: Amazon Recruiting will review your application and invite the most qualified candidate to complete a pre-employment assessment. \u003cbr/\u003e\u003cbr/\u003eStep 3: If you meet the role qualifications, you will receive an invitation from Amazon Recruiting (do-not-reply@criteriacorp.com) to begin your Criteria assessment. You have 5 days to complete. \u003cbr/\u003e\u003cbr/\u003eStep 4: Once you successfully meet the pre-employment assessment requirements, you will be invited to complete a video interview. Your video interview invitation will be from HireVue (interviews@hirevue.com) and you will have 7 days to record your interview.\u003cbr/\u003e\u003cbr/\u003eStep 5: Your video interview will be reviewed by the Amazon Hiring Team and you will be notified of next steps via email within 5 business days. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities include, but are not limited to: \u003cbr/\u003e- You will promote a safe working environment by following all safety procedures \u003cbr/\u003e- You will complete preventative maintenance routines with proper documentation \u003cbr/\u003e- You will troubleshoot electrical and mechanical problems related to all Material Handling Equipment (MHE) which includes belts, motors, photo-eyes, relays, and more \u003cbr/\u003e- You will maintain a positive working relationship across all of the Amazon Operations facility \u003cbr/\u003e- You must be able to move up to 49lbs, stand and walk during shifts lasting up to 12 hours, climb ladders and gangways safely, and without limitation, as well as perform regular bending, lifting, stretching, and reaching both below the waist and above the head\u003cbr/\u003e\u003cbr/\u003ePlease note that while we strive to accommodate employees' preferences for shift assignments, due to operational requirements and scheduling constraints, we cannot guarantee a specific shift assignment.\u003cbr/\u003e","department_cost_center":null,"description_short":"About Maintenance at AmazonOperations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds","display_distance":null,"id":"8148b26a-07aa-4048-9ae7-f448b3a19d01","id_icims":"3176230","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3176230/mechatronics-robotics-tech-launch-bjc1-rme","job_schedule_type":"full-time","location":"US, CO, Aurora","locations":["{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Aurora\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Aurora\",\"coordinates\":\"39.70932,-104.81458\",\"normalizedCountyName\":\"Arapahoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Aurora, Colorado, USA\",\"location\":\"US, CO, Aurora\",\"region\":\"CO\",\"buildingCodeList\":[\"BJC1\"],\"normalizedCityName\":\"Aurora\"}"],"normalized_location":"Aurora, Colorado, USA","optional_search_labels":["operations.team-reliability-maintenance-engineering-na"],"posted_date":"February  6, 2026","preferred_qualifications":"- Experience with robotic operation and maintenance\u003cbr/\u003e- 2+ years of electrical and electronic principles experience\u003cbr/\u003e- Associate's degree in Mechnical or Electrical\u003cbr/\u003e- 2+ years of Mechanical or Electrical apprenticeship experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below including the base pay rate plus the highest available shift differential which applies depending on the shift you select. As a total compensation company, you are eligible for additional earnings including overtime pay and performance bonuses. Final pay will be based on factors including shift selection and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Aurora - 35.00 - 37.00 USD hourly","primary_search_label":"operations.team-reliability-maintenance-engineering","source_system":"JobCreator","state":"CO","title":"Mechatronics \u0026 Robotics Tech , Launch BJC1 RME","university_job":null,"updated_time":"about 3 hours","url_next_step":"https://account.amazon.com/jobs/3176230/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-reliability-maintenance-engineering","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}