{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Bachelor's degree in engineering, computer science or equivalent\u003cbr/\u003e- 7+ years of technical program management working directly with software engineering teams experience\u003cbr/\u003e- Experience leading highly technical programs involving infrastructure, complex systems, systems engineering\u003cbr/\u003e- Experience in project management disciplines including scope, schedule, budget, quality, along with risk and critical path management\u003cbr/\u003e- 5+ years of experience interfacing with software/hardware teams in an academic or R\u0026D space.\u003cbr/\u003e- Experience communicating with technical and non-technical stakeholders.","business_category":"aws","city":"Pasadena","company_name":"Amazon Development Center U.S., Inc.","country_code":"USA","description":"We are looking to add a Senior Technical Program Manager to support our software development efforts. You will pair with technical leads to plan and execute a continuous stream of small projects that support the software build-out and development of automation capabilities to fabricate and operate our quantum hardware. The projects a successful candidate will work on span a broad range of topics, including the development and implementation of new of tools to ingest data, accelerate testing, streamline and automate operations. These projects do not work on the actual quantum hardware, but rather are meant to drive efficiency, and accelerate our hardware development effort. This role will operate in an environment with a high degree of ambiguity, where the scope and deliverables are fluid, but where a successful applicant can navigate these challenges to make detailed plans and negotiate resources across a matrixed organization. Given the diversity of projects, a successful applicant will have an opportunity to gain familiarity with all aspects of hardware development and testing for quantum computing, and thus will require a capability to multitask paired with an innate curiosity to dive deep.\u003cbr/\u003e\u003cbr/\u003eYou will partner with other TPMs and work across team boundaries and project lines to identify and unblock resource conflicts. You will leverage your experience in managing complex technical programs to make data-informed decisions at a programmatic level. In this role, you will also support the definition of technical project management standards across the Center of Quantum Computing. Additionally, as an experienced project manager, you will have the opportunity to contribute to shaping our general project management practices across the organization. This includes improving our general lifecycle approach for projects, while also increasing our ability to promote visibility of project progress to other teams and senior leadership. Familiarity with system engineering topics that intersect with project management, such as quantitative risk management, reviews, and requirements management is highly desirable.  \u003cbr/\u003e\u003cbr/\u003eAWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (IoT), Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for their cloud services.\u003cbr/\u003e\u003cbr/\u003e*Why AWS*\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003e*Diverse Experiences*\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003e*Work/Life Balance*\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003e*Inclusive Team Culture*\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003e*Mentorship and Career Growth*\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003e10038\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e1. Identify opportunities where inhouse developed software can streamline our internal hardware and software workflows.\u003cbr/\u003e2. Develop requirement documents that translate customer needs into software workable solutions.\u003cbr/\u003e3. In collaboration with our software managers develop plans (including identifying resources) to develop our internal software platforms.\u003cbr/\u003e4. Support the internal roll-out and adoption of these tools.\u003cbr/\u003e5. Compile customer feedback and use this to drive incremental improvements of existing software tools. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be either a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum, or be able to obtain a U.S export license. If you are unsure if you meet these requirements, please apply and Amazon will review your application for eligibility.\u003cbr/\u003e\u003cbr/\u003eThe AWS Center for Quantum Computing is a multi-disciplinary team of scientists, engineers, and technicians, together working to develop a universal fault-tolerant quantum computer.\u003cbr/\u003e\u003cbr/\u003eOur organization is chasing an ambitious goal, but values the importance of work-life balance. We value setting aside time and providing opportunities for personal growth and development, and we are striving to build an environment that celebrates knowledge sharing and mentorship.","department_cost_center":null,"description_short":"We are looking to add a Senior Technical Program Manager to support our software development efforts. You will pair with technical leads to plan and execute a continuous stream of small projects that support","display_distance":null,"id":"c6b685fb-8b14-4498-8703-a51e9f42d22e","id_icims":"2997746","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"Technical Program Management","job_function_id":null,"job_path":"/en/jobs/2997746/senior-technical-program-manager-software-aws-center-for-quantum-computing","job_schedule_type":"full-time","location":"US, CA, Pasadena","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Pasadena\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Pasadena\",\"coordinates\":\"34.14745,-118.14427\",\"normalizedCountyName\":\"Los Angeles\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Pasadena, California, USA\",\"location\":\"US, CA, Pasadena\",\"region\":\"CA\",\"buildingCodeList\":[\"LAX43\"],\"normalizedCityName\":\"Pasadena\"}"],"normalized_location":"Pasadena, California, USA","optional_search_labels":["aws.team-quantum"],"posted_date":"June  2, 2025","preferred_qualifications":"- Master's or PhD in a relevant topic (computer science, math, physics, etc.).\u003cbr/\u003e- Demonstrated ability to implement both agile and traditional ‘waterfall’ project management practices.\u003cbr/\u003e- Demonstrated ability to dive deep in at least one engineering domain other than software.\u003cbr/\u003e- Experience in the application of machine learning and AI tools to improve or automate a design, production, or testing processes in an industrial context.\u003cbr/\u003e- Familiarity with cloud-based architectures, ideally based on Amazon Web Services.\u003cbr/\u003e- Excellent written and oral communication skills.\u003cbr/\u003e- Familiarity with the layers of the quantum computing stack and the quantum devices lifecycle would be an advantage.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $133,900/year in our lowest geographic market up to $231,400/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-hardware-development-primary","source_system":"JobCreator","state":"CA","title":"Senior Technical Program Manager - Software, AWS Center for Quantum Computing","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/2997746/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-hardware-development-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of hardware design and validation of components, subsystems and systems experience\u003cbr/\u003e- Bachelor's degree or above in electrical engineering, computer engineering, or equivalent\u003cbr/\u003e- Experience in motherboard design, PCB design including schematic capture, stackup and circuit board layout\u003cbr/\u003e- Experience with analog, digital, and high-speed circuit design\u003cbr/\u003e- Experience in EE Hardware system design, integration validation, failure analysis and debug skills.","business_category":"alexa-and-amazon-devices","city":"Sunnyvale","company_name":"Amazon.com Services LLC","country_code":"USA","description":"At Amazon Lab126, we're not just building devices; we're creating experiences that connect people in innovative ways. As a Hardware Development Engineer, you'll be at the forefront of designing innovative consumer electronics that shape the future of technology.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•     Design Complex Electrical systems involving schematic design and layout using ECAD tools (OrCAD/Allegro)\u003cbr/\u003e•     Integrate Innovative  Technologies: Lead system-level engineering efforts, seamlessly combining multiple technological components into cohesive, high-performance products.\u003cbr/\u003e•      Collaborate Across Disciplines: Partner with hardware, software, and mechanical engineering teams to develop comprehensive, innovative solutions\u003cbr/\u003e•\tSolve Complex Technical Challenges: Diagnose and resolve intricate design and manufacturing issues with precision and creativity\u003cbr/\u003e•\tValidate and Optimize Performance: Design, test, and validate system boards to ensure exceptional product quality and performance\u003cbr/\u003e•\tSupport Global Engineering Initiatives: Contribute to international engineering builds and support global product development efforts\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs a hardware engineer, you will engage with an experienced cross-disciplinary staff to conceive and design innovative products. You will work closely with an internal inter-disciplinary team and outside partners to drive key aspects of product definition, execution, and test. \u003cbr/\u003eAs part of a project team, you will work alongside senior electrical engineers, supporting the design, debug, validation, and optimization of the products. You will be involved in projects from concept through production, gaining exposure to the complete design lifecycle. You will also support engineering builds, gaining experience with high-volume manufacturing. Some positions may require international travel.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe are a passionate, collaborative team of engineers and innovators dedicated to creating transformative consumer electronics. Our team thrives on cross-functional collaboration, bringing together diverse expertise to solve complex technical challenges. We believe in empowering our engineers to think creatively, take calculated risks, and drive meaningful innovation.","department_cost_center":null,"description_short":"At Amazon Lab126, we're not just building devices; we're creating experiences that connect people in innovative ways. As a Hardware Development Engineer, you'll be at the forefront of designing innovative","display_distance":null,"id":"7fdab9fe-8244-4c99-9b24-c0221438e272","id_icims":"3165778","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/3165778/hardware-dev-engineer-ii","job_schedule_type":"full-time","location":"US, CA, Sunnyvale","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sunnyvale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Sunnyvale\",\"coordinates\":\"37.37188,-122.03751\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sunnyvale, California, USA\",\"location\":\"US, CA, Sunnyvale\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC11\"],\"normalizedCityName\":\"Sunnyvale\"}"],"normalized_location":"Sunnyvale, California, USA","optional_search_labels":["devices-hwdev"],"posted_date":"January 23, 2026","preferred_qualifications":"- Master's degree in electrical engineering, computer engineering, or equivalent\u003cbr/\u003e- Experience in system-level integration - Audio, Power, Battery management, RF, ESD, or equivalent\u003cbr/\u003e- Experience working with interdisciplinary teams to execute product design from concept to production\u003cbr/\u003e- Experience with the project management of technical projects\u003cbr/\u003e- Experience scripting for automation (e.g., Python, Perl, Ruby)\u003cbr/\u003e- Experience in EE schematic design, HW validation, failure analysis and debug skills.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Sunnyvale - 134,900.00 - 185,000.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-hardware-and-eero","source_system":"JobCreator","state":"CA","title":"Hardware Dev Engineer II","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/3165778/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-hardware-and-eero","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Leo is an initiative to increase global broadband access through a constellation of 3,236 satellites in low Earth orbit (LEO). Its mission is to bring fast, affordable broadband to unserved and underserved communities around the world. Leo will help close the digital divide by delivering fast, affordable broadband to a wide range of customers, including consumers, businesses, government agencies, and other organizations operating in places without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eThis role is for a Software Engineer who will design, implement, and operate globally distributed systems that enable Leo to achieve low single-digit-second query responses within a near real-time analytics layer or lakehouse, and to support agentic AI capabilities on top. You’ll build these systems using the latest AWS technologies and best-in-industry software engineering practices.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eArchitect and implement a scalable, cost-optimized S3-based Data Lakehouse that unifies structured and unstructured data from disparate sources.\u003cbr/\u003eArchitect and implement a scalable, cost-performance-optimized OLAP-based analytics layer\u003cbr/\u003eEstablish metadata management with automated data classification and lineage tracking.\u003cbr/\u003eDesign and enforce standardized data ingestion patterns with built-in quality controls and validation gates.\u003cbr/\u003eArchitect a centralized metrics repository that becomes the source of truth for all Leo metrics.\u003cbr/\u003eImplement robust data quality frameworks with staging-first policies and automated validation pipelines.\u003cbr/\u003eDesign extensible metrics schemas that support complex analytical queries while optimizing for AI retrieval patterns.\u003cbr/\u003eDevelop intelligent orchestration for metrics generation workflows with comprehensive audit trails.\u003cbr/\u003eLead the design of semantic data models that balance analytical performance with AI retrieval requirements.\u003cbr/\u003eImplement cross-domain federated query capabilities with sophisticated query optimization techniques.\u003cbr/\u003eArchitect a globally distributed vector database infrastructure capable of managing billions of embeddings with consistent sub-100ms retrieval times.\u003cbr/\u003eDesign and implement hybrid search strategies combining dense vectors with sparse representations for optimal semantic retrieval.\u003cbr/\u003eEstablish automated compliance validation frameworks ensuring data handling meets Amazon's security standards.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role is for a Software Development Engineer who will build new cloud services and APIs that facilitates and orchestrates simulation of software on Leo devices such as satellites, ground gateways, and customer terminals. You will be building low-latency, highly scalable architecture that are critical to getting high quality internet service to customers.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThis role is for a Software Development Engineer who will build new cloud services and APIs that facilitate and orchestrate the Leo AI Foundations—enabling intelligent software operation across Leo devices such as satellites, ground gateways, and customer terminals. You will design and deliver low-latency, highly scalable architectures that are critical to providing high-quality internet service and AI capabilities to customers.","department_cost_center":null,"description_short":"Leo is an initiative to increase global broadband access through a constellation of 3,236 satellites in low Earth orbit (LEO). Its mission is to bring fast, affordable broadband to unserved and underserved","display_distance":null,"id":"feb8d74f-57b5-4372-b4ba-fd060acfeb4a","id_icims":"3168170","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3168170/sr-software-dev-engineer-leo-ai-foundations","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA114\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":[],"posted_date":"January 27, 2026","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Redmond - 168,100.00 - 227,400.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Sr. Software Dev Engineer, Leo AI Foundations","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/3168170/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of proven success leading User Research projects with demonstrated impact experience\u003cbr/\u003e- 5+ years of hands-on work with: field research, ethnography, lab-based user testing, remote testing, paper prototype testing, iterative prototype testing, concept testing, and survey design experience\u003cbr/\u003e- Bachelor's degree in HCDE, Human Factors, Cognitive Psychology, or a related field\u003cbr/\u003e- Experience in leading User Research projects with demonstrated impact\u003cbr/\u003e- Experience with field research, ethnography, lab-based user testing, remote testing, paper prototype testing, iterative prototype testing, concept testing, and survey design\u003cbr/\u003e- Experience with all aspects of research (study design, recruiting, moderation, analysis, reporting)\u003cbr/\u003e- Experience with behavioral data collection, quantitative data analysis, and statistics\u003cbr/\u003e- Have a portfolio demonstrating past work experience and deliverables (e.g., study plans, reports, personas)","business_category":"aws","city":"Bellevue","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"At AWS Support, our mission is to help millions of customers worldwide achieve their desired outcomes on AWS through personalized, proactive guidance and technical expertise. We are revolutionizing cloud operations through AI innovation, developing intelligent solutions that anticipate and resolve customer needs. We help customers adopt, optimize, and operate AWS at scale through our technology and expertise.\u003cbr/\u003e\u003cbr/\u003eAs a UX Researcher on our team, you'll play a critical role in understanding the complex journey of AWS customers, identifying pain points in their support experience, and informing product decisions that drive customer satisfaction and operational efficiency. Your research will directly influence how we evolve our support offerings to create seamless experiences that enable customers to maximize their cloud investments. By joining our team, you'll help shape the future of AWS Support as we continue to scale our services while maintaining the high-touch, customer-obsessed approach that differentiates us in the market.\u003cbr/\u003e\u003cbr/\u003eHere, you'll collaborate with passionate designers, researchers, and product teams to solve meaningful problems at scale. You'll have the opportunity to work on high-impact projects that directly influence how AWS customers interact with support services, from enterprise organizations to individual developers. We foster a culture of continuous learning, mentorship, and inclusion—where your ideas matter, your growth is supported, and your work makes a tangible difference in the customer experience. If you're excited about leveraging AI to transform support and want to be part of a team that values innovation, collaboration, and customer obsession, we'd love to hear from you.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Use your knowledge of behavioral science research methods and experimental design to lead research initiatives that align to and inform business strategy and goals. \u003cbr/\u003e- Use your communication, presentation, interpersonal, and analytical skills to communicate complex concepts clearly and persuasively across different audiences and varying levels of the organization. \u003cbr/\u003e- Help product teams and leadership determine the right research questions to ask. \u003cbr/\u003e- Define and execute (and, as necessary, invent) research methods appropriate to the questions at hand, including but not limited to field research, surveys, lab studies, remote testing, and A-B tests. \u003cbr/\u003e- Provide focused, insightful, and actionable findings by quickly and thoroughly analyzing a wide range of primary and secondary data types. \u003cbr/\u003e- Translate insights into measurable customer experience outcomes aligned to business goals. \u003cbr/\u003e- Work with design, product management, engineering, and marketing partners to develop innovative end-to-end solutions that address top outcomes. Iteratively design and test these solutions until outcomes are achieved or hypotheses are proven wrong. \u003cbr/\u003e- Advance the development of insight-based knowledge management frameworks used to drive decision-making and prioritization of investments. \u003cbr/\u003e","department_cost_center":null,"description_short":"At AWS Support, our mission is to help millions of customers worldwide achieve their desired outcomes on AWS through personalized, proactive guidance and technical expertise. We are revolutionizing cloud","display_distance":null,"id":"39403436-ca2a-462d-8ba0-a925f0a31e8a","id_icims":"3177343","is_intern":null,"is_manager":null,"job_category":"Design","job_family":"Design","job_function_id":null,"job_path":"/en/jobs/3177343/senior-ux-researcher-aws-support","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA81\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA113\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"February  9, 2026","preferred_qualifications":"- Experience with UX Research in non-US markets\u003cbr/\u003e- Master's degree in Human Factors, HCDE, Cognitive Psychology or equivalent\u003cbr/\u003e- Experience in a technical field (software development, network development, IT, other related)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Bellevue - 152,200.00 - 205,900.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 152,200.00 - 205,900.00 USD annually","primary_search_label":"aws.team-design-primary","source_system":"JobCreator","state":"WA","title":"Senior UX Researcher, AWS Support","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3177343/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-design-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of product or program management, product marketing, business development or technology experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Experience with feature delivery and tradeoffs of a product\u003cbr/\u003e- Experience owning/driving roadmap strategy and definition\u003cbr/\u003e- Experience with end to end product delivery\u003cbr/\u003e- Experience contributing to engineering discussions around technology decisions and strategy related to a product\u003cbr/\u003e- Experience managing technical products or online services\u003cbr/\u003e- Experience in representing and advocating for a variety of critical customers and stakeholders during executive-level prioritization and planning","business_category":"no-business-category","city":"Arlington","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Do you want a role with deep meaning and the ability to make a major impact? As part of Intelligent Talent Acquisition (ITA), you'll have the opportunity to reinvent the hiring process and deliver unprecedented scale, sophistication, and accuracy for Amazon Talent Acquisition operations. \u003cbr/\u003e\u003cbr/\u003eITA is an industry-leading people science and technology organization made up of scientists, engineers, analysts, product professionals and more, all with the shared goal of connecting the right people to the right jobs in a way that is fair and precise. Last year we delivered over 6 million online candidate assessments, and helped Amazon deliver billions of packages around the world by making it possible to hire hundreds of thousands of workers in the right quantity, at the right location and at exactly the right time. \u003cbr/\u003e\u003cbr/\u003eYou’ll work on state-of-the-art research, advanced software tools, new AI systems, and machine learning algorithms, leveraging Amazon's in-house tech stack to bring innovative solutions to life. Join ITA in using technologies to transform the hiring landscape and make a meaningful difference in people's lives. Together, we can solve the world's toughest hiring problems.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Develop product and tactical strategy for consistent data vending, discoverability and reporting\u003cbr/\u003e- Establish self-serve systems to help customers access consistent data more quickly\u003cbr/\u003e- Work closely with data and business intelligence engineers to scope and prioritize the most valuable data opportunities\u003cbr/\u003e- Optimize our data ecosystem to support GenAI applications that advance recruiting automation\u003cbr/\u003e- Partner closely with customers to deeply understand business needs, and synthesize insights into functional requirements, developer-ready user stories, and acceptance criteria\u003cbr/\u003e- Write clear product strategy documents including product requirement documents and Press Releases/Frequently Asked Questions.\u003cbr/\u003e- Own and drive value for the business, creating data-driven impact in every sprint and with every release\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eA PMT in ITA Data begins by understanding our recruiting lifecycle and the key players and systems that hire and develop the best. They lead start-ups with cross-functional teams, prioritizing features that improve candidate experience and recruiter efficiency. Mid-day involves customer interviews to understand pain points in data. They may collaborate with UX on wireframes for new assessment features or candidate communication flows. Afternoons include stakeholder meetings to align on product strategy and ROI metrics. The day concludes with writing product requirements for upcoming releases and reviewing A/B test results from recent feature launches.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWithin ITA, the HIRing Intelligence, Science \u0026 Experimentation (HIRISE) Data team delivers high-quality recruiting data, reusable tools, and analytics reporting to Amazon Talent Acquisition customers. The Data team powers the engine of hiring, creating pathways to information upon which all of the organization’s products are built and enabling Amazon to make correct hiring decisions a million times over. Focused on building scalable long term solutions, the team empowers engineers and consumers to develop, access, and analyze data independently with a high degree of data privacy and integrity. As a member of the team, you will deliver robust data solutions that drive fair and efficient hiring and rapidly evolve with the needs of the business.","department_cost_center":null,"description_short":"Do you want a role with deep meaning and the ability to make a major impact? As part of Intelligent Talent Acquisition (ITA), you'll have the opportunity to reinvent the hiring process and deliver unprecedented","display_distance":null,"id":"e6d2fadb-dadb-4342-961f-0df08d9e0598","id_icims":"3139995","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Product Management - Technical","job_function_id":null,"job_path":"/en/jobs/3139995/sr-product-manager-tech-intelligent-talent-acquisition","job_schedule_type":"full-time","location":"US, VA, Arlington","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS19\"],\"normalizedCityName\":\"Arlington\"}"],"normalized_location":"Arlington, Virginia, USA","optional_search_labels":[],"posted_date":"December  9, 2025","preferred_qualifications":"- Experience in using analytical tools, such as Tableau, Qlikview, QuickSight\u003cbr/\u003e- Experience in building and driving adoption of new tools\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Arlington - 151,200.00 - 204,600.00 USD annually","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"VA","title":"Sr. Product Manager - Tech, Intelligent Talent Acquisition","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3139995/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in operations, supply chain, business, engineering, finance, or related fields.\u003cbr/\u003e- 5+ years of program or project management experience, with a focus on network capacity.\u003cbr/\u003e- Experience using data and metrics to drive improvements in network capacity processes.\u003cbr/\u003e- Intermediate knowledge of MS Excel (vlookups, pivot tables at minimum) and familiarity of SQL.","business_category":"transportation-and-logistics","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join Amazon's dynamic environment as a Senior Supply Chain Manager with a Network Capacity planning background, where you will play a crucial role in shaping and optimizing various facets of our operations, concentrating on optimizing and managing the flow of goods, information, or services within the supply chain network. We have exciting opportunities across different business units, each seeking a skilled professional to lead strategic initiatives and drive process improvements, with a specific focus on network capacity and expansion and the physical flow of goods or services within the supply chain network. As a Strategic Senior Supply Chain Manager with a Network Capacity Background, you'll take end-to-end ownership of operations, emphasizing capacity planning, logistics optimization, network design, new launch expansion and analysis of operational efficiency.\u003cbr/\u003e\u003cbr/\u003eIn this role, you will collaborate with cross-functional teams, including Business, Operations, Supply Chain, Start Up Planning, Launch and more. Utilize your analytical prowess to identify opportunities for operational improvements, implement scalable systems, and drive automation to enhance efficiency, with a particular focus on optimizing the physical flow and operations within the supply chain network. Whether you're managing network capacity initiatives, overseeing cross-functional programs, or focusing on strategic projects, your impact will be visible, ongoing, and contribute directly to our commitment to being the most customer-centric company on earth.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Lead strategic initiatives related to network capacity within Amazon's various business units.\u003cbr/\u003e- Concentrate on optimizing and managing the flow of goods, information, or services within the supply chain network by analyzing topology for new site expansion opportunities.\u003cbr/\u003e- Balance supply and demand, assess and improve the efficiency of distribution networks, warehouses, or logistics operations.\u003cbr/\u003e- Analyze and synthesize data to identify opportunities for enhancing customer experiences and operational efficiency in network capacity.\u003cbr/\u003e- Define metrics, develop program management mechanisms, and invent/simplify processes to drive decision-making in complex network capacity situations.\u003cbr/\u003e- Manage cross-functional network capacity initiatives, ensuring continuous improvement and adherence to lean philosophy at scale.\u003cbr/\u003e- Own a portfolio of cross-functional programs related to network capacity, driving performance improvement and efficiency in project delivery (New Launch, EV, ADTA, Retrofit Projects)\u003cbr/\u003e- Monitor and optimize key network capacity metrics to ensure the smooth flow of goods or services through the supply chain network.","department_cost_center":null,"description_short":"Join Amazon's dynamic environment as a Senior Supply Chain Manager with a Network Capacity planning background, where you will play a crucial role in shaping and optimizing various facets of our operations,","display_distance":null,"id":"6ca310fd-c218-4832-abdc-ab6dcae2b556","id_icims":"3051334","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Supply Chain Management","job_function_id":null,"job_path":"/en/jobs/3051334/senior-supply-chain-manager-last-mile-topology","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA82\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"August  4, 2025","preferred_qualifications":"- Master's degree or MBA in relevant fields.\u003cbr/\u003e- Specific experience in driving process improvements in network capacity.\u003cbr/\u003e- Technical aptitude and familiarity with complex systems.\u003cbr/\u003e- Strong analytical skills and ability to work with large, complex datasets.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Bellevue - 115,400.00 - 160,000.00 USD annually","primary_search_label":"transportation-and-logistics.team-na-operations","source_system":"JobCreator","state":"WA","title":"Senior Supply Chain Manager, Last Mile Topology","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3051334/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-na-operations","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- University degree (Bachelor's or Master's degree), completed before start date Advanced proficiency in written and verbal English and local language Relevant experience in performing data analysis","business_category":"fulfillment-ops","city":"Haydock","company_name":"Amazon UK Services Ltd.","country_code":"GBR","description":"When you join Amazon as an Area/Shift Manager, you’ll gain experience leading a large and diverse team to make sure your area of the business keeps pace with demand. In this hands-on role, you’ll learn about the complexity of operations at a global business and what it takes to make everything run seamlessly. While you implement your team’s approach to drive productivity, you’ll also work closely with your colleagues to address challenges, which means no two days will be the same. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003ePromote a culture of safety and wellbeing\u003cbr/\u003eAnalyse and implement corrective actions to make sure quality and productivity are at consistently high levels, and business objectives are met across all shifts\u003cbr/\u003eSupport and lead a team and handle administrative work alongside building and supporting a strong team culture\u003cbr/\u003eAnalyse performance and suggest process improvements to optimise work and improve customer service\u003cbr/\u003eCollaborate with other managers to standardise shift processes \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou’ll work shifts and be based at one of our operational sites. Your main focus will be to maintain safety standards within your team and across your site. You’ll also monitor and maintain process efficiency. Your days will always include prioritising routine team management and daily operational tasks, alongside other tasks like individual escalations, process improvement work and wide-scale operational contingency planning.\u003cbr/\u003e\u003cbr/\u003eBeing a key part of the operations team involves working with colleagues in other teams and external partners to make sure we stay on track to meet our customer demands and targets. This will involve analysing data and performance metrics with leaders in your business area, as well as discussing the operational pros and cons of technical improvements with engineers. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon couldn’t deliver at pace without the Amazon Transportation Service (ATS) team. As part of ATS, you’ll be welcomed into a diverse team that plays a central role in our success. Using air, sea and road transport, as well as sortation centres equipped with the latest technology, you’ll help Amazon’s transport run at maximum efficiency. Our team captures data and uses it to drive decisions. They are key to making Amazon more innovative and efficient.\u003cbr/\u003eWe put safety first as our people are our priority. And we use the expertise of our people to get packages to their destination – quickly, conveniently and sustainably.","department_cost_center":null,"description_short":"When you join Amazon as an Area/Shift Manager, you’ll gain experience leading a large and diverse team to make sure your area of the business keeps pace with demand. In this hands-on role, you’ll learn","display_distance":null,"id":"e9cbbcab-b362-4ea1-a5a9-f93cf1833acf","id_icims":"3183105","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3183105/area-manager","job_schedule_type":"full-time","location":"GB, Haydock","locations":["{\"normalizedStateName\":\"England\",\"normalizedCountryCode\":\"GBR\",\"city\":\"Haydock\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, Haydock\",\"coordinates\":\"53.46763,-2.6844\",\"normalizedCountyName\":\"Merseyside\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"St Helens, England, GBR\",\"location\":\"GB, Haydock\",\"region\":\"\",\"buildingCodeList\":[\"MAN8\"],\"normalizedCityName\":\"St Helens\"}"],"normalized_location":"St Helens, England, GBR","optional_search_labels":[],"posted_date":"February 17, 2026","preferred_qualifications":"- Experience of communicating with a wide range of stakeholders, including your peers and leadership.\u003cbr/\u003e- Experience in a logistical working environment.\u003cbr/\u003e- Experience working with the MS Office suite (Word, Excel, Outlook) in a professional environment.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-global-specialty-fulfillment","source_system":"JobCreator","state":null,"title":"Area Manager ","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3183105/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-specialty-fulfillment","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 3+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"no-business-category","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Innovators wanted! Are you an entrepreneur? A builder? A dreamer? This role is part of an Amazon Special Projects team that takes the company’s Think Big leadership principle to the limits. If you’re interested in innovating at scale to address big challenges in the world, this is the team for you.\u003cbr/\u003e\u003cbr/\u003eAs a Machine Learning Engineer on our team, you will leverage your deep technical expertise to build reliable, scalable, and highly performant AI systems. You will collaborate closely with Applied Scientists on modeling experiments and prototypes. We’re looking for someone who wants to can make a positive impact on humanity, has a track record of innovating and building successfully, and loves solving hard problems! \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe ideal candidate for this role has a demonstrable track record of delivering successfully in a hyper-growth ML/AI environment by leveraging their deep technical expertise and adapting deftly to rapidly evolving priorities.\u003cbr/\u003eIn this role, you will:\u003cbr/\u003e- Development and maintain key platforms needed for building, evaluating and deploying models for real-world applications. \u003cbr/\u003e- Design and implement scalable data processing pipelines and infrastructure to support ML model training workflows\u003cbr/\u003e- Develop tools for data preprocessing, feature engineering, and efficient resource utilization for large-scale AI training jobs\u003cbr/\u003e- Create monitoring systems, debugging tools, and performance optimization solutions for ML infrastructure\u003cbr/\u003e- Collaborate with AI/ML engineers to integrate ML frameworks with production systems and implement version control for both code and model artifacts\u003cbr/\u003e- Learn state of the art technologies and algorithms in the field of Generative AI to participate in our journey to build the best models.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eOur main data consumers and producers are science teams. You will work closely with scientists from various domains to clarify requirements, design new systems, upgrade existing services and provide operational support to mitigate issues. You work will largely comprise of working with data services and pipelines.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe represent Amazon's ambitious vision to solve the world's most pressing challenges. We operate with the agility of a startup while backed by Amazon's resources and operational excellence. We're looking for builders who are excited about working on ambitious, undefined problems and are comfortable with ambiguity. Our team is for engineers who enjoy teamwork, cross-functional collaboration and building new things. You need to be a fast learner able to independently disambiguate requirements and deliver value to customers. We are offering fast-paced, Agile environment with little bureaucracy and small operational load.","department_cost_center":null,"description_short":"Innovators wanted! Are you an entrepreneur? A builder? A dreamer? This role is part of an Amazon Special Projects team that takes the company’s Think Big leadership principle to the limits. If you’re interested","display_distance":null,"id":"e2a93e38-ce96-421b-bea0-1f1439b32b4a","id_icims":"3121713","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3121713/machine-learning-engineer-ii-special-projects","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA77\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"November  5, 2025","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- Experience designing, developing, optimizing, and maintaining machine learning systems at scale\u003cbr/\u003e- Strong verbal and written communication skills and able to articulate technical challenges and solutions to a broad range of audiences, technical and business\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $129,300/year in our lowest geographic market up to $223,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"no-business-category.no-team-listed","source_system":"JobCreator","state":"WA","title":"Machine Learning Engineer II, Special Projects","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3121713/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- Knowledge of QA methodology and tools","business_category":"alexa-and-amazon-devices","city":"Chennai","company_name":"ADCI MAA 12 SEZ - H82","country_code":"IND","description":"An Associate, Quality Services owns manual execution of documented set of task instructions for a list of components or features of a product, as per the defined productivity and quality targets, agreed SLA and adhere to processes.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eRoles \u0026 Responsibilities:\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e· Gain understanding of the application test procedures and how to use applicable software and tools.\u003cbr/\u003e· Execute test instructions and report test results accurately and promptly.\u003cbr/\u003e· Report any deviations observed\u003cbr/\u003e· Understand any changes in test instructions related to their assigned work\u003cbr/\u003e· Follow defined processes to perform assigned work\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eQuality Services (QS) organization provides testing support for Devices, Retail and AWS products. The primary objective of QS organization is to provide manual testing support. An Associate, Quality Services performs manual test execution of documented task instructions. They produce accurate test results meeting daily targets, adhering to defined processes.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eQuality Services (QS) organization provides testing support for Devices, Retail and AWS products. The primary objective of QS organization is to provide manual testing support. ","department_cost_center":null,"description_short":"An Associate, Quality Services owns manual execution of documented set of task instructions for a list of components or features of a product, as per the defined productivity and quality targets, agreed","display_distance":null,"id":"ce7de5f4-932b-4f18-9e1c-59e86b1b3f02","id_icims":"3183101","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Device associates","job_function_id":null,"job_path":"/en/jobs/3183101/associate-quality-services-quality-services","job_schedule_type":"full-time","location":"IN, TN, Chennai","locations":["{\"normalizedStateName\":\"Tamil Nadu\",\"normalizedCountryCode\":\"IND\",\"city\":\"Chennai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TN, Chennai\",\"coordinates\":\"13.08404,80.28274\",\"normalizedCountyName\":\"Chennai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Chennai, Tamil Nadu, IND\",\"location\":\"IN, TN, Chennai\",\"region\":\"TN\",\"buildingCodeList\":[\"MAA12\"],\"normalizedCityName\":\"Chennai\"}"],"normalized_location":"Chennai, Tamil Nadu, IND","optional_search_labels":["devices-india"],"posted_date":"February 17, 2026","preferred_qualifications":"- Knowledge of software test techniques and strategy\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"alexa-and-amazon-devices.no-team-listed","source_system":"JobCreator","state":"TN","title":"Associate, Quality Services, Quality Services","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3183101/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 8+ years of design experience\u003cbr/\u003e- Have an available online portfolio\u003cbr/\u003e- Experience with design tools such as Photoshop, Illustrator and InDesign and prototyping in HTML, JavaScript, CSS, Ajax","business_category":"entertainment","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Digital Acceleration is Amazon’s e-commerce engine driving digital products, including Kindle, Audible, Music, Video, and Prime. user experience for our digital catalog, pricing, promotions, and data teams — creating a world-class experience for our internal customers. If you're passionate about leading UX improvements and shaping innovative GenAI experiences that drive process efficiencies that impact how millions engage with digital products, this is your opportunity to make a global impact.\u003cbr/\u003e\u003cbr/\u003eWe are looking for an experienced leader with both creative and technical expertise to deliver customer-obsessed UX tmeasurably enhances our internal client experience. In this role, you will have the opportunity to lead and shape how we simplify and streamline client interactions, delivering exceptional experiences that empower our internal teams. You will define and propose new design patterns, interaction models, and features that delight across various customer personas, leveraging GenAI capabilities to create innovative solutions and unlock significant process efficiencies..\u003cbr/\u003e\u003cbr/\u003eIn this role, you will work backwards from a client experience north star, collaborating closely with product and development teams to innovate, implement, and iteratively explore concepts. Your ability to think conceptually, break down work into immediate and long-term phases, and influence across broad stakeholder groups will be key to your success. You will synthesize both qualitative and quantitative inputs to propose and help deliver innovative features that transform how our internal customers work.\u003cbr/\u003e\u003cbr/\u003eThis role demands strong written and verbal presentation skills, an ability to dive deep into technical details, a data-driven mindset, sound business judgment, a deep curiosity about how things work, and a passion for improving customer experiences and delivering world-class solutions for our internal teams.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Own the UX of a foundational framework for digital ecommerce at Amazon \u003cbr/\u003e- Translate  complex customer interactions into simple, engaging user-centered  solutions.\u003cbr/\u003e- Quickly  and thoroughly create user flows, wireframes, low-fidelity and  high-fidelity design mockups, and interactive prototypes.\u003cbr/\u003e- Lead the vision for a customer-centric UX, working closely with product  and development teams to implement innovative concepts that simplify and  expedite the Amazon client experience.\u003cbr/\u003e- Synthesize qualitative and quantitative inputs to  support decision-making and delivery of new features.\u003cbr/\u003e- Communicate complex, interactive design concepts clearly and persuasively across different audiences and varying levels of the organization.\u003cbr/\u003e- Collaborate with cross-functional teams to influence and align with business objectives\u003cbr/\u003e- Manage multiple projects, prioritizing based on  business impact and customer outcomes.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Digital Acceleration powers ordering, subscriptions, and device management for Prime, Amazon Video, Music, Audible, Alexa, and Kindle, amongst other digital businesses. We process billions of digital purchases every year and enable our digital businesses to grow their businesses worldwide. We are on a mission to be earth's best provider of one-time and recurring digital commerce, delivering a seamless and enjoyable post-purchase customer experience.","department_cost_center":null,"description_short":"Digital Acceleration is Amazon’s e-commerce engine driving digital products, including Kindle, Audible, Music, Video, and Prime. user experience for our digital catalog, pricing, promotions, and data teams","display_distance":null,"id":"773de646-5612-4e92-babf-c967131c1726","id_icims":"3175247","is_intern":null,"is_manager":null,"job_category":"Design","job_family":"Design","job_function_id":null,"job_path":"/en/jobs/3175247/senior-ux-designer-digital-acceleration","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA106\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"February  5, 2026","preferred_qualifications":"- Experience applying scrum to visual or UX design processes\u003cbr/\u003e- Experience with UX design of complex workflows\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, BELLEVUE - 137,800.00 - 186,400.00 USD annually","primary_search_label":"entertainment.no-team-listed","source_system":"JobCreator","state":"WA","title":"Senior UX Designer, Digital Acceleration","university_job":null,"updated_time":"19 minutes","url_next_step":"https://account.amazon.com/jobs/3175247/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}