{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Bachelor's degree, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- 3+ years of increasing responsibilities in WHS and/or environmental programs in manufacturing, production, or service operations\u003cbr/\u003e- 3+ years of increasing responsibilities in people and performance management, or 2+ years of Amazon Safety (blue badge/FTE) experience","business_category":"fulfillment-and-operations","city":"Stone Mountain","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We're seeking a dedicated Workplace Health \u0026 Safety (WHS) Manager to join our mission of creating the world's safest work environment. This role offers an exciting opportunity to directly impact associate well being while driving operational excellence.\u003cbr/\u003e\u003cbr/\u003eAs a WHS Manager, you'll be the site's safety champion, leading our Global WHS Program implementation. You'll combine hands-on safety management with strategic thinking to protect our most valuable asset – our people. Your role bridges the gap between safety requirements and operational success, requiring both technical expertise and strong interpersonal skills. Working closely with Operations leadership, you'll drive safety initiatives that make a real difference. You'll conduct comprehensive risk assessments, analyze safety data, and implement practical solutions that protect associates while supporting productivity. Your ability to build relationships and influence positive change will be essential as you help shape our safety culture. You'll lead safety compliance efforts, conduct thorough site audits, and analyze incident trends to target improvements where they matter most. Managing our first aid program and emergency response capabilities, you'll ensure immediate care is always available. Your analytical skills will transform safety data into actionable insights, while your leadership abilities will help engage associates in our safety mission.\u003cbr/\u003e\u003cbr/\u003eCore Impact Areas:\u003cbr/\u003eSafety Leadership \u0026 Innovation - Transform safety culture through leadership and innovative solutions. Drive continuous improvement initiatives that set new benchmarks in workplace safety. Leverage technology and data analytics to drive preventive safety measures that protect our associates while enhancing operational excellence. Develop leadership plans, communicate expectations, and drive initiatives to create a safe work environment. Measure performance against WHS policies, analyze metrics, and conduct site audits to address non-compliance issues. \u003cbr/\u003e\u003cbr/\u003eStrategic Partnership \u0026 Influence - Build partnerships with Operations leadership to integrate safety into every aspect of our business. Use compelling data analysis and risk insights to influence positive change and drive strategic decision-making. Establish yourself as a trusted advisor who balances safety excellence with operational demands. Oversee recordkeeping, workplace organization, and WHS training programs. \u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements include: \u003cbr/\u003e- Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Stand/walk for up to 12 hours during shifts\u003cbr/\u003e- Work in an environment where the noise level varies \u003cbr/\u003e- Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e- Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e- Maintain effective care delivery in emergencies and assist emergency response at the site\u003cbr/\u003e\u003cbr/\u003eFor those that do not have an adult First Aid, CPR, AED certification from the American Heart Association or American Red Cross, must obtain within 3 weeks of start date.","department_cost_center":null,"description_short":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We're seeking","display_distance":null,"id":"8489b3a7-ab3c-4d2f-a99e-6d9d507673f4","id_icims":"3144393","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3144393/site-ehs-manager-ii","job_schedule_type":"full-time","location":"US, GA, Stone Mountain","locations":["{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Stone Mountain\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Stone Mountain\",\"coordinates\":\"33.8049,-84.17011\",\"normalizedCountyName\":\"Dekalb\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Stone Mountain, Georgia, USA\",\"location\":\"US, GA, Stone Mountain\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL2\"],\"normalizedCityName\":\"Stone Mountain\"}"],"normalized_location":"Stone Mountain, Georgia, USA","optional_search_labels":[],"posted_date":"December 16, 2025","preferred_qualifications":"- Distribution Center or Manufacturing EHS experience with mix of exempt and non-exempt employees at a site of at least 250 people\u003cbr/\u003e- Master’s degree\u003cbr/\u003e- Experience implementing lean principles and process improvement in an operational environment.\u003cbr/\u003e- Experience in a fast paced, dynamic organization.\u003cbr/\u003e- Certified Safety Professional\u003cbr/\u003e- Excellent written and verbal communication skills, including comfort interfacing with site leader\u003cbr/\u003e- Ability to develop and implement department goals and strategies.\u003cbr/\u003e- Strong analytical skills with demonstrated problem solving ability.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $63,100/year in our lowest geographic market up to $115,700/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"GA","title":"Site EHS Manager II","university_job":null,"updated_time":"2 minutes","url_next_step":"https://account.amazon.com/jobs/3144393/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- 5+ years of programming with at least one modern language such as C++, C#, Java, Python, Golang, PowerShell, Ruby experience\u003cbr/\u003e- 5+ years of designing or architecting (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Have you ever wanted to develop ground systems and related products for a high-performance satellite constellation? Amazon Leo is an initiative to launch a constellation of Low Earth Orbit satellites that will provide low-latency, high-speed broadband connectivity to unserved and underserved communities around the world. We are looking for a Ground Software Systems Engineer to participate in the technical definition, development, integration, test, production, and deployment of Leo ground systems. These systems include state of the art full motion tracking antennas, modems, and innovative supporting systems. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tBecome a Ground Software Systems Engineer and Owner, a key member of the Ground Systems development team with a focus on Ground Gateway and TT\u0026C software systems\u003cbr/\u003e•\tLead ground terminal software requirements definition and design for project teams in the planning, design, and delivery of Leo ground systems software solutions\u003cbr/\u003e•\tServe as technical expert of ground terminal functionality and associated software interfaces\u003cbr/\u003e•\tResearch, analyze, and design inter-system/application interface protocols, behaviors and performance addressing cyber-security standards and network topology/routing as well as software engineering best-practices\u003cbr/\u003e•\tUse a broad understanding of software engineering, network engineering and RF engineering concepts as it relates to ground terminal monitoring and control to develop solutions to problems and design issues\u003cbr/\u003e•\tManage day-to-day software related technical direction for the team to ensure project schedules are met and development roadblocks are resolved\u003cbr/\u003e•\tLead internal and supplier development teams to understand ground terminal software requirements and create all software technical deliverables\u003cbr/\u003e•\tEffectively communicate project health, risks and issues to stakeholders and management teams\u003cbr/\u003e•\tEnsure delivered gateway systems meet Leo performance needs including availability, reliability, upgradeability, interoperability, and security requirements.\u003cbr/\u003e•\tMentor and lead other Software Systems and Software Development Engineers\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eIn this role as a Senior Ground Software Systems Engineer, you will be actively engaged in developing Leo’s Ground Systems software capabilities. You will define the software products, features, and requirements with internal development teams and external suppliers. These products enable mission critical, high throughput communications with Leo satellites. You will engage with an experienced cross-disciplinary team to develop, qualify, produce, and globally deploy solutions and products enabling Leo’s global network.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Ground Systems team is responsible for the architecture, design, build, and installation of Leo’s Ground Gateway and TT\u0026C Terminal Systems. Our Ground Gateways enable high data rate, low latency communications between Leo points of presence (PoP) and our Low Earth Orbit Satellite constellation. TT\u0026C Terminals support satellite Launch and Early Orbit enabling command and control of the satellites during this critical phase. The team works closely with the Networks, Regulatory, Payload Test, and RF Systems teams to ensure Leo provides a seamless customer experience.","department_cost_center":null,"description_short":"Have you ever wanted to develop ground systems and related products for a high-performance satellite constellation? Amazon Leo is an initiative to launch a constellation of Low Earth Orbit satellites that","display_distance":null,"id":"3707ecd3-6cac-4fcf-8a16-473426da82ed","id_icims":"3127866","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"System Development Engineering","job_function_id":null,"job_path":"/en/jobs/3127866/sr-software-systems-engineer-leo-ground-systems","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA129\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":[],"posted_date":"November 17, 2025","preferred_qualifications":"- Experience with architecture or system engineering\u003cbr/\u003e- Knowledge of network design, protocols and troubleshooting\u003cbr/\u003e- Experience in writing and managing software system and subsystem requirements, including definition and traceability.\u003cbr/\u003e- Experience working with external custom product suppliers\u003cbr/\u003e- Experience in developing performance optimized and highly-available real-time monitoring and control software for Linux based systems\u003cbr/\u003e- Experience in developing cloud-based infrastructure services, related to database technologies, monitoring services, and/or analytics\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Redmond - 151,200.00 - 204,600.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Sr. Software Systems Engineer, Leo Ground Systems","university_job":null,"updated_time":"4 minutes","url_next_step":"https://account.amazon.com/jobs/3127866/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Nashville","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our Worldwide Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager. In this role, you will lead a team of hourly employees and will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. You will also play a key part in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e\u003cbr/\u003eOur Operation’s workflow has three major components: First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer.\u003cbr/\u003e\u003cbr/\u003eRapid and Rural Logistics (R2L) is an exciting organization within Amazon specializing in delighting our customers with speed in which we can make items appear on their doorsteps. We are a combination of operations and support teams aligned to innovate for the last mile customer experience. Come build the future with us!\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Support, mentor, and motivate your team\u003cbr/\u003e- Manage safety, quality, productivity, and customer delivery promises\u003cbr/\u003e- Collaborate with all support teams including Safety, Ops Integration, Loss Prevention and Human Resources to develop plans to meet business objectives\u003cbr/\u003e- Lift up to 49 pounds, stand and walk during shifts lasting up to 12 hours, and frequently push, pull, squat, bend, and reach, as well as continuously climb and descend stairs\u003cbr/\u003e- Work in an environment where the noise level varies and is subject to variable temperatures and weather (delivery stations include outside loading departments, and grocery locations include refrigerated environments\u003cbr/\u003e- Work a flexible schedule (weekends and/or overnight shifts)","department_cost_center":null,"description_short":"Our Worldwide Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area","display_distance":null,"id":"8b00b968-642d-43c8-aa75-b180b3688f1f","id_icims":"3147830","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3147830/area-manager","job_schedule_type":"full-time","location":"US, TN, Nashville","locations":["{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Nashville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Nashville\",\"coordinates\":\"36.16792,-86.77798\",\"normalizedCountyName\":\"Davidson\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Nashville, Tennessee, USA\",\"location\":\"US, TN, Nashville\",\"region\":\"TN\",\"buildingCodeList\":[\"SNL1\"],\"normalizedCityName\":\"Nashville\"}"],"normalized_location":"Nashville, Tennessee, USA","optional_search_labels":[],"posted_date":"December 22, 2025","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $70,000/year in our lowest geographic market up to $100,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"fulfillment-ops.team-global-specialty-fulfillment","source_system":"JobCreator","state":"TN","title":"Area Manager","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/3147830/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-specialty-fulfillment","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 8+ years of product or program management, product marketing, business development or technology experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Experience with feature delivery and tradeoffs of a product\u003cbr/\u003e- Experience owning/driving roadmap strategy and definition\u003cbr/\u003e- Experience with end to end product delivery\u003cbr/\u003e- Experience contributing to engineering discussions around technology decisions and strategy related to a product\u003cbr/\u003e- Experience technical product management","business_category":"alexa-and-amazon-devices","city":"Sunnyvale","company_name":"Amazon.com Services LLC","country_code":"USA","description":"In this role, you will lead the development and launch of some of Fire TV's best selling devices as well as develop new ones. You will make high judgment decisions, present persuasive cases to executive leadership and have enduring impact on the future of Fire TV. You will work closely with a high-energy team consisting of HW, OS and software engineering, user experience, finance, marketing, customer service, and Amazon leadership, and ship devices to customers globally. You will lead large teams of 50+ team members through high complexity and high ambiguity product development cycles, while building excellent intuition for one-way door decisions. In this role you will also work on hardware systems and platform Software/OS – bringing in your unique perspective into the complex systems that make winning products.\u003cbr/\u003e\u003cbr/\u003eYou will work with a broad array of technical and non-tech stakeholders – from design to architecture and core technologies all the way through product development and commercialization. You will have visibility at the highest levels of Amazon's leadership team, and work on our most strategic future initiatives. You will innovate on new devices, features and experiences, even as you manage the operational rigor of rolling out high quality devices on time and within budget. Finally your team will ship - to millions of customers at a scale that only Fire TV can enable.\u003cbr/\u003e\u003cbr/\u003eThis role is a good fit for someone creative, who has strong customer focus and product sense, combined with an established track record in consumer technology products, connected devices, and a real passion for TV and mobile video entertainment.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Lead the development of the consumer-focused product strategy and vision for next-generation devices and experiences\u003cbr/\u003e• Oversee programs in various stages of the lifecycle- from ideation to development to launch/retirement.\u003cbr/\u003e• Define creative, high quality, long term product roadmaps based on team strategy and vision\u003cbr/\u003e• Develop detailed business requirements and user stories that are used to create product specifications and architecture for each product and application\u003cbr/\u003e• Manage prioritization and trade-offs among customer experience, performance and operational support load\u003cbr/\u003e• Drive product launches in concert with Engineering, Operations Go to Market, PR, and other Product teams\u003cbr/\u003e• Create buy-in for the product/feature/service vision and strategy with technical and leadership teams\u003cbr/\u003e• Operate with influence across a variety of cross functional technical, design and commercial teams","department_cost_center":null,"description_short":"In this role, you will lead the development and launch of some of Fire TV's best selling devices as well as develop new ones. You will make high judgment decisions, present persuasive cases to executive","display_distance":null,"id":"d733d5fd-c3bf-45ab-a272-4fb37a4dbd6a","id_icims":"3029783","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Product Management - Technical","job_function_id":null,"job_path":"/en/jobs/3029783/principal-product-manager-tech-devices-fire-tv-devices","job_schedule_type":"full-time","location":"US, CA, Sunnyvale","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sunnyvale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Sunnyvale\",\"coordinates\":\"37.37188,-122.03751\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sunnyvale, California, USA\",\"location\":\"US, CA, Sunnyvale\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC32\"],\"normalizedCityName\":\"Sunnyvale\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA41\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Sunnyvale, California, USA","optional_search_labels":["alexa-and-amazon-devices.team-product-project-program-management-job-family"],"posted_date":"July  9, 2025","preferred_qualifications":"- Experience working directly with Engineers on product enhancements\u003cbr/\u003e- Experience in project management methodologies, business analysis, or process improvement\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Sunnyvale - 206,900.00 - 279,900.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 179,900.00 - 243,400.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-firetv-tablets","source_system":"JobCreator","state":"CA","title":"Principal Product Manager Tech - Devices, Fire TV Devices","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3029783/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-firetv-tablets","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of analyzing and interpreting data with Redshift, Oracle, NoSQL etc. experience\u003cbr/\u003e- Experience with data visualization using Tableau, Quicksight, or similar tools\u003cbr/\u003e- Experience with data modeling, warehousing and building ETL pipelines\u003cbr/\u003e- Experience in Statistical Analysis packages such as R, SAS and Matlab\u003cbr/\u003e- Experience using SQL to pull data from a database or data warehouse and scripting experience (Python) to process data for modeling","business_category":"alexa-and-amazon-devices","city":"Chennai","company_name":"ADCI MAA 15 SEZ","country_code":"IND","description":"Are you ready to be at the forefront of Agentic AI innovation and redefine the future of communication? Join our dynamic Alexa Connections team as a Business Intelligence Engineer, and lead futuristic initiatives that will shape the next generation of intelligent, conversational experiences. In this role, you'll work at the intersection of disruptive AI technologies and real-world impact, making a difference for millions of customers. You'll collaborate with a team of passionate professionals who are as excited about innovation as you are, and together, you'll push the boundaries of what's possible with Alexa+.\u003cbr/\u003e\u003cbr/\u003eAs a BIE, you'll drive the development of scalable real-time metrics reporting and analysis tools for our next-generation communication features powered by advanced AI technologies, including Generative, Agentic, and Real-time AI. You'll work closely with cross-functional teams, including product management, engineering, design, and data science, to design and deliver innovative solutions that leverage these AI technologies to enable seamless, intelligent communication experiences. You'll also lead the integration of these advanced data systems into Alexa's core capabilities, ensuring a seamless and intuitive user experience.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Define the data elements to enable analytical and reporting capabilities, and work cross-functionally with other business intelligence teams\u003cbr/\u003e- Own the design, development, and maintenance of the data models that support ongoing metrics, reports, and analyses used to drive key business decisions\u003cbr/\u003e- Use expertise in qualitative and quantitative analysis to deliver actionable insights to stakeholders\u003cbr/\u003e- Use business intelligence and visualization software (e.g., Quicksight, Tableau) to develop dashboards that are used by senior leadership, HST, One Medical and other health teams\u003cbr/\u003e- Drive data democratization throughout the organization, enabling others to self-serve their data needs. Empower technical and non-technical, internal customers to drive their own analytics and reporting (self-serve reporting) and support ad-hoc reporting when needed.\u003cbr/\u003e- Develop deep understanding of vast data sources and know exactly how, when, and which data to use to solve particular business problems.\u003cbr/\u003e* Design and influence operational best practices for reporting and analytics to enable the team to scale as we grow\u003cbr/\u003e* Work with Product Managers, Engineering, Finance, Marketing teams and other stakeholders on need basis to support their new analytics requirements.\u003cbr/\u003e* Manage numerous requests concurrently and strategically, prioritizing when necessary.\u003cbr/\u003e* Partner/collaborate across teams/roles to deliver results.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAlexa Connections aspires to make Alexa+ the world’s most trusted connection assistant for getting things done and creating moments of joy. Our vision emphasizes a) Trust as our foundation for becoming a daily habit, knowing our customers have plentiful choices, b) Completion of end-to-end customer journeys, beyond shipping features, and c) Joy through personalized, proactive experiences, that create a memory. \u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Are you ready to be at the forefront of Agentic AI innovation and redefine the future of communication? Join our dynamic Alexa Connections team as a Business Intelligence Engineer, and lead futuristic","display_distance":null,"id":"f36fbb3a-60bc-4e8f-ba70-82f0c0948ce5","id_icims":"3136662","is_intern":null,"is_manager":null,"job_category":"Business Intelligence","job_family":"Business Intel Engineer","job_function_id":null,"job_path":"/en/jobs/3136662/business-intelligence-engineer-alexa-connections","job_schedule_type":"full-time","location":"IN, TN, Chennai","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR14\"],\"normalizedCityName\":\"Bengaluru\"}","{\"normalizedStateName\":\"Tamil Nadu\",\"normalizedCountryCode\":\"IND\",\"city\":\"Chennai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TN, Chennai\",\"coordinates\":\"13.08404,80.28274\",\"normalizedCountyName\":\"Chennai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Chennai, Tamil Nadu, IND\",\"location\":\"IN, TN, Chennai\",\"region\":\"TN\",\"buildingCodeList\":[\"MAA15\"],\"normalizedCityName\":\"Chennai\"}"],"normalized_location":"Chennai, Tamil Nadu, IND","optional_search_labels":[],"posted_date":"December  3, 2025","preferred_qualifications":"- Experience with AWS solutions such as EC2, DynamoDB, S3, and Redshift\u003cbr/\u003e- Experience in data mining, ETL, etc. and using databases in a business environment with large-scale, complex datasets\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"alexa-and-amazon-devices.devices-and-services-teams","source_system":"JobCreator","state":"TN","title":"Business Intelligence Engineer, Alexa Connections","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3136662/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"devices-and-services-teams","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of product or program management, product marketing, business development or technology experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Experience with feature delivery and tradeoffs of a product\u003cbr/\u003e- Experience owning/driving roadmap strategy and definition\u003cbr/\u003e- Experience with end to end product delivery\u003cbr/\u003e- Experience contributing to engineering discussions around technology decisions and strategy related to a product\u003cbr/\u003e- Experience managing technical products or online services","business_category":"alexa-and-amazon-devices","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"We're seeking an experienced Senior Product Manager to lead the development and launch of Fire TV's flagship devices. In this strategic role, you'll drive innovation and product excellence while managing large cross-functional teams to deliver innovative entertainment solutions to millions of customers globally. You'll have direct impact on Fire TV's future direction and work closely with Amazon's executive leadership.\u003cbr/\u003e\u003cbr/\u003eIn this role, you will work closely with a high-energy team consisting of HW, OS and software engineering, user experience, finance, marketing, customer service, and Amazon leadership, and ship devices to customers globally. You will lead large teams of 50+ team members through high complexity and high ambiguity product development cycles, while building excellent intuition for one-way door decisions. In this role you will also work on hardware systems and platform Software/OS – bringing in your unique perspective into the complex systems that make winning products.\u003cbr/\u003e\u003cbr/\u003eThis is an exceptional opportunity to shape the future of home entertainment at global scale. You'll work with emerging technology, lead innovative projects, and have significant impact on products used by millions of customers worldwide.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Lead the development of the consumer-focused product strategy and vision for next-generation devices and experiences\u003cbr/\u003e• Oversee programs in various stages of the lifecycle- from ideation to development to launch/retirement.\u003cbr/\u003e• Define creative, high quality, long term product roadmaps based on team strategy and vision\u003cbr/\u003e• Develop detailed business requirements and user stories that are used to create product specifications and architecture for each product and application\u003cbr/\u003e• Manage prioritization and trade-offs among customer experience, performance and operational support load\u003cbr/\u003e• Drive product launches in concert with Engineering, Operations Go to Market, PR, and other Product teams\u003cbr/\u003e• Create buy-in for the product/feature/service vision and strategy with technical and leadership teams\u003cbr/\u003e• Operate with influence across a variety of cross functional technical, design and commercial teams\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou will work with a broad array of technical and non-tech stakeholders – from design to architecture and core technologies all the way through product development and commercialization. You will have visibility at the highest levels of Amazon's leadership team, and work on our most strategic future initiatives. You will innovate on new devices, features and experiences, even as you manage the operational rigor of rolling out high quality devices on time and within budget. Finally your team will ship - to millions of customers at a scale that only Fire TV can enable.\u003cbr/\u003e","department_cost_center":null,"description_short":"We're seeking an experienced Senior Product Manager to lead the development and launch of Fire TV's flagship devices. In this strategic role, you'll drive innovation and product excellence while managing","display_distance":null,"id":"f944a77f-6d84-499b-af8e-63af870edb71","id_icims":"3058473","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Product Management - Technical","job_function_id":null,"job_path":"/en/jobs/3058473/senior-product-manager-tech-fire-tv","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sunnyvale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Sunnyvale\",\"coordinates\":\"37.37188,-122.03751\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sunnyvale, California, USA\",\"location\":\"US, CA, Sunnyvale\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC32\"],\"normalizedCityName\":\"Sunnyvale\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA41\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"August 13, 2025","preferred_qualifications":"- Experience in technical product management, program management or engineering\u003cbr/\u003e- Experience owning feature delivery and tradeoffs of a product\u003cbr/\u003e- Experience in representing and advocating for a variety of critical customers and stakeholders during executive-level prioritization and planning\u003cbr/\u003e- Master's degree\u003cbr/\u003e- Seeking candidates with proven experience in consumer electronics, streaming media platforms, or Smart TV/streaming media player (SMP) product development.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Sunnyvale - 173,900.00 - 235,200.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 151,200.00 - 204,600.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-firetv-tablets","source_system":"JobCreator","state":"WA","title":"Senior Product Manager - Tech, Fire TV","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3058473/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-firetv-tablets","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of computer networking experience\u003cbr/\u003e- 1+ years of Linux operating systems experience\u003cbr/\u003e- Bachelor's degree in Information Technology, Computer Science, or a related field\u003cbr/\u003e- Experience in computer networking\u003cbr/\u003e- Experience working with Linux operating systems\u003cbr/\u003e- Can lift and rack equipment up to 40 pounds\u003cbr/\u003e- Experience with computer hardware troubleshooting and repair","business_category":"aws","city":"Herndon","company_name":"Amazon Data Services, Inc. - A19","country_code":"USA","description":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring seamless data center operations that power millions of businesses and services worldwide.\u003cbr/\u003eData Center Technician position involves in-depth hardware and network diagnostics followed by physical repair as well as participating in an on-call rotation.\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role.\u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e-Performing server rack installations, hardware break-fix on various components, troubleshooting network issues, responding to operational incidents that impact service availability, and carrying out routine network, server hardware, and operating system repairs to contribute to the overall availability of AWS services\u003cbr/\u003e-Serving as a primary contact point for both internal and external stakeholders, including engineers, software developers, vendors, and contractors\u003cbr/\u003e-Performing on-call duties and participating in scheduled maintenance and change management activities\u003cbr/\u003e-Contributing to documentation and process improvement initiatives based on your analysis of operational issues\u003cbr/\u003e-Helping to interview, train and onboard new team members\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e-Lifting and moving material up to 40 pounds each\u003cbr/\u003e-Working in cramped and/or elevated locations\u003cbr/\u003e-Bending, lifting, stretching, and reaching\u003cbr/\u003e-Standing and walking for up to 8+ hours a day\u003cbr/\u003e-Ascending and descending ladders, stairs, and gangways safely and without limitation\u003cbr/\u003e\u003cbr/\u003eWork in an industrial environment\u003cbr/\u003e-Work shifts longer than 8 hours to support 24/7 operations (covering both night and day shifts).\u003cbr/\u003e-This role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational.\u003cbr/\u003e\u003cbr/\u003eEssential Requirements:\u003cbr/\u003e-Ability to travel to or commute between data center locations as needed\u003cbr/\u003e-Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational\u003cbr/\u003e-Travel frequency will vary based on business needs and operational status of assigned facility\u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eOur Data Center Technician professionals, who have industry-leading technical abilities and demonstrate a breadth of knowledge while they:\u003cbr/\u003e\u003cbr/\u003e-Take ownership of technical issues brought by their customer base, engaging other teams when needed to drive resolution\u003cbr/\u003e-Show a strong aptitude for troubleshooting and problem solving\u003cbr/\u003e-Solve problems at their root and step back to understand the broader context\u003cbr/\u003e-Maintain service level agreements through the implementation of proactive issue detection and reporting\u003cbr/\u003e-Are biased to act in the absence of direction or support\u003cbr/\u003e-Improve effectiveness through process innovation\u003cbr/\u003e\u003cbr/\u003eYou will be required to work shift work that will include days/nights/weekends/holidays.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.","department_cost_center":null,"description_short":"Join our dynamic AWS team and become a critical guardian of global cloud infrastructure! You'll play a pivotal role in maintaining the heartbeat of the world's most innovative technology platform, ensuring","display_distance":null,"id":"5f18105f-9368-48e1-be89-c6bb1eaaf33e","id_icims":"3167897","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3167897/dco-tech","job_schedule_type":"full-time","location":"US, VA, Herndon","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sterling\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Sterling\",\"coordinates\":\"39.03336,-77.40713\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sterling, Virginia, USA\",\"location\":\"US, VA, Sterling\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD603\",\"IAD57\",\"IAD282\",\"IAD12\",\"IAD118\",\"IAD417\",\"IAD91\",\"IAD181\",\"IAD62\",\"IAD140\",\"IAD661\",\"IAD147\",\"IAD33\",\"IAD405\",\"IAD232\",\"IAD588\",\"IAD190\",\"IAD256\",\"IAD160\",\"IAD409\",\"IAD83\",\"IAD143\",\"IAD16\",\"IAD123\",\"OSU69\",\"IAD15\",\"IAD98\",\"IAD139\",\"IAD413\",\"IAD69\",\"IAD82\",\"IAD662\",\"IAD90\",\"IAD182\",\"IAD148\",\"IAD146\",\"IAD285\",\"IAD141\",\"IAD402\",\"IAD144\",\"IAD257\",\"IAD17\",\"IAD586\",\"IAD244\",\"IAD407\",\"IAD32\",\"IAD192\",\"BWI1\",\"IAD259\",\"IAD571\",\"IAD214\",\"IAD410\",\"IAD164\",\"IAD608\",\"IAD920\",\"IAD26\",\"IAD403\",\"IAD72\",\"IAD10\",\"IAD116\",\"IAD121\",\"IAD415\",\"IAD149\",\"IAD229\",\"IAD128\",\"IAD613\",\"IAD213\",\"IAD93\",\"IAD226\",\"IAD79\",\"IAD81\",\"IAD191\",\"IAD389\",\"IAD255\",\"IAD412\",\"IAD129\",\"IAD231\",\"IAD92\",\"IAD230\",\"IAD180\",\"IAD419\",\"IAD574\",\"IAD142\",\"IAD88\",\"IAD388\",\"IAD681\",\"IAD246\",\"IAD418\",\"IAD56\",\"IAD117\",\"IAD119\",\"IAD89\",\"IAD404\",\"IAD68\",\"IAD163\",\"IAD414\",\"IAD228\",\"IAD122\",\"IAD175\",\"IAD58\",\"WAS30\",\"IAD408\",\"IAD99\",\"IAD609\",\"DDC4\",\"IAD587\",\"IAD411\",\"IAD258\",\"IAD51\",\"IAD76\",\"IAD145\",\"IAD406\",\"IAD416\",\"IAD243\",\"IAD120\"],\"normalizedCityName\":\"Sterling\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Ashburn\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Ashburn\",\"coordinates\":\"39.05232,-77.4827\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Ashburn, Virginia, USA\",\"location\":\"US, VA, Ashburn\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD438\",\"LAB1\",\"IAD496\",\"IAD426\",\"IAD200\",\"IAD215\",\"IAD115\",\"IAD434\",\"IAD435\",\"IAD66\",\"WFM534\",\"IAD290\",\"IAD50\",\"IAD611\",\"IAD847\",\"IAD169\",\"IAD685\",\"IAD499\",\"IAD423\",\"IAD13\",\"IAD421\",\"IAD162\",\"IAD606\",\"IAD433\",\"IAD202\",\"IAD177\",\"IAD71\",\"IAD431\",\"IAD114\",\"IAD05\",\"IAD78\",\"IAD428\",\"IAD470\",\"IAD420\",\"IAD23\",\"IAD436\",\"IAD179\",\"IAD60\",\"IAD498\",\"IAD80\",\"IAD138\",\"IAD254\",\"IAD2\",\"IAD437\",\"IAD174\",\"IAD497\",\"IAD427\",\"IAD6\",\"WAS36\",\"IAD439\",\"IAD430\",\"IAD67\",\"IAD432\",\"IAD54\",\"IAD429\",\"IAD161\",\"IAD422\"],\"normalizedCityName\":\"Ashburn\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Chantilly\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Chantilly\",\"coordinates\":\"38.88675,-77.43892\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Chantilly, Virginia, USA\",\"location\":\"US, VA, Chantilly\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD544\",\"IAD37\",\"IAD600\",\"IAD527\",\"IAD9\",\"IAD156\",\"IAD604\",\"IAD738\",\"IAD152\",\"IAD63\",\"IAD157\",\"IAD150\",\"IAD86\",\"IAD203\",\"IAD61\",\"IAD1\",\"IAD135\",\"IAD602\",\"IAD529\",\"IAD155\",\"IAD530\",\"IAD18\",\"IAD525\",\"IAD134\",\"IAD610\",\"IAD605\",\"IAD151\",\"IAD526\",\"IAD158\",\"IAD22\",\"IAD159\",\"IAD528\",\"IAD543\",\"IAD601\",\"IAD65\",\"IAD204\",\"DRC7\"],\"normalizedCityName\":\"Chantilly\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Dulles\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Dulles\",\"coordinates\":\"39.02784,-77.39718\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sterling, Virginia, USA\",\"location\":\"US, VA, Dulles\",\"region\":\"VA\",\"buildingCodeList\":[\"HGJ5\",\"IAD683\",\"IAD183\",\"HCS6\",\"HCS5\",\"AFT3\",\"IAD251\",\"PAR6\",\"HGJ4\",\"IAD614\",\"HSN2\",\"AFT2\"],\"normalizedCityName\":\"Sterling\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD653\",\"IAD28\",\"IAD168\",\"DCA52\",\"IAD547\",\"IAD940\",\"IAD657\",\"IAD21\",\"IAD993\",\"IAD656\",\"IAD769\",\"IAD8\",\"IAD548\",\"IAD736\",\"IAD21R\",\"IAD500\",\"IAD658\",\"IAD990\",\"IAD960\",\"IAD869\",\"IAD545\",\"IAD980\",\"IAD549\",\"IAD166\",\"IAD848\",\"IAD739\",\"IAD651\",\"IAD660\",\"IAD992\",\"IAD655\",\"IAD31\",\"IAD905\",\"IAD654\",\"IAD650\",\"IAD165\",\"IAD991\",\"IAD546\",\"IAD659\",\"IAD652\",\"IAD737\",\"IAD167\"],\"normalizedCityName\":\"Herndon\"}","{\"normalizedStateName\":\"Maryland\",\"normalizedCountryCode\":\"USA\",\"city\":\"Frederick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MD, Frederick\",\"coordinates\":\"39.41574,-77.41203\",\"normalizedCountyName\":\"Frederick\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Frederick, Maryland, USA\",\"location\":\"US, MD, Frederick\",\"region\":\"MD\",\"buildingCodeList\":[\"BWI139\",\"IAD541\",\"BWI111\",\"BWI127\",\"DIW5\",\"BWI144\",\"IAD536\",\"BWI118\",\"IAD533\",\"BWI135\",\"BWI136\",\"BWI126\",\"IAD532\",\"IAD916\",\"BWI110\",\"IAD542\",\"BWI141\",\"BWI143\",\"BWI184\",\"IAD539\",\"BWI138\",\"BWI128\",\"BWI153\",\"BWI100\",\"BWI131\",\"BWI133\",\"BWI148\",\"DFR1\",\"FDK1\",\"IAD534\",\"BWI181\",\"BWI151\",\"IAD245\",\"BWI123\",\"BWI125\",\"IAD538\",\"BWI142\",\"HGR4\",\"BWI113\",\"WFM865\",\"BWI154\",\"DDI1\",\"BWI137\",\"BWI150\",\"BWI117\",\"IAD531\",\"BWI121\",\"BWI116\",\"BWI146\",\"BWI145\",\"BWI130\",\"BWI101\",\"LFDK\",\"BWI124\",\"BWI122\",\"IAD537\",\"BWI112\",\"BWI134\",\"IAD540\",\"BWI147\",\"BWI180\",\"BWI149\",\"BWI132\",\"BWI119\",\"IAD352\",\"BWI152\",\"BWI129\",\"IAD535\"],\"normalizedCityName\":\"Frederick\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Manassas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Manassas\",\"coordinates\":\"38.75125,-77.47086\",\"normalizedCountyName\":\"Manassas (City)\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Manassas, Virginia, USA\",\"location\":\"US, VA, Manassas\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD96\",\"IAD112\",\"IAD100\",\"IAD84\",\"IAD314\",\"IAD46\",\"IAD107\",\"IAD516\",\"IAD75\",\"IAD34\",\"IAD444\",\"IAD43\",\"IAD103\",\"IAD14\",\"IAD598\",\"IAD234\",\"IAD87\",\"IAD322\",\"IAD515\",\"IAD440\",\"IAD38\",\"IAD210\",\"IAD524\",\"IAD216\",\"IAD108\",\"IAD225\",\"DCA73\",\"IAD194\",\"IAD443\",\"IAD35\",\"IAD95\",\"IAD111\",\"IAD445\",\"IAD7\",\"IAD85\",\"IAD224\",\"IAD132\",\"IAD523\",\"IAD47\",\"IAD101\",\"IAD441\",\"IAD104\",\"IAD521\",\"IAD518\",\"IAD73\",\"IAD448\",\"IAD237\",\"IAD106\",\"IAD307\",\"IAD247\",\"IAD20\",\"IAD594\",\"IAD222\",\"IAD45\",\"DCA72\",\"IAD19\",\"IAD442\",\"IAD914\",\"IAD109\",\"IAD110\",\"IAD223\",\"IAD193\",\"MAK7\",\"IAD24\",\"IAD211\",\"DCA080\",\"IAD235\",\"IAD220\",\"HWY120\",\"IAD39\",\"IAD446\",\"IAD102\",\"IAD370\",\"IAD77\",\"IAD131\",\"DCA075\",\"IAD48\",\"IAD612\",\"IAD590\",\"IAD113\",\"IAD49\",\"IAD97\",\"IAD52\",\"IAD944\",\"IAD130\",\"IAD607\",\"DVA5\",\"IAD59\",\"IAD236\",\"IAD447\",\"IAD449\",\"IAD221\",\"IAD218\",\"IAD105\",\"IAD44\",\"IAD520\",\"IAD519\",\"IAD74\",\"IAD11\",\"IAD133\",\"IAD248\",\"IAD517\",\"IAD522\",\"IAD238\",\"IAD846\"],\"normalizedCityName\":\"Manassas\"}"],"normalized_location":"Herndon, Virginia, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"January 27, 2026","preferred_qualifications":"- Can work in cramped spaces or in elevated locations while adhering to health \u0026 safety guidelines\u003cbr/\u003e- Experience dealing effectively with customers during problem resolution and operating efficiently under pressure\u003cbr/\u003e- Experience managing work and priorities through a ticketing system\u003cbr/\u003e- Experience with cabling infrastructure best practices and methodologies\u003cbr/\u003e- Experience working in a data center environment (racking and stacking gear, cable management, hot/cold aisle containment)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MD, Frederick - 29.00 - 52.00 USD hourly\u003cbr/\u003eUSA, VA, Ashburn - 29.00 - 52.00 USD hourly\u003cbr/\u003eUSA, VA, Chantilly - 29.00 - 52.00 USD hourly\u003cbr/\u003eUSA, VA, Dulles - 29.00 - 52.00 USD hourly\u003cbr/\u003eUSA, VA, Herndon - 29.00 - 52.00 USD hourly\u003cbr/\u003eUSA, VA, MANASSAS - 29.00 - 52.00 USD hourly\u003cbr/\u003eUSA, VA, Manassas - 29.00 - 52.00 USD hourly\u003cbr/\u003eUSA, VA, Sterling - 29.00 - 52.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"VA","title":"DCO Tech","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3167897/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language\u003cbr/\u003e- Experience building complex software systems that have been successfully delivered to customers","business_category":"advertising","city":"New York","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The Sponsored Products and Brands team at Amazon Ads is re-imagining the advertising landscape through cutting-edge generative AI technologies, revolutionizing how millions of customers discover products and engage with brands across Amazon.com and beyond. We are at the forefront of re-inventing advertising experiences, bridging human creativity with artificial intelligence to transform every aspect of the advertising lifecycle from ad creation and optimization to performance analysis and customer insights. We are a passionate group of innovators dedicated to developing responsible and intelligent AI technologies that balance the needs of advertisers, enhance the shopping experience, and strengthen the marketplace. If you're energized by solving complex challenges and pushing the boundaries of what's possible with AI, join us in shaping the future of advertising.\u003cbr/\u003e\u003cbr/\u003eWe are looking for a Machine Learning Engineer II  who can drive appropriate technology choices for the business, lead the way for continuous innovation, and shape the future of ad serving on Amazon search. You will build services to handle billions of requests per day, while maintaining response latency in milliseconds and meeting strict SLA requirements. It is quite routine for our systems to operate on massive datasets using distributed frameworks. You will design and code, troubleshoot, and support high volume and low latency distributed systems. The solutions you create would ensure relevant ads are served to Amazon's customers. You will directly impact our customers’ shopping experience while helping our sellers get the maximum ROI from advertising on Amazon. This role will provide exposure to cutting-edge innovations in product search, information retrieval, natural language processing (NLP), LLM training, deep learning, and image processing. In addition to being a strongly motivated IC, you will also be responsible for mentoring junior engineers and guiding them to deliver high impacting products and services for Amazon customers and sellers. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eJob Responsibilities: \u003cbr/\u003e\u003cbr/\u003e•\tDrive the direction of our technical solutions, and work on many different technologies such as deep learning, AWS, Auto ML, real-time ML serving systems.\u003cbr/\u003e•\tDesign, develop, and production software to support scalable offline machine-learning pipelines and online serving components.\u003cbr/\u003e•\tWork closely with applied scientists to optimize the performance of machine-learning models, improve the team’s machine learning productivity, and advance the technical foundation to empower our science innovation. What you create is also what you own.\u003cbr/\u003e","department_cost_center":null,"description_short":"The Sponsored Products and Brands team at Amazon Ads is re-imagining the advertising landscape through cutting-edge generative AI technologies, revolutionizing how millions of customers discover products","display_distance":null,"id":"4541875c-5175-4163-8c20-c76479806c51","id_icims":"3105222","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3105222/machine-learning-engineer-ii-sponsored-products-search-sourcing-amazon-advertising","job_schedule_type":"full-time","location":"US, NY, New York","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA40\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK19\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"New York, New York, USA","optional_search_labels":["advertising.team-software-development","amazon.artificial-intelligence"],"posted_date":"October  9, 2025","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- Experience in machine learning, data mining, information retrieval, statistics or natural language processing\u003cbr/\u003e- Experience with AI/ML technologies\u003cbr/\u003e- Experiences with LLM, prompt engineering\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $129,300/year in our lowest geographic market up to $223,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"advertising.team-amazon-ads","source_system":"JobCreator","state":"NY","title":"Machine Learning Engineer II,  Sponsored Products Search Sourcing, Amazon Advertising","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3105222/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-ads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of computer networking experience\u003cbr/\u003e- High school or equivalent diploma","business_category":"aws","city":"Herndon","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003eAmazon is looking for an Infrastructure Delivery Installation Technician to join our growing team within infrastructure operations. You will work with minimum supervision in a dynamic environment to drive the stability and sustainability of our next-generation networks and assist in the development of innovative ways to automate and scale our network.\u003cbr/\u003eTo be successful in this role you should possess technical aptitude, written and oral communications skills and the ability to deal effectively with people in a wide variety of situations. In addition, you must possess strong analytical skills with demonstrated problem solving ability. You will be able to leverage your experience exercising high levels of initiative, judgment, and diplomacy.\u003cbr/\u003eAdditionally, all candidates should be willing to work both independently and with a team. Work prioritization, organizational skills, effective communication, and the ability to react quickly are critical to being successful.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eAll physical requirements are expected with reasonable accommodations:\u003cbr/\u003e• Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds\u003cbr/\u003e• Ability to work in an environment that operates 24/7 with an ability to participate in primary responder rotation and provide after-hours support as needed\u003cbr/\u003e• Working in cramped and/or elevated and/or noisy environments\u003cbr/\u003e• Bending, lifting, stretching, reaching, standing and walking for up to 8+ hours a day\u003cbr/\u003e• Ascending and descending ladders, stairs, and gangways safely and without limitatio\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Moving and implementing large enterprise equipment\u003cbr/\u003e• Installing Fiber and Copper cabling and patching cabling between equipment\u003cbr/\u003e• Ensuring proper safety and security standards are maintained during cabling and rack installation,\u003cbr/\u003e• Following well established hardware installation procedures and break-fix activities\u003cbr/\u003e• Safely using material handling tools and equipment\u003cbr/\u003eTraveling within and outside of regional work area is required. You will be responsible for having a reliable personal vehicle and valid driver's license to travel within the regional work area, as company transportation will not be provided.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eCurrent Schedule: Monday - Friday, 8-hour shift Occasional weekend work required\u003cbr/\u003e\u003cbr/\u003eFuture Schedule Change: Transition to 10-hour shifts on either:\u003cbr/\u003eSunday - Wednesday OR\u003cbr/\u003eWednesday- Saturday \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"c3233007-02e0-4d9f-8bd7-ea9f375fedd4","id_icims":"3148575","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3148575/cable-installation-technician-infrastructure-delivery","job_schedule_type":"full-time","location":"US, VA, Herndon","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Herndon\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Herndon\",\"coordinates\":\"38.96973,-77.385\",\"normalizedCountyName\":\"Fairfax\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Herndon, Virginia, USA\",\"location\":\"US, VA, Herndon\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD28\"],\"normalizedCityName\":\"Herndon\"}"],"normalized_location":"Herndon, Virginia, USA","optional_search_labels":[],"posted_date":"December 23, 2025","preferred_qualifications":"- Knowledge of fiber optic and copper cabling standards, testing equipment and troubleshooting methodologies\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Herndon - 27.00 - 47.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"VA","title":"Cable Installation Technician,  Infrastructure Delivery","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3148575/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- 1+ year of experience in any of the following or similar technical or vocational roles: Computer Hardware Repair, Infrastructure Cabling, Network Deployment, Data Center Operations","business_category":"aws","city":"Sterling","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Transform network infrastructure by joining our dynamic team! You'll be at the forefront of developing innovative solutions that drive network stability and scalability, using your technical expertise to create automated systems that power global technological advancement. \u003cbr/\u003e \u003cbr/\u003eInfra Delivery Install Technicians will collaborate with cross-functional teams, troubleshoot complex technical scenarios, and implement strategic solutions that keep our network running seamlessly. Expect to engage in hands-on technical work that requires creativity, precision, and a passion for technological innovation. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Moving and implementing large enterprise equipment \u003cbr/\u003e- Installing Fiber and Copper cabling and patching cabling between equipment \u003cbr/\u003e- Ensuring proper safety and security standards are maintained during cabling and rack installation, \u003cbr/\u003e- Following well established hardware installation procedures and break-fix activities \u003cbr/\u003e- Safely using material handling tools and equipment \u003cbr/\u003e- Traveling within and outside of the regional work area is required. You will be responsible for having a reliable personal vehicle and valid driver's license to travel within the regional work area, as company transportation will not be provided \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e- Regularly lift and/or move up to 40 pounds; and participate in group lifts for 41+ pounds \u003cbr/\u003e- Ability to work in an environment that operates 24/7 with an ability to participate in primary responder rotation and provide after-hours support as needed \u003cbr/\u003e- Working in cramped and/or elevated and/or noisy environments \u003cbr/\u003e- Bending, lifting, stretching, reaching, standing and walking for up to 8+ hours a day \u003cbr/\u003e- Ascending and descending ladders, stairs, and gangways safely and without limitation \u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. ","department_cost_center":null,"description_short":"Transform network infrastructure by joining our dynamic team! You'll be at the forefront of developing innovative solutions that drive network stability and scalability, using your technical expertise","display_distance":null,"id":"eacffd47-0455-4dc0-9dbb-ccc40dd97238","id_icims":"3168727","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3168727/infra-delivery-install-technician","job_schedule_type":"full-time","location":"US, VA, Sterling","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sterling\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Sterling\",\"coordinates\":\"39.03336,-77.40713\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sterling, Virginia, USA\",\"location\":\"US, VA, Sterling\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD90\",\"IAD603\",\"IAD26\",\"IAD57\",\"IAD403\",\"IAD282\",\"IAD12\",\"IAD418\",\"IAD118\",\"IAD182\",\"IAD148\",\"IAD72\",\"IAD56\",\"IAD117\",\"IAD417\",\"IAD119\",\"IAD91\",\"IAD10\",\"IAD116\",\"IAD121\",\"IAD89\",\"IAD181\",\"IAD404\",\"IAD415\",\"IAD146\",\"IAD149\",\"IAD62\",\"IAD140\",\"IAD285\",\"IAD68\",\"IAD229\",\"IAD661\",\"IAD163\",\"IAD414\",\"IAD228\",\"IAD122\",\"IAD128\",\"IAD141\",\"IAD175\",\"IAD147\",\"IAD402\",\"IAD144\",\"IAD58\",\"WAS30\",\"IAD408\",\"IAD33\",\"IAD405\",\"IAD613\",\"IAD213\",\"IAD232\",\"IAD588\",\"IAD99\",\"IAD257\",\"IAD93\",\"IAD609\",\"DDC4\",\"IAD226\",\"IAD190\",\"IAD79\",\"IAD587\",\"IAD81\",\"IAD256\",\"IAD160\",\"IAD17\",\"IAD411\",\"IAD191\",\"IAD586\",\"IAD409\",\"IAD83\",\"IAD244\",\"IAD389\",\"IAD255\",\"IAD258\",\"IAD407\",\"IAD32\",\"IAD192\",\"IAD412\",\"IAD143\",\"IAD51\",\"IAD16\",\"BWI1\",\"IAD129\",\"IAD123\",\"OSU69\",\"IAD231\",\"IAD15\",\"IAD76\",\"IAD92\",\"IAD145\",\"IAD259\",\"IAD571\",\"IAD214\",\"IAD98\",\"IAD406\",\"IAD230\",\"IAD416\",\"IAD410\",\"IAD139\",\"IAD180\",\"IAD419\",\"IAD164\",\"IAD608\",\"IAD413\",\"IAD574\",\"IAD142\",\"IAD88\",\"IAD388\",\"IAD243\",\"IAD69\",\"IAD82\",\"IAD120\",\"IAD681\",\"IAD920\",\"IAD662\",\"IAD246\"],\"normalizedCityName\":\"Sterling\"}"],"normalized_location":"Sterling, Virginia, USA","optional_search_labels":[],"posted_date":"January 28, 2026","preferred_qualifications":"- Knowledge of network cabling, optic types, and test equipment\u003cbr/\u003e- Industry standard certifications (CompTIA, CCENT, Network+)\u003cbr/\u003e- Experience with cabling infrastructure best practices and methodologies\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Sterling - 27.00 - 47.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"VA","title":"Infra Delivery Install Technician","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3168727/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}