{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team","business_category":"aws","city":"Singapore","company_name":"Amazon Web Services Singapore Private Limited","country_code":"SGP","description":"The Generative AI Innovation Center at AWS empowers customers to harness state of the art AI technologies for transformative business opportunities. Our multidisciplinary team of strategists, scientists, engineers, and architects collaborates with customers across industries to fine-tune and deploy customized generative AI applications at scale. Additionally, we work closely with foundational model providers to optimize AI models for Amazon Silicon, enhancing performance and efficiency. As an SDE on our team, you will drive the development of custom Large Language Models (LLMs) across languages, domains, and modalities. You will be responsible for fine-tuning state-of-the-art LLMs for diverse use cases while optimizing models for high-performance deployment on AWS’s custom AI accelerators. This role offers an opportunity to innovate at the forefront of AI, tackling end-to-end LLM training pipelines at massive scale and delivering next-generation AI solutions for top AWS clients. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Large-Scale Training Pipelines: Design and implement distributed training pipelines for LLMs using tools such as Fully Sharded Data Parallel (FSDP) and DeepSpeed, ensuring scalability and efficiency \u003cbr/\u003e* LLM Customization \u0026 Fine-Tuning: Adapt LLMs for new languages, domains, and vision applications through continued pre-training, fine-tuning, and Reinforcement Learning with Human Feedback (RLHF) \u003cbr/\u003e* Model Optimization on AWS Silicon: Optimize AI models for deployment on AWS Inferentia and Trainium, leveraging the AWS Neuron SDK and developing custom kernels for enhanced performance \u003cbr/\u003e* Customer Collaboration: Interact with enterprise customers and foundational model providers to understand their business and technical challenges, co-developing tailored generative AI solutions\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.","department_cost_center":null,"description_short":"The Generative AI Innovation Center at AWS empowers customers to harness state of the art AI technologies for transformative business opportunities. Our multidisciplinary team of strategists, scientists,","display_distance":null,"id":"7d14ae49-d39e-4816-beef-b8e596b6590e","id_icims":"3170278","is_intern":null,"is_manager":null,"job_category":"Data Science","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3170278/senior-machine-learning-engineer-generative-ai-innovation-center","job_schedule_type":"full-time","location":"SG, Singapore","locations":["{\"normalizedCountryCode\":\"SGP\",\"city\":\"Singapore\",\"countryIso3a\":\"SGP\",\"countryIso2a\":\"SG\",\"locationNonStemming\":\"Singapore, Singapore\",\"coordinates\":\"1.29087,103.85238\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Singapore\",\"normalizedLocation\":\"SGP\",\"location\":\"SG, Singapore\",\"region\":\"\",\"buildingCodeList\":[\"SIN18\"]}"],"normalized_location":"SGP","optional_search_labels":["aws-team-global-services-optional","aws.team-generative-ai"],"posted_date":"January 30, 2026","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-pro-serv","source_system":"JobCreator","state":null,"title":"Senior Machine Learning Engineer, Generative AI Innovation Center","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3170278/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-pro-serv","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of technical product or program management experience\u003cbr/\u003e- 3+ years of project management disciplines including scope, schedule, budget, quality, along with risk and critical path management experience\u003cbr/\u003e- Experience managing programs across cross functional teams, building processes and coordinating release schedules\u003cbr/\u003e- Bachelor's degree in engineering, computer science or equivalent","business_category":"aws","city":"Seattle","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Data Center Capacity Delivery (DCCD) is looking for a Technical Program Manager to develop and own a Smartsheet-based solution to support the global DCCD organization. Responsibilities include establishing the product roadmap, tool development, and ongoing maintenance. In addition to these responsibilities, this role also has program management duties such as inventing and simplifying processes, managing program communications, onboarding and training users, and establishing training and program related documentation.\u003cbr/\u003e\u003cbr/\u003eThis Technical Program Manager will need to be detailed, flexible, and take strong ownership of a global user base, including system functionality and process implementation. The successful candidate will be obsessed with internal and external system user groups, responsible for scoping and driving implementation of system functionality to the global team. They will be able to work independently to prioritize, craft, and execute deliverable as well as effectively work with partner teams that impact their primary user group.\u003cbr/\u003e\u003cbr/\u003eThis role will sit within Data Center Capacity Delivery; however, they will be part of a larger organization that is diverse, positive, exceptionally talented, driven and responsible for the design, construction and operation of industry leading data center facilities. They will need to excel at managing multiple priorities and learning the pain points of their primary users, being able to execute system implementation effectively across subject matter experts with a broad range of disciplines and/or cultural or regional differences. The ideal candidate operates effectively in an ambiguous environment and drives structure without constraining business objectives. They have a demonstrated track record of managing multiple projects and driving them to completion. Because the person in this role will influence global team members, they will also need to be highly collaborative and able to influence without authority while also being able to work with significant autonomy.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services (AIS)\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Data Center Capacity Delivery (DCCD) is looking for a Technical Program Manager to develop and own a Smartsheet-based solution to support the global DCCD organization. Responsibilities include establishing","display_distance":null,"id":"dd875253-086b-463c-ba6a-3b5ae183394c","id_icims":"3167721","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Technical Program Management","job_function_id":null,"job_path":"/en/jobs/3167721/technical-program-manager-data-center-construction-tooling-data-center-capacity-delivery","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA84\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"January 27, 2026","preferred_qualifications":"- 3+ years of working directly with engineering teams experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 127,100.00 - 172,000.00 USD annually","primary_search_label":"aws.team-no-matching-primary-label-listed","source_system":"JobCreator","state":"WA","title":"Technical Program Manager, Data Center Construction Tooling, Data Center Capacity Delivery ","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3167721/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-no-matching-primary-label-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of product or program management, product marketing, business development or technology experience\u003cbr/\u003e- Experience with feature delivery and tradeoffs of a product\u003cbr/\u003e- Experience as a product manager or owner\u003cbr/\u003e- Bachelor's degree or equivalent\u003cbr/\u003e- Experience building and maintaining Smartsheet-based solutions","business_category":"aws","city":"Seattle","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Data Center Capacity Delivery (DCCD) is looking for a Systems Administrator to develop and own a Smartsheet-based solution to support the global DCCD organization. Responsibilities include establishing the product roadmap, tool development, and ongoing maintenance. In addition to these responsibilities, this role also has program management duties such as inventing and simplifying processes, managing program communications, onboarding and training users, and establishing training and program related documentation.\u003cbr/\u003e\u003cbr/\u003eThis Systems Administrator will need to be detailed, flexible, and take strong ownership of a global user base, including system functionality and process implementation. The successful candidate will be obsessed with internal and external system user groups, responsible for scoping and driving implementation of system functionality to the global team. They will be able to work independently to prioritize, craft, and execute deliverable as well as effectively work with partner teams that impact their primary user group.\u003cbr/\u003e\u003cbr/\u003eThis role will sit within Data Center Capacity Delivery; however, they will be part of a larger organization that is diverse, positive, exceptionally talented, driven and responsible for the design, construction and operation of industry leading data center facilities. They will need to excel at managing multiple priorities and learning the pain points of their primary users, being able to execute system implementation effectively across subject matter experts with a broad range of disciplines and/or cultural or regional differences. The ideal candidate operates effectively in an ambiguous environment and drives structure without constraining business objectives. They have a demonstrated track record of managing multiple projects and driving them to completion. Because the person in this role will influence global team members, they will also need to be highly collaborative and able to influence without authority while also being able to work with significant autonomy.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services (AIS)\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e\u003cbr/\u003e#DCCD_AMER","department_cost_center":null,"description_short":"AWS Data Center Capacity Delivery (DCCD) is looking for a Systems Administrator to develop and own a Smartsheet-based solution to support the global DCCD organization. Responsibilities include establishing","display_distance":null,"id":"cd01fd7f-507b-47ef-895f-2961d96b8c6e","id_icims":"3167714","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"System Planning/Administration","job_function_id":null,"job_path":"/en/jobs/3167714/system-admin-data-center-construction-tooling-data-center-capacity-delivery","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA84\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["aws.team-ais","aws.team-dcpd-optional"],"posted_date":"January 27, 2026","preferred_qualifications":"- Experience owning/driving roadmap strategy and definition\u003cbr/\u003e- Experience with end to end product delivery\u003cbr/\u003e- Experience managing technical products or online services\u003cbr/\u003e- Experience in influencing senior leadership through data driven insights\u003cbr/\u003e- Experience working across functional teams and senior stakeholders\u003cbr/\u003e- Master's degree\u003cbr/\u003e- Knowledge of key customer experience metrics and methodology (e.g., NPS)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 80,200.00 - 111,100.00 USD annually","primary_search_label":"aws.team-no-matching-primary-label-listed","source_system":"JobCreator","state":"WA","title":"System Admin, Data Center Construction Tooling, Data Center Capacity Delivery ","university_job":null,"updated_time":"22 minutes","url_next_step":"https://account.amazon.com/jobs/3167714/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-no-matching-primary-label-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Fairless Hills","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability \u003cbr/\u003e• Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS) \u003cbr/\u003e• Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA) \u003cbr/\u003e• Perform rack installs and rack decommissioning within internal SLA \u003cbr/\u003e• Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment \u003cbr/\u003e• Technical writing to support change management program \u003cbr/\u003e• Monitor daily work requests and manage to resolution, and execute projects from conception to completion \u003cbr/\u003e• On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation \u003cbr/\u003e• Work schedule changes depending on specific site needs. Shifts can be up to 12 hours and may rotate on a predefined schedule. Some locations have on-call rotations. \u003cbr/\u003e• Role may support more than one location/site. \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e• Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodations: \u003cbr/\u003e• Regularly lift and/or move up to 39 pounds independently \u003cbr/\u003e• Participate in group lifts for 40+ pounds \u003cbr/\u003e• Maintain balance and perform construction tasks while on a ladder \u003cbr/\u003e• Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position \u003cbr/\u003e• Work in an environment requiring provided ear protection \u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e• Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e• Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e• Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"8e61d82b-a369-448c-8fff-db1e30cde9c9","id_icims":"3165368","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3165368/data-center-engineering-operations-technician","job_schedule_type":"full-time","location":"US, PA, Fairless Hills","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Fairless Hills\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Fairless Hills\",\"coordinates\":\"40.17334,-74.85369\",\"normalizedCountyName\":\"Bucks\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Fairless Hills, Pennsylvania, USA\",\"location\":\"US, PA, Fairless Hills\",\"region\":\"PA\",\"buildingCodeList\":[\"PNE101\"],\"normalizedCityName\":\"Fairless Hills\"}"],"normalized_location":"Fairless Hills, Pennsylvania, USA","optional_search_labels":[],"posted_date":"January 27, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Technical (Military/Trade School) training\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, PA, Fairless Hills - 32.00 - 57.00 USD hourly","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"PA","title":"Data Center Engineering Operations Technician","university_job":null,"updated_time":"24 minutes","url_next_step":"https://account.amazon.com/jobs/3165368/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of data engineering experience\u003cbr/\u003e- Experience with data modeling, warehousing and building ETL pipelines","business_category":"aws","city":"Bellevue","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e \u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eWe are looking for a talented Data Engineer to join the Manufacturing Operations, Transportation Operations, and Reverse (MOTOR) organization in support of our Supply Chain Intelligence team. MOTOR manages the manufacturing of datacenter racks and the movement of racks/parts through the supply chain, consisting of transportation, warehousing, and reverse logistics into and out of the data centers. This role performs helps connect the different systems across the supply chain together so operational teams have clean, actionable data to work with. This requires someone with strong analytic skills and business acumen who can work with stakeholders on strategic projects across MOTOR.  \u003cbr/\u003e\u003cbr/\u003eThe ideal candidate relishes working with large volumes of data, enjoys the challenge of highly complex technical contexts, and, above all else, is passionate about data and analytics. Must be an expert working with data modeling with un/structured data, ingestion pipelines and ETL design and business intelligence tools with the business to identify strategic opportunities where improvements in data infrastructure creates out-sized business impact. Candidate is a self-starter, comfortable with ambiguity, able to think big (while paying careful attention to detail), mentors other engineers in team on high quality tech, and enjoys working in a fast-paced team. Candidate will have a chance to architect the data pipelines needed for optimization and predictive analysis. We're excited to talk to those up to the challenge!\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Build and maintain the infrastructure to answer questions with data, using software engineering best practices, data management fundamentals, data storage principles, recent advances in distributed systems, and operational excellence best practices. Build datasets that analysts and scientists use to generate actionable insights.\u003cbr/\u003e- Define the data engineering processes that leverage various AWS services to improve accessibility, redundancy, data integrity, cost, and storage requirements.\u003cbr/\u003e- Develop high quality solutions for the faster development of the products/models that solve the business needs in a scalable format, while also anticipating future requirements.\u003cbr/\u003e- Collaborate with Research/Applied Scientists, Data Engineers, Business Intelligence Engineers, Data Scientists, Business Analysts, and Product/Program Managers to understand the business and technical requirements, and make decisions that help make the products/programs smoother.\u003cbr/\u003e - Interface with other technology/data engineering teams to extract, transform, and load data from a wide variety of data sources using and AWS data technologies.\u003cbr/\u003e- Lead the technical design and implementation of the data infrastructure.\u003cbr/\u003e- Design and manage data audit, quality, and reconciliation processes in collaboration with various stakeholders.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThis team provides data engineering and business intelligence engineering services to the rest of MOTOR. We are the data experts behind the scenes helping the operational teams focus on operations by ensuring they have accurate, timely data and provide business insights to help improve operational excellence.\u003cbr/\u003e\u003cbr/\u003e*Why AWS*\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003e*Diverse Experiences*\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003e*Work/Life Balance*\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003e*Inclusive Team Culture*\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003e*Mentorship and Career Growth*\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"aa42af1a-bdf7-4428-99a2-e8e05f607a68","id_icims":"3187071","is_intern":null,"is_manager":null,"job_category":"Business Intelligence","job_family":"Data Engineering","job_function_id":null,"job_path":"/en/jobs/3187071/data-engineer-aws-infrastructure-supply-chain-intelligence","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA112\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":["aws.team-ais","aws.team-supply-chain"],"posted_date":"February 23, 2026","preferred_qualifications":"- Experience with AWS technologies like Redshift, S3, AWS Glue, EMR, Kinesis, FireHose, Lambda, and IAM roles and permissions\u003cbr/\u003e- Experience with non-relational databases / data stores (object storage, document or key-value stores, graph databases, column-family databases)\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Arlington - 132,100.00 - 178,800.00 USD annually\u003cbr/\u003eUSA, WA, Bellevue - 132,100.00 - 178,800.00 USD annually","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"WA","title":"Data Engineer , AWS Infrastructure Supply Chain Intelligence","university_job":null,"updated_time":"24 minutes","url_next_step":"https://account.amazon.com/jobs/3187071/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1)10+2 or Bachelor’s degree 2)12-24 months of work experience. 3)Good communication skills - Trans Ops Representative will be facilitating flow of information between external 4)Proficiency in Excel (pivot tables, vlookups) 5)Demonstrated ability to work in a team in a very dynamic environment","business_category":"transportation-and-logistics","city":"Na - Virtual","company_name":"ASSPL - Andhra Pradesh - E88","country_code":"IND","description":"Job Description for Transportation Representative – NOC\u003cbr/\u003eNOC Overview\u003cbr/\u003e\u003cbr/\u003eNOC (Network Operation Center) is the central command and control center for ‘Transportation Execution’ across the Amazon Supply Chain network supporting multiple geographies like NA, India and EU. It ensures hassle free, timely pick-up and delivery of freight from vendors to Amazon fulfillment centers (FC) and from Amazon FCs to carrier hubs. In case of any exceptions, NOC steps in to resolve the issue and keeps all the stakeholders informed on the proceedings. Along with this tactical problem solving NOC is also charged with understanding trends in network exceptions and then automating processes or proposing process changes to streamline operations. This second aspect involves network monitoring and significant analysis of network data.\u003cbr/\u003eOverall, NOC plays a critical role in ensuring the smooth functioning of Amazon transportation and thereby has a direct impact on Amazon’s ability to serve its customers on time.\u003cbr/\u003e\u003cbr/\u003ePurview of a Trans Ops Representative:\u003cbr/\u003eA Trans Ops Representative at NOC facilitates flow of information between different stakeholders (Trans Carriers/Hubs/Warehouses) and resolves any potential issues that impacts customer experience and business continuity. Trans Ops Specialist at NOC works across two verticals – Inbound and Outbound operations.\u003cbr/\u003eInbound Operations deals with Vendor/Carrier/FC relationship, ensuring that the freight is picked-up on time and is delivered at FC as per the given appointment. Trans Ops Specialist on Inbound addresses any potential issues occurring during the lifecycle of pick-up to delivery.\u003cbr/\u003eOutbound Operations deals with FC/Carrier/Carrier Hub relationship, ensuring that the truck leaves the FC in order to delivery customer orders as per promise. Trans Ops Specialist on Outbound addresses any potential issues occurring during the lifecycle of freight leaving the FC and reaching customer premises.\u003cbr/\u003e\u003cbr/\u003eA Trans Ops Representative provides timely resolution to the issue in hand by researching and querying internal tools and by taking real-time decisions. An ideal candidate should be able to understand the requirements/be able to analyze data and notice trends and be able to drive Customer Experience without compromising on time. The candidate should have the basic understanding of Logistics and should be able to communicate clearly in the written and oral form. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eTrans Ops Representative should be able to ideate process improvements and should have the zeal to drive them to conclusion.\u003cbr/\u003eResponsibilities include, but are not limited to:\u003cbr/\u003e\u003cbr/\u003e· Communication with external customers (Carriers, Vendors/Suppliers) and internal customers (Retail, Finance, Software Support, Fulfillment Centers)\u003cbr/\u003e· Must be able to systematically escalate problems or variance in the information and data to the relevant owners and teams and follow through on the resolutions to ensure they are delivered.\u003cbr/\u003e· Excellent communication, both verbal and written as one may be required to create a narrative outlining weekly findings and the variances to goals, and present these finding in a review forum.\u003cbr/\u003e\u003cbr/\u003e    Providing real-time customer experience by working in 24*7 operating environment.","department_cost_center":null,"description_short":"Job Description for Transportation Representative – NOCNOC OverviewNOC (Network Operation Center) is the central command and control center for ‘Transportation Execution’ across the Amazon Supply Chain","display_distance":null,"id":"4530deee-14e9-4266-be80-47ba6c8a72fa","id_icims":"3183590","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Cust. Experience Qualit Ops","job_function_id":null,"job_path":"/en/jobs/3183590/transportation-representative-amazonnowco-row-apex","job_schedule_type":"full-time","location":"IN, AP, Na - Virtual","locations":["{\"normalizedStateName\":\"Andhra Pradesh\",\"normalizedCountryCode\":\"IND\",\"city\":\"Na - Virtual\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, AP, Na - Virtual\",\"coordinates\":\"16.57011,80.35992\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Andhra Pradesh, IND\",\"location\":\"IN, AP, Na - Virtual\",\"region\":\"AP\",\"buildingCodeList\":[\"VCCAPIND\"]}"],"normalized_location":"Andhra Pradesh, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"February 18, 2026","preferred_qualifications":"- Graduate with Bachelor’s degree Good logical skills Good communication skills - Trans Ops Representative will be facilitating flow of information between different teams Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e- Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-supply-chain","source_system":"JobCreator","state":"AP","title":"Transportation Representative, AmazonNowCO, RoW APEX ","university_job":null,"updated_time":"41 minutes","url_next_step":"https://account.amazon.com/jobs/3183590/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-supply-chain","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Valid and active driver's license\u003cbr/\u003e- 1+ years of computer hardware experience, including troubleshooting and repairing experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"aws","city":"Melbourne","company_name":"Amazon Corporate Services Pty Ltd","country_code":"AUS","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eTo be eligible for this role you will need to hold or be able to obtain an Australian Government Security Vetting Agency clearance. See link for specific details of suitability (https://www.agsva.gov.au/applicants/eligibility-and-suitability). \u003cbr/\u003e\u003cbr/\u003eThe Infrastructure Operations team is looking for Data Centre Technicians to join our expanding Infrastructure Operations team. Data Centre Technicians are the primary resolver, troubleshooter, and solve a range of data centre infrastructure issues including, but not limited to: hardware, fiber, networking, and related problems.\u003cbr/\u003e\u003cbr/\u003eIf you like to use IT principles like computer architecture and the Open Systems Interconnection Model (OSI model) and apply them to finding solutions to problems, we’d like to meet you. Your work will help to maintain one of the world's largest information system infrastructures.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eYou will be required to engage in physical data centre activities with or without reasonable accommodation. This includes all tasks associated with planning and tracking capacity, rack deployment, rack cabling, hardware and software troubleshooting, and rack decommissioning. Some of the key responsibilities you will undertake are:\u003cbr/\u003e\u003cbr/\u003eProblem Solving:\u003cbr/\u003e- Maintain a high level of system reliability by prioritising and resolving trouble tickets efficiently\u003cbr/\u003e- Escalation point and technical troubleshooter for all Systems and problems\u003cbr/\u003e- Deep diving into Linux server issues\u003cbr/\u003e\u003cbr/\u003eTechnical:\u003cbr/\u003e- Troubleshoot technical issues on various platforms ranging from Systems through to Power/Mechanical\u003cbr/\u003e- Remediation of physical layer outages, both Systems \u0026 Network\u003cbr/\u003e- Remediation or recovery of physical power issues on racks\u003cbr/\u003e- Participate in Data centre power \u0026 cooling events\u003cbr/\u003e\u003cbr/\u003eOperations:\u003cbr/\u003e- Meet 24x7 On-Call requirements and response during shift rotations.\u003cbr/\u003e- Install \u0026 configure racks of hosts in line with internal SLAs\u003cbr/\u003e- Triage \u0026 resolve trouble tickets for all devices in your region\u003cbr/\u003e- Data centre point of contact for all High Severity issues\u003cbr/\u003e- Physical replacement of server and network device parts\u003cbr/\u003e- Ensure correct rotation of parts \u0026 spares\u003cbr/\u003e- Help define metrics to increase our customer uptime\u003cbr/\u003e- Enforcing Amazons Security Best Practices\u003cbr/\u003e- Interact with third party vendors \u0026 contractors\u003cbr/\u003e- Contribute ideas to improve operational efficiency\u003cbr/\u003e\u003cbr/\u003eProject Management:\u003cbr/\u003e- Participate in and deliver on a number of high impact small to mid-scale projects\u003cbr/\u003e- Participate in team meetings for metric analysis and project status updates\u003cbr/\u003e- Help build the world’s largest Cloud infrastructure\u003cbr/\u003e\u003cbr/\u003eHiring \u0026 Mentoring:\u003cbr/\u003e- Contribute towards building a great team by getting involved in the Amazon hiring process/candidate interviews\u003cbr/\u003e- Share knowledge and help educate less technical staff on the best practices related to all service owner issues\u003cbr/\u003e\u003cbr/\u003eThis position also has a physical component requiring the ability to lift \u0026 rack equipment up to 20 kg; it may require working in cramped spaces or in elevated locations while adhering to health \u0026 safety guidelines. This role involves covering 24x7 shift rotation.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe are experiencing rapid growth, therefore your onboarding will be dynamic in nature, where you will gain diverse experience working in new and established AWS data centre's. These future Amazonians will rotate through various AWS locations to complete training as part of their onboarding to prepare for deployment in a data centre region. This training will be completed over a duration of 6-12 months. Once training is completed, individuals will be relocated to the permanent location.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"c838bc1a-8cd9-4c0b-b5e5-06ca5d48dfca","id_icims":"3167113","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3167113/data-centre-operations-technician","job_schedule_type":"full-time","location":"AU, VIC, Melbourne","locations":["{\"normalizedStateName\":\"Victoria\",\"normalizedCountryCode\":\"AUS\",\"city\":\"Melbourne\",\"countryIso3a\":\"AUS\",\"countryIso2a\":\"AU\",\"locationNonStemming\":\"Australia, VIC, Melbourne\",\"coordinates\":\"-37.81736,144.96755\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Australia\",\"normalizedLocation\":\"Melbourne, Victoria, AUS\",\"location\":\"AU, VIC, Melbourne\",\"region\":\"VIC\",\"buildingCodeList\":[\"MEL12\"],\"normalizedCityName\":\"Melbourne\"}"],"normalized_location":"Melbourne, Victoria, AUS","optional_search_labels":["aws.adc-australia"],"posted_date":"January 27, 2026","preferred_qualifications":"- Experience in a data center or other critical environment\u003cbr/\u003e\u003cbr/\u003eAcknowledgement of country:\u003cbr/\u003eIn the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.\u003cbr/\u003e\u003cbr/\u003eIDE statement:\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-support","source_system":"JobCreator","state":"VIC","title":"Data Centre Operations Technician ","university_job":null,"updated_time":"41 minutes","url_next_step":"https://account.amazon.com/jobs/3167113/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of Microsoft Office products and applications experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- Bachelors degree in Safety related field or a Cert IV in WHS.","business_category":"operations-team","city":"Dandenong South","company_name":"Amazon Commercial Services Pty Ltd","country_code":"AUS","description":"We currently have a vacancy for a Day Shift Workplace Health and Safety (WHS) Coordinator to join the Amazon Australia Team. This position is within the Fulfilment Center (FC), reporting into the MEL1 WHS Manager. It requires working with the WHS team to deliver high standards of safety within our FC. \u003cbr/\u003eThe suitable applicant will be trained in both the standard work and tools used within the WHS function. You will be a strong communicator, who values teamwork, is proactive about safety and who can function as a role model and engage in a professional manner with the entire FC workforce. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e - Identify and inform management of compliance issues, safety risks, and improvement opportunities through the conduct of daily, weekly, and monthly audits \u003cbr/\u003e -   Facilitate incident investigation process \u003cbr/\u003e -  Maintain required paperwork to comply with Amazon and local regulations \u003cbr/\u003e -   Enter Safety Incident Information in internal database in a timely manner \u003cbr/\u003e - Perform safety observations \u0026 audits \u003cbr/\u003e - Coach others (Area Managers etc.) to complete their safety responsibilities (Audits, Follow Safety Rules, Inspections etc.)  \u003cbr/\u003e - May have additional responsibility for fire prevention, hazardous waste management, or other safety related activities depending on the business unit and location \u003cbr/\u003e - Participate in process improvement activities and manage actions to completion\u003cbr/\u003e\u003cbr/\u003e*This is an hourly role based on shift patterns:\u003cbr/\u003eThis shift pattern is Wednesday to Saturday - 7.30am to 5.30pm\u003cbr/\u003eMust be willing to rotate shifts based on business need. ","department_cost_center":null,"description_short":"We currently have a vacancy for a Day Shift Workplace Health and Safety (WHS) Coordinator to join the Amazon Australia Team. This position is within the Fulfilment Center (FC), reporting into the MEL1","display_distance":null,"id":"7b5dcd50-ad5c-4152-ab43-619a95fe92c2","id_icims":"3187665","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3187665/whs-coordinator-workplace-health-and-safety","job_schedule_type":"full-time","location":"AU, VIC, Dandenong South","locations":["{\"normalizedStateName\":\"Victoria\",\"normalizedCountryCode\":\"AUS\",\"city\":\"Dandenong South\",\"countryIso3a\":\"AUS\",\"countryIso2a\":\"AU\",\"locationNonStemming\":\"Australia, VIC, Dandenong South\",\"coordinates\":\"-38.0124,145.20594\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Australia\",\"normalizedLocation\":\"Melbourne, Victoria, AUS\",\"location\":\"AU, VIC, Dandenong South\",\"region\":\"VIC\",\"buildingCodeList\":[\"MEL1\"],\"normalizedCityName\":\"Melbourne\"}"],"normalized_location":"Melbourne, Victoria, AUS","optional_search_labels":["stores.lander-australia","international-stores.australia-whs"],"posted_date":"February 24, 2026","preferred_qualifications":"- Work 40 hours/week, and overtime as required\u003cbr/\u003e- Experience with data analysis\u003cbr/\u003e- Experience in logistics\u003cbr/\u003e\u003cbr/\u003eAcknowledgement of country:\u003cbr/\u003eIn the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.\u003cbr/\u003e\u003cbr/\u003eIDE statement:\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"operations-team.transportation-operations-management","source_system":"JobCreator","state":"VIC","title":"WHS Coordinator, Workplace Health and Safety","university_job":null,"updated_time":"42 minutes","url_next_step":"https://account.amazon.com/jobs/3187665/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"transportation-operations-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in accounting and commerce (B. Com)\u003cbr/\u003e- Knowledge of Excel at an advanced level\u003cbr/\u003e- Experience with Microsoft Office products and applications","business_category":"finance","city":"Hyderabad","company_name":"ADCI HYD 13 SEZ","country_code":"IND","description":"The ideal candidate will be experienced in finance role with an understanding of finance operations and will have experience in relationship management. He/she will have problem solving skills with the focus on improving the processes and strengthening the relationships with the vendors. The candidate will have action-driven approach and will require to work proactively on issues on vendor’s account while identifying areas of improvement.\u003cbr/\u003e\u003cbr/\u003eResponsibilities include, but are not limited to: \u003cbr/\u003e\u003cbr/\u003e•\tWorking on Complex vendor queries and resolving the queries in a time bound manner\u003cbr/\u003e•\tWorking on underlying issues and fixing the root causes\u003cbr/\u003e•\tLiaising with internal teams to understand vendor issue and working towards resolution \u003cbr/\u003e•\tContacting internal stakeholders and coordinating with them on vendor queries\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role is dedicated to working on vendor queries related to Accounts Payable and Accounts Receivable. The team member needs to review all details of vendor accounts and dive deep to understand the root cause of issues. They will work with multiple internal teams to resolve problems and develop steps to prevent similar issues from arising in the future. The role also involves working closely with vendors, educating them on Amazon's financial processes and how best to utilize Amazon's services. This position requires making calls to vendors in accordance with their time zones and communicating via written emails","department_cost_center":null,"description_short":"The ideal candidate will be experienced in finance role with an understanding of finance operations and will have experience in relationship management. He/she will have problem solving skills with the","display_distance":null,"id":"47f40439-aad8-4d39-af9b-3e504792e4e0","id_icims":"3187720","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/Planning","job_function_id":null,"job_path":"/en/jobs/3187720/sr-finops-analyst","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD13\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":[],"posted_date":"February 24, 2026","preferred_qualifications":"- Advanced Excel skills are advantageous\u003cbr/\u003e- Knowledge of Oracle Financial Application (OFA) experience is preferred\u003cbr/\u003e- Knowledge around supplier/vendor payment queries will be preferred\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-accounting","source_system":"JobCreator","state":"TS","title":"Sr. FinOps Analyst ","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3187720/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-accounting","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in logistics\u003cbr/\u003e- Knowledge of city topography and road network\u003cbr/\u003e- Speak, write, and read fluently in English","business_category":"fulfillment-ops","city":"Giza","company_name":"Souq.com for E-Commerce LLC","country_code":"EGY","description":"We are looking for a continuous improvement junior specialist which is a role referred to internally as ACES Specialist, to drive cost and efficiency charter within Amazon logistics and transportation services.\u003cbr/\u003eAs an ACES (Amazon Customer Excellence Systems) Specialist, you will drive process standardization in Egypt last mile logistics operations. As a member of the ACES team itself, you will contribute to the optimization of the delivery stations, first mile stations, line haul operations while providing operations team with sufficient knowledge and appropriate tools to improve performance.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs a primary contact for delivery station management regarding process improvements and efficiency programs, you will support monitoring the logistics and delivery success through in-station and on-road performance indicators. You will set up actions plans and execute them to drive current performance to benchmark results.\u003cbr/\u003e\u003cbr/\u003eYou will work towards improving OTR (on the road), UTR (under the roof), Linehaul performance, mainly productivity metrics like shipments per route, truck utilization, throughput per hour, process path rates, deliveries per paid hour etc.\u003cbr/\u003e \u003cbr/\u003eAdditionally, you will be contributing to deployment of process standards and upgrades within the delivery station partnering with station management and several stakeholders.\u003cbr/\u003e\u003cbr/\u003eThis role will be based in the delivery stations. You will be required to work in non-traditional shift patterns which include night.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eYou will be joining ACES EG cost and productivity team, focusing on EG productivity improvement agenda.","department_cost_center":null,"description_short":"We are looking for a continuous improvement junior specialist which is a role referred to internally as ACES Specialist, to drive cost and efficiency charter within Amazon logistics and transportation","display_distance":null,"id":"4089e974-8872-4e7d-b534-a451ac563735","id_icims":"3184795","is_intern":null,"is_manager":null,"job_category":"Fulfillment Associate","job_family":"Administrative Support","job_function_id":null,"job_path":"/en/jobs/3184795/aces-specialist-amzl-trans","job_schedule_type":"full-time","location":"EG, Giza","locations":["{\"normalizedCountryCode\":\"EGY\",\"city\":\"Giza\",\"countryIso3a\":\"EGY\",\"countryIso2a\":\"EG\",\"locationNonStemming\":\"Egypt, Giza\",\"coordinates\":\"30.00957,31.21381\",\"normalizedCountyName\":\"Giza\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Egypt\",\"normalizedLocation\":\"Giza, EGY\",\"location\":\"EG, Giza\",\"region\":\"\",\"buildingCodeList\":[\"DGI7\"],\"normalizedCityName\":\"Giza\"}"],"normalized_location":"Giza, EGY","optional_search_labels":[],"posted_date":"February 19, 2026","preferred_qualifications":"- 1+ years of manufacturing or customer-facing environment experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-global-specialty-fulfillment","source_system":"JobCreator","state":null,"title":"ACES Specialist, AMZL Trans","university_job":null,"updated_time":"about 1 hour","url_next_step":"https://account.amazon.com/jobs/3184795/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-specialty-fulfillment","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}