{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 3+ years of team management experience\u003cbr/\u003e- Experience using data to influence business decisions\u003cbr/\u003e- 2+ years of operational and/or retail management experience","business_category":"customer-trust-and-partner-support","city":"Hyderabad","company_name":"ADCI HYD 20 SEZ - H94","country_code":"IND","description":"Manager of manager’s role\u003cbr/\u003e\u003cbr/\u003eIn charge of managing multiple entry level managers. This would consist of one or more teams of Investigation specialists (~60-65 headcount) who investigate buyer or seller transactions on Amazon platforms and take appropriate actions based on processes, tools and high-judgment decisions.\u003cbr/\u003e\u003cbr/\u003eAs a people manager, provide leadership and administrative support to their team(s) and manage them to focus on the people development of their team, minimize the impact of bad debt by meeting decision quality targets, constantly meet/exceed service levels based on capacity and team delivery, execute road mapped projects with various stakeholders.\u003cbr/\u003e\u003cbr/\u003eIn addition to being responsible for achieving and exceeding team’s defined metrics through rigorous performance management, she/he will be expected to participate in strategic planning, project road mapping activities of the team\u003cbr/\u003e\u003cbr/\u003eThe key to success in this role is the ability to understand the SPS vision and make independent decisions with sound judgment to manage their teams to attain that vision.\u003cbr/\u003e\u003cbr/\u003eThe incumbent is required to demonstrate performance in all the metric assigned and over and beyond\u003cbr/\u003e\u003cbr/\u003eMetrics, by consistently leading the group of managers to meet the goals aligned to bad debt reduction, improved customer experience and meet service levels as per targets. Will also be accountable to represent the performance of his entire team/sub-function at various platforms worldwide. The candidate would need be able to dive deep on metrics and facilitate the solutions.\u003cbr/\u003eWill be responsible for ensuring that the team delivers as per plan, and will actively work with various teams to on board resources for the team.\u003cbr/\u003e\u003cbr/\u003eProcess Improvement, by delivering significant Business impacts and contributions to their company through improvement to quality, productivity, or customer experience. Work with various stakeholders within and outside SPS to ensure feature prioritization and delivery of process level improvements. The candidate will have to enable his team to deliver on improvements. Consistently demonstrates timely delivery of projects on roadmap to support the team and department vision\u003cbr/\u003e\u003cbr/\u003ePeople Development, by developing the career and skills of their Managers and Investigator teams through continuous closure of performance feedback loops. Is expected to setup governance mechanisms on people processes. The manager would be responsible for engaging people, identifying training needs within his teams and accordingly upskill. Responsible for creation of a roadmap based on improvement areas and career aspirations and track adherence. Should work towards creating a succession plan within his team.\u003cbr/\u003eShould be able to hire the best for his teams and for Amazon as well and be able to act as a mentor.\u003cbr/\u003e\u003cbr/\u003eNetworking, the candidate also needs to communicate with multiple stakeholders within the organization - the peer group as well support functions to ensure smooth delivery of the processes being handled. Keep abreast of trends and fraud issues impacting the retail industry. Ensure that Amazon is leading the curve in identifying and preventing new fraud attacks.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e1. The candidate would need be able to dive deep on metrics and facilitate the solutions\u003cbr/\u003e2. The candidate will have to enable his team to deliver on improvements\u003cbr/\u003e3. Timely delivery of projects on roadmap\u003cbr/\u003e4. People development\u003cbr/\u003e5. Communicate with multiple stakeholder ","department_cost_center":null,"description_short":"Manager of manager’s roleIn charge of managing multiple entry level managers. This would consist of one or more teams of Investigation specialists (~60-65 headcount) who investigate buyer or seller transactions","display_distance":null,"id":"b38563ba-ffd8-4ef0-bca3-321a8679dc43","id_icims":"3151081","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Investigation","job_function_id":null,"job_path":"/en/jobs/3151081/manager-risk-investigations-sepo","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD20\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":[],"posted_date":"January  2, 2026","preferred_qualifications":"- Knowledge of Microsoft Office products and applications (esp. MS Excel, Word) at an advanced level\u003cbr/\u003e- Experience in operational excellence using six sigma methodologies\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"customer-trust-and-partner-support.no-team-listed","source_system":"JobCreator","state":"TS","title":"Manager Risk Investigations, SEPO ","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/3151081/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- At least a high school diploma (with or without experience in investigation or customer support) with 3 years of any work experience\u003cbr/\u003e- Fresh graduates and career freshers are welcome to apply.\u003cbr/\u003e- Must have a dedicated workspace at home, free from background noise, where they can connect to the internet and work on deliverables.\u003cbr/\u003e- A postpaid (wired) fiber internet connection with a minimum speed of 200 Mbps or better, and at least 100 GB of data from a reliable provider.\u003cbr/\u003e- Excellent written and spoken English skills and an ability to compose a grammatically correct, concise and accurate written response\u003cbr/\u003e- Excellent interpersonal skills, with the ability to communicate complex transactional issues correctly and clearly to both internal and external customers\u003cbr/\u003e- Demonstrated ability to analyze problems logically\u003cbr/\u003e- Self disciplined, diligent, proactive and detail oriented\u003cbr/\u003e- Strong time management and organizational skills\u003cbr/\u003e- Must be able to start on March 23, 2026","business_category":"customer-trust-and-partner-support","city":"Virtual","company_name":"AOSP-V","country_code":"PHL","description":"The role requires candidates to commit to the following:\u003cbr/\u003e\u003cbr/\u003e- This is a 9-month short term contract role.\u003cbr/\u003e- 2 months of onsite training in our office at Pasay followed by WFH arrangement after requirements is met.\u003cbr/\u003e- Must be physically based in Metro Manila, Cavite, Bulacan, Laguna or Rizal during the time of employment.\u003cbr/\u003e- 5 days’ work week which includes weekends and flexible and/or holidays.\u003cbr/\u003e- 9 hours/day schedule inclusive of lunch break.\u003cbr/\u003e- Operations is 24/7 – shifting, rotating and possibility of night shift\u003cbr/\u003e- Internet Connectivity - maintain a minimum speed of 200 Mbps or better, and at least 100 GB of data from a reliable provider.\u003cbr/\u003e\u003cbr/\u003eAmazon Philippines is seeking dedicated, hardworking, analytical candidates with a proven track record of performance and results-oriented thinking, to join the Seller Experience Protection Operations (SEPO) Team in Manila. Candidates will be responsible for a wide range of duties related to the investigation and elimination of online e-commerce risk. Ideal applicants will have experience in the e-commerce payments space, trust and safety field, and success in a customer-focused workplace. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThe Investigation Associate position relies on excellent judgment to plan and accomplish goals and will work under limited manager supervision. Excellent individual problem-solving and analytical skills are used to authenticate customers and complex transactions. Nearly all decisions are expected to be made independently with little to no guidance and a high degree of accuracy.\u003cbr/\u003e\u003cbr/\u003eThe Investigation Associate will be required to engage proactively with the team members and team leads, department management, and other company associates and third party vendors to accomplish goals. \u003cbr/\u003e\u003cbr/\u003eProductivity and quality assurance will be evaluated along with the overall contribution to the development of the department.","department_cost_center":null,"description_short":"The role requires candidates to commit to the following:- This is a 9-month short term contract role.- 2 months of onsite training in our office at Pasay followed by WFH arrangement after requirements","display_distance":null,"id":"28ced952-b802-4148-8ca9-5e4845e4de4f","id_icims":"3170244","is_intern":null,"is_manager":null,"job_category":"Investigation \u0026 Loss Prevention","job_family":"Investigation","job_function_id":null,"job_path":"/en/jobs/3170244/investigation-associate-9-month-contract-sepo","job_schedule_type":"full-time","location":"PH, Virtual","locations":["{\"normalizedCountryCode\":\"PHL\",\"city\":\"Virtual\",\"countryIso3a\":\"PHL\",\"countryIso2a\":\"PH\",\"locationNonStemming\":\"Philippines, Virtual\",\"coordinates\":\"14.60488,120.98626\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"Philippines\",\"normalizedLocation\":\"PHL\",\"location\":\"PH, Virtual\",\"region\":\"\",\"buildingCodeList\":[\"VCCPHL\"]}"],"normalized_location":"PHL","optional_search_labels":[],"posted_date":"January 30, 2026","preferred_qualifications":"- Comfortable working MS tools and using basic level of automation\u003cbr/\u003e- Experience in fields such as Investigations/Payments/Security or Banking domain\u003cbr/\u003e- Intermediate knowledge of E-commerce\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"customer-trust-and-partner-support.team-selling-partner-support","source_system":"JobCreator","state":null,"title":"Investigation Associate (9-month Contract), SEPO","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3170244/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-selling-partner-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Für diese Stelle erwarten wir:\u003cbr/\u003e- Abgeschlossene technische Berufsausbildung, anerkannt durch die Industrie- und Handelskammer (IHK) oder Handwerkskammer (HWK). Alternativ Nachweis eines erfolgreich abgeschlossen Hochschulstudiums im Ingenieurwissenschaftlichen Bereich (Maschinenbau / Elektrotechnik oder artverwandt) einer deutschen Hochschule oder anerkannte ausländische Hochschulabschlüsse (BA, B. Sc., MA, M. Sc., Dipl.-Ing.)\u003cbr/\u003e- Berufserfahrung in dem entsprechenden Handwerk\u003cbr/\u003e- Erfahrung in der Instandhaltung von industriellen Produktionsanlagen\u003cbr/\u003e- Fortgeschrittene Deutschkenntnisse in Wort und Schrift","business_category":"fulfillment-ops","city":"Kaiserslautern","company_name":"Amazon Kaiserslautern GmbH","country_code":"DEU","description":"Mechatroniker:in/Elektroniker:in/Elektriker:in oder vergleichbar als Instandhaltungstechniker:in für unseren Standort in Kaiserslautern gesucht!\u003cbr/\u003e\u003cbr/\u003eDas Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) ist für unseren Betrieb von fundamentaler Bedeutung – es sorgt dafür, dass unsere technischen Systeme und Anlagen laufend funktionieren. Als Instandhaltungstechniker:in bist Du für die Wartung und Instandhaltung unserer förder- und haustechnischen Anlagen sowie Produktionsanlagen zuständig. Du hilfst, die höchsten Sicherheitsstandards im Arbeitsschutz zu gewährleisten und Maschinenausfallzeiten zu verhindern. Unser technisches Team stellt eine hohe Verfügbarkeit der technischen Anlagen sicher und verbessert die Qualität unserer Geräte.\u003cbr/\u003e\u003cbr/\u003eWir bieten:\u003cbr/\u003e- Einen unbefristeten Vertrag direkt mit Amazon\u003cbr/\u003e- Ein attraktives Vergütungspaket\u003cbr/\u003e- Eine kostenlose Lebens- und Erwerbsunfähigkeitsversicherung und Unterstützung bei der betrieblichen Altersvorsorge\u003cbr/\u003e- Mitarbeiterrabatte auf amazon.de sowie Amazon Extras (z.B. Rabatte in Reisen, Restaurants, Unterhaltung, Elektronik, Heim etc.)\u003cbr/\u003e- Bezuschusste Mahlzeiten\u003cbr/\u003e- Pendlerleistungen: Kostenloses Parken, Kostenübernahme für das 58-EUR Ticket oder Bike Leasing Angebote\u003cbr/\u003e- Familienbonus (Einmalzahlung für Eltern in Elternzeit).\u003cbr/\u003e- Vermittlungsservices für die Betreuung von Kindern, Senioren und Menschen mit besonderen Bedürfnissen\u003cbr/\u003e- Ein kostenloses Mitarbeiterhilfeprogramm (auch für Familienmitglieder) für eine Beratung bei beruflichen oder privaten Angelegenheiten\u003cbr/\u003e- Hervorragende Weiterentwicklungsmöglichkeiten in einem globalen Unternehmen\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Ausführung präventiver Wartungsmaßnahmen an einer breiten Vielfalt von Geräten an unseren Standorten\u003cbr/\u003e- Durchführung von Reparaturen und Fehlerdiagnosen\u003cbr/\u003e- Verwendung neuester Tools zur Maximierung der Geräteeffektivität\u003cbr/\u003e- Einhaltung aller Arbeitsschutzrichtlinien und -praktiken \u003cbr/\u003e- Unterstützung der Entwicklung und des beruflichen Fortschritts von Auszubildenden am Standort\u003cbr/\u003e- Arbeit an Projekten zur kontinuierlichen Verbesserung und Einführung von Best Practices an verschiedenen EU-Standorten\u003cbr/\u003e\u003cbr/\u003eDie Stelle beinhaltet die Arbeit in einem rotierenden Dreischichtsystem, welches Samstage, Nachtschichten sowie Rufbereitschaft umfassen kann. Zudem besteht das Logistiknetzwerk in der Region aus mehreren Standorten, welche im Notfall eine Mitbetreuung voraussetzen. Lokale Flexibilität und eine gewisse Reisebereitschaft (innerhalb der Region) sollte dementsprechend gegeben sein.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWelcome to RME: https://www.youtube.com/embed/w66B2uKaF0Y  • RME Technician: https://www.youtube.com/embed/_YpKqbxej6A \u003cbr/\u003e\u003cbr/\u003eAls Instandhaltungstechniker:in bist Du vor Ort in einem unserer Logistikzentren tätig, um schnell auf technische Störungen reagieren zu können. Du führst eine Reihe geplanter präventiver Wartungsmaßnahmen an Geräten durch, um für ihren sicheren Betrieb zu sorgen. Außerdem reagierst Du als Instandhaltungstechniker:in unverzüglich auf Störungen und Ausfälle. Du untersuchst die Ursachen, findest so schnell wie möglich Lösungen und wendest sie an.  Zudem machst Du Vorschläge für langfristige Verbesserungen.\u003cbr/\u003eIn Zusammenarbeit mit leitenden Kolleg:innen nimmst Du tägliche Wartungsaufgaben wahr und kommunizierst mit Dienstleistern, falls Du externe Expertise benötigst. Du arbeitest in rotierenden Schichten, damit wir rund um die Uhr unsere Standorte unterstützen – und dafür sorgen, dass Amazon weiterhin in dem Tempo liefern kann, für das wir bekannt sind. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eUnser Wartungs- und Instandhaltungsteam (Reliability Maintenance Engineering Team oder RME-Team) sorgt dafür, dass unsere Geräte und Ausstattung jederzeit optimal funktionieren. Wir sind ein Team von Techniker:innen und Ingenieur:innen, das aus hervorragenden Teamplayern besteht und von erfahrenen Führungskräften geleitet wird. Wir arbeiten gemeinsam daran, die Geräte in unserem gesamten globalen Netzwerk von Fulfillment-Centern zu warten, zu reparieren und ihre Fehler zu beheben. Einige unserer Mitarbeiter:innen sind Führungskräfte, die das Team bei der Arbeit an spannender, innovativer Technologie beaufsichtigen – die es teilweise nur bei Amazon gibt.\u003cbr/\u003eVon der Installation automatisierter Verpackungssysteme bis hin zur Beaufsichtigung der allgemeinen Wartungsarbeiten eines Standorts sowie der Reparatur von für den Vertrieb wesentlichen Geräten wickelt unser Team einen Großteil der technischen Aufgaben bei Amazon ab. Unter anderem sorgt es auch dafür, dass Gebäude weiterhin den rechtlichen Auflagen entsprechen, damit alle sicher bleiben und unsere Standorte mit maximaler Effizienz betrieben werden. Es gibt zahlreiche Aufstiegschancen im RME-Team selbst ebenso wie im gesamten Amazon-Unternehmen.\u003cbr/\u003eAlle unsere Aktivitäten sind darauf ausgerichtet, die Ausfallzeiten an Amazons wichtigsten Betriebsstandorten zu reduzieren, damit Kund:innen ihre Bestellungen rechtzeitig erhalten. Oft arbeiten wir früh morgens, spät abends oder in der Nachtschicht, um Wartungsarbeiten mit den geringstmöglichen Störungen vorzunehmen. Falls wir eine bessere Möglichkeit finden, eine bestimmte Aufgabe zu erledigen, verfügen wir über die Fertigkeiten und Gelegenheiten, vollständig neue Prozesse oder bahnbrechende Technologie wie Amazon Robotics oder unseren Complex Item Sorter einzuführen.","department_cost_center":null,"description_short":"Mechatroniker:in/Elektroniker:in/Elektriker:in oder vergleichbar als Instandhaltungstechniker:in für unseren Standort in Kaiserslautern gesucht!Das Wartungs- und Instandhaltungsteam (Reliability Maintenance","display_distance":null,"id":"e82e04ad-0dae-4089-84a5-76550d5c9eae","id_icims":"3164067","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Real Estate/facilities","job_function_id":null,"job_path":"/en/jobs/3164067/mechatroniker-in-elektroniker-in-kaiserslautern-reliability-maintenance-engineering","job_schedule_type":"full-time","location":"DE, Kaiserslautern","locations":["{\"normalizedStateName\":\"Rhineland-Palatinate\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Kaiserslautern\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, Kaiserslautern\",\"coordinates\":\"49.44208,7.76045\",\"normalizedCountyName\":\"Kaiserslautern (City)\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Kaiserslautern, Rhineland-Palatinate, DEU\",\"location\":\"DE, Kaiserslautern\",\"region\":\"\",\"buildingCodeList\":[\"SCN2\"],\"normalizedCityName\":\"Kaiserslautern\"}"],"normalized_location":"Kaiserslautern, Rhineland-Palatinate, DEU","optional_search_labels":[],"posted_date":"February  5, 2026","preferred_qualifications":"- Eine oder mehrere der folgenden Kompetenzen wäre ein Plus:\u003cbr/\u003e- Erfahrung mit zustandsorientierter Überwachung\u003cbr/\u003e- Erfahrung in der Arbeit mit Druck- und Applikationsmaschinen\u003cbr/\u003e- Erfahrung in der Störungssuche und Wartung von Förder- oder Automationssystemen\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":null,"title":"Mechatroniker:in/Elektroniker:in - Kaiserslautern, Reliability Maintenance Engineering","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3164067/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of analyzing and interpreting data with Redshift, Oracle, NoSQL etc. experience\u003cbr/\u003e- Experience with data visualization using Tableau, Quicksight, or similar tools\u003cbr/\u003e- Experience with data modeling, warehousing and building ETL pipelines\u003cbr/\u003e- Experience using SQL to pull data from a database or data warehouse and scripting experience (Python) to process data for modeling","business_category":"finance","city":"Bengaluru","company_name":"Amazon Retail India Private Limited","country_code":"IND","description":"Amazon is one of the world’s largest and most customer-centric companies, continuously innovating to make customers’ lives easier. We are seeking a Business Intelligence Engineer to join our dynamic team, driving data-driven decision-making and fostering innovation at scale. Do you want a unique, exciting opportunity to help build something from the ground up? We are looking for builders who thrive in ambiguity to join the BI team of a tech organization under S\u0026A, global partner for Ops Finance.\u003cbr/\u003e\u003cbr/\u003eAs a Business Intelligence Engineer at Amazon, you will play a pivotal role in leveraging data to drive insights and support strategic decision-making across the organization. You will be responsible for designing and developing scalable data models, performing statistical analysis, and delivering actionable insights through effective story telling.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will have a passion for automation and clean, streamlined process design. You will work with analytic tools, write excellent scripts, partner with customers to answer key business questions, and act as an advocate for your customers. Successful members of this team collaborate effectively with internal end-users, cross-functional product teams, and data engineering teams to solve problems, implement new solutions, and deliver successfully against high operational standards of system availability and reliability. We look for candidates who are excellent communicators, self-motivated, flexible, hardworking, and who like to have fun.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Expertise in SQL for data modeling, and architecture design. Industry experience of 3+ is required.\u003cbr/\u003e- Proficiency in Python for data wrangling, EDA, and model evaluation. Industry experience of 3+ years is preferred.\u003cbr/\u003e- Industry experience in building and evaluating data models is highly preferred.\u003cbr/\u003e- Create compelling data visualizations and dashboards to communicate insights effectively.\u003cbr/\u003e- Knowledge of AWS products such as Redshift, QuickSight, or similar experience with other cloud tech stack.\u003cbr/\u003e- Collaborate with product, engineering, and business teams to translate ambiguous problems into tech requirements and build data-driven solutions.\u003cbr/\u003e- Excellent verbal/written communication \u0026 data presentation skills, including ability to succinctly summarize key findings and effectively communicate with both business and technical teams.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe S\u0026A team plays a crucial role in Operations Finance by leading our data infrastructure transformation. Over the past four years, our business has undergone significant structural changes, creating challenges in managing our data infrastructure effectively. \u003cbr/\u003e\u003cbr/\u003eTo address these challenges, we established the S\u0026A team with a clear mission: to align technology solutions with organizational goals through standardization and automation of core finance functions - planning, bridging, reporting, and controllership. Our team's primary objective is to break down existing data silos while preventing new ones from forming. This approach enables faster execution of automation initiatives and promotes standardization across all finance functions. Through centralization, we can reduce duplicate efforts across teams and create more efficient operations throughout Operations Finance.","department_cost_center":null,"description_short":"Amazon is one of the world’s largest and most customer-centric companies, continuously innovating to make customers’ lives easier. We are seeking a Business Intelligence Engineer to join our dynamic team,","display_distance":null,"id":"33534caf-697d-44f7-93a3-497e0fbc9111","id_icims":"3124291","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Business Intel Engineer","job_function_id":null,"job_path":"/en/jobs/3124291/business-intelligence-engineer-s-a","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR2\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"November 11, 2025","preferred_qualifications":"- Experience with AWS solutions such as EC2, DynamoDB, S3, and Redshift\u003cbr/\u003e- Experience in data mining, ETL, etc. and using databases in a business environment with large-scale, complex datasets\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-fulfillment-operations","source_system":"JobCreator","state":"KA","title":"Business Intelligence Engineer, S\u0026A","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3124291/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-operations","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of data engineering experience\u003cbr/\u003e- Experience with data modeling, warehousing and building ETL pipelines\u003cbr/\u003e- Experience in at least one modern scripting or programming language, such as Python, Java, Scala, or NodeJS","business_category":"finance","city":"Hyderabad","company_name":"ADCI HYD 13 SEZ","country_code":"IND","description":"Are you passionate about standardizing data platforms and automating data engineering to drive analytics and reporting? Do you excel in dynamic, fast-paced environments and find joy in converting data into actionable insights? Are you adept at implementing data governance practices and defining data access and quality standards? If you thrive in innovation and can deliver scalable Data Engineering Solutions, then the Worldwide Operations Finance Standardization \u0026 Automation (SnA) team has an exciting opportunity for you! We are seeking a customer-centric Senior Data Engineer to establish a reliable and accessible data platform, ensuring Operations Finance customers have complete trust in the data, technology, and tools to make data-driven business decisions.\u003cbr/\u003e\u003cbr/\u003eAs a Senior Data Engineer in WWSNA, you will be working in one of the world's largest and most complex data warehouse environments. You will design, implement and support scalable data infrastructure solutions and implement complex data models for Amazon Inbound \u0026 Outbound Transportation business. As a Sr. DE you will create solutions to integrate with multi heterogeneous data sources, aggregate and retrieve data in a fast and safe mode, curate data that can be used in reporting, analysis, machine learning models and ad-hoc data requests. You should have excellent business and communication skills to be able to work with business owners, Product teams and Tech leaders to gather infrastructure requirements, design data infrastructure, build up data pipelines and data-sets to meet business needs. You will be responsible for designing, developing, and operating a data service platform using Python, Airflow, and SQL to build the various ETL, analytics, and data quality components. You’ll automate deployments using AWS CodeDeploy, AWS CodePipeline, AWS Cloud Development Kit (CDK), and AWS Cloud Formation. You will work with AWS services like Redshift, Glue, S3, IAM, CloudWatch, and more.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eInterface with other technology teams to extract, transform, and load data from a wide variety of data sources using Python, SQL and AWS big data technologies.\u003cbr/\u003e\u003cbr/\u003eExplore and learn the latest AWS technologies to provide new capabilities and increase efficiencies of the team.\u003cbr/\u003e\u003cbr/\u003eDesigning and implementing complex pipelines and other Data Engineering solutions.\u003cbr/\u003e\u003cbr/\u003eWork closely with business owners, developers, Business Intelligence Engineer to explore new data sources and deliver the data.\u003cbr/\u003e\u003cbr/\u003eCreate extensible designs and easy to maintain solutions with the long term vision in mind\u003cbr/\u003e\u003cbr/\u003eImprove tools, processes, scale existing solutions, create new solutions as required based on team and stakeholder needs\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThe Operations finance data ecosystem supports global data management solutions inclusive of the scaling solutions to support 10+ data producer teams and 2500 finance customers. The role will identify critical customer pain points and help design , implement and drive customer's data journey. In the age of AI capabilities, the role will identify newer mechanisms to help incorporate AI driven workflows both for our builder and customer communities.  ","department_cost_center":null,"description_short":"Are you passionate about standardizing data platforms and automating data engineering to drive analytics and reporting? Do you excel in dynamic, fast-paced environments and find joy in converting data","display_distance":null,"id":"27a3b080-da9f-462e-9cff-ed445c37a003","id_icims":"3128959","is_intern":null,"is_manager":null,"job_category":"Data Science","job_family":"Data Engineering","job_function_id":null,"job_path":"/en/jobs/3128959/sr-data-engineer-ww-ops-finance-s-a","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD13\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"November 19, 2025","preferred_qualifications":"- Experience with big data technologies such as: Hadoop, Hive, Spark, EMR\u003cbr/\u003e- Experience operating large data warehouses\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-consumer","source_system":"JobCreator","state":"TS","title":"Sr Data Engineer, WW Ops Finance - S\u0026A","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3128959/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-consumer","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of data engineering experience\u003cbr/\u003e- 4+ years of SQL experience\u003cbr/\u003e- Experience with data modeling, warehousing and building ETL pipelines","business_category":"finance","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"As a Data Engineer in Data Infrastructure and Strategy group, you will play a key role in transforming the way Operations Finance teams access and analyse the data. You will work to advance 3 Year Data Infrastructure Modernisation strategy and play a key role in adopting and expanding a unified data access platform and scalable governance and observability frameworks that follow modern data architecture and cloud-first designs.\u003cbr/\u003e\u003cbr/\u003eYour responsibilities will include supporting and migrating data analytics use cases of a targeted customer group and new features implementations within the central platform: component design, implementation using NAWS services that follow best engineering practices, user acceptance testing, launch, adoption and post-launch support. You will work on system design and integrate new components to established architecture. You will be engaged into cross-team collaboration by building reusable design patterns and components and adopting designs adopted by others. You will contribute to “buy” vs “build” decision by evaluating latest product and features releases for NAWS and internal products, perform gap analysis and define feasibility of their adoption and the list of blockers.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate possess a track record of creating efficient AWS-based data solutions; data models for both relational databases and Glue/Athena/EMR stack; developing solution documentation, project plans, user guides and other project documentation. We are looking into individual contributor inspired to become data systems architects. Track of production level deliverables leveraging GenAI is big plus.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Elevate and optimize existing solutions while driving strategic migration. Conduct thorough impact assessments to identify opportunities for transformative re-architecture or migration to central platforms. Your insights will shape the technology roadmap, ensuring we make progress towards deprecation goals while providing best customer service;\u003cbr/\u003e* Design, review and implement data solutions that support WW Operations Finance standardisation and automation initiatives using AWS technologies and internally built tools, including Spark/EMR, Redshift, Athena, DynamoDB, Lambda, S3, Glue, Lake Formation, etc;\u003cbr/\u003e* Support data solutions adoption by both, finance and technical teams; identify and remove adoption blockers;\u003cbr/\u003e* Ensure the speed of delivery and high-quality: iteratively improve development process and adopt mechanisms for optimisation of the development and support;\u003cbr/\u003e* Contribute into engineering excellence by reviewing design and code created by others;\u003cbr/\u003e* Contribute to delivery execution, planning, operational excellence, retrospectives, problem identification, and solution proposals;\u003cbr/\u003e* Collaborate with finance analysts, engineers, product and program managers and external teams to influence and optimize the value of the delivery in data platform;\u003cbr/\u003e* Create technical and customer-facing documentation on the products within the platform.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou work with the Engineering, Product, BI and Operations teams to elevate existing data platforms and implement best-of-class data solutions for WW Operations Finance organization. You solve unstructured customer pain points with technical solutions, you are focused on users productivity when working with the data. You participate in discussions with stakeholders to provide updates on project progress, gather feedback, and align on priorities. Utilizing AWS CDK and various AWS services, you design, execute, and deploy solutions. Your broader focus is on system architecture rather than individual pipelines. You regularly review your designs with Principal Engineer, incorporate gathered insights. Conscious of your impact on customers and infrastructure, you establish efficient development and change management processes to guarantee speed, quality and scalability of delivered solution.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWW Operations Finance Standardization and Automation improves customer experience and business outcomes across Amazon Operations Finance through innovative technical solutions, standardization and automation of processes and use of modern data analytics technologies.","department_cost_center":null,"description_short":"As a Data Engineer in Data Infrastructure and Strategy group, you will play a key role in transforming the way Operations Finance teams access and analyse the data. You will work to advance 3 Year Data","display_distance":null,"id":"50f95aaf-b806-46de-b1ac-054d9bae7fcc","id_icims":"3165403","is_intern":null,"is_manager":null,"job_category":"Data Science","job_family":"Data Engineering","job_function_id":null,"job_path":"/en/jobs/3165403/data-engineer-amazon-operations-finance-standardisation-and-automation","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR37\"],\"normalizedCityName\":\"Bengaluru\"}","{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD13\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"January 23, 2026","preferred_qualifications":"- Experience with AWS technologies like Redshift, S3, AWS Glue, EMR, Kinesis, FireHose, Lambda, and IAM roles and permissions\u003cbr/\u003e- Experience with non-relational databases / data stores (object storage, document or key-value stores, graph databases, column-family databases)\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-fintech","source_system":"JobCreator","state":"KA","title":"Data Engineer, Amazon Operations Finance Standardisation and Automation","university_job":null,"updated_time":"18 minutes","url_next_step":"https://account.amazon.com/jobs/3165403/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fintech","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Conoscenza avanzata dell’italiano, scritto e parlato.\u003cbr/\u003e- Vasta esperienza nell’analisi dei dati in un contesto professionale e nell’utilizzo di tali indicatori per l’individuazione di problemi.\u003cbr/\u003e- Buona padronanza del pacchetto MS Office (Word, Excel, Outlook) in contesti di uso professionale.","business_category":"fulfillment-ops-team","city":"Parma","company_name":"Amazon Italia Transport Srl","country_code":"ITA","description":"Il team Operations è il cuore pulsante di Amazon ed è grazie al suo operato impeccabile che riusciamo a elaborare e spedire gli ordini ai nostri clienti in tempi record. Nel ruolo di Operations Lead/Supervisor avrai l’opportunità di toccare con mano l’interazione tra le diverse componenti delle nostre attività operative, contribuendo in prima persona a garantirne un funzionamento efficiente.\u003cbr/\u003eSarai il punto di riferimento per i colleghi durante il turno di lavoro e li aiuterai a seguire i processi introdotti dai manager. Il ruolo prevede una forte componente pratica: avrai la possibilità di acquisire esperienza nell’utilizzo di strumenti e sistemi da cui dipende il successo della nostra attività. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Misurare e monitorare i flussi di lavoro e le performance del sito, nonché fornire rilevanti informazioni ai manager di prima linea per garantire l’eccellenza operativa in tutti i turni.\u003cbr/\u003e- Supportare e formare il personale affinché assicuri un servizio d’eccellenza e supervisionarlo nello svolgimento delle mansioni quotidiane.\u003cbr/\u003e- Supportare l’Area/Shift Manager nell’ambito di progetti per migliorare i processi, creare un ambiente di lavoro sicuro e aumentare il coinvolgimento del personale. \u003cbr/\u003e- Collaborare con altri reparti per individuare soluzioni tese a risolvere problematiche frequenti o soddisfare le necessità, laddove la produttività è cruciale.\u003cbr/\u003e- Analizzare i dati per identificare piani volti all’ottimizzazione della sicurezza, qualità e produttività. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eIl tuo lavoro di Operations Lead/Supervisor si svolgerà in uno dei nostri siti operativi. Affiancherai l’Area/Shift Manager nell’esecuzione del piano per il turno. Le mansioni di cui ti occuperai spazieranno dall’organizzazione delle riunioni di inizio turno con il team al monitoraggio delle procedure, per assicurare che tutti rispettino le norme di sicurezza, i processi di qualità e le priorità della giornata.\u003cbr/\u003eSegnalerai eventuali criticità ai manager, ma talvolta sarai tu la figura più senior durante un turno e spetterà a te fornire le indicazioni per portare a termine ogni incarico. A volte affiancherai l’Area/Shift Manager nella definizione dei turni, in modo da assicurare la presenza di personale a sufficienza anche nei periodi di massima attività. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Il team Operations è il cuore pulsante di Amazon ed è grazie al suo operato impeccabile che riusciamo a elaborare e spedire gli ordini ai nostri clienti in tempi record. Nel ruolo di Operations Lead/Supervisor","display_distance":null,"id":"df4eaa11-5b38-4851-a657-896fd67c3472","id_icims":"3144986","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3144986/operations-supervisor","job_schedule_type":"full-time","location":"IT, PR, Parma","locations":["{\"normalizedStateName\":\"Emilia-Romagna\",\"normalizedCountryCode\":\"ITA\",\"city\":\"Parma\",\"countryIso3a\":\"ITA\",\"countryIso2a\":\"IT\",\"locationNonStemming\":\"Italy, PR, Parma\",\"coordinates\":\"44.79853,10.34022\",\"normalizedCountyName\":\"Parma\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Italy\",\"normalizedLocation\":\"Parma, Emilia-Romagna, ITA\",\"location\":\"IT, PR, Parma\",\"region\":\"PR\",\"buildingCodeList\":[\"OER3\",\"DER3\"],\"normalizedCityName\":\"Parma\"}"],"normalized_location":"Parma, Emilia-Romagna, ITA","optional_search_labels":[],"posted_date":"December 17, 2025","preferred_qualifications":"- Esperienza nella gestione degli stakeholder e nella creazione e nel mantenimento di rapporti professionali.\u003cbr/\u003e- Esperienza in un contesto operativo, ad esempio di tipo logistico, vendita al dettaglio, settore alberghiero o hospitality, o customer service.\u003cbr/\u003e- Buona padronanza della lingua inglese.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops-team.fulfillment-associates","source_system":"JobCreator","state":"PR","title":"Operations Supervisor","university_job":null,"updated_time":"19 minutes","url_next_step":"https://account.amazon.com/jobs/3144986/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"fulfillment-associates","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of data engineering experience\u003cbr/\u003e- 4+ years of SQL experience\u003cbr/\u003e- Experience with data modeling, warehousing and building ETL pipelines","business_category":"finance","city":"Hyderabad","company_name":"ADCI - Karnataka","country_code":"IND","description":"As a Data Engineer in Data Infrastructure and Strategy group, you will play a key role in transforming the way Operations Finance teams access and analyse the data. You will work to advance 3 Year Data Infrastructure Modernisation strategy and play a key role in adopting and expanding a unified data access platform and scalable governance and observability frameworks that follow modern data architecture and cloud-first designs.\u003cbr/\u003e\u003cbr/\u003eYour responsibilities will include supporting and migrating data analytics use cases of a targeted customer group and new features implementations within the central platform: component design, implementation using NAWS services that follow best engineering practices, user acceptance testing, launch, adoption and post-launch support. You will work on system design and integrate new components to established architecture. You will be engaged into cross-team collaboration by building reusable design patterns and components and adopting designs adopted by others. You will contribute to “buy” vs “build” decision by evaluating latest product and features releases for NAWS and internal products, perform gap analysis and define feasibility of their adoption and the list of blockers.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate possess a track record of creating efficient AWS-based data solutions; data models for both relational databases and Glue/Athena/EMR stack; developing solution documentation, project plans, user guides and other project documentation. We are looking into individual contributor inspired to become data systems architects. Track of production level deliverables leveraging GenAI is big plus.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Elevate and optimize existing solutions while driving strategic migration. Conduct thorough impact assessments to identify opportunities for transformative re-architecture or migration to central platforms. Your insights will shape the technology roadmap, ensuring we make progress towards deprecation goals while providing best customer service;\u003cbr/\u003e* Design, review and implement data solutions that support WW Operations Finance standardisation and automation initiatives using AWS technologies and internally built tools, including Spark/EMR, Redshift, Athena, DynamoDB, Lambda, S3, Glue, Lake Formation, etc;\u003cbr/\u003e* Support data solutions adoption by both, finance and technical teams; identify and remove adoption blockers;\u003cbr/\u003e* Ensure the speed of delivery and high-quality: iteratively improve development process and adopt mechanisms for optimisation of the development and support;\u003cbr/\u003e* Contribute into engineering excellence by reviewing design and code created by others;\u003cbr/\u003e* Contribute to delivery execution, planning, operational excellence, retrospectives, problem identification, and solution proposals;\u003cbr/\u003e* Collaborate with finance analysts, engineers, product and program managers and external teams to influence and optimize the value of the delivery in data platform;\u003cbr/\u003e* Create technical and customer-facing documentation on the products within the platform.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou work with the Engineering, Product, BI and Operations teams to elevate existing data platforms and implement best-of-class data solutions for WW Operations Finance organization. You solve unstructured customer pain points with technical solutions, you are focused on users productivity when working with the data. You participate in discussions with stakeholders to provide updates on project progress, gather feedback, and align on priorities. Utilizing AWS CDK and various AWS services, you design, execute, and deploy solutions. Your broader focus is on system architecture rather than individual pipelines. You regularly review your designs with Principal Engineer, incorporate gathered insights. Conscious of your impact on customers and infrastructure, you establish efficient development and change management processes to guarantee speed, quality and scalability of delivered solution.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWW Operations Finance Standardization and Automation improves customer experience and business outcomes across Amazon Operations Finance through innovative technical solutions, standardization and automation of processes and use of modern data analytics technologies.","department_cost_center":null,"description_short":"As a Data Engineer in Data Infrastructure and Strategy group, you will play a key role in transforming the way Operations Finance teams access and analyse the data. You will work to advance 3 Year Data","display_distance":null,"id":"067d4d84-69b2-4c6e-b333-ad5870692bf9","id_icims":"3167512","is_intern":null,"is_manager":null,"job_category":"Data Science","job_family":"Data Engineering","job_function_id":null,"job_path":"/en/jobs/3167512/data-engineer-amazon-operations-finance-standardisation-and-automation","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD13\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"January 27, 2026","preferred_qualifications":"- Experience with AWS technologies like Redshift, S3, AWS Glue, EMR, Kinesis, FireHose, Lambda, and IAM roles and permissions\u003cbr/\u003e- Experience with non-relational databases / data stores (object storage, document or key-value stores, graph databases, column-family databases)\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-fintech","source_system":"JobCreator","state":"TS","title":"Data Engineer, Amazon Operations Finance Standardisation and Automation","university_job":null,"updated_time":"19 minutes","url_next_step":"https://account.amazon.com/jobs/3167512/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fintech","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of data engineering experience\u003cbr/\u003e- 4+ years of SQL experience\u003cbr/\u003e- Experience with data modeling, warehousing and building ETL pipelines","business_category":"finance","city":"Bengaluru","company_name":"ADCI - BLR - DTA","country_code":"IND","description":"As a Data Engineer in Data Infrastructure and Strategy group, you will play a key role in transforming the way Operations Finance teams access and analyse the data. You will work to advance 3 Year Data Infrastructure Modernisation strategy and play a key role in adopting and expanding a unified data access platform and scalable governance and observability frameworks that follow modern data architecture and cloud-first designs.\u003cbr/\u003e\u003cbr/\u003eYour responsibilities will include supporting and migrating data analytics use cases of a targeted customer group and new features implementations within the central platform: component design, implementation using NAWS services that follow best engineering practices, user acceptance testing, launch, adoption and post-launch support. You will work on system design and integrate new components to established architecture. You will be engaged into cross-team collaboration by building reusable design patterns and components and adopting designs adopted by others. You will contribute to “buy” vs “build” decision by evaluating latest product and features releases for NAWS and internal products, perform gap analysis and define feasibility of their adoption and the list of blockers.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate possess a track record of creating efficient AWS-based data solutions; data models for both relational databases and Glue/Athena/EMR stack; developing solution documentation, project plans, user guides and other project documentation. We are looking into individual contributor inspired to become data systems architects. Track of production level deliverables leveraging GenAI is big plus.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Elevate and optimize existing solutions while driving strategic migration. Conduct thorough impact assessments to identify opportunities for transformative re-architecture or migration to central platforms. Your insights will shape the technology roadmap, ensuring we make progress towards deprecation goals while providing best customer service;\u003cbr/\u003e* Design, review and implement data solutions that support WW Operations Finance standardisation and automation initiatives using AWS technologies and internally built tools, including Spark/EMR, Redshift, Athena, DynamoDB, Lambda, S3, Glue, Lake Formation, etc;\u003cbr/\u003e* Support data solutions adoption by both, finance and technical teams; identify and remove adoption blockers;\u003cbr/\u003e* Ensure the speed of delivery and high-quality: iteratively improve development process and adopt mechanisms for optimisation of the development and support;\u003cbr/\u003e* Contribute into engineering excellence by reviewing design and code created by others;\u003cbr/\u003e* Contribute to delivery execution, planning, operational excellence, retrospectives, problem identification, and solution proposals;\u003cbr/\u003e* Collaborate with finance analysts, engineers, product and program managers and external teams to influence and optimize the value of the delivery in data platform;\u003cbr/\u003e* Create technical and customer-facing documentation on the products within the platform.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou work with the Engineering, Product, BI and Operations teams to elevate existing data platforms and implement best-of-class data solutions for WW Operations Finance organization. You solve unstructured customer pain points with technical solutions, you are focused on users productivity when working with the data. You participate in discussions with stakeholders to provide updates on project progress, gather feedback, and align on priorities. Utilizing AWS CDK and various AWS services, you design, execute, and deploy solutions. Your broader focus is on system architecture rather than individual pipelines. You regularly review your designs with Principal Engineer, incorporate gathered insights. Conscious of your impact on customers and infrastructure, you establish efficient development and change management processes to guarantee speed, quality and scalability of delivered solution.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWW Operations Finance Standardization and Automation improves customer experience and business outcomes across Amazon Operations Finance through innovative technical solutions, standardization and automation of processes and use of modern data analytics technologies.","department_cost_center":null,"description_short":"As a Data Engineer in Data Infrastructure and Strategy group, you will play a key role in transforming the way Operations Finance teams access and analyse the data. You will work to advance 3 Year Data","display_distance":null,"id":"4d5f9038-bbb9-4fd1-9763-3021b7fd2566","id_icims":"3168540","is_intern":null,"is_manager":null,"job_category":"Data Science","job_family":"Data Engineering","job_function_id":null,"job_path":"/en/jobs/3168540/data-engineer-amazon-operations-finance-standardisation-and-automation","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR37\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":["amazon-india-operations"],"posted_date":"January 28, 2026","preferred_qualifications":"- Experience with AWS technologies like Redshift, S3, AWS Glue, EMR, Kinesis, FireHose, Lambda, and IAM roles and permissions\u003cbr/\u003e- Experience with non-relational databases / data stores (object storage, document or key-value stores, graph databases, column-family databases)\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-fintech","source_system":"JobCreator","state":"KA","title":"Data Engineer, Amazon Operations Finance Standardisation and Automation","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3168540/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fintech","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Strong experience in Editing, PR, Marketing, Communications, Copywriting, Journalism, UX/CX Product or Program management\u003cbr/\u003e- Bachelor’s Degree in Business, Marketing, Journalism, Communications or comparable fields\u003cbr/\u003e- Bilingual fluency in English and Japanese\u003cbr/\u003e- Exceptional written and verbal communication skills\u003cbr/\u003e- Highly effective at writing and assessing short form content across diverse subject matters\u003cbr/\u003e- Experience in defining and owning project objectives, requirements, and delivery\u003cbr/\u003e- High attention to detail while managing multiple, competing priorities simultaneously","business_category":"retail","city":"London","company_name":"Amazon Development Centre (London) Limited","country_code":"GBR","description":"The AI Conversational Shopping team is looking for an AI Editorial Lead to drive its efforts in delivering a seamless, fluent, and locally-relevant experience for AI-assisted shopping in Japanese. This is an opportunity to join the high-performing team behind Amazon’s Generative AI shopping initiatives. Our objective is to make it easy for customers worldwide to find and discover the best products, meet their unique needs with product research, providing comparisons and recommendations, answering specific product questions, and more. This role is inherently high-visibility and highly cross-functional, requiring collaboration and influence across global product, design, science, and engineering teams, to support evaluation, automation and curation efforts in the AI development process.\u003cbr/\u003e\u003cbr/\u003eThis role requires bilingual fluency in English and Japanese, exceptional writing and communication skills in both languages, excellent judgement, strong interpersonal skills, deep curiosity about how things work in the AI space, and a passion for serving customers. You must enjoy context-switching and partnering at all levels of the organisation to deliver results. This is an opportunity to gain valuable experience in AI and its application in diverse business settings.\u003cbr/\u003e\u003cbr/\u003eWe are looking for candidates who are passionate about the intersection of language and technology and who are keen to learn and innovate in the field of artificial intelligence. A successful candidate will thrive in ambiguity and care deeply about curating experiences for customers with content that is clear, concise, and relatable. This person will have a knack for simplifying complex statements and revel in the opportunity to create and implement language and product guidelines. This person will deliver delightful conversational experiences through writing, editing, evaluation, and prompt engineering. Part editor, part team lead, they will set and drive the vision for the style, tone and voice our Large Language Models will be trained to adopt in Japanese across the team while driving broader, scalable innovation across international marketplaces.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Write, edit, and evaluate short-form content along a defined criteria that will be used to evaluate and train our AI models\u003cbr/\u003e- Define, align and guide stakeholders in implementing language and evaluation guidelines for Generative AI shopping experiences\u003cbr/\u003e- Uphold response quality by exercising judgment and using customer feedback to continually drive improvements across team processes\u003cbr/\u003e- Analyze root causes, identify error patterns, and propose solutions to enhance the quality of evaluation and annotation tasks\u003cbr/\u003e- Create, design and use frameworks for Prompt tuning and management to improve the fluency of our AI models\u003cbr/\u003e- Guide the development of automation and internal tools that will support evaluation and editorial curation, by providing user requirements and feedback\u003cbr/\u003e- Work closely with product, science and engineering stakeholders to prioritise and complete projects within deadlines","department_cost_center":null,"description_short":"The AI Conversational Shopping team is looking for an AI Editorial Lead to drive its efforts in delivering a seamless, fluent, and locally-relevant experience for AI-assisted shopping in Japanese. This","display_distance":null,"id":"9f4cbc21-5ea4-416e-8a05-70603f8a5966","id_icims":"3106071","is_intern":null,"is_manager":null,"job_category":"Editorial, Writing, \u0026 Content Management","job_family":"Editorial","job_function_id":null,"job_path":"/en/jobs/3106071/ai-editorial-lead-japanese-ai-shopping-international","job_schedule_type":"full-time","location":"GB, London","locations":["{\"normalizedStateName\":\"England\",\"normalizedCountryCode\":\"GBR\",\"city\":\"London\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, London\",\"coordinates\":\"51.50643,-0.12719\",\"normalizedCountyName\":\"London\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"London, England, GBR\",\"location\":\"GB, London\",\"region\":\"\",\"buildingCodeList\":[\"LHR16\"],\"normalizedCityName\":\"London\"}"],"normalized_location":"London, England, GBR","optional_search_labels":[],"posted_date":"October 10, 2025","preferred_qualifications":"- Experience working with technical and business stakeholders from global cross-functional teams\u003cbr/\u003e- Experience in managing teams\u003cbr/\u003e- Experience working in Generative AI, particularly relating to Evaluations, Content Management, Prompt Engineering, Editorial, Tutoring, Expert/Human Annotations or Product Management\u003cbr/\u003e- Experience in documenting learnings, strategies, and proposals to present to leadership and stakeholders teams\u003cbr/\u003e- Experience working with product and tech teams to develop, launch, or improve tooling and/or user features for customers\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"retail.team-intech","source_system":"JobCreator","state":null,"title":"AI Editorial Lead (Japanese), AI Shopping, International ","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3106071/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-intech","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}