{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- 5+ years of increasing responsibilities in EHS and/or environmental programs in manufacturing, production, or service operations\u003cbr/\u003e- 5+ years of increasing responsibilities in people and performance management\u003cbr/\u003e- Experience implementing lean principles and process improvement in an operational environment","business_category":"fulfillment-and-operations","city":"New Castle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We’re seeking a dedicated Workplace Health \u0026 Safety (WHS) Manager to help drive this mission forward. As our next WHS Manager, you'll be more than a safety professional – you'll be a catalyst for change, leading a comprehensive safety program that touches thousands of lives. Working at the intersection of operations and safety, you'll shape the future of workplace health while delivering real-time solutions that protect our most valuable asset: our people.\u003cbr/\u003e\u003cbr/\u003eIn this role, you'll serve as the site's safety facilitator, orchestrating our Global WHS Program with precision and passion. You'll partner with Operations leadership to weave safety into the fabric of our daily operations, using data-driven insights to create innovative solutions that reduce risk and enhance productivity. Your ability to build trust, influence change, and drive results will be crucial as you lead comprehensive risk assessments and transform safety data into actionable strategies.\u003cbr/\u003eLeadership is at the heart of this role. You'll build and develop a high-performing team of WHS professionals, fostering a culture of continuous improvement and excellence.\u003cbr/\u003e\u003cbr/\u003eCore Impact Areas:\u003cbr/\u003eSafety Leadership \u0026 Innovation - Transform safety culture through leadership and innovative solutions. Drive continuous improvement initiatives that set new benchmarks in workplace safety. Leverage technology and data analytics to drive preventive safety measures that protect our associates while enhancing operational excellence. Develop leadership plans, communicate expectations, and drive initiatives to create a safe work environment. Measure performance against WHS policies, analyze metrics, and conduct site audits to address non-compliance issues.\u003cbr/\u003e\u003cbr/\u003eStrategic Partnership \u0026 Influence - Build partnerships with Operations leadership to integrate safety into every aspect of our business. Use compelling data analysis and risk insights to influence positive change and drive strategic decision-making. Establish yourself as a trusted advisor who balances safety excellence with operational demands. Oversee recordkeeping, workplace organization, and WHS training programs.\u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements include:\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eLift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e\u003cbr/\u003eStand/walk for up to 12 hours during shifts\u003cbr/\u003e\u003cbr/\u003eWork in an environment where the noise level varies\u003cbr/\u003e\u003cbr/\u003eWork in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e\u003cbr/\u003eContinuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e\u003cbr/\u003eMaintain effective care delivery in emergencies and assist emergency response at the site\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eThose that do not have an adult First Aid, CPR, AED certification from the American Heart Association or American Red Cross must obtain within 3 weeks of start date.","department_cost_center":null,"description_short":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We’re seeking","display_distance":null,"id":"9d62901f-06c5-4ca8-90b5-79b038fa11cf","id_icims":"3121025","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3121025/site-ehs-manager-iii","job_schedule_type":"full-time","location":"US, DE, New Castle","locations":["{\"normalizedStateName\":\"Delaware\",\"normalizedCountryCode\":\"USA\",\"city\":\"New Castle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, DE, New Castle\",\"coordinates\":\"39.65978,-75.56394\",\"normalizedCountyName\":\"New Castle\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New Castle, Delaware, USA\",\"location\":\"US, DE, New Castle\",\"region\":\"DE\",\"buildingCodeList\":[\"ILG1\"],\"normalizedCityName\":\"New Castle\"}"],"normalized_location":"New Castle, Delaware, USA","optional_search_labels":[],"posted_date":"November  4, 2025","preferred_qualifications":"- Distribution Center or Manufacturing EHS experience with mix of exempt and non-exempt employees at a site of at least 250 people\u003cbr/\u003e- Master’s degree\u003cbr/\u003e- Experience implementing lean principles and process improvement in an operational environment.\u003cbr/\u003e- Experience in a fast paced, dynamic organization\u003cbr/\u003e- Certified Safety Professional\u003cbr/\u003e- Excellent written and verbal communication skills, including comfort interfacing with site leaders.\u003cbr/\u003e- Ability to develop and implement department goals and strategies\u003cbr/\u003e- Strong analytical skills with demonstrated problem solving ability\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $84,800/year in our lowest geographic market up to $155,500/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"DE","title":"Site EHS Manager III","university_job":null,"updated_time":"less than a minute","url_next_step":"https://account.amazon.com/jobs/3121025/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 9+ years of management of technical, enterprise customer facing resources or equivalent experience\u003cbr/\u003e- 9+ years of infrastructure architecture, database architecture and networking experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Experience architecting/operating solutions built on any cloud service provider like Azure, AWS, GCP, OCI, etc.\u003cbr/\u003e- 5 years experience in either the Fintech, Healthcare, Life Sciences or Web3 domains.","business_category":"aws","city":"New York","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Do you have a passion for Startups? Do you have a passion for helping  early startup companies grow and thrive? Amazon Web Services (AWS) is looking for an experienced and motivated technical manager to coach,  grow, and partner with skilled Startups Solutions Architects focusing on a wide range of customers. Working in collaboration with our sales teams, you will drive growth across a broad set of customers in this  segment. If you think you have what it takes to lead the best in the industry, AWS is hiring Managers for our Solutions Architects!\u003cbr/\u003e\u003cbr/\u003eIn this role, you will need to be technically capable and credible in your own right as well as effective in shaping the customer-facing and technical skills of your team.  In addition to technical knowledge and leadership experience it is important to have a solid understanding of Fintech, Healthcare or Life Sciences domain(s), including regulatory and compliance guidelines and customer impact. In addition to technical knowledge and leadership experience it is important to have a solid understanding of the Startup journey. We are looking for technical builders who love the idea of working with early stage startups to help them as they grow. In this role, you’ll work directly with a variety of interesting customers  and help them make the best (and sometimes the most pragmatic) technical decisions along the way. You’ll have a chance to build enduring relationships with these companies and establish yourself as a trusted  advisor. You will also have a solid understanding of the unique challenges startups face and how technology can empower their businesses. \u003cbr/\u003e\u003cbr/\u003eYou will help team members ramp up on AWS and develop  speaking, writing, presentation, and executive interaction skills. You will need to be adept at interacting, communicating and partnering with other departments within AWS such as our Services Teams, Marketing, Business Development and the broader Solutions Architecture Organization, as well as representing your team to executive management.\u003cbr/\u003e\u003cbr/\u003eOpen to domestic travel up to 30%\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e· As a key member of the Startups Solutions  Architecture team, ensure our customers’ success in building and  migrating infrastructure, software and services onto the AWS platform leveraging best practices and modern architectures\u003cbr/\u003e· Capture and share best-practice knowledge amongst the AWS Solutions Architect community, especially those in Fintech, Healthcare, or Life Sciences\u003cbr/\u003e· In partnership with the sales and business development teams, formulate and execute a strategy to drive successful customer outcomes worldwide for startups\u003cbr/\u003e· Hire, on-board, train, and develop new Solutions Architects\u003cbr/\u003e·  Coach Solutions Architects in the skills needed to conduct one-to-few and one-to-many training sessions so they can transfer deep technical skills to customers who are considering or using AWS\u003cbr/\u003e· Capture and share best-practice knowledge amongst the AWS Solutions Architect community\u003cbr/\u003e·  Create and motivate the development of whitepapers, data sheets,  solutions, quickstarts, and other high-value customer facing content and best practices\u003cbr/\u003e· Act as a conduit and liaison between customers, service engineering teams and support\u003cbr/\u003e· Broadly engage with Amazon leadership to communicate, drive your vision, and work across the organization\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"Do you have a passion for Startups? Do you have a passion for helping  early startup companies grow and thrive? Amazon Web Services (AWS) is looking for an experienced and motivated technical manager to","display_distance":null,"id":"4ad0e162-b342-44dd-9d20-fec12e3a293c","id_icims":"3155482","is_intern":null,"is_manager":null,"job_category":"Solutions Architect","job_family":"Solution Architect","job_function_id":null,"job_path":"/en/jobs/3155482/senior-sa-manager-regulated-industries","job_schedule_type":"full-time","location":"US, NY, New York","locations":["{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK37\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"New York, New York, USA","optional_search_labels":["aws.team-sus-startups-optional","aws.team-startupbd"],"posted_date":"January  8, 2026","preferred_qualifications":"- Experience architecting, migrating, transforming or modernizing customer requirements to the cloud\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, New York - 221,100.00 - 299,200.00 USD annually","primary_search_label":"aws.team-solutions-architect-primary","source_system":"JobCreator","state":"NY","title":"Senior SA Manager, Regulated Industries","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3155482/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-solutions-architect-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 9+ years of management of technical, enterprise customer facing resources or equivalent experience\u003cbr/\u003e- Experience architecting/operating solutions built on any cloud service provider like Azure, AWS, GCP, OCI, etc.\u003cbr/\u003e- 9+ years of infrastructure architecture, database architecture and networking experience\u003cbr/\u003e- Bachelor's degree","business_category":"aws","city":"New York","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Do you have a passion for Startups? Do you have a passion for helping  early startup companies grow and thrive? Amazon Web Services (AWS) is looking for an experienced and motivated technical manager to coach,  grow, and partner with skilled Startups Solutions Architects focusing on a wide range of customers. Working in collaboration with our sales teams, you will drive growth across a broad set of customers in this  segment. If you think you have what it takes to lead the best in the industry, AWS is hiring Managers for our Solutions Architects!\u003cbr/\u003e\u003cbr/\u003eIn this role, you will need to be technically capable and credible in your own right as well as effective in shaping the customer-facing and technical skills of your team.  In addition to technical knowledge and leadership experience it is important to have a solid understanding of all cloud service providers, not just AW. In addition to technical knowledge and leadership experience it is important to have a solid understanding of the Startup journey. We are looking for technical builders who love the idea of working with early stage startups to help them as they grow. In this role, you’ll work directly with a variety of interesting customers  and help them make the best (and sometimes the most pragmatic) technical decisions along the way. You’ll have a chance to build enduring relationships with these companies and establish yourself as a trusted  advisor. You will also have a solid understanding of the unique challenges startups face and how technology can empower their businesses. \u003cbr/\u003e\u003cbr/\u003eYou will help team members ramp up on AWS and develop  speaking, writing, presentation, and executive interaction skills. You will need to be adept at interacting, communicating and partnering with other departments within AWS such as our Services Teams, Marketing, Business Development and the broader Solutions Architecture Organization, as well as representing your team to executive management.\u003cbr/\u003e\u003cbr/\u003eOpen to domestic travel up to 30%\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e· As a key member of the Startups Solutions  Architecture team, ensure our customers’ success in building and  migrating infrastructure, software and services onto the AWS platform leveraging best practices and modern architectures\u003cbr/\u003e· Capture and share best-practice knowledge amongst the AWS Solutions Architect community, including latest innovations of all cloud service providers.\u003cbr/\u003e· In partnership with the sales and business development teams, formulate and execute a strategy to drive successful customer outcomes worldwide for startups\u003cbr/\u003e· Hire, on-board, train, and develop new Solutions Architects\u003cbr/\u003e·  Coach Solutions Architects in the skills needed to conduct one-to-few and one-to-many training sessions so they can transfer deep technical skills to customers who are considering or using AWS\u003cbr/\u003e· Capture and share best-practice knowledge amongst the AWS Solutions Architect community\u003cbr/\u003e·  Create and motivate the development of whitepapers, data sheets,  solutions, quickstarts, and other high-value customer facing content and best practices\u003cbr/\u003e· Act as a conduit and liaison between customers, service engineering teams and support\u003cbr/\u003e· Broadly engage with Amazon leadership to communicate, drive your vision, and work across the organization\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"Do you have a passion for Startups? Do you have a passion for helping  early startup companies grow and thrive? Amazon Web Services (AWS) is looking for an experienced and motivated technical manager to","display_distance":null,"id":"ef644c50-cbfe-4c13-ac0c-c3b9ea41fa40","id_icims":"3155495","is_intern":null,"is_manager":null,"job_category":"Solutions Architect","job_family":"Solution Architect","job_function_id":null,"job_path":"/en/jobs/3155495/senior-sa-manager-startups-east-migrate","job_schedule_type":"full-time","location":"US, NY, New York","locations":["{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK37\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"New York, New York, USA","optional_search_labels":["aws.team-sus-startups-optional","aws.team-startupbd"],"posted_date":"January  8, 2026","preferred_qualifications":"- Experience architecting, migrating, transforming or modernizing customer requirements to the cloud\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, New York - 221,100.00 - 299,200.00 USD annually","primary_search_label":"aws.team-solutions-architect-primary","source_system":"JobCreator","state":"NY","title":"Senior SA Manager, Startups, East Migrate","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3155495/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-solutions-architect-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- 7+ years of experience in Supply Chain, Network Capacity planning and Long term planning\u003cbr/\u003e- 5+ years of owning program strategy, end to end delivery, and communicating results to senior leadership experience\u003cbr/\u003e- Experience owning program strategy, end to end delivery, and communicating results to senior leadership\u003cbr/\u003e- Experience in stakeholder management, dealing with multiple stakeholders at varied levels of the organization\u003cbr/\u003e- Knowledge of Microsoft Excel at an advanced level, including: pivot tables, macros, index/match, vlookup, VBA, data links, etc.\u003cbr/\u003e- Strong Verbal and written communication","business_category":"operations","city":"Austin","company_name":"Amazon.com Services LLC","country_code":"USA","description":"We're seeking an experienced Network Planning Manager to lead strategic initiatives for our Emerging Country Network Topology Planning team. To lead supply chain planning and process automation initiatives, design and optimize multi-year network topology across multiple countries\u003cbr/\u003eand Manage network topology and strategic planning for countries / regions including Mexico, Brazil, Australia, Middle East, Turkey, South Africa, Singapore, and emerging markets\u003cbr/\u003eWhat You'll Do:\u003cbr/\u003e•\tCollaborate with global Supply Chain professionals, Technology teams, Engineers, Operations teams, Finance teams, and Business leaders\u003cbr/\u003e•\tDesign cost-efficient supply chain networks that optimize customer experience\u003cbr/\u003e•\tDefine requirements and solutions with cross-functional teams\u003cbr/\u003e•\tDrive strategic initiatives and best practices adoption\u003cbr/\u003e•\tProvide regular updates to senior management on status, risks, and opportunities\u003cbr/\u003eRequired Skills:\u003cbr/\u003e•\tStrong stakeholder management abilities\u003cbr/\u003e•\tAdvanced critical thinking and analytical skills\u003cbr/\u003e•\tExcellence in project management\u003cbr/\u003e•\tExecutive communication capabilities\u003cbr/\u003e•\tAbility to thrive in a fast-paced environment\u003cbr/\u003e•\tExperience in data analysis and solution development\u003cbr/\u003e•\tStrong cross-functional collaboration skills\u003cbr/\u003eThe ideal candidate will excel at analyzing complex information, partnering with diverse teams, and delivering innovative solutions while balancing multiple priorities.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Lead long term strategic Network planning initiatives that meet cost optimization and speed acceleration goals.\u003cbr/\u003e- Partner with country teams to develop long term solution for next 3-5 years planning horizon.\u003cbr/\u003e- Communicate and drive long term initiatives, actively work to remove bottlenecks and create scalable mechanisms and use Supply Chain knowledge to influence process enhancements. \u003cbr/\u003e- Effectively influence stakeholders without having direct authority. Drive clear, precise, and regular communication with stakeholders to include ongoing project/program status via monthly and quarterly planning reviews.\u003cbr/\u003e- Proactively identify gaps and opportunities in the process while partnering with established markets teams to benchmark the best practices to drive implementation and adoption for emerging countries. \u003cbr/\u003e- Contribute to mid to long-term planning, process standardization and development of innovative solution for new and existing emerging countries. \u003cbr/\u003e- Around 25% annual travel to respective countries to connect with local partners and learn the local operations.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Emerging Country Long term Network Topology and Supply Chain Planning team works to optimize multi-year and multi-echelon network topology strategy, along with Supply Chain planning processes for nine emerging countries. Team scope includes Network planning of Mexico, Brazil, Australia, Middle East (AE, KSA, EG), Turkey, South Africa and Singapore, with additional new countries to come with further international expansion.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAmazon Benefits:\u003cbr/\u003eAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include:\u003cbr/\u003e1. Medical, Dental, and Vision Coverage\u003cbr/\u003e2. Maternity and Parental Leave Options\u003cbr/\u003e3. Paid Time Off (PTO)\u003cbr/\u003e4. 401(k) Plan\u003cbr/\u003eIf you are not sure that every qualification on the list above describes you exactly, we'd still love to hear from you! At Amazon, we value people with unique backgrounds, experiences, and skill sets. If you’re passionate about this role and want to make an impact on a global scale, please apply!","department_cost_center":null,"description_short":"We're seeking an experienced Network Planning Manager to lead strategic initiatives for our Emerging Country Network Topology Planning team. To lead supply chain planning and process automation initiatives,","display_distance":null,"id":"6bf611ea-e9a8-4a4d-8ade-890c2906a2c7","id_icims":"3035621","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Supply Chain Management","job_function_id":null,"job_path":"/en/jobs/3035621/senior-network-planning-manager-emerging-countries-network-planning","job_schedule_type":"full-time","location":"US, TX, Austin","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS20\"],\"normalizedCityName\":\"Austin\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA104\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Austin, Texas, USA","optional_search_labels":[],"posted_date":"July 16, 2025","preferred_qualifications":"- Master's degree Supply Chain Management or Operation Management\u003cbr/\u003e- High attention to detail and proven ability to manage multiple, competing priorities simultaneously\u003cbr/\u003e- Experience with Six Sigma/Lean, Statistical data analysis, network modeling and Operational Excellence\u003cbr/\u003e- Ability to write SQL/Python queries and use BI Tools like Tableau/Power BI.\u003cbr/\u003e- Knowledge of how a fulfillment center, and transportation network is designed and operated\u003cbr/\u003e- Demonstrated ability to operate both strategically and tactically in a high-energy, fast-paced environment\u003cbr/\u003e- Strong bias for action; ability to juggle multiple competing priorities and create a sense of urgency in a fast-paced, and dynamic environment\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Austin - 115,400.00 - 160,000.00 USD annually\u003cbr/\u003eUSA, WA, Bellevue - 115,400.00 - 160,000.00 USD annually","primary_search_label":"operations.team-supply-chain-optimization","source_system":"JobCreator","state":"TX","title":"Senior Network Planning Manager, Emerging countries Network Planning","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3035621/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-supply-chain-optimization","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 3+ years of Apple platform development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Bachelor's degree or foreign equivalent in Computer Science, Engineering, Mathematics, or a related field\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"north-america-stores","city":"New York","company_name":"Zappos.com LLC","country_code":"USA","description":"At Zappos Tech, we're on a mission to deliver unparalleled shopping experiences to our customers. We're seeking a Software Development Engineer II (SDE2) to join our iOS Mobile team at Zappos. As an SDE2 on the iOS team, you will contribute significantly to software development of the Zappos iOS app. Your work will span the entire customer journey, from Homepage to checkout: Search, Search Results, Homepage, Ads, Widgets, Recommendations, and much more. If you're passionate about innovative products, thrive in dynamic environments, and are ready to grow your technical and leadership skills, we would love to hear from you!\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tDevelop and Maintain: Play a key role in the development and maintenance of native iOS apps using all the prominent iOS technologies and frameworks (XCode, Swift, SwiftUI, Objective-C, UIKit, CloudKit, Core Data,Core Animation)\u003cbr/\u003e•\tCollaborate for Success: Work closely with product managers, UX designers, and engineers. Your contributions will be crucial in creating optimal customer experiences and steering technology choices.\u003cbr/\u003e•\tCoach and Guide: Provide guidance and feedback to help maintain high coding standards and practices. Your efforts will contribute to the growth and development of our engineering team.\u003cbr/\u003e•\tSolve Problems: Address complex issues within a well-understood technology strategy. You'll balance business needs with technical solutions to ensure scalability and future growth.\u003cbr/\u003e•\tUphold Best Practices: Your contributions will not only address problems efficiently but also adhere to and promote best practices within the team.\u003cbr/\u003e•\tLearn and Grow: You'll have opportunities for continuous learning and contributing to the team's strategy and goals, fostering an inclusive and growth-oriented environment.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYour day starts with standup where you sync with your team and product managers about tasks and priorities. \u003cbr/\u003e\u003cbr/\u003eYou'll spend most of your time writing code - building and testing new features, fixing issues, and improving app performance. Code reviews are part of your regular routine.  You regularly use AI tooling as part of your day to day development tasks.\u003cbr/\u003e\u003cbr/\u003eYou might research new iOS frameworks or tools, write technical documentation for complex features, or collaborate closely with teammates on challenging problems. Some days are deep focus on feature development, others involve mentoring or investigating production issues. The work varies but always centers on making our iOS app better for our customers.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eYou'll join a tight-knit mobile team of iOS and Android developers who take ownership of the entire customer experience in our app. Everyone here is passionate about creating seamless shopping experiences that make customers genuinely happy - whether that's perfecting the search flow, streamlining checkout, or building features that surprise and delight.\u003cbr/\u003e\u003cbr/\u003eWe work closely together, sharing knowledge across platforms and collaborating daily with product managers and backend engineers. The team values transparency, continuous learning, and taking initiative. You'll have the freedom to propose solutions, and experiment with new approaches to \u003cbr/\u003eimprove the Zappos customer experience.","department_cost_center":null,"description_short":"At Zappos Tech, we're on a mission to deliver unparalleled shopping experiences to our customers. We're seeking a Software Development Engineer II (SDE2) to join our iOS Mobile team at Zappos. As an SDE2","display_distance":null,"id":"f4430de3-0d75-43a0-afed-c07f29c9450d","id_icims":"3167774","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3167774/software-development-engineer-ii-ios-zappos-discovery-tech-mobile","job_schedule_type":"full-time","location":"US, NY, New York","locations":["{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK94\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"New York, New York, USA","optional_search_labels":[],"posted_date":"January 27, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- Usage of generative AI tools to enhance workflow efficiency, with a willingness to learn effective prompting and evaluation practices.\u003cbr/\u003e- Ability to recognize opportunities where generative AI could enhance products, workflows, or customer experiences.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, New York - 158,100.00 - 213,800.00 USD annually","primary_search_label":"north-america-stores.fashion","source_system":"JobCreator","state":"NY","title":"Software Development Engineer II, iOS, Zappos Discovery Tech - Mobile ","university_job":null,"updated_time":"27 minutes","url_next_step":"https://account.amazon.com/jobs/3167774/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"fashion","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- A completed Bachelor’s Degree from an accredited university\u003cbr/\u003e- 7+ years direct management experience, including a salaried workforce, in a manufacturing, production or distribution environment\u003cbr/\u003e- Experience with performance metrics and process improvement and Lean techniques\u003cbr/\u003e- Experience with the full staffing lifecycle, including interviewing, hiring, performance management, promotions and terminations\u003cbr/\u003e- Candidates must be flexible to work a variety of hours as business demands, including overnight, weekends and holidays","business_category":"fulfillment-ops","city":"Avenel","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our Sr. Operations Managers responsible for all budgetary, people development and operations objectives. The Sr. Operations Managers is responsible for all aspects of operation or functions at the site. Additional responsibilities include managing and leading a team of Operations and Area Managers, coaching and mentoring the team to ensure performance objectives are met, building positive employee relations and building leadership bench strength within the Fulfillment Center.\u003cbr/\u003e\u003cbr/\u003eResponsibilities:\u003cbr/\u003e• Drives creation of quality initiatives, process change initiatives and other Lean initiatives to enable their functional area and ultimately the FC to meet and exceed business plan.\u003cbr/\u003e• Responsible for the overall safety, quality and performance and customer experience of either Inbound or Outbound operations.\u003cbr/\u003e• Will set and clarify requirements and expectations for Operations and Area Managers. Measures performance, provides feedback, and holds Ops Managers accountable for their performance and the performance of their departments.\u003cbr/\u003e• Leverages the Operations and Area Managers by sourcing and nurturing ideas, and rolling them into the creation of improvement plans for the functional area.\u003cbr/\u003e• Takes proactive steps to ensure that best practices are shared across all departments, shifts and among the network.\u003cbr/\u003e• Works closely with support staff (HR, Finance, Facilities, Safety, IT and other Sr. Operations Managers) to build and secure support and resources for projects and initiatives in their area, as well as providing needed support and resources for other staff initiatives.\u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements:\u003cbr/\u003e• Lift and move totes up to 49 pounds each\u003cbr/\u003e• Regular bending, lifting, stretching and reaching both below the waist and above the head\u003cbr/\u003e• Walking in the FC and around area with great frequency; facilities are over a quarter mile in length\u003cbr/\u003e• Continual standing and/or walking an average of 5 miles daily\u003cbr/\u003e• Ability to work in construction /distribution environments that may be noisy, unlit, unheated, not air-conditioned\u003cbr/\u003e• Able to access all areas of building (ascending and descending ladders, stairs, gangways safely and without limitation)","department_cost_center":null,"description_short":"Our Sr. Operations Managers responsible for all budgetary, people development and operations objectives. The Sr. Operations Managers is responsible for all aspects of operation or functions at the site.","display_distance":null,"id":"55a0d4a4-c8e6-45ba-9252-beaa227a7092","id_icims":"3100495","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3100495/sr-operations-manager-north-america-sort-centers","job_schedule_type":"full-time","location":"US, NJ, Avenel","locations":["{\"normalizedStateName\":\"New Jersey\",\"normalizedCountryCode\":\"USA\",\"city\":\"Avenel\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NJ, Avenel\",\"coordinates\":\"40.57829,-74.28018\",\"normalizedCountyName\":\"Middlesex\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Avenel, New Jersey, USA\",\"location\":\"US, NJ, Avenel\",\"region\":\"NJ\",\"buildingCodeList\":[\"EWR5\"],\"normalizedCityName\":\"Avenel\"}"],"normalized_location":"Avenel, New Jersey, USA","optional_search_labels":[],"posted_date":"October  3, 2025","preferred_qualifications":"• Degree in Engineering, Operations or related field and MBA preferred\u003cbr/\u003e• Experience with a contingent workforce during peak seasons\u003cbr/\u003e• Ability to handle changing priorities and use good judgment in stressful situations\u003cbr/\u003e• Interest in long-term career development through assignments in multiple FCs across the nation\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $121,500/year in our lowest geographic market up to $200,900/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"NJ","title":"Sr. Operations Manager, North America Sort Centers","university_job":null,"updated_time":"28 minutes","url_next_step":"https://account.amazon.com/jobs/3100495/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Lithia Springs","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support the operations of some of the world’s most Customer Centric data centers. Our Data Center Engineering Operations team maintain and operate our critical infrastructure systems so that they are prepared to stand up against any situation.\u003cbr/\u003e\u003cbr/\u003eAWS has the world’s largest cloud computing portfolio. As an Amazonian you will work in some of the most sophisticated, safe, and secure data centers in the world. Our Engineering Operations Technicians (EOT’s) help keep them that way by working with the brightest minds from around the globe to help test and implement the newest technology and work practices to meet the demands of a changing market.\u003cbr/\u003e\u003cbr/\u003eWe have a passion for learning and evolving, it’s how we have helped define ourselves as leaders in the industry. Let’s work hard, have fun, and make history!\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule including night shift. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.","department_cost_center":null,"description_short":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support the operations of some of the world’s most Customer Centric data","display_distance":null,"id":"668f532f-050a-462f-9d29-3d39b34b28ac","id_icims":"3174932","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3174932/engineering-operations-technician-dceo","job_schedule_type":"full-time","location":"US, GA, Lithia Springs","locations":["{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Lithia Springs\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Lithia Springs\",\"coordinates\":\"33.79382,-84.66073\",\"normalizedCountyName\":\"Douglas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Lithia Springs, Georgia, USA\",\"location\":\"US, GA, Lithia Springs\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL88\",\"ATL73\",\"ATL8\",\"ATL250\",\"ATL82\",\"ATL72\",\"ATL81\",\"VUGO\",\"ATL701\",\"SGA2\",\"ATL68\"],\"normalizedCityName\":\"Lithia Springs\"}"],"normalized_location":"Lithia Springs, Georgia, USA","optional_search_labels":["aws.team-ais","aws.team-dc","hourly","military"],"posted_date":"February  5, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Technical (Military/Trade School) training\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, GA, LITHIA SPRINGS - 31.00 - 55.00 USD hourly\u003cbr/\u003eUSA, GA, Lithia Springs - 31.00 - 55.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"GA","title":"Engineering Operations Technician , DCEO","university_job":null,"updated_time":"30 minutes","url_next_step":"https://account.amazon.com/jobs/3174932/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bonne maîtrise de la suite MS Office (Word, Excel, Outlook) dans un environnement professionnel\u003cbr/\u003e- Vous possédez le diplôme du baccalauréat\u003cbr/\u003e- Vous possédez une expérience en matière de direction d'équipe dans un environnement opérationnel ou logistique dynamique orienté processus\u003cbr/\u003e- Parfaite maîtrise du français, à l’oral et à l’écrit","business_category":"fulfillment-ops-team","city":"Ormes","company_name":"Amazon France Transport SAS","country_code":"FRA","description":"Vous serez amené à changer de shifts\u003cbr/\u003e\u003cbr/\u003eLes opérations sont au cœur de toutes les activités d’Amazon. L’efficacité de nos fonctions opérationnelles nous permet de traiter nos commandes et d’expédier les articles à nos clients en temps voulu. En tant que superviseur des opérations, vous verrez comment nous assurons le fonctionnement de nos différentes fonctions opérationnelles et vous jouerez un rôle dans leur bon déroulement.\u003cbr/\u003eVous serez le premier point de contact des membres de l’équipe pendant leur service et les aiderez à suivre les processus mis en place par vos supérieurs. Il s’agit d’un rôle de terrain, qui vous permettra d’acquérir de l’expérience dans l’utilisation des outils et des systèmes essentiels au succès de nos opérations. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Mesurer et contrôler les flux de travail, suivre les performances sur site et fournir aux responsables de terrain les données nécessaires et relatives aux postes/équipes afin de nous aider à atteindre notre objectif d’excellence opérationnelle\u003cbr/\u003e- Soutenir et former les collaborateurs pour qu’ils donnent le meilleur d’eux-mêmes et les superviser dans leurs tâches quotidiennes\u003cbr/\u003e- Soutenir le responsable d’équipe/de secteur pour améliorer les processus, cultiver un environnement de travail sûr et accroître l’engagement des collaborateurs\u003cbr/\u003e- Travailler avec d’autres services pour trouver des solutions aux problèmes fréquents ou aux besoins en matière d’appui opérationnel dans les secteurs clés\u003cbr/\u003e- Analyse les données pour identifier les solutions qui nous permettront d’optimiser la sécurité, la qualité et la productivité \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eEn tant que superviseur des opérations, vous serez basé·e sur l’un de nos sites opérationnels. Vous aiderez votre chef d’équipe/de secteur à mettre en pratique le plan de travail de l’équipe. Vous participerez aux réunions d’avant-poste avec votre équipe. Vous vous assurerez que chacun respecte les règles de sécurité et les processus de qualité en place et effectue les tâches selon le degré de priorité de chacune.\u003cbr/\u003eVous ferez remonter les problèmes à votre supérieur, mais vous serez parfois la personne la plus gradée de l’équipe et vous donnerez aux collaborateurs les instructions dont ils ont besoin pour mener à bien leurs tâches. À d’autres moments, vous aiderez votre chef d’équipe/de secteur à planifier les rotations d’équipes afin d’avoir un personnel suffisamment nombreux pendant les périodes de pointe. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Logistics, ou AMZL, s’occupe des activités de livraison du « dernier kilomètre » en partenariat avec des entreprises de distribution tierces. Nous faisons appel à la créativité et aux initiatives visant à l’amélioration continue pour acheminer des millions de produits physiques jusqu’à nos clients. Notre objectif est de rendre l’expérience de livraison de nos clients aussi fluide que possible et de déployer des solutions de livraison globales pour nos concepts les plus récents, tels qu’Amazon Fresh, Prime Now et Amazon Restaurants.\u003cbr/\u003eNotre travail s’effectue de deux manières. Nos collaborateurs·trices « sous le toit » traitent des millions de produits avant de les envoyer à nos équipes de livraison. La dimension humaine est au cœur des activités de l’équipe. Nous jouons essentiellement un rôle de soutien, y compris de nuit. Nous nous concentrons principalement sur les opérations, avec des équipes présentes 24 heures sur 24, 7 jours sur 7 dans la plupart de nos sites.\u003cbr/\u003eQuant à nos collaborateurs·trices « sur la route », ils travaillent avec Amazon Flex, un réseau d’entreprises de livraison. Chaque année, nous plaçons la barre toujours plus haut en matière d’expérience client grâce à de nouveaux services de livraison. Nous recherchons de nouveaux moyens de relever les défis logistiques du secteur et de nouvelles idées pour réduire notre empreinte carbone, en nous appuyant sur un parc de véhicules (y compris des véhicules électriques) et des technologies de pointe.","department_cost_center":null,"description_short":"Vous serez amené à changer de shiftsLes opérations sont au cœur de toutes les activités d’Amazon. L’efficacité de nos fonctions opérationnelles nous permet de traiter nos commandes et d’expédier les articles","display_distance":null,"id":"e717722b-b8e3-4c50-ab0b-acae0b7f194e","id_icims":"3160973","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3160973/superviseur-euse-des-operations-h-f-x-operations-supervisor","job_schedule_type":"full-time","location":"FR, Ormes","locations":["{\"normalizedStateName\":\"Centre-Val de Loire\",\"normalizedCountryCode\":\"FRA\",\"city\":\"Ormes\",\"countryIso3a\":\"FRA\",\"countryIso2a\":\"FR\",\"locationNonStemming\":\"France, Ormes\",\"coordinates\":\"47.94255,1.81772\",\"normalizedCountyName\":\"Loiret\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"France\",\"normalizedLocation\":\"Ormes, Centre-Val de Loire, FRA\",\"location\":\"FR, Ormes\",\"region\":\"\",\"buildingCodeList\":[\"DWV1\"],\"normalizedCityName\":\"Ormes\"}"],"normalized_location":"Ormes, Centre-Val de Loire, FRA","optional_search_labels":[],"posted_date":"January 16, 2026","preferred_qualifications":"- Expérience dans la gestion des parties prenantes, y compris l’établissement et le maintien de relations professionnelles\u003cbr/\u003e- Expérience dans un environnement opérationnel, tel que la logistique, le commerce de détail, l’hôtellerie ou le service client\u003cbr/\u003e- Expérience préalable dans l’analyse de données pour identifier les problèmes\u003cbr/\u003e- Maîtrise de l’anglais\u003cbr/\u003e\u003cbr/\u003eAmazon est un employeur engagé pour l'égalité des chances. Nous sommes convaincus qu'une main d'oeuvre diversifée est essentielle à notre réussite. Nous prenons nos décisions de recrutement en fonction de votre expérience et de vos compétences. Nous apprécions votre envie de découvrir, d'inventer, de simplifier et de construire. La protection de votre vie privée et la sécurité de vos données constituent depuis longtemps une priorité absolue pour Amazon. Veuillez consulter notre Politique de Confidentialité pour en savoir plus sur la façon dont nous collectons, utilisons et traitons les données personnelles de nos candidats.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops-team.fulfillment-associates","source_system":"JobCreator","state":null,"title":"Superviseur/euse des Opérations (H/F/X), Operations supervisor","university_job":null,"updated_time":"33 minutes","url_next_step":"https://account.amazon.com/jobs/3160973/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"fulfillment-associates","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree;\u003cbr/\u003e- Experience with PLC controlled automation and issue diagnosis in a continuous process or production environment;\u003cbr/\u003e- Experience in dealing with material handling, flow and capacity;\u003cbr/\u003e- Experience in written and spoken English;\u003cbr/\u003e- Experience supporting a wide range of different conveyors and sortation systems;\u003cbr/\u003e- Experience with Microsoft Office, SolidWorks, Ignition, Visio and AutoCAD.","business_category":"fulfillment-ops","city":"Cajamar","company_name":"Amazon Servicos de Varejo do Brasil Ltda.","country_code":"BRA","description":"DESCRIPTION:\u003cbr/\u003eAmazon Operations sits at the heart of the Amazon customer experience. We look after everything from the moment a customer clicks buy, to the moment their item is delivered – from desktop to doorstep.\u003cbr/\u003e\u003cbr/\u003eAmazon has several Fulfillment Centers, Sort Centers and Delivery Stations, thousands of machines, and thousands of employees, all working together in harmony to make sure the right item gets delivered to the right person, in the right place, at the right time.\u003cbr/\u003e   \u003cbr/\u003eWorking in Amazon Operations is for people who like to be active and give their all. We work in a busy, dynamic environment and are part of a bigger team delivering on the expectations of millions of customers every single day. We are open, inclusive and welcome individuality and diversity. Our teams take pride in a job well done, looking out for one another, ensuring the highest safety standards and playing their part in delivering the quality service Amazon is known for around the world.\u003cbr/\u003e   \u003cbr/\u003eJoin us in the Amazon Reliability Maintenance Engineering team. We maintain and optimize technologies in the Global Amazon Warehouse \u0026 Delivery Network.\u003cbr/\u003e     \u003cbr/\u003ePURPOSE OF THE JOB:\u003cbr/\u003eWe are looking for motivated, customer-focused people who want to join our team as an Automation Engineer (AE). The focus of the AE role is to fault find, troubleshoot and improve controls solutions for automated material handling equipment such as conveyors, sortation systems, scanners, cameras, print and apply systems, scales, Human-Machine Interface (HMI) systems, and control cabinets. The AE will also provide training to the Engineering Technicians on device troubleshooting and preventive maintenance.\u003cbr/\u003e   \u003cbr/\u003e  \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e     - Be the site level Subject Matter Expert (SME) for all controls systems and sensors within the building. Work in a hands-on manner to actively monitor, fault find and repair systems in order to provide a high level of equipment availability to internal customers.\u003cbr/\u003e   - Train technicians in the basics of control systems fault finding in order to raise the level of knowledge within the site.\u003cbr/\u003e   - Work within the Global Controls network to enhance the capability to monitor Material      Handling Equipment (MHE) metrics and provide visualization and data to internal customers by means of troubleshooting and prioritizing.\u003cbr/\u003e   - Actively participate in or own continuous improvement projects coordinated by the      Global Controls network.\u003cbr/\u003e   - Work with Global Controls Engineering and Operations Engineering to ensure all systems are correctly documented and that accurate backup libraries are maintained.\u003cbr/\u003e   - Work alongside global teams to support the installation and commission of new equipment.\u003cbr/\u003e   - Support other sites in the Brazil network as required.\u003cbr/\u003e   - Interpreting both mechanical and electrical drawings plus understanding and developing      improvement strategies for code conforming.","department_cost_center":null,"description_short":"DESCRIPTION:Amazon Operations sits at the heart of the Amazon customer experience. We look after everything from the moment a customer clicks buy, to the moment their item is delivered – from desktop to","display_distance":null,"id":"f9ee093b-140f-47f2-b397-10f41e428f91","id_icims":"3169637","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"System Development Engineering","job_function_id":null,"job_path":"/en/jobs/3169637/regional-automation-engineer-amazon-reliability-maintenance-engineering-intlrme","job_schedule_type":"full-time","location":"BR, SP, Cajamar","locations":["{\"normalizedStateName\":\"Sao Paulo\",\"normalizedCountryCode\":\"BRA\",\"city\":\"Cajamar\",\"countryIso3a\":\"BRA\",\"countryIso2a\":\"BR\",\"locationNonStemming\":\"Brazil, SP, Cajamar\",\"coordinates\":\"-23.35635,-46.87702\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Brazil\",\"normalizedLocation\":\"Cajamar, Sao Paulo, BRA\",\"location\":\"BR, SP, Cajamar\",\"region\":\"SP\",\"buildingCodeList\":[\"GRU8\"],\"normalizedCityName\":\"Cajamar\"}"],"normalized_location":"Cajamar, Sao Paulo, BRA","optional_search_labels":[],"posted_date":"January 29, 2026","preferred_qualifications":"- Experience in a multi-site environment;\u003cbr/\u003e- Experience in project management;\u003cbr/\u003e- Knowledge of process improvement, ideally including Lean, Kaizen and Six Sigma;\u003cbr/\u003e- Electrical or mechanical training degree in computer science, mechanical engineering, electrical engineering, or related fields;\u003cbr/\u003e- Understanding of ISO 13849 \u0026 62061.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":"SP","title":"Regional Automation Engineer, Amazon Reliability Maintenance Engineering - IntlRME","university_job":null,"updated_time":"35 minutes","url_next_step":"https://account.amazon.com/jobs/3169637/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience acting as a Program Security Officer, Security Specialist, or Security Manager with duties including interpreting and implementing requirements within the personnel, industrial, and physical security disciplines and overseeing security operations\u003cbr/\u003e- 2+ years’ experience in physical security project management.\u003cbr/\u003e- 2+ years' experience in Security Operations experience in technology, manufacturing, or similar industries, to include access control systems, CCTV, and defense in depth strategies.","business_category":"aws","city":"Manassas","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Amazon Web Services (AWS) and Amazon.com serve customers and developers all over the world who rely on storage, compute, and other services that power Amazon’s consumer, digital and AWS businesses. Our customers trust us to handle their data with air-tight security. Customer data security is a given and a guarantee for our businesses.\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Physical Security team is looking for a highly talented and motivated Physical Security System Project Manager and Technology Expert to lead physical security projects. This position will be responsible for the management of data center physical security systems and projects. A successful candidate will be responsible for interpretation of Threat Assessments and AWS Physical Security Standards to assure the proper security mitigations are selected to meet the unique challenges in each area. You will be responsible for collaborating with AWS architectural and engineering teams to assure each data center meets the high standards AWS sets for physical security. After implementation, this position will be responsible for assuring local security teams have the technical knowledge and resources necessary to meet the physical security mission.\u003cbr/\u003e`\u003cbr/\u003e- Considered candidates should be at least 18 years old.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Manage installation of approved physical security system hardware, including, but not limited to, access control devices, intrusion detection devices, CCTV, and other components of physical security systems.\u003cbr/\u003e- Design of physical security system for new construction, expansion and retrofit projects.\u003cbr/\u003e- Preparation of security design standards, typical drawings, and technical specification documents for projects for the purposes of pricing by approved vendors. Review and provide quality assurance of vendor quotes. Submission of complete and accurate vendor quote packages to the Infrastructure Technical Project Manager for inclusion in project requisitions.\u003cbr/\u003e- Project management of multiple, concurrent security system installation projects and vendors.\u003cbr/\u003e- Subject Matter Expert for physical security system testing and acceptance, and assuring operational readiness at project completion.\u003cbr/\u003e- Preparation and archiving of project close-out documentation.\u003cbr/\u003e- Reporting vendor performance metrics regarding system installation, service delivery, and equipment availability / reliability.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Infrastructure Services (AIS)  owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. \u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Web Services (AWS) and Amazon.com serve customers and developers all over the world who rely on storage, compute, and other services that power Amazon’s consumer, digital and AWS businesses. Our","display_distance":null,"id":"4c2a88e3-7eb7-4322-a125-9e2798034a66","id_icims":"3174968","is_intern":null,"is_manager":null,"job_category":"Investigation \u0026 Loss Prevention","job_family":"Data Center Security","job_function_id":null,"job_path":"/en/jobs/3174968/security-program-manager-dc-security-amer-e","job_schedule_type":"full-time","location":"US, VA, Manassas","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Manassas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Manassas\",\"coordinates\":\"38.75125,-77.47086\",\"normalizedCountyName\":\"Manassas (City)\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Manassas, Virginia, USA\",\"location\":\"US, VA, Manassas\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD109\"],\"normalizedCityName\":\"Manassas\"}"],"normalized_location":"Manassas, Virginia, USA","optional_search_labels":["military","aws.team-security-optional","aws.team-dc","aws.team-ais"],"posted_date":"February  5, 2026","preferred_qualifications":"- Experience in the delivery of physical security projects or programs within an enterprise setting.\u003cbr/\u003e- Background in any of the following: Physical Security Design, Security Systems Deployment, Physical Security Operations, Security Architecture, Construction Management\u003cbr/\u003e- Proficient in AutoCAD and/or physical security designs.\u003cbr/\u003e- Demonstrated ability to successfully influence stakeholders without formal authority, leading cross functional teams across geographies and business units\u003cbr/\u003e- PSP, CPP, PMP Certification; Training in Crime Prevention Through Environmental Design (CPTED), Certification or experience with Lenel Access Control System.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Manassas - 61,100.00 - 106,900.00 USD annually","primary_search_label":"aws.team-program-management-primary","source_system":"JobCreator","state":"VA","title":"Security Program Manager , DC Security AMER E","university_job":null,"updated_time":"36 minutes","url_next_step":"https://account.amazon.com/jobs/3174968/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-program-management-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}