{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Completed Bachelor’s Degree from an accredited University,\u003cbr/\u003e- Working experience in Operations, Supply Chain/Logistics, or a related field,\u003cbr/\u003e- Experience as a manager, involving sizable teams; you’re a natural at motivating others around you and building strong relationships,\u003cbr/\u003e- Demonstrate ability in problem-solving and analytical capabilities: conducting and driving Dive Deep analysis on complex processes,\u003cbr/\u003e- Excellent communication skills, both verbal and written,\u003cbr/\u003e- Experience with performance metrics and process improvement,\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, days and nights,\u003cbr/\u003e- Authorised to work in Australia without sponsorship.","business_category":"fulfillment-and-operations","city":"Sydney","company_name":"Amazon Commercial Services Pty Ltd","country_code":"AUS","description":"Here at Amazon we are currently seeking for experienced Sort Center Shift Managers to join our team within our Kemps Creek Sort Center. \u003cbr/\u003e\u003cbr/\u003eFor this position, you'll play a key role in driving engagement and execution excellence in our Sort Center operations. This leader will be comfortable managing and inspiring a team, able to think strategically (while paying careful attention to detail), and enjoy working in a fast-paced, dynamic and data-intensive operations environment. The successful candidate will be a natural self-starter who is comfortable supporting daily operational activities. This individual must have a curious mind-set, excellent analytical abilities, as well as superior written and verbal communication skills. \u003cbr/\u003e\u003cbr/\u003ePlease note the shift pattern is based on 4 days on and 3 days off, this is a full-time contract. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Leading and developing a team of Amazon associates\u003cbr/\u003e- Maintaining Health and Safety standards, while promoting a Health and Safety culture on-site.\u003cbr/\u003e- Oversee and improve performance of all aspects of sortation operations including but not limited to: \u003cbr/\u003e- Lead sort center activities across a shift and support coordination of staff plans and operating schedules.\u003cbr/\u003e- Develop a strong performing team fostering a culture of safety, customer obsession and engagement.\u003cbr/\u003e- Support developing and implementing process quality and continuous improvement initiatives.\u003cbr/\u003e- Encourage and strengthen our strong culture of health and safety best practices.\u003cbr/\u003e- Contribute to cross-functional projects as needed.","department_cost_center":null,"description_short":"Here at Amazon we are currently seeking for experienced Sort Center Shift Managers to join our team within our Kemps Creek Sort Center. For this position, you'll play a key role in driving engagement and","display_distance":null,"id":"bd6da29e-9404-4e2d-b3e3-d7555fac009a","id_icims":"3186547","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3186547/operation-shift-manager-sort-centre-operations","job_schedule_type":"full-time","location":"AU, Sydney","locations":["{\"normalizedStateName\":\"New South Wales\",\"normalizedCountryCode\":\"AUS\",\"city\":\"Sydney\",\"countryIso3a\":\"AUS\",\"countryIso2a\":\"AU\",\"locationNonStemming\":\"Australia, Sydney\",\"coordinates\":\"-33.87073,151.20788\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Australia\",\"normalizedLocation\":\"Sydney, New South Wales, AUS\",\"location\":\"AU, Sydney\",\"region\":\"\",\"buildingCodeList\":[\"BWU5\"],\"normalizedCityName\":\"Sydney\"}"],"normalized_location":"Sydney, New South Wales, AUS","optional_search_labels":["stores.lander-australia"],"posted_date":"February 23, 2026","preferred_qualifications":"- You are leader and exhibit that in you every day work,\u003cbr/\u003e- You have the ability to thrive in an ambiguous environment, and when given a deadline you know how to motivate yourself and meet it,\u003cbr/\u003e- You have strong verbal and written communication skills,\u003cbr/\u003e- You enjoy analytical work and using data to provide thought-provoking and workable solutions,\u003cbr/\u003e- You typically volunteer to lead projects and help your team achieve goals,\u003cbr/\u003e- You have a track record of taking ownership and driving results,\u003cbr/\u003e- You see value in long term thinking and large scale impact to a company.\u003cbr/\u003e\u003cbr/\u003eAcknowledgement of country:\u003cbr/\u003eIn the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.\u003cbr/\u003e\u003cbr/\u003eIDE statement:\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.no-team-listed","source_system":"JobCreator","state":null,"title":"Operation Shift Manager, Sort Centre Operations","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3186547/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Electrical Engineering\u003cbr/\u003e- Experience with large-scale power systems\u003cbr/\u003e- Bachelor's degree in electrical or mechanical engineering, engineering technology or equivalent, or 6+ years of project management and implementation experience\u003cbr/\u003e- 10+ years of electrical or mechanical engineering experience","business_category":"aws","city":"Hyderabad","company_name":"ADSIPL - Telangana","country_code":"IND","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eThe Sr. Project Manager is a strategically significant role on the Data Center Construction team dedicated to leading projects for construction of Data centers. You will lead the Electricals Substation and transmission Project and construction management for our projects in Hyderabad.\u003cbr/\u003eOur Data Center Construction team owns and drives the construction life cycle from pre-construction, through procurement, to managing the onsite construction work. The Project manager will be expected to dive deep and know construction management; inspire and think big about the construction management program; and support, related stakeholders within AWS to deliver electrical supply capacity and capability to our customers. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Manage the project delivery across multiple sites including developing managing and reporting on safety, quality scope, schedule and budget ensuring predictable delivery within the business, cost and schedule expectations.\u003cbr/\u003e- Strategic and tactical management of construction capacity delivery within Hyderabad\u003cbr/\u003e- Communicate and provide guidance to Finance during the development and execution of capital budgets.\u003cbr/\u003e- Work with Energy team of AWS to partner on delivering the electrical supply capability and capacity to the Data centers being constructed.\u003cbr/\u003e- Coordinate with various teams supporting the data center development and launch.\u003cbr/\u003e- Develop and manage metrics quantifying performance within the region.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. ","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"9720710b-cbda-42fa-9fd0-0cfbe864dd21","id_icims":"3186546","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3186546/sr-project-manager-aws-data-center-capacity-delivery-dccd","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD11\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":["aws.team-ais","aws.team-dcpd-optional","aws.team-dc"],"posted_date":"February 23, 2026","preferred_qualifications":"- Experience in construction of data center delivery (design, commissioning and construction), mission critical facilities, or equivalent industrial/manufacturing facility builds\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-no-matching-primary-label-listed","source_system":"JobCreator","state":"TS","title":"Sr. Project Manager, AWS Data Center Capacity Delivery (DCCD)","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3186546/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-no-matching-primary-label-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- 3+ years of increasing responsibilities in EHS or environmental programs in manufacturing, production, or service operations experience\u003cbr/\u003e- 3+ years of increasing responsibilities in people and performance management, or 2+ years of Amazon Safety (blue badge/FTE) experience","business_category":"fulfillment-and-operations","city":"West Jefferson","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We're seeking a dedicated Workplace Health \u0026 Safety (WHS) Manager to join our mission of creating the world's safest work environment. This role offers an exciting opportunity to directly impact associate well being while driving operational excellence.\u003cbr/\u003e\u003cbr/\u003eAs a WHS Manager, you'll be the site's safety champion, leading our Global WHS Program implementation. You'll combine hands-on safety management with strategic thinking to protect our most valuable asset – our people. Your role bridges the gap between safety requirements and operational success, requiring both technical expertise and strong interpersonal skills. Working closely with Operations leadership, you'll drive safety initiatives that make a real difference. You'll conduct comprehensive risk assessments, analyze safety data, and implement practical solutions that protect associates while supporting productivity. Your ability to build relationships and influence positive change will be essential as you help shape our safety culture. You'll lead safety compliance efforts, conduct thorough site audits, and analyze incident trends to target improvements where they matter most. Managing our first aid program and emergency response capabilities, you'll ensure immediate care is always available. Your analytical skills will transform safety data into actionable insights, while your leadership abilities will help engage associates in our safety mission.\u003cbr/\u003e\u003cbr/\u003eCore Impact Areas:\u003cbr/\u003eSafety Leadership \u0026 Innovation - Transform safety culture through leadership and innovative solutions. Drive continuous improvement initiatives that set new benchmarks in workplace safety. Leverage technology and data analytics to drive preventive safety measures that protect our associates while enhancing operational excellence. Develop leadership plans, communicate expectations, and drive initiatives to create a safe work environment. Measure performance against WHS policies, analyze metrics, and conduct site audits to address non-compliance issues. \u003cbr/\u003e\u003cbr/\u003eStrategic Partnership \u0026 Influence - Build partnerships with Operations leadership to integrate safety into every aspect of our business. Use compelling data analysis and risk insights to influence positive change and drive strategic decision-making. Establish yourself as a trusted advisor who balances safety excellence with operational demands. Oversee recordkeeping, workplace organization, and WHS training programs. \u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements include: \u003cbr/\u003e- Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Stand/walk for up to 12 hours during shifts\u003cbr/\u003e- Work in an environment where the noise level varies \u003cbr/\u003e- Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e- Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e- Maintain effective care delivery in emergencies and assist emergency response at the site\u003cbr/\u003e\u003cbr/\u003eFor those that do not have an adult First Aid, CPR, AED certification from the American Heart Association or American Red Cross, must obtain within 3 weeks of start date.","department_cost_center":null,"description_short":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. We're seeking","display_distance":null,"id":"1822bec3-64c1-4789-82b9-84e0bbede6d2","id_icims":"3168214","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3168214/site-ehs-manager-ii","job_schedule_type":"full-time","location":"US, OH, West Jefferson","locations":["{\"normalizedStateName\":\"Ohio\",\"normalizedCountryCode\":\"USA\",\"city\":\"West Jefferson\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OH, West Jefferson\",\"coordinates\":\"39.94479,-83.26904\",\"normalizedCountyName\":\"Madison\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"West Jefferson, Ohio, USA\",\"location\":\"US, OH, West Jefferson\",\"region\":\"OH\",\"buildingCodeList\":[\"CMH4\"],\"normalizedCityName\":\"West Jefferson\"}"],"normalized_location":"West Jefferson, Ohio, USA","optional_search_labels":[],"posted_date":"January 27, 2026","preferred_qualifications":"- Distribution Center or Manufacturing EHS experience with mix of exempt and non-exempt employees at a site of at least 250 people\u003cbr/\u003e- Master’s degree\u003cbr/\u003e- Experience implementing lean principles and process improvement in an operational environment.\u003cbr/\u003e- Experience in a fast paced, dynamic organization.\u003cbr/\u003e- Certified Safety Professional\u003cbr/\u003e- Excellent written and verbal communication skills, including comfort interfacing with site leader\u003cbr/\u003e- Ability to develop and implement department goals and strategies.\u003cbr/\u003e- Strong analytical skills with demonstrated problem solving ability.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, OH, West Jefferson - 70,100.00 - 105,200.00 USD annually","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"OH","title":"Site EHS Manager II","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3168214/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in written and verbal communication skills to communicate with technical and non-technical audiences, including senior leadership\u003cbr/\u003e- Experience communicating with users, other technical teams, and management to collect requirements, describe software product features, and technical designs\u003cbr/\u003e- Experience dealing well with ambiguity, prioritizing needs, and delivering measurable results in an agile environment\u003cbr/\u003e- Bachelor’s Degree in aerospace, engineering, mathematics, or related field\u003cbr/\u003e- 8+ years professional development experience in a DO-178C environment\u003cbr/\u003e- Familiarity with at least one software language such as C++","business_category":"retail","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Here at Amazon, we embrace our differences. We are committed to furthering our culture of diversity and inclusion of our teams within the organization.\u003cbr/\u003eHow do you get items to customers quickly, cost-effectively, and—most importantly—safely, in less than an hour? And how do you do it in a way that can scale? Our teams of hundreds of scientists, engineers, aerospace professionals, and futurists have been working hard to do just that! We are delivering to customers, and are excited for what’s to come. Check out more information about Prime Air on the About Amazon blog (https://www.aboutamazon.com/news/transportation/amazon-prime-air-delivery-drone-reveal-photos).\u003cbr/\u003e\u003cbr/\u003eIf you are seeking an iterative environment where you can drive innovation, apply state-of-the-art technologies to solve real world delivery challenges, and provide benefits to customers, Prime Air is the place for you.\u003cbr/\u003e\u003cbr/\u003eCome work on the Amazon Prime Air Team! \u003cbr/\u003e\u003cbr/\u003eWe’re looking for a Sr Systems Engineer with software experience who combines superb technical, analytical, and operational capabilities with a demonstrated ability to get the right things done quickly and effectively. This person must be comfortable working closely with a team of top-notch software developers to guide them through the certification process during software design and development. This person will also collaborate with our systems and hardware engineering teams to own the certification process for our components. We’re looking for someone who innovates, and loves solving hard problems. You will work hard, have fun, and of course, make history!\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eExport Control License\u003cbr/\u003eThis position may require a deemed export control license for compliance with applicable laws and regulations. Placement is contingent on Amazon’s ability to apply for and obtain an export control license on your behalf.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Develop optimal certification strategy tailored to Prime Air's unique drone delivery system\u003cbr/\u003e- Design and execute comprehensive test strategies that demonstrate compliance with safety and performance requirements\u003cbr/\u003e- Bridge engineering teams, quality assurance, program management, and certification authorities on certification strategy\u003cbr/\u003e- Ensure development processes and documentation meet regulatory requirements and prepare for certification audits\u003cbr/\u003e","department_cost_center":null,"description_short":"Here at Amazon, we embrace our differences. We are committed to furthering our culture of diversity and inclusion of our teams within the organization.How do you get items to customers quickly, cost-effectively,","display_distance":null,"id":"61fa5b17-512b-4735-bb63-f50c4a51229a","id_icims":"3186544","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Interdisciplinary Systems Engr","job_function_id":null,"job_path":"/en/jobs/3186544/sr-systems-engineer-iii-prime-air","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA109\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February 22, 2026","preferred_qualifications":"- Master's degree in Computer Science, Engineering, Mathematics, or a related field\u003cbr/\u003e- Experience in professional software development\u003cbr/\u003e- Experience leading teams that deliver DO-178C certified software\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 151,200.00 - 204,600.00 USD annually","primary_search_label":"retail.team-global-prime-air","source_system":"JobCreator","state":"WA","title":"Sr Systems Engineer III, Prime Air","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3186544/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-prime-air","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of engineering team management experience\u003cbr/\u003e- 7+ years of working directly within engineering teams experience\u003cbr/\u003e- 3+ years of designing or architecting (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience partnering with product or program management teams","business_category":"aws","city":"Cupertino","company_name":"Annapurna Labs (U.S.) Inc.","country_code":"USA","description":"DESCRIPTION\u003cbr/\u003eAWS Utility Computing (UC) provides product innovations, from foundational services such as Amazon Elastic Compute Cloud (EC2), to new product innovations that continue to set AWS’s services and features apart in the industry.\u003cbr/\u003e\u003cbr/\u003eWe develop AWS Neuron, the complete software stack for Trainium, Amazon's custom cloud-scale\u003cbr/\u003emachine learning accelerators. Come optimize LLMs such as Llama and GPT-OSS to run really fast on Trainium.\u003cbr/\u003e\u003cbr/\u003eAs the SDM for the LLM Inference Model Enablement team, you will lead a team of expert AI/ML engineers to onboard and optimize state-of-the-art open-source and customer LLMs, both dense and MoE, for inference on Neuron and Trainium and Inferentia accelerators. You will also drive improvements in model enablement speed and experience, while advancing inference usability and quality through inference features, infrastructure optimization, tools, and automation.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will have a strong background in LLM model architectures, model performance optimizations, and inference techniques,  such as delivering high-performance models using distributed inference libraries. You should be capable of managing demanding, fast-changing priorities. You should have a strong technical ability to understand and deliver as part of a vertically integrated system stack consisting of the PyTorch inference library, Neuron compiler, runtime, and collectives.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou will work with your senior management and technical leaders to define the model enablement and performance optimization for the latest SOTA LLMs, build and deliver them to customers.\u003cbr/\u003e\u003cbr/\u003eMeanwhile, lead the team to continue improving the model onboarding experience, as well as enhancing inference usability and quality for Neuron-supported models.\u003cbr/\u003e\u003cbr/\u003eYou will manage changing priorities as new models and new technologies emerge, and you adapt your team’s work to manage them. You will dive deep to help your team solve technical challenges.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"DESCRIPTIONAWS Utility Computing (UC) provides product innovations, from foundational services such as Amazon Elastic Compute Cloud (EC2), to new product innovations that continue to set AWS’s services","display_distance":null,"id":"f16d5bdf-cd4f-4347-98db-db43181b8f26","id_icims":"3074104","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3074104/software-development-manager-llm-inference-model-enablement-neuron-sdk","job_schedule_type":"full-time","location":"US, CA, Cupertino","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Cupertino\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Cupertino\",\"coordinates\":\"37.31913,-122.02929\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Cupertino, California, USA\",\"location\":\"US, CA, Cupertino\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC29\"],\"normalizedCityName\":\"Cupertino\"}"],"normalized_location":"Cupertino, California, USA","optional_search_labels":["aws.team-annapurna-labs","aws.team-sde-sdm","aws.team-utility-computing"],"posted_date":"September  5, 2025","preferred_qualifications":"- Experience in communicating with users, other technical teams, and senior leadership to collect requirements, describe software product features, technical designs, and product strategy\u003cbr/\u003e- Experience in recruiting, hiring, mentoring/coaching and managing teams of Software Engineers to improve their skills, and make them more effective, product software engineers\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $166,400/year in our lowest geographic market up to $287,700/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"CA","title":"Software Development Manager, LLM Inference Model Enablement, Neuron SDK","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3074104/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of engineering team management experience\u003cbr/\u003e- 7+ years of working directly within engineering teams experience\u003cbr/\u003e- 3+ years of designing or architecting (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience partnering with product or program management teams","business_category":"aws","city":"Seattle","company_name":"Annapurna Labs (U.S.) Inc.","country_code":"USA","description":"DESCRIPTION\u003cbr/\u003eAWS Utility Computing (UC) provides product innovations — from foundational services such as\u003cbr/\u003eAmazon Elastic Compute Cloud (EC2), to new product innovations that continue to set AWS’s\u003cbr/\u003eservices and features apart in the industry.\u003cbr/\u003e\u003cbr/\u003eWe develop AWS Neuron, the complete software stack for Trainium, Amazon's custom cloudscale\u003cbr/\u003emachine learning accelerators. Come optimize LLMs such as Llama and GPT OSS to run\u003cbr/\u003ereally fast on Trainium.\u003cbr/\u003e\u003cbr/\u003eAs the SDM for the Neuron Inference Technology building blocks team, you will guide your\u003cbr/\u003eexpert AI engineers to build fundamental inference technology building blocks and libraries to\u003cbr/\u003eenable AI developers to optimize model for inference on Trainium and Inferentia devices. We’re\u003cbr/\u003ecurrently focusing on MoE models such as GPT OSS for Trainium 2 and the upcoming\u003cbr/\u003eTrainium 3. You will develop and optimize blocks such as attention kernels and\u003cbr/\u003edeliver them in the Neuronx_Distributed Inference Libraries, enabling customers to optimize\u003cbr/\u003eLLMs, multimodal, and generative models.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will have an established background in optimizing LLMs, such as delivering\u003cbr/\u003ehigh-performance models using distributed inference libraries. You should be capable of\u003cbr/\u003emanaging demanding, fast-changing priorities. You should have a strong technical ability to\u003cbr/\u003eunderstand and deliver as part of a vertically integrated system stack consisting of the PyTorch\u003cbr/\u003einference library, Neuron compiler, runtime and collectives.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e\u003cbr/\u003eYou will work with your senior management and technical leaders to define the building blocks\u003cbr/\u003efor the latest LLMs, build and deliver them to customers. You will manage changing priorities as\u003cbr/\u003enew models and new technologies emerge, and you adapt your team’s work to manage them.\u003cbr/\u003eYou will dive deep to help your team solve technical challenges.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAbout AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud\u003cbr/\u003eplatform. We pioneered cloud computing and never stopped innovating — that’s why\u003cbr/\u003ecustomers from the most successful startups to Global 500 companies trust our robust suite of\u003cbr/\u003eproducts and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed\u003cbr/\u003ein the job description, we encourage candidates to apply. If your career is just starting, hasn’t\u003cbr/\u003efollowed a traditional path, or includes alternative experiences, don’t let it stop you from\u003cbr/\u003eapplying.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of\u003cbr/\u003esacrifices at home, which is why we strive for flexibility as part of our working culture. When we\u003cbr/\u003efeel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer.\u003cbr/\u003eThat’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing\u003cbr/\u003eresources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"DESCRIPTIONAWS Utility Computing (UC) provides product innovations — from foundational services such asAmazon Elastic Compute Cloud (EC2), to new product innovations that continue to set AWS’sservices","display_distance":null,"id":"6ad31e77-f321-454e-a0b6-d30489a75dcc","id_icims":"3059846","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3059846/software-development-manager-ai-inference-technology-neuron-sdk","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA42\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["aws.team-annapurna-labs"],"posted_date":"August 14, 2025","preferred_qualifications":"- Experience in communicating with users, other technical teams, and senior leadership to collect requirements, describe software product features, technical designs, and product strategy\u003cbr/\u003e- Experience in recruiting, hiring, mentoring/coaching and managing teams of Software Engineers to improve their skills, and make them more effective, product software engineers\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $166,400/year in our lowest geographic market up to $287,700/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"WA","title":"Software Development Manager, AI Inference Technology, Neuron SDK","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3059846/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team","business_category":"aws","city":"Seattle","company_name":"Annapurna Labs (U.S.) Inc.","country_code":"USA","description":"In this role you will be responsible for leading a technical team which is critical in providing profiling and optimization tools for the Neuron ML accelerators fleet. You will work closely with the hardware and software teams to ensure the right tools are available for performance profiling of large ML workloads, identifying bottlenecks and automatically providing improvement recommendations. Neuron Core Tools develops and maintains a family of profiling software and provides ability for performance engineers to develop and improve custom kernels that would impact efficiency of large workloads.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Provide technical leadership to the Neuron Core Tools team\u003cbr/\u003e* Work closely with the frameworks and compiler teams.\u003cbr/\u003e* Collect requirements from various other teams including training, inference and runtime.\u003cbr/\u003e* Collaborate with the compiler performance team to ensure timely release of the core performance tools.\u003cbr/\u003e* Anticipate future needs based on the product roadmap and develop necessary tools to increase efficiency in large scale compute.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge-sharing and mentorship. Our senior members enjoy one-on-one mentoring and thorough, but kind, code reviews. We care about your career growth and strive to assign projects that help our team members develop your engineering expertise so you feel empowered to take on more complex tasks in the future.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eAbout Amazon Annapurna Labs:\u003cbr/\u003eAmazon Annapurna Labs team (our organization within AWS UC) is  responsible for building innovation in silicon and software for our AWS customers. We are at the forefront of innovation by combining cloud scale with the world’s most talented engineers. Our team covers multiple disciplines including silicon engineering, hardware design, software and operations. Because of our teams breadth of talent, we have been able to improve AWS cloud infrastructure in high-performance machine learning with AWS Neuron, Inferentia and Trainium ML chips, in networking and security with products such as AWS Nitro, Enhanced Network Adapter (ENA), and Elastic Fabric Adapter (EFA), and in computing with AWS Graviton and F1 EC2 instances.\u003cbr/\u003e\u003cbr/\u003eAbout AWS Utility Computing (UC):\u003cbr/\u003eAWS Utility Computing (UC) provides product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for their cloud services. Additionally, this role may involve exposure to and experience with Amazon's growing suite of generative AI services and other cloud computing offerings across the AWS portfolio.\u003cbr/\u003e\u003cbr/\u003eAbout AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAbout AWS Neuron:\u003cbr/\u003eAWS Neuron is the software of Trainium and Inferentia, the AWS Machine Learning chips. Inferentia delivers best-in-class ML inference performance at the lowest cost in the cloud to our AWS customers. Trainium is designed to deliver the best-in-class ML training performance at the lowest training cost in the cloud, and it’s all being enabled by AWS Neuron. Neuron is a Software that include ML compiler and native integration into popular ML frameworks. Our products are being used at scale with external customers like Anthropic and Databricks as well as internal customers like Alexa, Amazon Bedrocks, Amazon Robotics, Amazon Ads, Amazon Rekognition and many more.","department_cost_center":null,"description_short":"In this role you will be responsible for leading a technical team which is critical in providing profiling and optimization tools for the Neuron ML accelerators fleet. You will work closely with the hardware","display_distance":null,"id":"9b6ee497-6b62-4e6f-b653-31959b5bbee0","id_icims":"3105124","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3105124/sr-software-development-engineer-annapurna-labs","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA42\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Cupertino\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Cupertino\",\"coordinates\":\"37.31913,-122.02929\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Cupertino, California, USA\",\"location\":\"US, CA, Cupertino\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC29\"],\"normalizedCityName\":\"Cupertino\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["aws.team-annapurna-labs","aws.team-utility-computing"],"posted_date":"October  9, 2025","preferred_qualifications":"- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $151,300/year in our lowest geographic market up to $261,500/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"WA","title":"Sr. Software Development Engineer, Annapurna Labs","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3105124/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"aws","city":"Seattle","company_name":"Annapurna Labs (U.S.) Inc.","country_code":"USA","description":"AWS Neuron is the complete software stack for the AWS Inferentia and Trainium cloud-scale machine learning accelerators and the Trn1 and Inf1 servers that use them.\u003cbr/\u003e\u003cbr/\u003eAs the Software Development Engineer for the Neuron Foundation Tools Team, you will be responsible for working alongside a team of engineers to develop and maintain high-performance monitoring and profiling tools for machine learning applications and AI accelerators. You will work on design, development, and deployment of the Neuron Profiler and other Neuron Tools. The profiler plays a crucial role to internal and external customers in optimizing AI workloads across hardware platforms such as Trainium and Inferentia devices, by providing deep insights into performance bottlenecks and system behavior. Improving performance of ML Kernels and ML Frameworks.\u003cbr/\u003e\u003cbr/\u003eIn this role, you will manage the full development life cycle of the Neuron Profiler/Tools toolchain, ensuring scalability, reliability, and usability. You will collaborate with cross-functional teams to ensure that the our C++ compiler and runtime generates key information so customers can understand and optimize the performance of our custom hardware. Additionally, you will drive innovations that allow the profiler to support multiple frameworks, such as PyTorch, JAX, and XLA.\u003cbr/\u003e\u003cbr/\u003eA successful candidate will have an established background in building AI/ML and performance analysis tools. Experience with ML-specific profiler tools (like PyTorch Profiler or TensorFlow Profiler) is highly desirable, along with direct customer-facing experience and a strong motivation to achieve results.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e day in the life\u003cbr/\u003e You will work with the executive leadership and other senior management and technical leaders to define product directions and deliver them to customers. We build massive-scale distributed training and inference solutions. This organization builds the full stack of software, servers and chips to accelerate at the highest scale.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003e\u003cbr/\u003eHere at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences. Amazon’s culture of inclusion is reinforced within our 16 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003e\u003cbr/\u003eOur team puts a high value on work-life balance. It isn’t about how many hours you spend at home or at work; it’s about the flow you establish that brings energy to both parts of your life. We believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfillment. We offer flexibility in working hours and encourage you to find your own balance between your work and personal lives.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003e\u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded professional and enable them to take on more complex tasks in the future.\u003cbr/\u003e","department_cost_center":null,"description_short":"AWS Neuron is the complete software stack for the AWS Inferentia and Trainium cloud-scale machine learning accelerators and the Trn1 and Inf1 servers that use them.As the Software Development Engineer","display_distance":null,"id":"d4e5e5f8-80d1-4f19-a8d8-8f34f7f4d2bd","id_icims":"3128560","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3128560/software-development-engineer-neuron-foundation-tools","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA42\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Cupertino\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Cupertino\",\"coordinates\":\"37.31913,-122.02929\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Cupertino, California, USA\",\"location\":\"US, CA, Cupertino\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC29\"],\"normalizedCityName\":\"Cupertino\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":["aws.team-annapurna-labs","aws.team-utility-computing","aws.team-sde-sdm"],"posted_date":"November 18, 2025","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $129,300/year in our lowest geographic market up to $223,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-aws-sdm","source_system":"JobCreator","state":"WA","title":"Software Development Engineer, Neuron Foundation Tools","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/3128560/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-aws-sdm","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team","business_category":"aws","city":"Cupertino","company_name":"Annapurna Labs (U.S.) Inc.","country_code":"USA","description":"AWS Neuron is the complete software stack for the AWS Inferentia and Trainium cloud-scale machine\u003cbr/\u003elearning accelerators. As a part of the Neuron Frameworks team you'll develop and enhance support PyTorch and JAX for AWS Neuron, working with the open source ecosystem.\u003cbr/\u003e\u003cbr/\u003eYou will develop and extend support for the leading ML frameworks, delivering an outstanding user experience for PyTorch and JAX ML model development on the Trainium and Inferentia accelerators. You will work closely with teams across AWS Neuron including compiler, training and inference optimization to optimize frameworks for AWS's accelerator architectures, and engage closely with the PyTorch and JAX and other ML Framework communities to take advantage of their latest capabilities and improve performance and usability for ML model developers.\u003cbr/\u003e\u003cbr/\u003eA successful candidate will have a experience developing Machine Learning infrastructure and/or ML Frameworks, a demonstrated ability to work with open source communities to influence future community direction, a robust technical ability and a motivation to achieve results. Experience with technologies and tools such as XLA, vLLM or Hugging Face transformers is highly valued.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e*Utility Computing (UC)* \u003cbr/\u003eAWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (Iot), Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for their cloud services.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eYou will work with the team to develop, improve and release JAX and PyTorch framework support for AWS Neuron.\u003cbr/\u003e\u003cbr/\u003eYou will understand current and future directions of ML framework development, with a focus on setting the direction for the AWS Neuron framework technology roadmap, shaping the future of framework support on accelerators, and enabling key features for AWS Neuron such as torch.compile().\u003cbr/\u003e\u003cbr/\u003eYou will work closely with the PyTorch and JAX community to actively drive the future directions to improve the experience of developing and optimizing ML models on accelerators.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003e**Why AWS\u003cbr/\u003e**Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003e**Diverse Experiences**\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003e**Work/Life Balance* *\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003e**Inclusive Team Culture* *\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003e**Mentorship and Career Growth**\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. ","department_cost_center":null,"description_short":"AWS Neuron is the complete software stack for the AWS Inferentia and Trainium cloud-scale machinelearning accelerators. As a part of the Neuron Frameworks team you'll develop and enhance support PyTorch","display_distance":null,"id":"9984e725-0244-4297-9473-2cc87342ca90","id_icims":"2977656","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/2977656/senior-software-development-engineer-aws-neuron-frameworks","job_schedule_type":"full-time","location":"US, CA, Cupertino","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Cupertino\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Cupertino\",\"coordinates\":\"37.31913,-122.02929\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Cupertino, California, USA\",\"location\":\"US, CA, Cupertino\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC29\"],\"normalizedCityName\":\"Cupertino\"}"],"normalized_location":"Cupertino, California, USA","optional_search_labels":["aws.team-utility-computing","aws.team-annapurna-labs"],"posted_date":"May  8, 2025","preferred_qualifications":"- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $151,300/year in our lowest geographic market up to $261,500/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-sde-primary","source_system":"JobCreator","state":"CA","title":"Senior Software Development Engineer, AWS Neuron Frameworks","university_job":null,"updated_time":"about 2 hours","url_next_step":"https://account.amazon.com/jobs/2977656/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sde-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of program or project management experience\u003cbr/\u003e- 5+ years of defining and implementing process improvement initiatives using data and metrics experience\u003cbr/\u003e- Knowledge of Excel (Pivot Tables, VLookUps) at an advanced level and SQL\u003cbr/\u003e- Experience using data and metrics to determine and drive improvements\u003cbr/\u003e- Experience working cross functionally with tech and non-tech teams\u003cbr/\u003e- Bachelor's degree in supply chain, business, engineering, finance or related technical or quantitative field\u003cbr/\u003e- 3+ years of maintenance planner/scheduler in industrial maintenance, manufacturing, or distribution industries experience\u003cbr/\u003e- 4+ years of Computerized Maintenance Management System (CMMS) experience\u003cbr/\u003e- Experience managing inventory in warehousing, retail or distribution setting","business_category":"transportation-and-logistics","city":"Calgary","company_name":"Amazon Canada Fulfillment Services, ULC","country_code":"CAN","description":"  Amazon Worldwide Operations is looking for Program Managers to own strategic, tactical, cross-functional and technology projects and programs within Amazon Transportation Services. These roles require scoping and creating project plans, developing processes, coordinating and driving execution, and communicating to senior management on status, risks and process/product changes. Cross-team coordination, project management and executive presentation skills are essential. \u003cbr/\u003e\u003cbr/\u003e***This role can be based in any Canadian Amazon location***\u003cbr/\u003e\u003cbr/\u003e   \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Be a network level Subject Matter Expert (SME) on the CMMS (Computerized Maintenance Management System), train and assist the local Reliability Maintenance Engineering Planner and support network initiatives.\u003cbr/\u003e• Drive Global standards roll-out in cross-country initiatives and participate in Global led projects.\u003cbr/\u003e• Be a CMMS key user and drive programs to roll out new functionality, procedures, scheduling or reports. Monitor standards implementation through reporting and audits.\u003cbr/\u003e• Analyze and improve forecasting of preventative maintenance routines to make equipment maintenance less intrusive and more effective.\u003cbr/\u003e• Compile equipment information, performance metrics and machine histories and make recommendations for improvements based on their findings to the entire network.\u003cbr/\u003e• Work with the Global Reliability Maintenance Engineering network and initiatives on cost reduction and process improvement for spare parts management, equipment maintenance and maintenance routines.\u003cbr/\u003e• Ability to Travel up to 50%\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e• Working in a team where talent and potential have more value than paper-based qualifications\u003cbr/\u003e• Global opportunities to develop in role and choose long term career paths\u003cbr/\u003e• Working at the cusp of high-speed automated logistics technology\u003cbr/\u003e• Finding and conquering emerging challenges as the company grows and scales rapidly\u003cbr/\u003e• Working in data driven environment where accuracy and clarity is prized above personal opinion\u003cbr/\u003e\u003cbr/\u003eAmazon offers a full range of benefits for you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include:\u003cbr/\u003e1. Medical, Dental, and Vision Coverage\u003cbr/\u003e2. Maternity and Parental Leave Options\u003cbr/\u003e3. Paid Time Off (PTO)\u003cbr/\u003e4. 401(k) Plan\u003cbr/\u003e\u003cbr/\u003eIf you are not sure that every qualification on the list above describes you exactly, we'd still love to hear from you! At Amazon, we value people with unique backgrounds, experiences, and skillsets. If you’re passionate about this role and want to make an impact on a global scale, please apply!","department_cost_center":null,"description_short":"  Amazon Worldwide Operations is looking for Program Managers to own strategic, tactical, cross-functional and technology projects and programs within Amazon Transportation Services. These roles require","display_distance":null,"id":"2886ccee-f97d-4f13-907f-04b4278a2efb","id_icims":"3186542","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Program Management","job_function_id":null,"job_path":"/en/jobs/3186542/program-manager-senior-reliability-maintenance-and-engineering-rme-planner-global-planning-team-gpt","job_schedule_type":"full-time","location":"CA, AB, Calgary","locations":["{\"normalizedStateName\":\"Alberta\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Calgary\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, AB, Calgary\",\"coordinates\":\"51.04532,-114.06301\",\"normalizedCountyName\":\"Alberta\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Calgary, Alberta, CAN\",\"location\":\"CA, AB, Calgary\",\"region\":\"AB\",\"buildingCodeList\":[\"YYC062\",\"YYC50\",\"YYC4\",\"RLBC\",\"YYC1\",\"XCAB\",\"DAA1\",\"YYC51\",\"YYC3\",\"GCG1\",\"YYC250\",\"YYC6\",\"XYY3\",\"HYC2\",\"DCG1\",\"DCG4\",\"SAD1\",\"YYC52\",\"DCG3\",\"YYC11\",\"CYYC\",\"YYC251\"],\"normalizedCityName\":\"Calgary\"}","{\"normalizedStateName\":\"Ontario\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Mississauga\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, ON, Mississauga\",\"coordinates\":\"43.58726,-79.64494\",\"normalizedCountyName\":\"Peel\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Mississauga, Ontario, CAN\",\"location\":\"CA, ON, Mississauga\",\"region\":\"ON\",\"buildingCodeList\":[\"DTO4\",\"DOI6\",\"DTO2\",\"RLBE\",\"YYZ1\",\"DOI5\",\"YYZ251\",\"ZAO7\",\"DTR4\",\"LSQO\",\"DTY4\",\"KTO2\",\"KTO5\",\"YYZ23\"],\"normalizedCityName\":\"Mississauga\"}"],"normalized_location":"Calgary, Alberta, CAN","optional_search_labels":["ops.lander-emea-rme-reliability"],"posted_date":"February 22, 2026","preferred_qualifications":"- 3+ years of driving end to end delivery, and communicating results to senior leadership experience\u003cbr/\u003e- 3+ years of driving process improvements experience\u003cbr/\u003e- Experience in stakeholder management, dealing with multiple stakeholders at varied levels of the organization\u003cbr/\u003e- Experience building processes, project management, and schedules\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(34, 34, 34)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. As a total compensation company, Amazon's package may include other elements such as sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon offers comprehensive benefits including health insurance (medical, dental, vision, prescription, basic life \u0026amp; AD\u0026amp;D insurance), Registered Retirement Savings Plan (RRSP), Deferred Profit Sharing Plan (DPSP), paid time off, and other resources to improve health and well-being. We thank all applicants for their interest, however only those interviewed will be advised as to hiring status.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eCAN, AB, Calgary - 69,700.00 - 116,400.00 CAD annually\u003cbr/\u003eCAN, ON, Mississauga - 69,700.00 - 116,400.00 CAD annually","primary_search_label":"transportation-and-logistics.int-ops-global-ops-svcs","source_system":"JobCreator","state":"AB","title":"Program Manager- Senior Reliability, Maintenance, and Engineering (RME) Planner, Global Planning Team (GPT)","university_job":null,"updated_time":"about 3 hours","url_next_step":"https://account.amazon.com/jobs/3186542/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"int-ops-global-ops-svcs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}