{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Bachelor's degree or equivalent in a technical or analytical discipline\u003cbr/\u003e- Experience leading multi-functional teams and developing people managers in a data-driven environment","business_category":"international-stores","city":"Riyadh","company_name":"Afaq Q Tech General Trading","country_code":"SAU","description":"    Amazon is looking for an exceptionally motivated and talented Commercial Leader, Saudi National, to join our team based in Riyadh Office. This leader will lead one of our KSA store businesses with full P\u0026L, and have responsibility for building in areas such as vendor and merchant management, in-stock management, and product management. This leader will manage a high performing team whose primary goal is to grow a Amazon business through continuously improving business fundamentals, launching innovative initiatives and creating the earth's greatest shopping experience for KSA – a store featuring  more products, brands, better \u0026 more compelling content than any  store, online or off!\u003cbr/\u003e\u003cbr/\u003e Your Responsibilities:\u003cbr/\u003e\u003cbr/\u003e - Provide  leadership for the business team and across the company to ensure that  the various functions supporting the business have  accountability for all important metrics such as increased selection,  unit growth, inventory turns, and in-stock rates.\u003cbr/\u003e - Drive periodic innovation aimed at improving customer experience and strengthening vendor relationships.\u003cbr/\u003e - Provide  local input to defining the customer experience and represent that to  senior executives, vendors and third party merchant teams, as well as  the category team.\u003cbr/\u003e - Work cross functionally with central  company-wide teams in Technology, Operations and Merchant Services to  establish the right processes and optimize them to utilize resources  most efficiently.\u003cbr/\u003e - Translate business metrics into actionable plans as determined by different inputs which drive category performance.\u003cbr/\u003e - Create sustainable process improvements which drive year-over-year progress in the category.\u003cbr/\u003e - Identify  new approaches for improving selection and category awareness to better  manage the performance of the category over the long run.\u003cbr/\u003e - Focus  on talent management of the team which includes effectively recruiting  and developing the best, and creating an environment which motivates  people to thrive in their expertise and deliver results.\u003cbr/\u003e","department_cost_center":null,"description_short":"    Amazon is looking for an exceptionally motivated and talented Commercial Leader, Saudi National, to join our team based in Riyadh Office. This leader will lead one of our KSA store businesses with","display_distance":null,"id":"17888de8-1cde-4acf-b2f4-5f95c30c26b9","id_icims":"3178523","is_intern":null,"is_manager":null,"job_category":"Buying, Planning, \u0026 Instock Management","job_family":"Category Leader","job_function_id":null,"job_path":"/en/jobs/3178523/ksa-commercial-leader-saudi-national-amazon-stores","job_schedule_type":"full-time","location":"SA, Riyadh","locations":["{\"normalizedCountryCode\":\"SAU\",\"city\":\"Riyadh\",\"countryIso3a\":\"SAU\",\"countryIso2a\":\"SA\",\"locationNonStemming\":\"Saudi Arabia, Riyadh\",\"coordinates\":\"24.68208,46.68723\",\"normalizedCountyName\":\"Riyadh\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Saudi Arabia\",\"normalizedLocation\":\"Riyadh, SAU\",\"location\":\"SA, Riyadh\",\"region\":\"\",\"buildingCodeList\":[\"RUH14\"],\"normalizedCityName\":\"Riyadh\"}"],"normalized_location":"Riyadh, SAU","optional_search_labels":["ops.lander-saudization"],"posted_date":"February 11, 2026","preferred_qualifications":"- Experience in retail or digital content including vendor management, product management, or operations management\u003cbr/\u003e- Experience in consulting, business development, as a business leader with P\u0026L responsibilities, or in product management in an international environment\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"international-stores.team-international-sellers-group","source_system":"JobCreator","state":null,"title":"KSA Commercial Leader - Saudi national, Amazon Stores","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3178523/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-international-sellers-group","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Sparks","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"5e87d1ca-5054-4367-83f3-31dbfe78a5dd","id_icims":"3169293","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3169293/engineering-operations-technician-dcc-communities","job_schedule_type":"full-time","location":"US, NV, Sparks","locations":["{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sparks\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, Sparks\",\"coordinates\":\"39.54115,-119.74832\",\"normalizedCountyName\":\"Washoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sparks, Nevada, USA\",\"location\":\"US, NV, Sparks\",\"region\":\"NV\",\"buildingCodeList\":[\"RNO100\"],\"normalizedCityName\":\"Sparks\"}"],"normalized_location":"Sparks, Nevada, USA","optional_search_labels":["aws.team-ais","aws.team-dc","hourly","military"],"posted_date":"January 29, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Technical (Military/Trade School) training\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NV, Sparks - 31.00 - 55.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"NV","title":"Engineering Operations Technician, DCC Communities ","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3169293/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of Microsoft Office products and applications experience\u003cbr/\u003e- 2+ years of electrical and mechanical experience\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends","business_category":"aws","city":"Sparks","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e- Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"6fbde57a-2466-4876-90b1-40c4f18c82b1","id_icims":"3168283","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3168283/engineering-operations-technician-dcc-communities","job_schedule_type":"full-time","location":"US, NV, Sparks","locations":["{\"normalizedStateName\":\"Nevada\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sparks\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NV, Sparks\",\"coordinates\":\"39.54115,-119.74832\",\"normalizedCountyName\":\"Washoe\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sparks, Nevada, USA\",\"location\":\"US, NV, Sparks\",\"region\":\"NV\",\"buildingCodeList\":[\"RNO100\"],\"normalizedCityName\":\"Sparks\"}"],"normalized_location":"Sparks, Nevada, USA","optional_search_labels":["military","aws.team-dc","hourly","aws.team-ais"],"posted_date":"January 28, 2026","preferred_qualifications":"- Experience working in a data center or mission critical facility (example: hospital, military facility, public safety facility, etc.)\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e- Experience with reading and writing procedures, technical documents, and engineering drawings\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NV, Sparks - 36.00 - 63.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"NV","title":"Engineering Operations Technician, DCC Communities ","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3168283/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Allgemeine Hochschulreife, Fachhochschulreife/ fachgebundene Hochschulreife\u003cbr/\u003e- Fließende Deutschkenntnisse in Wort und Schrift (C1-Niveau)\u003cbr/\u003e- Grundlegende Englischkenntnisse in Wort und Schrift (A2-Niveau)\u003cbr/\u003e- Affinität für die naturwissenschaftlichen Fächer, insbesondere Mathematik, Physik und Chemie\u003cbr/\u003e- Umgang mit MS-Office (insbesondere Kenntnisse in Excel, Word und Power Point)","business_category":"auta","city":"Kobern-gondorf","company_name":"Amazon Fulfillment Germany GmbH - B68","country_code":"DEU","description":"Wir bei Amazon haben uns zum Ziel gesetzt, das kundenorientierteste Unternehmen der Welt zu sein, bei dem Menschen alles finden können, was sie online kaufen möchten. Wir stellen die klügsten Köpfe der Welt ein und bieten ihnen ein Umfeld, in dem sie das Einkaufserlebnis unserer Kundschaft unermüdlich verbessern können. Innovation und Kreativität sind fest in der DNA unseres Unternehmens verankert und werden auf allen Ebenen der Beschäftigung gefördert. Jeden Tag lösen wir komplexe technische und geschäftliche Probleme – mit Ideenreichtum\u003cbr/\u003eund Einfachheit. Wir schreiben Geschichte. Die gute Nachricht ist: Wir haben gerade erst angefangen.\u003cbr/\u003eDies ist deine Chance, gemeinsam mit uns Geschichte zu schreiben.\u003cbr/\u003e\u003cbr/\u003eBei uns erwartet dich ein spannendes duales Studium, das Theorie und Praxis perfekt verbindet. Als eine:r der wenigen in Deutschland kannst du den Bachelor of Science (B.Sc.) in Sustainable Science and Technology mit Fokus auf Arbeitssicherheit erlangen - und das bei einem der innovativsten Unternehmen der Welt.\u003cbr/\u003e\u003cbr/\u003eBeginn: 01.08.2026\u003cbr/\u003eDauer: 3 Jahre\u003cbr/\u003eStandort: Kobern-Gondorf\u003cbr/\u003eHochschule: DHBW Karlsruhe\u003cbr/\u003e\u003cbr/\u003eDein Mehrwert:\u003cbr/\u003e- International anerkannter Bachelor of Science (B.Sc.) \u003cbr/\u003e- Qualifikation als Fachkraft für Arbeitssicherheit (SiFa) \u003cbr/\u003e- Exzellente Karriereperspektiven im Bereich Arbeitssicherheit \u003cbr/\u003e- Wechselnde Theorie- und Praxisphasen \u003cbr/\u003e- Attraktive Vergütung während des gesamten Studiums\u003cbr/\u003e- Direkte Praxiserfahrung in einem Global Player \u003cbr/\u003e- Internationales Arbeitsumfeld\u003cbr/\u003e\u003cbr/\u003eNach deinem Abschluss bist du bestens auf eine spannende Karriere im Bereich Arbeitssicherheit bei Amazon vorbereitet - einem Arbeitsumfeld, das Innovation und Sicherheit vereint.\u003cbr/\u003e\u003cbr/\u003eDeine Karriereperspektiven: \u003cbr/\u003e\u003cbr/\u003e- Direkter Einstieg als Safety Specialist bei Amazon möglich \u003cbr/\u003e- Entwicklungsmöglichkeiten zum Safety Manager oder Senior Safety Manager \u003cbr/\u003e- Internationale Karrierechancen innerhalb des Amazon-Netzwerks \u003cbr/\u003e- Verantwortung für komplexe Sicherheitsprojekte und -prozesse \u003cbr/\u003e- Chance zur Mitgestaltung innovativer Sicherheitskonzepte\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eDeine Aufgaben:\u003cbr/\u003e- Umsetzung von Sicherheits- und Gesundheitskonzepten\u003cbr/\u003e- Erstellung und Umsetzung von Arbeitssicherheitskampagnen\u003cbr/\u003e- Erstellung von Schulungsunterlagen\u003cbr/\u003e- Durchführung von Gefährdungsbeurteilungen\u003cbr/\u003e- Umsetzung gesetzlicher und interner Anforderungen im Bereich Arbeitssicherheit - und Gesundheitsschutz\u003cbr/\u003e- Erstellung von (Beinah-)Unfallberichten sowie Auswertungen\u003cbr/\u003e- Aufbau von Programmen zur Verhütung von Unfällen\u003cbr/\u003e- Betriebliches Gesundheitsmanagement\u003cbr/\u003e- Vorbereitung und Durchführung von Audits\u003cbr/\u003e- Zusammenarbeit mit den operativen Abteilungen und weiteren Fachbereichen im Unternehmen (Technik, Personalabteilung etc.)","department_cost_center":null,"description_short":"Wir bei Amazon haben uns zum Ziel gesetzt, das kundenorientierteste Unternehmen der Welt zu sein, bei dem Menschen alles finden können, was sie online kaufen möchten. Wir stellen die klügsten Köpfe der","display_distance":null,"id":"48127bf4-c4c9-43b8-a19f-0d4b1b6c80cf","id_icims":"3104799","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Apprentice Job Family","job_function_id":null,"job_path":"/en/jobs/3104799/duales-studium-arbeitssicherheit","job_schedule_type":"full-time","location":"DE, RP, Kobern-gondorf","locations":["{\"normalizedStateName\":\"Rhineland-Palatinate\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Kobern-gondorf\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, RP, Kobern-gondorf\",\"coordinates\":\"50.3083,7.45881\",\"normalizedCountyName\":\"Mayen-Koblenz\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Kobern-Gondorf, Rhineland-Palatinate, DEU\",\"location\":\"DE, RP, Kobern-gondorf\",\"region\":\"RP\",\"buildingCodeList\":[\"CGN1\"],\"normalizedCityName\":\"Kobern-Gondorf\"}"],"normalized_location":"Kobern-Gondorf, Rhineland-Palatinate, DEU","optional_search_labels":[],"posted_date":"October  9, 2025","preferred_qualifications":"- Eigeninitiative, Vorbildfunktion und „Hands-on-Mentalität“\u003cbr/\u003e- Proaktives Vorantreiben von Veränderungsprozessen und eigenverantwortliche Entscheidungsfindung\u003cbr/\u003e- Bist du interessiert? Wir freuen uns darauf, von Dir zu hören! Bitte bewirb Dich mit deinen vollständigen Bewerbungsunterlagen auf Deutsch (Lebenslauf, Zeugniskopie – ein PDF mit 5 MB max.). Sollten die Bewerbungsunterlagen nicht vollständig sein, können wir deine Bewerbung leider nicht berücksichtigen! Bitte beachte, dass du im Rahmen des Einstellungsprozesses ein Videointerview über ein externes Tool durchführen musst. Bitte sende uns Deine Bewerbungsunterlagen in Deutsch. Mit der Übersendung Deines Lebenslaufs erklärst Du Dich mit der Speicherung Deiner Daten zum Zwecke der Feststellung der Eignung für dieses und zukünftige Stellenangebot/e in der weltweiten Amazon Konzernpersonaldatenbank, die derzeit in den USA geführt wird, einverstanden.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"auta.apprenticeships","source_system":"JobCreator","state":"RP","title":"Duales Studium - Arbeitssicherheit","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3104799/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"apprenticeships","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of data-driven business operations processes experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Speak, write, and read fluently in English\u003cbr/\u003e- Experience with Microsoft Office products and applications\u003cbr/\u003e- Experience with Excel","business_category":"seller-services","city":"Bengaluru","company_name":"ASSPL - Karnataka","country_code":"IND","description":"Are you customer obsessed, flexible, smart and analytical, strategic yet execution focused, hungry and passionate about e-commerce? Are you an experienced and entrepreneurial leader with a strong work ethic? If yes, this opportunity will appeal to you. The ideal candidate will be enthusiastic about managing challenging, lengthy projects across multiple teams and locations. We are looking for an Operations Specialist who shares Amazon's passion for the customer—someone who understands the importance of compelling delivery programs in creating an overall customer (seller and buyer) experience.\u003cbr/\u003e\u003cbr/\u003eIn this role, you will be responsible for working closely with sellers, seller support, customer service, sales, and 3P carriers to identify delivery and fulfillment issues faced by sellers and work with them to alleviate their acute/short-term issues. You will also partner with product management teams to identify long-term delivery and fulfillment features and programs to improve the seller and customer experience on the Amazon platform.\u003cbr/\u003e\u003cbr/\u003eRole and Responsibilities:\u003cbr/\u003e• Monitor operations performance and work with other teams (3P Carriers, Customer Service, Seller Support, Product, Operations) to address performance issues and ensure metrics are within goals\u003cbr/\u003e• Work with operational teams to solve seller-reported issues \u003cbr/\u003e• Monitor and drive seller-impacting operational tickets to resolution\u003cbr/\u003e• Gather and analyze seller contacts and seller feedback to develop seller experience improvement suggestions and work with Product Managers for solutions\u003cbr/\u003e• Must be open to working on Saturday and Sunday, with any other 2 days of the week as off","department_cost_center":null,"description_short":"Are you customer obsessed, flexible, smart and analytical, strategic yet execution focused, hungry and passionate about e-commerce? Are you an experienced and entrepreneurial leader with a strong work","display_distance":null,"id":"8a4def19-6f24-4898-ae20-002c63d76640","id_icims":"3177030","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Risk Family","job_function_id":null,"job_path":"/en/jobs/3177030/product-compliance-associate-local-shops","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR37\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":["seller-services.team-amazon-business-marketplace"],"posted_date":"February  9, 2026","preferred_qualifications":"- Knowledge of consumer product compliance processes and regulations\u003cbr/\u003e- Experience in regulatory compliance management with government agencies\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"seller-services.no-team-listed","source_system":"JobCreator","state":"KA","title":"Product Compliance Associate, Local Shops","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3177030/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"transportation-and-logistics","city":"Hyderabad","company_name":"ADCI HYD 13 SEZ","country_code":"IND","description":"Amazon’s global fulfillment network enables any merchant to ship items that are ordered on Amazon to any place on earth. There is a complex network of ways in which items move between vendor locations, Amazon warehouses, and customer locations as well as several intermediate locations through which packages travel before reaching the customer. With a scale of millions of packages, each with different attributes and delivery requirements, what results is a highly dense graph of nodes.\u003cbr/\u003e\u003cbr/\u003eWe have built a highly respected software engineering team which is focused on solving complex problems in worldwide transportation using workflows, optimization algorithms, and machine learning systems. These are large-scale distributed systems handling millions of packages being shipped through the Amazon logistics network.\u003cbr/\u003e\u003cbr/\u003eYou will be working with senior SDEs and principals to solve problems of scale, improve existing services \u0026 build new ones, and work on deep and complex algorithms to improve the experience of our customers globally while optimizing network operations.","department_cost_center":null,"description_short":"Amazon’s global fulfillment network enables any merchant to ship items that are ordered on Amazon to any place on earth. There is a complex network of ways in which items move between vendor locations,","display_distance":null,"id":"ede3e5d8-87cb-4064-99f2-70f43beb5bf2","id_icims":"3175821","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3175821/software-dev-engineer-ii-amazon-shipping","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD13\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":[],"posted_date":"February  6, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-ats-tech","source_system":"JobCreator","state":"TS","title":"Software Dev Engineer II, Amazon Shipping","university_job":null,"updated_time":"20 minutes","url_next_step":"https://account.amazon.com/jobs/3175821/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-ats-tech","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in business administration, finance, economics, computer science, data science, engineering, or other related field\u003cbr/\u003e- 5+ years of experience in cloud architecture and implementation\u003cbr/\u003e- 5+ years of experience as a contact center technology architect, enterprise IT Architect or senior contact center developer working with leading contact center technology platforms and applications, such as Amazon Connect, Avaya, Cisco, Genesys, NICE InContact, Salesforce, etc.\u003cbr/\u003e- 3+ years designing and implementing NLP/NLU (IVR or chat) solutions using at least one major conversational AI framework (e.g., Rasa, Dialogflow, Lex, or Azure Bot Service) at enterprise scale in a contact center environment\u003cbr/\u003e- 3+ years hands-on coding experience with REST APIs and web services, including successful integration of 3+ contact center platforms (e.g., Genesys, Amazon Connect, Five9)","business_category":"aws","city":"Mountain View","company_name":"Amazon Web Services, Inc.","country_code":"USA","description":"Application deadline: Feb 21, 2026\u003cbr/\u003e\u003cbr/\u003eThe Amazon Web Services Professional Services (ProServe) team is seeking a skilled Delivery Consultant to join our team at Amazon Web Services (AWS). In this role, you'll work closely with customers to design, implement, and manage AWS solutions that meet their technical requirements and business objectives. You'll be a key player in driving customer success through their cloud journey, providing technical expertise and best practices throughout the project lifecycle.\u003cbr/\u003e\u003cbr/\u003ePossessing a deep understanding of AWS products and services, as a Delivery Consultant you will be proficient in architecting complex, scalable, and secure solutions tailored to meet the specific needs of each customer. You’ll work closely with stakeholders to gather requirements, assess current infrastructure, and propose effective migration strategies to AWS. As trusted advisors to our customers, providing guidance on industry trends, emerging technologies, and innovative solutions, you will be responsible for leading the implementation process, ensuring adherence to best practices, optimizing performance, and managing risks throughout the project.\u003cbr/\u003e\u003cbr/\u003eThe AWS Professional Services organization is a global team of experts that help customers realize their desired business outcomes when using the AWS Cloud. We work together with customer teams and the AWS Partner Network (APN) to execute enterprise cloud computing initiatives. Our team provides assistance through a collection of offerings which help customers achieve specific outcomes related to enterprise cloud adoption. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs an experienced technology professional, you will be responsible for:\u003cbr/\u003e\u003cbr/\u003e- Designing and implementing complex, scalable, and secure AWS solutions tailored to customer needs\u003cbr/\u003e- Providing technical guidance and troubleshooting support throughout project delivery\u003cbr/\u003e- Collaborating with stakeholders to gather requirements and propose effective migration strategies\u003cbr/\u003e- Acting as a trusted advisor to customers on industry trends and emerging technologies\u003cbr/\u003e- Sharing knowledge within the organization through mentoring, training, and creating reusable artifacts\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eABOUT AWS:\u003cbr/\u003e \u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e \u003cbr/\u003eWhy AWS \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. ","department_cost_center":null,"description_short":"The Amazon Web Services Professional Services (ProServe) team is seeking a skilled Delivery Consultant to join our team at Amazon Web Services (AWS). In this role, you'll work closely with customers to","display_distance":null,"id":"2f07204c-1803-49bb-aae1-ee5ffb4543c4","id_icims":"3164874","is_intern":null,"is_manager":null,"job_category":"Solutions Architect","job_family":"Professional Services","job_function_id":null,"job_path":"/en/jobs/3164874/senior-delivery-consultant-connect-and-lex-amazon-connect-center-of-delivery-excellence","job_schedule_type":"full-time","location":"US, CA, Mountain View","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS22\"],\"normalizedCityName\":\"Austin\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA44\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS17\"],\"normalizedCityName\":\"Arlington\"}","{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Atlanta\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Atlanta\",\"coordinates\":\"33.74831,-84.39111\",\"normalizedCountyName\":\"Fulton\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Atlanta, Georgia, USA\",\"location\":\"US, GA, Atlanta\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL11\"],\"normalizedCityName\":\"Atlanta\"}","{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK27\"],\"normalizedCityName\":\"New York\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}","{\"normalizedStateName\":\"Illinois\",\"normalizedCountryCode\":\"USA\",\"city\":\"Chicago\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, IL, Chicago\",\"coordinates\":\"41.88425,-87.63245\",\"normalizedCountyName\":\"Cook\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Chicago, Illinois, USA\",\"location\":\"US, IL, Chicago\",\"region\":\"IL\",\"buildingCodeList\":[\"ORD11\"],\"normalizedCityName\":\"Chicago\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Mountain View\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Mountain View\",\"coordinates\":\"37.38971,-122.08157\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Mountain View, California, USA\",\"location\":\"US, CA, Mountain View\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC43\"],\"normalizedCityName\":\"Mountain View\"}","{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Francisco\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Francisco\",\"coordinates\":\"37.77702,-122.41956\",\"normalizedCountyName\":\"San Francisco\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Francisco, California, USA\",\"location\":\"US, CA, San Francisco\",\"region\":\"CA\",\"buildingCodeList\":[\"SFO28\"],\"normalizedCityName\":\"San Francisco\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Dallas\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Dallas\",\"coordinates\":\"32.77822,-96.79512\",\"normalizedCountyName\":\"Dallas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Dallas, Texas, USA\",\"location\":\"US, TX, Dallas\",\"region\":\"TX\",\"buildingCodeList\":[\"DFW15\"],\"normalizedCityName\":\"Dallas\"}"],"normalized_location":"Mountain View, California, USA","optional_search_labels":["amazon.artificial-intelligence"],"posted_date":"January 22, 2026","preferred_qualifications":"- AWS experience preferred, with proficiency in a wide range of AWS services (e.g., EC2, S3, RDS, Lambda, IAM, VPC, CloudFormation)\u003cbr/\u003e- AWS Professional level certifications (e.g., Solutions Architect Professional, DevOps Engineer Professional) preferred\u003cbr/\u003e- Experience with automation and scripting (e.g., Terraform, Python)\u003cbr/\u003e- Knowledge of security and compliance standards (e.g., HIPAA, GDPR)\u003cbr/\u003e- Strong communication skills with the ability to explain technical concepts to both technical and non-technical audiences\u003cbr/\u003e- Knowledge of Amazon Connect or Amazon Lex capabilities, benefits, and required deployment skills\u003cbr/\u003e- Experience incorporating generative AI into the contact center (voice or chat bots, agent assist or next best action) to answer questions or drive self-service experiences, including architecture design, model selection and integration, prompt engineering, and data preparation.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Mountain View - 176,600.00 - 239,000.00 USD annually\u003cbr/\u003eUSA, CA, San Francisco - 176,600.00 - 239,000.00 USD annually\u003cbr/\u003eUSA, CO, Denver - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, GA, Atlanta - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, IL, Chicago - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, NY, New York - 169,000.00 - 228,600.00 USD annually\u003cbr/\u003eUSA, TX, Austin - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, TX, Dallas - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, VA, Arlington - 153,600.00 - 207,800.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 153,600.00 - 207,800.00 USD annually","primary_search_label":"aws.team-pro-serv","source_system":"JobCreator","state":"CA","title":"Senior Delivery Consultant - Connect and Lex, Amazon Connect Center of Delivery Excellence","university_job":null,"updated_time":"23 minutes","url_next_step":"https://account.amazon.com/jobs/3164874/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-pro-serv","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 7+ years of manufacturing or manufacturing engineering experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Knowledge of Microsoft Office products and applications at an advanced level","business_category":"transportation-and-logistics","city":"Bellevue","company_name":"Amazon.com LLC","country_code":"USA","description":"Application deadline: Feb 21, 2026\u003cbr/\u003e\u003cbr/\u003eDo you want to be part of an organization at the leading edge of sortation, distribution, and logistics operations as Amazon delivers world-class service to our customers? The North America Sort Center (NASC) Material Flow Optimization (MFO) Team is seeking a proven technical leader with extensive experience leading people, projects, and programs by applying planning and engineering principles to operations and developing process improvement initiatives within the logistics and distribution industry. As an MFO Manager, you will lead a team of talented engineers and collaborate with multiple teams, including labor planning, operations, network planning, and service performance. You will design and improve our evolving middle mile network while challenging the status quo of existing operations. This position requires a firm understanding of engineering principles, planning, forecasting, cost estimating, and process flows, along with proven management skills in leading and developing others.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eIn this role, you will have the opportunity to display your skills in the following areas:\u003cbr/\u003e- Lead and develop a team of engineers\u003cbr/\u003e- Design and implement floor layouts\u003cbr/\u003e- Facilitate the setup and integration of new products, services, and operations within buildings\u003cbr/\u003e- Apply engineering principles to develop processes and improve operations\u003cbr/\u003e- Study operations to optimize and design new tools involving simulation and planning\u003cbr/\u003e- Develop innovative design concepts to improve throughput, facility utilization, and labor optimization\u003cbr/\u003e- Build strong, productive relationships across peer organizations that advance business objectives\u003cbr/\u003e- Manage complex, quick-turn projects while demonstrating exceptional business judgment\u003cbr/\u003e- Assess process improvement and transformation opportunities and partner with process owners and stakeholders to scope opportunities, define problem statements and objectives, and structure projects and teams\u003cbr/\u003e- Train, coach, and mentor field Operations teams to empower them with leveraging operations tools and systems to meet daily business needs\u003cbr/\u003e- Travel up to 40%","department_cost_center":null,"description_short":"Do you want to be part of an organization at the leading edge of sortation, distribution, and logistics operations as Amazon delivers world-class service to our customers? The North America Sort Center","display_distance":null,"id":"5fa433b5-d350-4150-87f9-7a436621795d","id_icims":"3168220","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3168220/nasc-material-flow-optimization-manager-under-the-roof-optimization","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"New Jersey\",\"normalizedCountryCode\":\"USA\",\"city\":\"Jersey City\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NJ, Jersey City\",\"coordinates\":\"40.71748,-74.04385\",\"normalizedCountyName\":\"Hudson\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Jersey City, New Jersey, USA\",\"location\":\"US, NJ, Jersey City\",\"region\":\"NJ\",\"buildingCodeList\":[\"EWR18\"],\"normalizedCityName\":\"Jersey City\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS13\"],\"normalizedCityName\":\"Austin\"}","{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Nashville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Nashville\",\"coordinates\":\"36.16792,-86.77798\",\"normalizedCountyName\":\"Davidson\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Nashville, Tennessee, USA\",\"location\":\"US, TN, Nashville\",\"region\":\"TN\",\"buildingCodeList\":[\"BNA12\"],\"normalizedCityName\":\"Nashville\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA82\"],\"normalizedCityName\":\"Bellevue\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN16\"],\"normalizedCityName\":\"Denver\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"January 27, 2026","preferred_qualifications":"- Knowledge of Lean Manufacturing \u0026 Continuous Improvement principles \u0026 techniques\u003cbr/\u003e- Experience in complex work environments, including (but not limited to robotics, automation, diagnostic and test equipment)\u003cbr/\u003e- Experience managing teams of 6 or more\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Denver - 142,800.00 - 193,200.00 USD annually\u003cbr/\u003eUSA, NJ, Jersey City - 157,100.00 - 212,600.00 USD annually\u003cbr/\u003eUSA, TN, Nashville - 128,600.00 - 173,900.00 USD annually\u003cbr/\u003eUSA, TX, Austin - 142,800.00 - 193,200.00 USD annually\u003cbr/\u003eUSA, WA, Bellevue - 142,800.00 - 193,200.00 USD annually","primary_search_label":"transportation-and-logistics.team-na-operations","source_system":"JobCreator","state":"WA","title":"NASC Material Flow Optimization Manager, Under-the-Roof Optimization","university_job":null,"updated_time":"23 minutes","url_next_step":"https://account.amazon.com/jobs/3168220/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-na-operations","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Knowledge of Excel at a basic level (e.g., UX navigation, math \u0026 logical functions, lookup functions, etc.)\u003cbr/\u003e- Work 40 hours/week, and overtime as required\u003cbr/\u003e- Experience performing accurate data entry and analysis\u003cbr/\u003e- Experience in international logistics, cross-border transportation and supply chain, or U.S. Customs rules and regulations\u003cbr/\u003e- 2+ years of customs entry writing experience with a proven track record handling complex, high-value shipments\u003cbr/\u003e- Experience in international logistics, cross-border transportation and supply chain, or U.S. Customs rules and regulations\u003cbr/\u003e- 2+ years of customs entry writing experience with a proven track record handling complex, high-value shi","business_category":"transportation-and-logistics","city":"Virtual Location - Tennessee","company_name":"INLT LLC - I27","country_code":"USA","description":"Application deadline: Feb 21, 2026\u003cbr/\u003e\u003cbr/\u003eAt Amazon, our mission is to be Earth's most Customer-centric company. The Amazon Customs \u0026 Trade (ACT) team delivers comprehensive customs brokerage services for our customers.\u003cbr/\u003e\u003cbr/\u003eWe are seeking a detail-oriented Customs Brokerage Specialist to join our team. In this role, you will manage daily customs clearance operations for ocean, air, rail, and truck cross-border shipments. The position involves collaborating with freight forwarders, sellers, and vendors to ensure proper shipment and document preparation, while monitoring clearance status and managing issue escalation. You will also perform accurate data entry for entry filing, classifications, and inspections, as well as generate and track delivery forms while ensuring compliance requirements are met.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will be customer-obsessed, detail-driven, and passionate about international logistics. Join us as we revolutionize global commerce, one shipment at a time.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Verify completeness of information upon onboarding Customers\u003cbr/\u003e- Prepare import documentation to ensure timely release and delivery of orders\u003cbr/\u003e- Verify accuracy of commercial documentation and charges\u003cbr/\u003e- Submit documentation to regulatory agencies\u003cbr/\u003e- Meet daily/weekly KPI targets for entry submission and accuracy\u003cbr/\u003e- Collaborate with other service providers to solve shipment issues\u003cbr/\u003e- Collaborate with origin and destination logistics teams\u003cbr/\u003e- 2nd Tier support for Customer Service queries\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe are a collaborative group of logistics professionals dedicated to streamlining international trade processes. Our team is committed to excellence in global supply chain management, working closely with international partners to facilitate efficient and compliant cross-border transportation. We value precision, communication, and continuous learning.\u003cbr/\u003e","department_cost_center":null,"description_short":"At Amazon, our mission is to be Earth's most Customer-centric company. The Amazon Customs \u0026 Trade (ACT) team delivers comprehensive customs brokerage services for our customers.We are seeking a detail-oriented","display_distance":null,"id":"e90029be-6ff6-42aa-808f-5043e04b17d9","id_icims":"3176088","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Risk Family","job_function_id":null,"job_path":"/en/jobs/3176088/customs-brokerage-specialist","job_schedule_type":"full-time","location":"US, TN, Virtual Location - Tennessee","locations":["{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Virtual Location - Tennessee\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Virtual Location - Tennessee\",\"coordinates\":\"36.16792,-86.77799\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Tennessee, USA\",\"location\":\"US, TN, Virtual Location - Tennessee\",\"region\":\"TN\",\"buildingCodeList\":[\"VIR\"]}","{\"normalizedCountryCode\":\"USA\",\"city\":\"Virtual\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, Virtual\",\"coordinates\":\"38.89036,-77.03196\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"USA\",\"location\":\"US, Virtual\",\"region\":\"\",\"buildingCodeList\":[\"VIR\"]}"],"normalized_location":"Tennessee, USA","optional_search_labels":["hourly"],"posted_date":"February  6, 2026","preferred_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- Bachelor's degree in logistics, transporation, supply chain, or business\u003cbr/\u003e- Licensed customs broker\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, ,  - 19.00 - 33.00 USD hourly\u003cbr/\u003eUSA, TN, Virtual Location - Tennessee - 17.00 - 30.00 USD hourly","primary_search_label":"transportation-and-logistics.team-global-mile","source_system":"JobCreator","state":"TN","title":"Customs Brokerage Specialist","university_job":null,"updated_time":"23 minutes","url_next_step":"https://account.amazon.com/jobs/3176088/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-mile","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team","business_category":"advertising","city":"Denver","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Application deadline: Feb 21, 2026\u003cbr/\u003e\u003cbr/\u003eAmazon is continuing to invest in its Worldwide Online Display Advertising business to tap into the growing online advertising market. Amazon is using its first class technology, unique user data, and cross-device user identification to become the go-to solution for the world’s largest advertising agencies and advertisers. To meet this goal, Amazon is investing in our proprietary Amazon Demand Side Platform (DSP).\u003cbr/\u003e\u003cbr/\u003eThe DSP Engineering team within Multichannel Advertising is building the next generation of products and services that will fuel the growth of Amazon’s advertising business. The DSP team owns the web app for advertisers to place orders for programmatic ad campaigns on Amazon and most other sites across the Internet. Think order management including capturing limit prices, targeting customer segments, spreadsheet-style inline editing, bulk order editing, integration with algorithms, and connectivity to advertising exchanges.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eWe’re looking for talented full stack senior software engineers who want to join a team focused on building large-scale systems that integrate across multiple sources to provide unique advertising products. These products drive marketing investments into Amazon by giving advertisers the controls and data necessary to prove the efficacy of Amazon advertising and retail promotion programs to eCommerce and brand advertisers. In this role you influence design and deliver solutions for significant portion of our advertising business focused on the needs of the most sophisticated advertisers representing some of the best-loved brands in the world.\u003cbr/\u003e\u003cbr/\u003eOur goal is to provide a frictionless campaign management experience to customers by implementing customer-facing features and enabling other development teams to build functionality. We seek to simplify and minimize the steps to create and optimize campaigns.\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon is continuing to invest in its Worldwide Online Display Advertising business to tap into the growing online advertising market. Amazon is using its first class technology, unique user data, and","display_distance":null,"id":"f14a057f-808d-4507-8f26-7b8dd3554078","id_icims":"3167921","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3167921/sr-software-dev-engineer-amazon-dsp-supply-supply-quality","job_schedule_type":"full-time","location":"US, CO, Denver","locations":["{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK19\"],\"normalizedCityName\":\"New York\"}","{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Denver\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Denver\",\"coordinates\":\"39.74001,-104.99202\",\"normalizedCountyName\":\"Denver\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Denver, Colorado, USA\",\"location\":\"US, CO, Denver\",\"region\":\"CO\",\"buildingCodeList\":[\"DEN17\"],\"normalizedCityName\":\"Denver\"}"],"normalized_location":"Denver, Colorado, USA","optional_search_labels":["amazon.artificial-intelligence","advertising.team-software-development"],"posted_date":"January 27, 2026","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Denver - 168,100.00 - 227,400.00 USD annually\u003cbr/\u003eUSA, NY, New York - 184,900.00 - 250,200.00 USD annually","primary_search_label":"advertising.team-amazon-ads","source_system":"JobCreator","state":"CO","title":"Sr Software Dev Engineer, Amazon DSP Supply \u0026 Supply Quality","university_job":null,"updated_time":"23 minutes","url_next_step":"https://account.amazon.com/jobs/3167921/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-ads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}