{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"• Multiple years of entertainment industry experience in content development\u003cbr/\u003e• Track record of successfully developing and executing multiple content projects\u003cbr/\u003e• Experience providing creative notes and feedback to creators and stakeholders\u003cbr/\u003e• Demonstrated ability to identify marketable creative elements in pitches and submissions\u003cbr/\u003e• Strong editorial judgment and story development skills\u003cbr/\u003e• Experience managing writer and talent relationships\u003cbr/\u003e• Proven ability to give constructive script notes that elevate material\u003cbr/\u003e• History of successfully packaging and developing IP into viable content\u003cbr/\u003e• Fluency in Swedish and English","business_category":"entertainment","city":"Stockholm","company_name":"Amazon Corporate Services Sweden AB","country_code":"SWE","description":"Are you passionate about creating world-class content and driving innovation in entertainment? Amazon MGM Studios is seeking an experienced Sr Creative Executive who will be responsible for supporting the evaluation, development, and delivery of original content while demonstrating ownership over a specific content vertical or territory.\u003cbr/\u003e\u003cbr/\u003eIn this role, you will assist in identifying and championing compelling stories that resonate with our global customer base, while building and maintaining relationships with top-tier creative talent. You'll leverage data-driven insights alongside your creative intuition to make recommendations about content development for the Nordics.\u003cbr/\u003e\u003cbr/\u003eAs a Sr Creative Executive, you'll work cross-functionally with multiple teams including Production, Business Affairs, Marketing, and Data Analytics to ensure projects move efficiently from development through production. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Support the creative development process for a portfolio of original content\u003cbr/\u003e• Collaborate with creators, writers, and producers to help develop series and features\u003cbr/\u003e• Partner cross-functionally with Production, Business Affairs, and Marketing teams\u003cbr/\u003e• Provide actionable creative feedback throughout development and production\u003cbr/\u003e• Use data insights to support creative decisions while maintaining artistic integrity\u003cbr/\u003e• Scale development processes through documentation and best practices\u003cbr/\u003e","department_cost_center":null,"description_short":"Are you passionate about creating world-class content and driving innovation in entertainment? Amazon MGM Studios is seeking an experienced Sr Creative Executive who will be responsible for supporting","display_distance":null,"id":"c7775408-16d4-4137-8baf-5caed6025228","id_icims":"3083119","is_intern":null,"is_manager":null,"job_category":"Editorial, Writing, \u0026 Content Management","job_family":"Entertainment and Studio","job_function_id":null,"job_path":"/en/jobs/3083119/sr-creative-executive-nordic-originals-amazon-mgm-studios","job_schedule_type":"full-time","location":"SE, Stockholm","locations":["{\"normalizedStateName\":\"Stockholm County\",\"normalizedCountryCode\":\"SWE\",\"city\":\"Stockholm\",\"countryIso3a\":\"SWE\",\"countryIso2a\":\"SE\",\"locationNonStemming\":\"Sweden, Stockholm\",\"coordinates\":\"59.33257,18.06683\",\"normalizedCountyName\":\"Stockholm\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Sweden\",\"normalizedLocation\":\"Stockholm, Stockholm County, SWE\",\"location\":\"SE, Stockholm\",\"region\":\"\",\"buildingCodeList\":[\"ARN15\"],\"normalizedCityName\":\"Stockholm\"}"],"normalized_location":"Stockholm, Stockholm County, SWE","optional_search_labels":[],"posted_date":"September 15, 2025","preferred_qualifications":"• Demonstrated ability to identify and nurture compelling, commercially viable stories\u003cbr/\u003e• Strong narrative instincts and ability to provide incisive script notes\u003cbr/\u003e• Experience working with data-driven decision making tools\u003cbr/\u003e• Proven track record of packaging projects with high-profile talent\u003cbr/\u003e• Excellent understanding of story structure across various formats (series, features, limited series)\u003cbr/\u003e• Ability to articulate creative vision and align stakeholders around it\u003cbr/\u003e• Experience supporting a development slate and prioritizing projects\u003cbr/\u003e• Strong knowledge of current market trends and emerging storytelling techniques\u003cbr/\u003e• Prior experience at a major streaming service, studio, or network\u003cbr/\u003e• Proficiency in evaluating and developing content across multiple genres\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"entertainment.team-amazonstudios","source_system":"JobCreator","state":null,"title":"Sr Creative Executive, Nordic Originals, Amazon MGM Studios","university_job":null,"updated_time":"2 minutes","url_next_step":"https://account.amazon.com/jobs/3083119/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazonstudios","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Work flexible schedules/shifts/areas, including weekends, nights, and/or holidays\u003cbr/\u003e- Minimum of 1 years of experience leading customer or patient-facing teams OR 3+ years of in-depth back-end administrative experience in a patient-centered role within a multi-state primary healthcare company\u003cbr/\u003e- Proficient with Microsoft Suite and Google Suite applications.","business_category":"healthcare","city":"Tempe","company_name":"1Life Healthcare, Inc.","country_code":"USA","description":"Amazon One Medical is transforming primary care by offering a platform that makes healthcare more affordable, accessible, and enjoyable. Unlike traditional doctor's office models, it addresses the frustrations of patients, providers, employers, and health networks.\u003cbr/\u003e\u003cbr/\u003eWith a growing nationwide network, Amazon One Medical ensures members have easy access to comprehensive care and 24/7 virtual services, enhancing the patient experience through advanced technology. However, the company recognizes that much work remains in healthcare transformation. As it expands, Amazon One Medical is focused on building a diverse, driven, and empathetic team, where all employees can thrive.\u003cbr/\u003e\u003cbr/\u003eTo continue its growth, Amazon One Medical is seeking passionate leaders to manage people, processes, and technology. The Manager I, Customer Servicer plays a vital role in delivering exceptional care, ensuring great experiences for both patients and staff. This role involves implementing the company’s mission and leading a team to maintain high-quality, patient-centered services.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will be a strong people leader and problem-solver who excels in creating efficient workflows and fostering team cohesion. They should be self-aware, committed to learning, and able to focus on the bigger picture. The role requires expertise in customer service, administrative work, and team motivation, especially during times of change. This is a great opportunity for someone eager to make a real impact while helping to shape the future of healthcare. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Oversee daily operations of the inbound, outbound, and administrative (back office) centralized patient support center.\u003cbr/\u003e- Foster a positive team experience through onboarding, training, performance feedback, coaching, learning opportunities, and career development.\u003cbr/\u003e- Manage a team of 15+ specialists and prepare performance reports by collecting and analyzing their data for coaching and feedback.\u003cbr/\u003e- Audit team interactions for quality and compliance, providing feedback to improve patient interactions.\u003cbr/\u003e- Lead team meetings, share important updates, and drive key performance indicators (KPIs) to ensure patient satisfaction and continuous access to care (CSAT/NPS).\u003cbr/\u003e- Assist in setting weekly, monthly, and quarterly goals and action plans for the team.\u003cbr/\u003e- Monitor performance to identify and resolve operational issues, improving overall efficiency.\u003cbr/\u003e- Ensure patients have an exceptional experience by providing timely access to care, handling pre- and post-visit tasks, messages, calls, and resolving issues smoothly.\u003cbr/\u003e- Build an engaged team by effectively communicating using the CICARE framework and Amazon Leadership Principles to meet patient and team experience goals.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eImagine leading a team that makes a real difference in patients' healthcare journeys. Your day will be filled with strategic team development, operational excellence, and creating meaningful connections that transform how people experience healthcare support.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWe're a collaborative, innovative group committed to breaking down barriers in healthcare. Our team thrives on solving complex challenges, supporting each other, and creating pathways for exceptional patient experiences. We believe in continuous learning, mutual respect, and driving meaningful change in healthcare delivery.\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon One Medical is transforming primary care by offering a platform that makes healthcare more affordable, accessible, and enjoyable. Unlike traditional doctor's office models, it addresses the frustrations","display_distance":null,"id":"2e2e5c5c-dc64-4d87-99b3-e23b4a3ff4d0","id_icims":"3169747","is_intern":null,"is_manager":null,"job_category":"Customer Service","job_family":"Customer Service","job_function_id":null,"job_path":"/en/jobs/3169747/contact-center-supervisor-amazon-one-medical-customer-care","job_schedule_type":"full-time","location":"US, AZ, Tempe","locations":["{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Tempe\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Tempe\",\"coordinates\":\"33.42554,-111.93722\",\"normalizedCountyName\":\"Maricopa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Tempe, Arizona, USA\",\"location\":\"US, AZ, Tempe\",\"region\":\"AZ\",\"buildingCodeList\":[\"ONM296\"],\"normalizedCityName\":\"Tempe\"}"],"normalized_location":"Tempe, Arizona, USA","optional_search_labels":[],"posted_date":"January 29, 2026","preferred_qualifications":"- 2+ years of experience managing a high-volume contact center.\u003cbr/\u003e- Strong understanding of technology, software, and tools, including experience with IVR systems such as Nice-InContact.\u003cbr/\u003e- Experienced in navigating complex national markets and working within matrix healthcare organizations.\u003cbr/\u003e- Deep knowledge of region-specific healthcare systems with excellent written and verbal communication skills.\u003cbr/\u003e- Able to stay calm and composed to effectively resolve patient issues with minimal friction.\u003cbr/\u003e- Exceptional customer and patient service skills focused on delivering high-quality care.\u003cbr/\u003e- Proven ability to build collaborative team dynamics that foster a supportive and engaged culture.\u003cbr/\u003e- Skilled in talent development through mentorship, coaching, feedback, goal setting, and accountability.\u003cbr/\u003e- Demonstrated success in leading change management initiatives and driving process improvements.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, AZ, Tempe - 52,800.00 - 61,800.00 USD annually","primary_search_label":"healthcare.one-medical","source_system":"JobCreator","state":"AZ","title":"Contact Center Supervisor, Amazon One Medical Customer Care","university_job":null,"updated_time":"3 minutes","url_next_step":"https://account.amazon.com/jobs/3169747/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"one-medical","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Fortgeschrittene Deutschkenntnisse in Wort und Schrift.\u003cbr/\u003e- Erfahrung in der Arbeit mit Datenanalytik und deren Anwendung zur Problemerkennung\u003cbr/\u003e- Erfahrung mit MS Office (Word, Excel, Outlook) im beruflichen Umfeld","business_category":"operations-team","city":"Magdeburg","company_name":"Amazon Deutschland E6 Transport GmbH","country_code":"DEU","description":"Der operative Geschäftsbereich ist das Herz von Amazon. Ein effektiv ablaufender Betrieb trägt dazu bei, dass Artikel bearbeitet und rechtzeitig an unsere Kund:innen versendet werden. Als Operations Supervisor erlebst Du, wie alle unterschiedlichen Teile des Betriebs funktionieren und trägst zu einem reibungslosen Ablauf bei.\u003cbr/\u003eDu fungierst als erste:r Ansprechpartner:in für Teammitglieder während ihrer Schicht und hilfst ihnen beim Befolgen der Prozesse, die Deine Manager:innen eingeführt haben. Du sammelst praktische Erfahrung und benutzt analytische Systeme, die zum Erfolg unseres Unternehmens beitragen. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Messung und Überwachung von Arbeitsflüssen, Verfolgen der Leistung am Standort und Bereitstellung wichtiger Schichtinformationen an die Schicht-/Bereichsleiter:innen im Betrieb, um für schichtübergreifende Operational Excellence zu sorgen\u003cbr/\u003e- Unterstützung und Schulung von Mitarbeitenden, damit diese großartige Leistungen erbringen können, und Beaufsichtigung ihrer täglichen Aufgaben\u003cbr/\u003e- Unterstützung des/der Schicht-/Bereichsleiter:in bei Projekten zur Prozessverbesserung, Förderung eines sicheren Arbeitsumfelds und Erhöhung des Mitarbeiterengagements \u003cbr/\u003e- Zusammenarbeit mit anderen Abteilungen, um Lösungen für häufige Probleme zu finden oder Bedürfnisse in wichtigen Leistungsbereichen zu erfüllen\u003cbr/\u003e- Nutzung von Datenanalysen, um Möglichkeiten zur Optimierung von Sicherheit, Qualität und Produktivität zu finden \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAls Operations Supervisor arbeitest Du an einem unserer Betriebsstandorte. Du unterstützt Deine:n Schicht-/Bereichsleiter:in bei der Durchführung des Schichtplans. Du hilft bei der Vorbereitung von Schichtbesprechungen mit Deinem Team und überwachst Verfahren und Abläufe. Damit stellst du sicher, dass Sicherheitsregeln, Qualitätssicherungsprozesse und die Prioritäten für den Tag befolgt werden.\u003cbr/\u003eProbleme, die Du bemerkst, eskalierst Du an Deine:n Manager:in. Gelegentlich agierst Du auch selbst als Schichtleiter:in und bietest Deinen Mitarbeitenden die notwendige Anleitung, um ihre Aufgaben zu erledigen. Bei Bedarf unterstützt Du Deine:n Schicht-/Bereichsleiter:in bei der Schichtplanung und sorgst dafür, dass zu Stoßzeiten genügend Teammitglieder eingeteilt sind. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Logistik (AMZL) ist für die Auslieferung von Millionen von Produkten unserer Kunden und Kundinnen direkt an die Haustür verantwortlich. Die „Last-Mile-Logistik“ liefert unsere Pakete in Partnerschaft mit Drittanbietern und realisiert zahlreiche Initiativen zur kontinuierlichen Verbesserung, um Millionen von Kunden zufrieden zu stellen.\u003cbr/\u003eUnser Ziel ist es, das Liefererlebnis für unsere Kund:innen so reibungslos wie möglich zu machen und globale Lieferlösungen für unsere neuesten Angebote einzuführen, darunter Amazon Fresh, Prime Now und Amazon Restaurants.\u003cbr/\u003eUnsere Arbeit lässt sich in zwei Sparten unterteilen. „Under the Roof“ betrifft alles was innerhalb unserer Logistikstandorte passiert und „On the Road“ alles was in den Liefergebieten auf der Straße stattfindet. Unsere Mitarbeitenden bereiten die Pakete in entsprechenden Schichten (Nacht, Früh, Spät) auf den täglichen Versand an unsere Lieferteams vor und kümmern sich um Retouren, die nicht ausgeliefert werden konnten.\u003cbr/\u003eJedes Jahr setzen wir neue Maßstäbe in puncto Kundenerlebnis und bieten neue, innovative Lieferdienste an. Wir suchen nach neuen Möglichkeiten, um branchenweite Logistikherausforderungen zu überwinden, sowie nach neuen Ideen, um unseren CO2-Fußabdruck zu reduzieren. Ein Fuhrpark innovativer Fahrzeuge (einschließlich E-Fahrzeugen) und modernste Technologie unterstützen uns dabei.","department_cost_center":null,"description_short":"Der operative Geschäftsbereich ist das Herz von Amazon. Ein effektiv ablaufender Betrieb trägt dazu bei, dass Artikel bearbeitet und rechtzeitig an unsere Kund:innen versendet werden. Als Operations Supervisor","display_distance":null,"id":"9cd80a43-df26-487f-af7d-16cfc2a46e9c","id_icims":"3166460","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3166460/operations-supervisor","job_schedule_type":"full-time","location":"DE, BB, Magdeburg","locations":["{\"normalizedStateName\":\"Sachsen-Anhalt\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Magdeburg\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, BB, Magdeburg\",\"coordinates\":\"52.13048,11.63158\",\"normalizedCountyName\":\"Magdeburg\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Magdeburg, Sachsen-Anhalt, DEU\",\"location\":\"DE, BB, Magdeburg\",\"region\":\"BB\",\"buildingCodeList\":[\"DAH1\"],\"normalizedCityName\":\"Magdeburg\"}"],"normalized_location":"Magdeburg, Sachsen-Anhalt, DEU","optional_search_labels":["ops.lander.teamlead-emea","jdv.operations.operationssupervisor"],"posted_date":"January 26, 2026","preferred_qualifications":"- Erfahrung im Stakeholdermanagement, einschließlich Aufbau und Pflege professioneller Beziehungen\u003cbr/\u003e- Erfahrung in der Arbeit in einem Betriebsumfeld, beispielsweise in Logistik, Einzelhandel, Gastgewerbe oder im Kundenservice\u003cbr/\u003e- Fortgeschrittene Englischkenntnisse\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"operations-team.transportation-operations-management","source_system":"JobCreator","state":"BB","title":"Operations Supervisor","university_job":null,"updated_time":"6 minutes","url_next_step":"https://account.amazon.com/jobs/3166460/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"transportation-operations-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.\"","business_category":"aws","city":"Avondale","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"5ca98978-6fdb-4486-9e56-9c2bf517736b","id_icims":"3151888","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3151888/engineering-operation-technician","job_schedule_type":"full-time","location":"US, AZ, Avondale","locations":["{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Avondale\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Avondale\",\"coordinates\":\"33.44096,-112.34966\",\"normalizedCountyName\":\"Maricopa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Avondale, Arizona, USA\",\"location\":\"US, AZ, Avondale\",\"region\":\"AZ\",\"buildingCodeList\":[\"PHX69\"],\"normalizedCityName\":\"Avondale\"}"],"normalized_location":"Avondale, Arizona, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"January  5, 2026","preferred_qualifications":"- 2+ years of data center experience\u003cbr/\u003e- Technical (Military/Trade School) training\u003cbr/\u003e- Associate or higher education in related field\"\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, AZ, Avondale - 31.00 - 55.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"AZ","title":"Engineering Operation Technician","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3151888/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in developing functional specifications, design verification plans and functional test procedures\u003cbr/\u003e- Bachelor’s or Master’s in Electrical Engineering or a related field.\u003cbr/\u003e- 6-10+ years of experience designing and integrating electrical systems in robotics, distributed systems, or complex electromechanical platforms.\u003cbr/\u003e- Proficient in PCB design (schematic capture and layout) using Cadence OrCAD/Allegro or similar tools.\u003cbr/\u003e- Experience in embedded controls, high-speed differential signaling, microcontrollers, memory buses, digital design, and power electronics\u003cbr/\u003e- Experience with wire harness design, including connector selection, cable speccing, and EMI mitigation strategies.\u003cbr/\u003e- Hands-on experience testing, validating and debugging hardware (use of oscilloscopes, logic analyzers, etc.)","business_category":"fulfillment-technology-and-robotics","city":"San Francisco","company_name":"Amazon.com Services LLC","country_code":"USA","description":"We are seeking a hands-on Electrical Engineer to lead the design and integration of electrical systems or subsystems for high-degree-of-freedom robotic platforms. This role involves architecting the robot’s power distribution, sensor wiring, and embedded electrical infrastructure.\u003cbr/\u003e\u003cbr/\u003eYou will be responsible for designing across the full electrical system for advanced robotics platforms including including power distribution, sensing, compute, motor controllers, communication infrastructure, battery system and power electronics in close collaboration with mechanical, controls and software engineers. You’ll play a key role in ensuring high-performance, reliable operation of complex electromechanical systems under real-world conditions.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Electrical system architect / owner for power electronics, actuation, PCBAs, battery, ware harness specs and high speed electrical/communications protocols \u003cbr/\u003e* Design, develop and integrate power distribution, embedded electronics, motor controllers and safety-critical circuits for complex robotic systems\u003cbr/\u003e* Own board layout of PCBAs including SoCs, microcontrollers, sensors, power devices, etc. using Cadence OrCAD/Allegro or equivalent tools. Oversee bring-up and validation\u003cbr/\u003e* Determine appropriate high speed electrical and communication protocols (e.g., CAN, EtherCAT, USB, etc) for reliable and efficient system operation\u003cbr/\u003e* Specify and design custom power electronics and power distribution boards to meet performance, thermal, and safety requirements\u003cbr/\u003e* Design and route all cabling and wire harnesses across the robotic platform, considering EMI, signal integrity, serviceability, and integration with mechanical structures\u003cbr/\u003e* Architect and integrate the robot’s battery system, including protection circuitry, battery management, charging systems, and thermal considerations\u003cbr/\u003e* Define and implement wiring and electrical interfaces for sensors (e.g., lidar, stereo cameras, IMUs, tactile) and compute modules\u003cbr/\u003e* Ownership over prototyping and bringing up electrical designs and creation of test \u0026 validation rigs\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eFrontier AI \u0026 Robotics (FAR) is the team at Amazon building the next generation of embodied intelligence. FAR drives the development and implementation of advanced AI models within Amazon’s operations that enable robots to see, reason, and act on the world around them, supporting a number of different warehouse automation tasks.","department_cost_center":null,"description_short":"We are seeking a hands-on Electrical Engineer to lead the design and integration of electrical systems or subsystems for high-degree-of-freedom robotic platforms. This role involves architecting the robot’s","display_distance":null,"id":"019ba87a-57cb-4e86-8f2e-e3f4a08f9de1","id_icims":"3113171","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/3113171/advanced-robotics-electrical-engineer-frontier-ai-robotics","job_schedule_type":"full-time","location":"US, CA, San Francisco","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Francisco\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, San Francisco\",\"coordinates\":\"37.77712,-122.41966\",\"normalizedCountyName\":\"San Francisco\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Francisco, California, USA\",\"location\":\"US, CA, San Francisco\",\"region\":\"CA\",\"buildingCodeList\":[\"UCA1\"],\"normalizedCityName\":\"San Francisco\"}"],"normalized_location":"San Francisco, California, USA","optional_search_labels":[],"posted_date":"October 22, 2025","preferred_qualifications":"- Experience with high-DOF robotic systems.\u003cbr/\u003e- Familiarity with high-speed data protocols (e.g., CAN, EtherCAT, etc.).\u003cbr/\u003e- Exposure to embedded programming (e.g., C, Python, VHDL, etc.) and firmware bring-up\u003cbr/\u003e- Understanding of thermal design and safety design considerations in high-power robotic systems\u003cbr/\u003e- Experience working in environments with DFM/DFA constraints and production scaling.\u003cbr/\u003e- Familiarity with mechanical CAD (e.g., SolidWorks) for collaborative integration work.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, San Francisco - 157,900.00 - 213,600.00 USD annually","primary_search_label":"fulfillment-technology-and-robotics.team-frontier-ai-robotics","source_system":"JobCreator","state":"CA","title":"Advanced Robotics Electrical Engineer, Frontier AI \u0026 Robotics ","university_job":null,"updated_time":"19 minutes","url_next_step":"https://account.amazon.com/jobs/3113171/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-frontier-ai-robotics","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Sterling","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"6e01df55-eafc-47c4-a78e-f71d9a276b94","id_icims":"3154136","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3154136/engineering-operations-technician","job_schedule_type":"full-time","location":"US, VA, Sterling","locations":["{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sterling\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Sterling\",\"coordinates\":\"39.03336,-77.40713\",\"normalizedCountyName\":\"Loudoun\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sterling, Virginia, USA\",\"location\":\"US, VA, Sterling\",\"region\":\"VA\",\"buildingCodeList\":[\"IAD62\"],\"normalizedCityName\":\"Sterling\"}"],"normalized_location":"Sterling, Virginia, USA","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"January  7, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Technical (Military/Trade School) training\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, VA, Sterling - 31.00 - 55.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"VA","title":"Engineering Operations Technician","university_job":null,"updated_time":"22 minutes","url_next_step":"https://account.amazon.com/jobs/3154136/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience developing customer relationships and influencing key decision-makers\u003cbr/\u003e- Experience in a client-facing role including but not limited to digital marketing, analytics, etc.\u003cbr/\u003e- Experience in digital media/marketing strategy, data analysis and data analytics \u0026 visualization","business_category":"advertising","city":"New York","company_name":"Amazon Advertising LLC","country_code":"USA","description":"Amazon Advertising is seeking a results-oriented Local Agency Account Manager to support our growing portfolio of local agency partnerships. This role operates at the intersection of eCommerce and advertising, managing relationships with agencies ranging from high-value strategic partners to emerging prospects. The Account Manager will drive revenue growth, deliver exceptional customer service, and help agencies leverage Amazon's comprehensive advertising solutions to achieve their business objectives.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eDrive strategic partnerships with advertising agencies through comprehensive media planning, regular business reviews, and data-driven campaign optimization. You'll serve as the primary point of contact for your portfolio of agencies, providing expert guidance on Amazon Advertising solutions.\u003cbr/\u003e\u003cbr/\u003eYou will develop and execute multi-advertising campaigns, analyze performance metrics, and deliver actionable recommendations to improve campaign effectiveness. The role involves leading agency education sessions, promoting new advertising products, and leveraging Amazon's robust data insights to provide strategic recommendations.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWhat You'll Do: \u003cbr/\u003e• Manage and grow a portfolio of agency relationships \u003cbr/\u003e• Educate Agencies on best practice on how to operate inside the Amazon DSP\u003cbr/\u003e• Develop comprehensive media and campaign strategies \u003cbr/\u003e• Lead performance analysis and optimization efforts \u003cbr/\u003e• Conduct regular business reviews and strategic planning sessions \u003cbr/\u003e• Drive product adoption and education initiatives \u003cbr/\u003e• Collaborate across multiple internal teams to ensure client success","department_cost_center":null,"description_short":"Amazon Advertising is seeking a results-oriented Local Agency Account Manager to support our growing portfolio of local agency partnerships. This role operates at the intersection of eCommerce and advertising,","display_distance":null,"id":"ce985a81-d68f-44b1-b7ac-14b1837a0e0a","id_icims":"3157215","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Ad Sales","job_function_id":null,"job_path":"/en/jobs/3157215/sales-account-manager-amazon-local-ads","job_schedule_type":"full-time","location":"US, NY, New York","locations":["{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK19\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"New York, New York, USA","optional_search_labels":[],"posted_date":"January 12, 2026","preferred_qualifications":"- 3+ years of digital advertising, product marketing, consulting, business development, or other customer-facing role experience\u003cbr/\u003e- 3+ years of digital media/marketing strategy, data analysis, and data analytics/visualization experience\u003cbr/\u003e- Knowledge of advanced skills in Excel as well as any data visualization tools like Tableau or similar BI tools (familiarity with Tableau preferred)\u003cbr/\u003e- Experience with communication, presentation, and negotiation\u003cbr/\u003e- Experience in digital advertising and understanding of related ad specifications, file formats and technologies\u003cbr/\u003e- Experience in media and brand planning\u003cbr/\u003e- Experience working cross functionally across several teams\u003cbr/\u003e- Experience in identifying a customer need, building a product to meet th\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments, restricted stock units (RSUs), and sales incentives. Final compensation will be determined based on factors including experience, qualifications, and location. \u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eAmazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, New York - 66,300.00 - 108,800.00 USD annually","primary_search_label":"advertising.team-amazon-ads","source_system":"JobCreator","state":"NY","title":"Sales Account Manager, Amazon Local Ads ","university_job":null,"updated_time":"22 minutes","url_next_step":"https://account.amazon.com/jobs/3157215/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amazon-ads","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in accounting and commerce (B. Com)\u003cbr/\u003e- Knowledge of Excel at an advanced level\u003cbr/\u003e- Experience with Microsoft Office products and applications","business_category":"finance","city":"Hyderabad","company_name":"ADCI HYD 13 SEZ - H84","country_code":"IND","description":"GAR (Global Accts Rec) is looking for a proactive, customer and detail oriented Collections Analyst whose main responsibility will be to manage and resolve receivables related queries received from Amazon customers. As a Collections Analyst, you will support Amazon’s customers to resolve billing issues, reconcile accounts and drive monthly collection targets. The successful individual is expected to be self-motivated, be a quick learner, have strong ownership and earn trust with our customers to facilitate timely payment.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tUnderstanding of Accounts Receivables process\u003cbr/\u003e•\tFollow-up with customers  via emails and phone calls to ensure timely collection of payments for assigned portfolio\u003cbr/\u003e•\tMaintain detailed post correspondence update on accounts receivable records to ensure aging is up to date, credits and collections are applied, uncollectible amounts are accounted for, and miscellaneous differences are cleared\u003cbr/\u003e•\tCollaborate with various stakeholders (Billing, Finance, Legal, Tax, Customer Service) to resolve customer disputes and queries, to establish and maintain good client relationships, both internally and externally\u003cbr/\u003e•\tMonitor high-risk accounts and ensure timely escalation of challenges to management\u003cbr/\u003e•\tContinually look at ways to improve the customer experience\u003cbr/\u003e•\tAssist in streamlining and improving the accounts receivable process by identifying areas of improvement\u003cbr/\u003e•\tMeet the monthly productivity goals\u003cbr/\u003e•\tReconcile complex accounts and have excellent attention to detail\u003cbr/\u003e","department_cost_center":null,"description_short":"GAR (Global Accts Rec) is looking for a proactive, customer and detail oriented Collections Analyst whose main responsibility will be to manage and resolve receivables related queries received from Amazon","display_distance":null,"id":"bb720e20-6f13-45ec-9c78-bcd182a9bb23","id_icims":"3170558","is_intern":null,"is_manager":null,"job_category":"Finance \u0026 Accounting","job_family":"Finance/planning","job_function_id":null,"job_path":"/en/jobs/3170558/sr-finops-analyst-ar","job_schedule_type":"full-time","location":"IN, TS, Hyderabad","locations":["{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"PMOW\",\"TTB7\",\"YEXJ\",\"XSMM\",\"HYD46\",\"HYD113\",\"SHYI\",\"HHDB\",\"PNHR\",\"PHNT\",\"TTL3\",\"HSCH\",\"PMMO\",\"YSUR\",\"HYD48\",\"PMNF\",\"HYDW\",\"TTB5\",\"YSFB\",\"SHTX\",\"HYD13\",\"PMOY\",\"YZZD\",\"QSBC\",\"FHYB\",\"PMQE\",\"UHY4\",\"YZZM\",\"SHTI\",\"HYD602\",\"FHY3\",\"HYD51\",\"YEYL\",\"XBLH\",\"PMOU\",\"SHYG\",\"UHY93\",\"PNHY\",\"HYD111\",\"TTB3\",\"YSUP\",\"PNHG\",\"YSYN\",\"PNHA\",\"HBM11\",\"HYD120\",\"PMMM\",\"PNH8\",\"QSAJ\",\"HYD123\",\"ZSDZ\",\"HYT2\",\"UHYR\",\"BPM54\",\"HHY5\",\"HYD101\",\"PMOC\",\"ZSDV\",\"YZZV\",\"YEXD\",\"SHYC\",\"PMNY\",\"FHY1\",\"RSB8\",\"HYD85\",\"HYBV\",\"RSBC\",\"RSBD\",\"HYD253\",\"HYD54\",\"YSO5\",\"HBX2\",\"HYD84\",\"HYD122\",\"XSEV\",\"PMNC\",\"QSD6\",\"HYD56\",\"HYD121\",\"HYD83\",\"BPM61\",\"PMOS\",\"YEYJ\",\"YSYP\",\"SHYB\",\"VGA3\",\"PDSU\",\"UHY91\",\"HYD8\",\"YSUE\",\"YEYK\",\"HYD2\",\"FHYE\",\"PNHN\",\"PMOZ\",\"UHY92\",\"TTB4\",\"HYD102\",\"PNHH\",\"PMOT\",\"HYD103\",\"PNLA\",\"HYD20\",\"PMPY\",\"FHYD\",\"QSN6\",\"QSLJ\",\"MHYB\",\"HYD112\",\"HYD11\",\"PHYH\",\"BPM62\",\"PNWN\",\"UHY5\",\"YEXK\",\"UHYA\",\"YSUK\",\"HYD254\",\"FHY2\",\"MHYD\",\"HYBP\",\"PNO4\",\"HYT1\",\"TBC121\",\"QSO0\",\"TTL2\",\"HYD100\",\"PNVP\",\"PNH9\",\"QWQP\",\"VGX1\",\"HHDC\",\"HYD114\",\"PMOX\",\"HYD50\",\"HHDA\",\"HYD45\",\"XSML\",\"PMPZ\",\"HYD601\",\"HYD16\",\"SHYH\",\"HYD7\",\"PNIL\",\"PMOV\",\"UHYQ\",\"FAPA\",\"TTB8\",\"REBY\",\"VGA1\",\"PDKP\",\"YSFA\",\"QSN5\",\"HYD110\",\"HYD256\",\"HYD3\",\"KSZD\",\"YSUF\",\"HYD57\",\"UHY3\",\"PHYD\",\"HYD12\",\"HYD9\",\"KSZ7\",\"PNOA\",\"TTB6\",\"ZSDW\",\"FHYC\",\"SHYA\",\"XSIP\",\"HYD60\",\"HYD47\",\"XSAD\",\"HYD71\",\"YSFJ\",\"QSD7\",\"TTA9\",\"PMOQ\",\"HYD252\",\"TTB1\",\"VGA4\",\"YEYI\",\"HYX1\",\"YSUM\",\"PMOR\",\"PNIP\",\"YSTU\",\"IPCX\",\"BPM60\",\"FHYG\",\"PNLC\",\"HYD007\",\"YSFH\",\"HHY4\",\"HBM10\",\"PMNX\",\"YZZ5\",\"YSUA\",\"HYD124\",\"TTB2\",\"YSED\",\"PMOP\",\"UHY1\",\"SHYF\",\"BPM55\",\"HYD49\",\"ZSDY\",\"SHYL\",\"XBLS\",\"HBH91\",\"YSIZ\",\"HVR40\",\"PMQJ\",\"HSTG\",\"HYD503\",\"HYD81\",\"HYD125\",\"HYD251\",\"HYD115\",\"HYD257\",\"UHYD\",\"FHYA\",\"PMNQ\",\"HYD600\",\"UHY2\",\"PNH3\",\"HYB47\",\"PNTL\",\"SHYR\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Hyderabad, Telangana, IND","optional_search_labels":[],"posted_date":"January 30, 2026","preferred_qualifications":"- 3+ years of finance operations/shared services, accounts payable, account receivable (collections) or general ledger experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"finance.team-accounting","source_system":"JobCreator","state":"TS","title":"Sr.FinOps Analyst- AR ","university_job":null,"updated_time":"23 minutes","url_next_step":"https://account.amazon.com/jobs/3170558/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-accounting","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- - Diplôme de fin d’études secondaires\u003cbr/\u003e- - Expérience préalable à un poste d’encadrement dans le domaine technique\u003cbr/\u003e- - Expérience préalable dans des disciplines électriques et mécaniques\u003cbr/\u003e- - Expérience préalable dans des environnements d’automatisation ou de matériel de manutention\u003cbr/\u003e- - Parfaite maîtrise du français, à l’oral et à l’écrit, et niveau débutant en anglais\u003cbr/\u003e- - Capacité à travailler par équipe et en rotation dans un environnement disponible 7j/7, 24h/24.\u003cbr/\u003e- - Qualifications Requises :\u003cbr/\u003e- - BTS/DUT maintenance industrielle ou équivalent\u003cbr/\u003e- - 3-5 ans d'expérience en maintenance automatisée\u003cbr/\u003e- - Maîtrise convoyage automatisé et GMAO (APM)\u003cbr/\u003e- - Lecture schémas électriques/mécaniques\u003cbr/\u003e- - Gestion equipe","business_category":"fulfillment-ops","city":"Lauwin-planque","company_name":"Amazon France Logistique SAS","country_code":"FRA","description":"Notre équipe RME (Reliability Maintenance Engineering) est au cœur de l’engagement d’Amazon en matière d’innovation. À mesure qu’Amazon évolue et s’adapte, l’équipe RME veille à ce que les outils et les technologies que nous utilisons suivent la même voie. En tant que technicien RME senior, vous nous aiderez à garder une longueur d’avance grâce aux nouvelles technologies et à des méthodes de travail performantes. Vous veillerez au respect de normes élevées dans tous nos processus et proposerez des axes d’amélioration pour les élever davantage.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Appliquer les meilleures pratiques pour utiliser le matériel en toute sécurité et surveiller les équipes pour veiller au respect des procédures\u003cbr/\u003e- Procéder à des inspections visuelles, à une surveillance basée sur l’état et à une maintenance préventive pour évaluer les performances du matériel. Planifier les tâches d’entretiens supplémentaires éventuellement requises\u003cbr/\u003e- Superviser les techniciens à leur poste pour les aider à apprendre, à progresser et agir en tant que référent pour les ingénieurs RME\u003cbr/\u003e- Résoudre les problèmes matériels pour réduire les temps d’arrêt et permettre aux opérations de traiter les colis le plus rapidement possible\u003cbr/\u003e- Contribuer à trouver des solutions pour améliorer en permanence les systèmes et normaliser les processus dans l’ensemble du réseau européen\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eVous prendrez la tête des équipes et veillerez à ce que chacun dispose du matériel dont il a besoin et au bon fonctionnement de celui-ci. Pour ce faire, vous contrôlerez les processus afin que les réglementations et les politiques soient respectées et vous veillerez au bon déroulement des opérations de maintenance préventive afin d’optimiser l’utilisation du matériel.\u003cbr/\u003eVotre sens aiguisé de l’observation vous aidera à formuler des suggestions tendant à accroître l’efficacité de nos systèmes. Vous mettrez ensuite en œuvre ces améliorations à l’échelle de l’Union européenne. Vous assurerez la performance de nos processus en les analysant à l’aide d’outils tels que Scada et vous travaillerez en étroite collaboration avec votre responsable hiérarchique pour l’assister dans ses tâches administratives.\u003cbr/\u003eCe poste est basé sur l’un de nos sites opérationnels. Vous travaillerez en horaires décalés, ce qui peut inclure les week-ends et les nuits. L’expérience acquise dans ce service dynamique d’Amazon vous permettra d’assumer progressivement de plus en plus de responsabilités. \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eNotre équipe d’ingénieurs RME (Reliability Maintenance Engineering) veille à ce que nos équipements fonctionnent au mieux. Guidés par des responsables expérimentés, nous sommes une équipe à l’esprit analytique. Nos collaborateurs·trices possèdent à la fois des connaissances techniques poussées et un bon esprit d’équipe. Nous travaillons ensemble pour assurer l’entretien, le dépannage et la réparation des ressources de notre réseau mondial de centres d’expédition. Certains de nos employé·es occupent des postes à responsabilités et sont chargés de superviser l’équipe dans son travail sur des technologies passionnantes, dont certaines n’existent que chez Amazon.\u003cbr/\u003eDe l’installation de systèmes d’emballage automatisés à la supervision de la maintenance générale d’un site, en passant par la réparation d’équipements de distribution essentiels, notre équipe assure le bon fonctionnement de la plupart des éléments techniques d’Amazon. Nous veillons, par exemple, à ce que les bâtiments soient conformes à la législation, afin d’assurer la sécurité de tous et le fonctionnement à plein régime de nos sites. Les possibilités d’évolution sont nombreuses, tant au sein de l’équipe RME qu’à l’échelle d’Amazon.\u003cbr/\u003eTout ce que nous faisons vise à réduire les temps d’arrêt dans les principaux sites logistiques d’Amazon, afin que les clients reçoivent leurs commandes à temps. Nous travaillons souvent tôt ou tard pour effectuer les tâches de maintenance avec un minimum de perturbations, y compris en équipes de nuit. Si nous voyons qu’il existe une méthodologie plus aboutie pour faire les choses, nous avons les compétences nécessaires pour développer et introduire des processus nouveaux ou des technologies de pointe, comme Amazon Robotics ou notre robot de tri ultra sophistiqué.","department_cost_center":null,"description_short":"Notre équipe RME (Reliability Maintenance Engineering) est au cœur de l’engagement d’Amazon en matière d’innovation. À mesure qu’Amazon évolue et s’adapte, l’équipe RME veille à ce que les outils et les","display_distance":null,"id":"e7453b43-325d-4604-932f-352a612da6ae","id_icims":"3170583","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3170583/superviseur-de-maintenance-industrielle-h-f-maintenance-robotique-systemes-automatises","job_schedule_type":"full-time","location":"FR, Lauwin-planque","locations":["{\"normalizedStateName\":\"Hauts-de-France\",\"normalizedCountryCode\":\"FRA\",\"city\":\"Lauwin-planque\",\"countryIso3a\":\"FRA\",\"countryIso2a\":\"FR\",\"locationNonStemming\":\"France, Lauwin-planque\",\"coordinates\":\"50.39051,3.04629\",\"normalizedCountyName\":\"Nord\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"France\",\"normalizedLocation\":\"Lauwin-Planque, Hauts-de-France, FRA\",\"location\":\"FR, Lauwin-planque\",\"region\":\"\",\"buildingCodeList\":[\"LIL1\"],\"normalizedCityName\":\"Lauwin-Planque\"}"],"normalized_location":"Lauwin-Planque, Hauts-de-France, FRA","optional_search_labels":["ops.lander-emea-rme-technician"],"posted_date":"January 30, 2026","preferred_qualifications":"- - QUALIFICATIONS SOUHAITABLES : Les compétences dites « souhaitables » vous aideront à tirer votre épingle du jeu mais elles ne sont pas nécessaires pour postuler à une offre chez Amazon. Si vous possédez toutes les compétences requises listées précédemment, contactez-nous sans plus tarder.\u003cbr/\u003e- - Connaissance de l’environnement multi-sites et multi-fournisseurs\u003cbr/\u003e- - Compréhension des systèmes de contrôle basés sur des automates et des exigences de conformité statutaire\u003cbr/\u003e- - Expérience de l’utilisation de systèmes informatisés de gestion de la maintenance pour planifier la maintenance et consigner les tâches\u003cbr/\u003e- - Diplôme dans une discipline technique, ou dans le domaine des opérations ou de l’administration des affaires\u003cbr/\u003e- - Qualifications Requises :\u003cbr/\u003e- - BTS/DUT maintenance industrielle ou équivalent\u003cbr/\u003e- - 3-5 ans d'expérience en maintenance automatisée\u003cbr/\u003e- - Habilitations électriques à jour (B1, B2, BR)\u003cbr/\u003e- - Maîtrise convoyage automatisé et GMAO (APM/Maximo)\u003cbr/\u003e- - Lecture schémas électriques/mécaniques\u003cbr/\u003e- - Préférées :\u003cbr/\u003e- - Expérience logistique haut volume\u003cbr/\u003e- - Automates programmables (Siemens, Allen Bradley)\u003cbr/\u003e- - Systèmes de tri (sorters, SLAM, PCNS)\u003cbr/\u003e- - Diagnostic pannes complexes\u003cbr/\u003e- - Mentorat techniciens juniors\u003cbr/\u003e- - Normes sécurité (LOTO)\u003cbr/\u003e- - Anglais technique\u003cbr/\u003e- - Soft Skills : Bias for Action, Ownership, Learn and Be Curious\u003cbr/\u003e\u003cbr/\u003eAmazon est un employeur engagé pour l'égalité des chances. Nous sommes convaincus qu'une main d'oeuvre diversifée est essentielle à notre réussite. Nous prenons nos décisions de recrutement en fonction de votre expérience et de vos compétences. Nous apprécions votre envie de découvrir, d'inventer, de simplifier et de construire. La protection de votre vie privée et la sécurité de vos données constituent depuis longtemps une priorité absolue pour Amazon. Veuillez consulter notre Politique de Confidentialité pour en savoir plus sur la façon dont nous collectons, utilisons et traitons les données personnelles de nos candidats.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":null,"title":"Superviseur de maintenance industrielle (H/F), Maintenance, Robotique \u0026 Systèmes Automatisés ","university_job":null,"updated_time":"23 minutes","url_next_step":"https://account.amazon.com/jobs/3170583/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of developing a team of technical professionals across multiple locations experience\u003cbr/\u003e- 2+ years of leading technology teams as a information technology operations manager experience\u003cbr/\u003e- Bachelor's degree, or 4+ years of professional or military experience\u003cbr/\u003e- Knowledge of Linux or Unix systems administration","business_category":"operations","city":"San Marcos","company_name":"Amazon.com Services LLC","country_code":"USA","description":"You will be leading a team of IT professionals with various skill sets to provide truly innovative technical support to Amazon’s Operations team who fulfill our customer promises millions of times a day. The technology varies between our different facilities, but Amazon’s core IT infrastructure is fully redundant and relies upon top tier vendor hardware networked over fiber optic, copper, and wireless topologies. Your internal customers, whether human, robotic, or mechanical, use mobile computing devices, thin clients, integrated computer, and PCs running Windows, Linux, and Android operating systems to virtually and physically move ecommerce items from our suppliers into our fulfillment centers shelves, from those shelves into packaging, those packages into cars, trucks, and airplanes for delivery to front doors around the world. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Hire, train, and develop a team of IT professionals.\u003cbr/\u003e- Support all safety programs and OSHA compliance to ensure a safe work environment for all associates.\u003cbr/\u003e- Interact with management and staff to provide technical assistance for continuous improvement of IT solutions.\u003cbr/\u003e- Establish and maintain a positive, productive relationship with operational partners and staff.\u003cbr/\u003e- Lead infrastructure builds in new facilities.\u003cbr/\u003e- Plan, organize, schedule, and supervise the day-to-day technical support activities, including troubleshooting, customer service issues, approvals, and installations.\u003cbr/\u003e- Measure, monitor, and maintain team’s ability to meet or exceed contact and resolution Service Level Agreements (SLA).\u003cbr/\u003e- Develop and maintain policies, procedures, and processes.\u003cbr/\u003e- Oversee management of equipment and parts inventory.\u003cbr/\u003e- Create, manage, and support recognition and communication programs.\u003cbr/\u003e- Travel up to 30%.","department_cost_center":null,"description_short":"You will be leading a team of IT professionals with various skill sets to provide truly innovative technical support to Amazon’s Operations team who fulfill our customer promises millions of times a day.","display_distance":null,"id":"35460ef3-5eb3-42c7-afd1-07a00a343c54","id_icims":"3157543","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Technical Services","job_function_id":null,"job_path":"/en/jobs/3157543/it-manager-ops-tech-solutions-ots","job_schedule_type":"full-time","location":"US, TX, San Marcos","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"San Marcos\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, San Marcos\",\"coordinates\":\"29.88608,-97.92818\",\"normalizedCountyName\":\"Hays\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"San Marcos, Texas, USA\",\"location\":\"US, TX, San Marcos\",\"region\":\"TX\",\"buildingCodeList\":[\"SAT2\"],\"normalizedCityName\":\"San Marcos\"}"],"normalized_location":"San Marcos, Texas, USA","optional_search_labels":[],"posted_date":"January 12, 2026","preferred_qualifications":"- Knowledge of hardware architectures\u003cbr/\u003e- Experience with system management tools and client/server environments\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, San Marcos - 116,800.00 - 160,000.00 USD annually","primary_search_label":"operations.team-ops-tech-engineering-it","source_system":"JobCreator","state":"TX","title":"IT Manager, Ops Tech Solutions (OTS) ","university_job":null,"updated_time":"28 minutes","url_next_step":"https://account.amazon.com/jobs/3157543/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-ops-tech-engineering-it","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}